{"title": "Joint Reasoning for Temporal and Causal Relations", "abstract": "Understanding temporal and causal relations between events is a fundamental natural language understanding task. Because a cause must occur earlier than its effect, temporal and causal relations are closely related and one relation often dictates the value of the other. However, limited attention has been paid to studying these two relations jointly. This paper presents a joint inference framework for them using constrained conditional models (CCMs). Specifically, we formulate the joint problem as an integer linear programming (ILP) problem, enforcing constraints that are inherent in the nature of time and causality. We show that the joint inference framework results in statistically significant improvement in the extraction of both temporal and causal relations from text. 1", "text": [{"id": 0, "string": "Introduction Understanding events is an important component of natural language understanding."}, {"id": 1, "string": "An essential step in this process is identifying relations between events, which are needed in order to support applications such as story completion, summarization, and timeline construction."}, {"id": 2, "string": "Among the many relation types that could exist between events, this paper focuses on the joint extraction of temporal and causal relations."}, {"id": 3, "string": "It is well known that temporal and causal relations interact with each other and in many cases, the decision of one relation is made primarily based on evidence from the other."}, {"id": 4, "string": "In Example 1, identifying the temporal relation between e1:died and e2:exploded is 1 The dataset and code used in this paper are available at http://cogcomp.org/page/publication_ view/835 in fact a very hard case: There are no explicit temporal markers (e.g., \"before\", \"after\", or \"since\"); the events are in separate sentences so their syntactic connection is weak; although the occurrence time of e2:exploded is given (i.e., Friday) in text, it is not given for e1:died."}, {"id": 5, "string": "However, given the causal relation, e2:exploded caused e1:died,it is clear that e2:exploded happened before e1:died."}, {"id": 6, "string": "The temporal relation is dictated by the causal relation."}, {"id": 7, "string": "Ex 1: Temporal relation dictated by causal relation."}, {"id": 8, "string": "More than 10 people (e1:died) on their way to the nearest hospital, police said."}, {"id": 9, "string": "A suicide car bomb (e2:exploded) on Friday in the middle of a group of men playing volleyball in northwest Pakistan."}, {"id": 10, "string": "Since e2:exploded is the reason of e1:died, the temporal relation is thus e2 being before e1."}, {"id": 11, "string": "Ex 2: Causal relation dictated by temporal relation."}, {"id": 12, "string": "Mir-Hossein Moussavi (e3:raged) after government's efforts to (e4:stifle) protesters."}, {"id": 13, "string": "Since e3:raged is temporally after e4:stifle, e4 should be the cause of e3."}, {"id": 14, "string": "On the other hand, causal relation extraction can also benefit from knowing temporal relations."}, {"id": 15, "string": "In Example 2, it is unclear whether the government stifled people because people raged, or people raged because the government stifled people: both situations are logically reasonable."}, {"id": 16, "string": "However, if we account for the temporal relation (that is, e4:stifle happened before e3:raged), it is clear that e4:stifle is the cause and e3:raged is the effect."}, {"id": 17, "string": "In this case, the causal relation is dictated by the temporal relation."}, {"id": 18, "string": "The first contribution of this work is proposing a joint framework for Temporal and Causal Reasoning (TCR), inspired by these examples."}, {"id": 19, "string": "Assuming the availability of a temporal extraction system and a causal extraction system, the proposed joint framework combines these two using a constrained conditional model (CCM) (Chang et al., 2012) framework, with an integer linear pro-gramming (ILP) objective (Roth and Yih, 2004) that enforces declarative constraints during the inference phase."}, {"id": 20, "string": "Specifically, these constraints include: (1) A cause must temporally precede its effect."}, {"id": 21, "string": "(2) Symmetry constraints, i.e., when a pair of events, (A, B) , has a temporal relation r (e.g., before), then (B, A) must have the reverse relation of r (e.g., after)."}, {"id": 22, "string": "(3) Transitivity constraints, i.e., the relation between (A, C) must be temporally consistent with the relation derived from (A, B) and (B, C)."}, {"id": 23, "string": "These constraints originate from the one-dimensional nature of time and the physical nature of causality and build connections between temporal and causal relations, making CCM a natural choice for this problem."}, {"id": 24, "string": "As far as we know, very limited work has been done in joint extraction of both relations."}, {"id": 25, "string": "Formulating the joint problem in the CCM framework is novel and thus the first contribution of this work."}, {"id": 26, "string": "A key obstacle in jointly studying temporal and causal relations lies in the absence of jointly annotated data."}, {"id": 27, "string": "The second contribution of this work is the development of such a jointly annotated dataset which we did by augmenting the Event-Causality dataset (Do et al., 2011) with dense temporal annotations."}, {"id": 28, "string": "This dataset allows us to show statistically significant improvements on both relations via the proposed joint framework."}, {"id": 29, "string": "This paper also presents an empirical result of improving the temporal extraction component."}, {"id": 30, "string": "Specifically, we incorporate explicit time expressions present in the text and high-precision knowledge-based rules into the ILP objective."}, {"id": 31, "string": "These sources of information have been successfully adopted by existing methods (Chambers et al., 2014; Mirza and Tonelli, 2016) , but were never used within a global ILP-based inference method."}, {"id": 32, "string": "Results on TimeBank-Dense (Cassidy et al., 2014), a benchmark dataset with temporal relations only, show that these modifications can also be helpful within ILP-based methods."}, {"id": 33, "string": "Related Work Temporal and causal relations can both be represented by directed acyclic graphs, where the nodes are events and the edges are labeled with either before, after, etc."}, {"id": 34, "string": "(in temporal graphs), or causes and caused by (in causal graphs)."}, {"id": 35, "string": "Existing work on temporal relation extraction was initiated by (Mani et al., 2006; Chambers et al., 2007; Bethard et al., 2007; Verhagen and Pustejovsky, 2008) , Ex 3: Global considerations are needed when making local decisions."}, {"id": 36, "string": "The FAA on Friday (e5:announced) it will close 149 regional airport control towers because of forced spending cuts."}, {"id": 37, "string": "Before Friday's (e6:announcement), it (e7:said) it would consider keeping a tower open if the airport convinces the agency it is in the \"national interest\" to do so."}, {"id": 38, "string": "which formulated the problem as that of learning a classification model for determining the label of each edge locally (i.e., local methods)."}, {"id": 39, "string": "A disadvantage of these early methods is that the resulting graph may break the symmetric and transitive constraints."}, {"id": 40, "string": "There are conceptually two ways to enforce such graph constraints (i.e., global reasoning)."}, {"id": 41, "string": "CAEVO (Chambers et al., 2014) grows the temporal graph in a multi-sieve manner, where predictions are added sieve-by-sieve."}, {"id": 42, "string": "A graph closure operation had to be performed after each sieve to enforce constraints."}, {"id": 43, "string": "This is solving the global inference problem greedily."}, {"id": 44, "string": "A second way is to perform exact inference via ILP and the symmetry and transitivity requirements can be enforced as ILP constraints (Bramsen et al., 2006; Chambers and Jurafsky, 2008; Denis and Muller, 2011; Do et al., 2012; Ning et al., 2017) ."}, {"id": 45, "string": "We adopt the ILP approach in the temporal component of this work for two reasons."}, {"id": 46, "string": "First, as we show later, it is straightforward to build a joint framework with both temporal and causal relations as an extension of it."}, {"id": 47, "string": "Second, the relation between a pair of events is often determined by the relations among other events."}, {"id": 48, "string": "In Ex 3, if a system is unaware of (e5, e6)=simultaneously when trying to make a decision for (e5, e7), it is likely to predict that e5 is before e7 2 ; but, in fact, (e5, e7)=after given the existence of e6."}, {"id": 49, "string": "Using global considerations is thus beneficial in this context not only for generating globally consistent temporal graphs, but also for making more reliable pairwise decisions."}, {"id": 50, "string": "Prior work on causal relations in natural language text was relatively sparse."}, {"id": 51, "string": "Many causal extraction work in other domains assumes the existence of ground truth timestamps (e.g., (Sun et al., 2007; Güler et al., 2016) ), but gold timestamps rarely exist in natural language text."}, {"id": 52, "string": "In NLP, people have focused on causal relation identification using lexical features or discourse relations."}, {"id": 53, "string": "For example, based on a set of explicit causal discourse markers (e.g., \"because\", \"due to\", and \"as a result\"), Hidey and McKeown (2016) built parallel Wikipedia articles and constructed an open set of implicit markers called AltLex."}, {"id": 54, "string": "A classifier was then applied to identify causality."}, {"id": 55, "string": "Dunietz et al."}, {"id": 56, "string": "(2017) used the concept of construction grammar to tag causally related clauses or phrases."}, {"id": 57, "string": "Do et al."}, {"id": 58, "string": "(2011) considered global statistics over a large corpora, the cause-effect association (CEA) scores, and combined it with discourse relations using ILP to identify causal relations."}, {"id": 59, "string": "These work only focused on the causality task and did not address the temporal aspect."}, {"id": 60, "string": "However, as illustrated by Examples 1-2, temporal and causal relations are closely related, as assumed by many existing works (Bethard and Martin, 2008; Rink et al., 2010) ."}, {"id": 61, "string": "Here we argue that being able to capture both aspects in a joint framework provides a more complete understanding of events in natural language documents."}, {"id": 62, "string": "Researchers have started paying attention to this direction recently."}, {"id": 63, "string": "For example, Mostafazadeh et al."}, {"id": 64, "string": "(2016b) proposed an annotation framework, CaTeRs, which captured both temporal and causal aspects of event relations in common sense stories."}, {"id": 65, "string": "CATENA (Mirza and Tonelli, 2016) extended the multi-sieve framework of CAEVO to extracting both temporal and causal relations and exploited their interaction through post-editing temporal relations based on causal predictions."}, {"id": 66, "string": "In this paper, we push this idea forward and tackle the problem in a joint and more principled way, as shown next."}, {"id": 67, "string": "Temporal and Causal Reasoning In this section, we explain the proposed joint inference framework, Temporal and Causal Reasoning (TCR)."}, {"id": 68, "string": "To start with, we focus on introducing the temporal component, and clarify how to design the transitivity constraints and how to enforce other readily available prior knowledge to improve its performance."}, {"id": 69, "string": "With this temporal component already explained, we further incorporate causal relations and complete the TCR joint inference framework."}, {"id": 70, "string": "Finally, we transform the joint problem into an ILP so that it can be solved using offthe-shelf packages."}, {"id": 71, "string": "Temporal Component Let R T be the label set of temporal relations and E and T be the set of all events and the set of all time expressions (a.k.a."}, {"id": 72, "string": "timex) in a document."}, {"id": 73, "string": "For notation convenience, we use EE to represent the set of all event-event pairs; then ET and T T have obvious definitions."}, {"id": 74, "string": "Given a pair in EE or ET , assume for now that we have corresponding classifiers producing confidence scores for every temporal relation in R T ."}, {"id": 75, "string": "Let them be s ee (·) and s et (·), respectively."}, {"id": 76, "string": "Then the inference formulation for all the temporal relations within this document is: Y = arg max Y ∈Y ∑ i∈EE s ee {i → Yi} + ∑ j∈ET s et {j → Yj} (1) where Y k ∈ R T is the temporal label of pair k ∈ MM (Let M = E ∪ T be the set of all tem- poral nodes), \"k → Y k \" represents the case where the label of pair k is predicted to be Y k , Y is a vec- torization of all these Y k 's in one document, and Y is the constrained space that Y lies in."}, {"id": 77, "string": "We do not include the scores for T T because the temporal relationship between timexes can be trivially determined using the normalized dates of these timexes, as was done in (Do et al., 2012; Chambers et al., 2014; Mirza and Tonelli, 2016) ."}, {"id": 78, "string": "We impose these relations via equality constraints denoted as Y 0 ."}, {"id": 79, "string": "In addition, we add symmetry and transitivity constraints dictated by the nature of time (denoted by Y 1 ), and other prior knowledge derived from linguistic rules (denoted by Y 2 ), which will be explained subsequently."}, {"id": 80, "string": "Finally, we set Y = ∩ 2 i=0 Y i in Eq."}, {"id": 81, "string": "(1)."}, {"id": 82, "string": "Transitivity Constraints."}, {"id": 83, "string": "Let the dimension of Y be n. Then a standard way to construct the symmetry and transitivity constraints is shown in (Bramsen et al., 2006; Chambers and Jurafsky, 2008; Denis and Muller, 2011; Do et al., 2012; Ning et al., 2017 ) Y 1 = { Y ∈ R n T |∀m 1,2,3 ∈ M, Y (m1,m2) =Ȳ (m2,m1) , Y (m1,m3) ∈ Trans(Y (m1,m2) , Y (m2,m3) ) } where the bar sign is used to represent the reverse relation hereafter, and Trans(r 1 , r 2 ) is a set comprised of all the temporal relations from R T that do not conflict with r 1 and r 2 ."}, {"id": 84, "string": "The construction of Trans(r 1 , r 2 ) necessitates a clearer definition of R T , the importance of which is often overlooked by existing methods."}, {"id": 85, "string": "Existing approaches all followed the interval representation of events (Allen, 1984) , which yields 13 temporal relations (denoted byR T here) as shown in ."}, {"id": 86, "string": "\"x\" means that the label is ignored."}, {"id": 87, "string": "Brackets represent time intervals along the time axis."}, {"id": 88, "string": "Scheme 2 is adopted consistently in this work."}, {"id": 89, "string": "ample, {before, after, includes, is included, simultaneously, vague}."}, {"id": 90, "string": "For notation convenience, we denote them R T = {b, a, i, ii, s, v}."}, {"id": 91, "string": "Using a reduced set is more convenient in data annotation and leads to better performance in practice."}, {"id": 92, "string": "However, there has been limited discussion in the literature on how to interpret the reduced relation types."}, {"id": 93, "string": "For example, is the \"before\" in R T exactly the same as the \"before\" in the original set (R T ) (as shown on the left-hand-side of Fig."}, {"id": 94, "string": "1 ), or is it a combination of multiple relations inR T (the right-hand-side of Fig."}, {"id": 95, "string": "1) ?"}, {"id": 96, "string": "We compare two reduction schemes in Fig."}, {"id": 97, "string": "1 , where scheme 1 ignores low frequency labels directly and scheme 2 absorbs low frequency ones into their temporally closest labels."}, {"id": 98, "string": "The two schemes barely have differences when a system only looks at a single pair of mentions at a time (this might explain the lack of discussion over this issue in the literature), but they lead to different Trans(r 1 , r 2 ) sets and this difference can be magnified when the problem is solved jointly and when the label distribution changes across domains."}, {"id": 99, "string": "To completely cover the 13 relations, we adopt scheme 2 in this work."}, {"id": 100, "string": "The resulting transitivity relations are shown in Table 1 ."}, {"id": 101, "string": "The top part of Table 1 is a compact representation of three generic rules; for instance, Line 1 means that the labels themselves are transitive."}, {"id": 102, "string": "Note that during human annotation, if an annotator looks at a pair of events and decides that multiple well-defined relations can exist, he/she labels it vague; also, when aggregating the labels from multiple annotators, a label will be changed to vague if the annotators disagree with each other."}, {"id": 103, "string": "In either case, vague is chosen to be the label when a single well-defined relation cannot be uniquely determined by the contextual information."}, {"id": 104, "string": "This explains why a vague relation (v) is always added in Table 1 if more than one label in Trans(r 1 , r 2 ) is possible."}, {"id": 105, "string": "As for Lines 6, 9-11 in Table 1 (where vague appears in Column r 2 ), Column Trans(r 1 ,r 2 ) was designed in such a way that r 2 cannot be uniquely determined through r 1 and Trans(r 1 ,r 2 )."}, {"id": 106, "string": "For instance, r 1 is after on Line 9, if we further put before into Trans(r 1 ,r 2 ), then r 2 would be uniquely determined to be before, conflicting with r 2 being vague, so before should not be in Trans(r 1 ,r 2 )."}, {"id": 107, "string": "Enforcing Linguistic Rules."}, {"id": 108, "string": "Besides the transitivity constraints represented by Y 1 above, we also propose to enforce prior knowledge to further constrain the search space for Y ."}, {"id": 109, "string": "Specifically, linguistic insight has resulted in rules for predicting the temporal relations with special syntactic or semantic patterns, as was done in CAEVO (a state-of-the-art method)."}, {"id": 110, "string": "Since these rule predictions often have high-precision, it is worthwhile incorporating them in global reasoning methods as well."}, {"id": 111, "string": "No."}, {"id": 112, "string": "r1 r2 Trans(r1, r2) 1 r r r 2 r s r 3 r1 r2 Trans(r2,r1) 4 b i b, i, v 5 b ii b, ii, v 6 b v b, i, ii, v 7 a i a, i, v 8 a ii a, ii, v 9 a v a, i, ii ,v 10 i v b, a, i, v 11 ii v b, a, ii, v In the CCM framework, these rules can be represented as hard constraints in the search space for Y ."}, {"id": 113, "string": "Specifically, Y2 = { Yj = rule(j), ∀j ∈ J (rule) } , (2) where J (rule) ⊆ MM is the set of pairs that can be determined by linguistic rules, and rule(j) ∈ R T is the corresponding decision for pair j according to these rules."}, {"id": 114, "string": "In this work, we used the same set of rules designed by CAEVO for fair comparison."}, {"id": 115, "string": "Full Model with Causal Relations Now we have presented the joint inference framework for temporal relations in Eq."}, {"id": 116, "string": "(1)."}, {"id": 117, "string": "It is easier to explain our complete TCR framework on top of it."}, {"id": 118, "string": "Let W be the vectorization of all causal relations and add the scores from the scoring function for causality s c (·) to Eq."}, {"id": 119, "string": "(1)."}, {"id": 120, "string": "Specifically, the full inference formulation is now: Y ,Ŵ = arg max Y ∈Y,W ∈W Y ∑ i∈EE s ee {i → Y i } (3) + ∑ j∈ET s et {j → Y j } + ∑ k∈EE s c {k → W k } where W Y is the search space for W ."}, {"id": 121, "string": "W Y depends on the temporal labels Y in the sense that W Y = {W ∈ R m C |∀i, j ∈ E, if W (i,j) = c, (4) then W (j,i) =c, and Y (i,j) = b} where m is the dimension of W (i.e., the total number of causal pairs), R C = {c,c, null} is the label set for causal relations (i.e., \"causes\", \"caused by\", and \"no relation\"), and W (i,j) is the causal label for pair (i, j)."}, {"id": 122, "string": "The constraint represented by W Y means that if a pair of events i and j are labeled to be \"causes\", then the causal relation between j and i must be \"caused by\", and the temporal relation between i and j must be \"before\"."}, {"id": 123, "string": "Scoring Functions In the above, we have built the joint framework on top of scoring functions s ee (·), s et (·) and s c (·)."}, {"id": 124, "string": "To get s ee (·) and s et (·), we trained classifiers using the averaged perceptron algorithm (Freund and Schapire, 1998) and the same set of features used in (Do et al., 2012; Ning et al., 2017) , and then used the soft-max scores in those scoring functions."}, {"id": 125, "string": "For example, that means s ee {i → r} = w T r ϕ(i) ∑ r ′ ∈RT w T r ′ ϕ(i) , i ∈ EE, r ∈ R T , where {w r } is the learned weight vector for relation r ∈ R T and ϕ(i) is the feature vector for pair i ∈ EE."}, {"id": 126, "string": "Given a pair of ordered events, we need s c (·) to estimate the scores of them being \"causes\" or \"caused by\"."}, {"id": 127, "string": "Since this scoring function has the same nature as s ee (·), we can reuse the features from s ee (·) and learn an averaged perceptron for s c (·)."}, {"id": 128, "string": "In addition to these existing features, we also use prior statistics retrieved using our temporal system from a large corpus 3 , so as to know probabilistically which event happens before another event."}, {"id": 129, "string": "For example, in Example 1, we have a pair of events, e1:died and e2:exploded."}, {"id": 130, "string": "The prior knowledge we retrieved from that large corpus is that die happens before explode with probability 15% and happens after explode with probability 85%."}, {"id": 131, "string": "We think this prior distribution is correlated with causal directionality, so it was also added as features when training s c (·)."}, {"id": 132, "string": "Note that the scoring functions here are implementation choice."}, {"id": 133, "string": "The TCR joint framework is fully extensible to other scoring functions."}, {"id": 134, "string": "Convert the Joint Inference into an ILP Conveniently, the joint inference formulation in Eq."}, {"id": 135, "string": "(3) can be rewritten into an ILP and solved using off-the-shelf optimization packages, e.g., (Gurobi Optimization, Inc., 2012) ."}, {"id": 136, "string": "First, we define indicator variables y r i = I{Y i = r}, where I{·} is the indicator function, ∀i ∈ MM, ∀r ∈ R T ."}, {"id": 137, "string": "Then let p r i = s ee {i → r} if i ∈ EE, or p r i = s et {i → r} if i ∈ ET ; similarly, let w r j = I{W i = r} be the indicator variables for W j and q r j be the score for W j = r ∈ R C ."}, {"id": 138, "string": "Therefore, without constraints Y and W Y for now, Eq."}, {"id": 139, "string": "(3) can be written as: y,ŵ = arg max ∑ i∈EE∪ET ∑ r∈R T p r i y r i + ∑ j∈EE ∑ r∈R C q r j w r j s.t."}, {"id": 140, "string": "y r i , w r j ∈ {0, 1}, ∑ r∈R T y r i = ∑ r∈R C w r j = 1 The prior knowledge represented as Y and W Y can be conveniently converted into constraints for this optimization problem."}, {"id": 141, "string": "Specifically, Y 1 has two components, symmetry and transitivity: Y1 : ∀i, j, k ∈ M, y r i,j = yr j,i , (symmetry) y r 1 i,j + y r 2 j,k − ∑ r 3 ∈Trans(r 1 ,r 2 ) y r 3 i,k ≤ 1 (transitivity) wherer is the reverse relation of r (i.e.,b = a, i = ii,s = s, andv = v), and Trans(r 1 , r 2 ) is defined in Table 1 ."}, {"id": 142, "string": "As for the transitivity constraints, if both y r 1 i,j and y r 2 j,k are 1, then the constraint requires at least one of y r 3 i,k , r 3 ∈ Trans(r 1 , r 2 ) to be 1, which means the relation between i and k has to be chosen from Trans(r 1 , r 2 ), which is exactly what Y 1 is intended to do."}, {"id": 143, "string": "The rules in Y 2 is written as Y 2 : y r j = I {rule(j)=r} , ∀j ∈ J (rule) (linguistic rules) where rule(j) and J (rule) have been defined in Eq."}, {"id": 144, "string": "(2)."}, {"id": 145, "string": "Converting the T T constraints, i.e., Y 0 , into constraints is as straightforward as Y 2 , so we omit it due to limited space."}, {"id": 146, "string": "Last, converting the constraints W Y defined in Eq."}, {"id": 147, "string": "(4) can be done as following: W Y : w c i,j = wc j,i ≤ y b i,j , ∀i, j ∈ E. The equality part, w c i,j = wc j,i represents the symmetry constraint of causal relations; the inequality part, w c i,j ≤ y b i,j represents that if event i causes event j, then i must be before j."}, {"id": 148, "string": "Experiments In this section, we first show on TimeBank-Dense (TB-Dense) (Cassidy et al., 2014) , that the proposed framework improves temporal relation identification."}, {"id": 149, "string": "We then explain how our new dataset with both temporal and causal relations was collected, based on which the proposed method improves for both relations."}, {"id": 150, "string": "Temporal Performance on TB-Dense Multiple datasets with temporal annotations are available thanks to the TempEval (TE) workshops (Verhagen et al., 2007 (Verhagen et al., , 2010 UzZaman et al., 2013) ."}, {"id": 151, "string": "The dataset we used here to demonstrate our improved temporal component was TB-Dense, which was annotated on top of 36 documents out of the classic TimeBank dataset (Pustejovsky et al., 2003) ."}, {"id": 152, "string": "The main purpose of TB-Dense was to alleviate the known issue of sparse annotations in the evaluation dataset provided with TE3 (Uz-Zaman et al., 2013) , as pointed out in many previous work (Chambers, 2013; Cassidy et al., 2014; Chambers et al., 2014; Ning et al., 2017) ."}, {"id": 153, "string": "Annotators of TB-Dense were forced to look at each pair of events or timexes within the same sentence or contiguous sentences, so that much fewer links were missed."}, {"id": 154, "string": "Since causal link annotation is not available on TB-Dense, we only show our improvement in terms of temporal performance on Table 2 : Ablation study of the proposed system in terms of the standard temporal awareness metric."}, {"id": 155, "string": "The baseline system is to make inference locally for each event pair without looking at the decisions from others."}, {"id": 156, "string": "The \"+\" signs on lines 2-5 refer to adding a new source of information on top of its preceding system, with which the inference has to be global and done via ILP."}, {"id": 157, "string": "All systems are significantly different to its preceding one with p<0.05 (McNemar's test)."}, {"id": 158, "string": "TB-Dense."}, {"id": 159, "string": "The standard train/dev/test split of TB-Dense was used and parameters were tuned to optimize the F 1 performance on dev."}, {"id": 160, "string": "Gold events and time expressions were also used as in existing systems."}, {"id": 161, "string": "The contributions of each proposed information sources are analyzed in the ablation study shown in Table 2 , where we can see the F 1 score was improved step-by-step as new sources of information were added."}, {"id": 162, "string": "Recall that Y 1 represents transitivity constraints, ET represents taking eventtimex pairs into consideration, and Y 2 represents rules from CAEVO (Chambers et al., 2014) ."}, {"id": 163, "string": "System 1 is the baseline we are comparing to, which is a local method predicting temporal relations one at a time."}, {"id": 164, "string": "System 2 only applied Y 1 via ILP on top of all EE pairs by removing the 2nd term in Eq."}, {"id": 165, "string": "(1); for fair comparison with System 1, we added the same ET predictions from System 1."}, {"id": 166, "string": "System 3 incorporated ET into the ILP and mainly contributed to an increase in precision (from 42.9 to 44.3); we think that there could be more gain if more time expressions existed in the testset."}, {"id": 167, "string": "With the help of additional high-precision rules (Y 2 ), the temporal performance can further be improved, as shown by System 4."}, {"id": 168, "string": "Finally, using the causal extraction obtained via (Do et al., 2011) in the joint framework, the proposed method achieved the best precision, recall, and F 1 scores in our ablation study (Systems 1-5)."}, {"id": 169, "string": "According to the McNemar's test (Everitt, 1992; Dietterich, 1998) , all Systems 2-5 were significantly different to its preceding system with p<0.05."}, {"id": 170, "string": "The second part of Table 2 compares several state-of-the-art systems on the same test set."}, {"id": 171, "string": "ClearTK (Bethard, 2013) was the top performing system in TE3 in temporal relation extraction."}, {"id": 172, "string": "Since it was designed for TE3 (not TB-Dense), it expectedly achieved a moderate recall on the test set of TB-Dense."}, {"id": 173, "string": "CAEVO (Chambers et al., 2014) and Ning et al."}, {"id": 174, "string": "(2017) were more recent methods and achieved better scores on TB-Dense."}, {"id": 175, "string": "Compared with these state-of-the-art methods, the proposed joint system (System 5) achieved the best F 1 score with a major improvement in recall."}, {"id": 176, "string": "We think the low precision compared to System 8 is due to the lack of structured learning, and the low precision compared to System 7 is propagated from the baseline (System 1), which was tuned to maximize its F 1 score."}, {"id": 177, "string": "However, the effectiveness of the proposed information sources is already justified in Systems 1-5."}, {"id": 178, "string": "Joint Performance on Our New Dataset Data Preparation TB-Dense only has temporal relation annotations, so in the evaluations above, we only evaluated our temporal performance."}, {"id": 179, "string": "One existing dataset with both temporal and causal annotations available is the Causal-TimeBank dataset (Causal-TB) (Mirza and Tonelli, 2014) ."}, {"id": 180, "string": "However, Causal-TB is sparse in temporal annotations and is even sparser in causal annotations: In Table 3 , we can see that with four times more documents, Causal-TB still has fewer temporal relations (denoted as T-Links therein), compared to TB-Dense; as for causal relations (C-Links), it has less than two causal relations in each document on average."}, {"id": 181, "string": "Note that the T-Link sparsity of Causal-TB originates from TimeBank, which is known to have missing links (Cassidy et al., 2014; Ning et al., 2017) ."}, {"id": 182, "string": "The C-Link sparsity was a design choice of Causal-TB in which C-Links were annotated based on only explicit causal markers (e.g., \"A happened because of B\")."}, {"id": 183, "string": "Another dataset with parallel annotations is CaTeRs (Mostafazadeh et al., 2016b) , which was primarily designed for the Story Cloze Test (Mostafazadeh et al., 2016a) based on common (2014) and use this new dataset to showcase the proposed joint approach."}, {"id": 184, "string": "The EventCausality dataset provides relatively dense causal annotations on 25 newswire articles collected from CNN in 2010."}, {"id": 185, "string": "As shown in Table 3 , it has more than 20 C-Links annotated per document on average (10 times denser than Causal-TB)."}, {"id": 186, "string": "However, one issue is that its notion for events is slightly different to that in the temporal relation extraction regime."}, {"id": 187, "string": "To construct parallel annotations of both temporal and causal relations, we preprocessed all the articles in EventCausality using ClearTK to extract events and then manually removed some obvious errors in them."}, {"id": 188, "string": "To annotate temporal relations among these events, we adopted the annotation scheme from TB-Dense given its success in mitigating the issue of missing annotations with the following modifications."}, {"id": 189, "string": "First, we used a crowdsourcing platform, Crowd-Flower, to collect temporal relation annotations."}, {"id": 190, "string": "For each decision of temporal relation, we asked 5 workers to annotate and chose the majority label as our final annotation."}, {"id": 191, "string": "Second, we discovered that comparisons involving ending points of events tend to be ambiguous and suffer from low inter-annotator agreement (IAA), so we asked the annotators to label relations based on the starting points of each event."}, {"id": 192, "string": "This simplification does not change the nature of temporal relation extraction but leads to better annotation quality."}, {"id": 193, "string": "For more details about this data collection scheme, please refer to (Ning et al., 2018b) for more details."}, {"id": 194, "string": "Results Result on our new dataset jointly annotated with both temporal and causal relations is shown in Ta-  ble 4."}, {"id": 195, "string": "We split the new dataset into 20 documents for training and 5 documents for testing."}, {"id": 196, "string": "In the training phase, the training parameters were tuned via 5-fold cross validation on the training set."}, {"id": 197, "string": "Table 4 demonstrates the improvement of the joint framework over individual components."}, {"id": 198, "string": "The \"temporal only\" baseline is the improved temporal extraction system for which the joint inference with causal links has NOT been applied."}, {"id": 199, "string": "The \"causal only\" baseline is to use s c (·) alone for the prediction of each pair."}, {"id": 200, "string": "That is, for a pair i, if s c {i → causes} > s c {i → caused by}, we then assign \"causes\" to pair i; otherwise, we assign \"caused by\" to pair i."}, {"id": 201, "string": "Note that the \"causal accuracy\" column in Table 4 was evaluated only on gold causal pairs."}, {"id": 202, "string": "In the proposed joint system, the temporal and causal scores were added up for all event pairs."}, {"id": 203, "string": "The temporal performance got strictly better in precision, recall, and F 1 , and the causal performance also got improved by a large margin from 70.5% to 77.3%, indicating that temporal signals and causal signals are helpful to each other."}, {"id": 204, "string": "According to the McNemar's test, both improvements are significant with p<0.05."}, {"id": 205, "string": "The second part of Table 4 shows that if gold relations were used, how well each component would possibly perform."}, {"id": 206, "string": "Technically, these gold temporal/causal relations were enforced via adding extra constraints to ILP in Eq."}, {"id": 207, "string": "(3) (imagine these gold relations as a special rule, and convert them into constraints like what we did in Eq."}, {"id": 208, "string": "(2))."}, {"id": 209, "string": "When using gold temporal relations, causal accuracy went up to 91.9%."}, {"id": 210, "string": "That is, 91.9% of the C-Links satisfied the assumption that the cause is temporally before the effect."}, {"id": 211, "string": "First, this number is much higher than the 77.3% on line 3, so there is still room for improvement."}, {"id": 212, "string": "Second, it means in this dataset, there were 8.1% of the C-Links in which the cause is temporally after its effect."}, {"id": 213, "string": "We will discuss this seemingly counter-intuitive phenomenon in the Discussion section."}, {"id": 214, "string": "When gold causal relations were used (line 5), the temporal performance was slightly better than line 3 in terms of both precision and recall."}, {"id": 215, "string": "The small difference means that the temporal performance on line 3 was already very close to its best."}, {"id": 216, "string": "Compared with the first line, we can see that gold causal relations led to approximately 2% improvement in precision and recall in temporal performance, which is a reasonable margin given the fact that C-Links are often much sparser than T-Links in practice."}, {"id": 217, "string": "Note that the temporal performance in Table 4 is consistently better than those in Table 2 because of the higher IAA in the new dataset."}, {"id": 218, "string": "However, the improvement brought by joint reasoning with causal relations is the same, which further confirms the capability of the proposed approach."}, {"id": 219, "string": "Discussion We have consistently observed that on the TB-Dense dataset, if automatically tuned to optimize its F 1 score, a system is very likely to have low precisions and high recall (e.g., Table 2 )."}, {"id": 220, "string": "We notice that our system often predicts non-vague relations when the TB-Dense gold is vague, resulting in lower precision."}, {"id": 221, "string": "However, on our new dataset, the same algorithm can achieve a more balanced precision and recall."}, {"id": 222, "string": "This is an interesting phenomenon, possibly due to the annotation scheme difference which needs further investigation."}, {"id": 223, "string": "The temporal improvements in both Table 2 and Table 4 are relatively small (although statistically significant)."}, {"id": 224, "string": "This is actually not surprising because C-Links are much fewer than T-Links in newswires which focus more on the temporal development of stories."}, {"id": 225, "string": "As a result, many T-Links are not accompanied with C-Links and the improvements are diluted."}, {"id": 226, "string": "But for those event pairs having both T-Links and C-Links, the proposed joint framework is an important scheme to synthesize both signals and improve both."}, {"id": 227, "string": "The comparison between Line 5 and Line 3 in Table 4 is a showcase of the effectiveness."}, {"id": 228, "string": "We think that a deeper reason for the improvement achieved via a joint framework is that causality often encodes humans prior knowledge as global information (e.g., \"death\" is caused by \"explosion\" rather than causes \"explosion\", regardless of the local context), while temporality often focuses more on the local context."}, {"id": 229, "string": "From this standpoint, temporal information and causal information are complementary and helpful to each other."}, {"id": 230, "string": "When doing error analysis for the fourth line of Table 4 , we noticed some examples that break the commonly accepted temporal precedence assumption."}, {"id": 231, "string": "It turns out that they are not annotation mistakes: In Example 4, e8:finished is obviously before e9:closed, but e9 is a cause of e8 since if the market did not close, the shares would not finish."}, {"id": 232, "string": "In the other sentence of Example 4, she prepares before hosting her show, but e11:host is the cause of e10:prepares since if not for hosting, no preparation would be needed."}, {"id": 233, "string": "In both cases, the cause is temporally after the effect because people are inclined to make projections for the future and change their behaviors before the future comes."}, {"id": 234, "string": "The proposed system is currently unable to handle these examples and we believe that a better definition of what can be considered as events is needed, as part of further investigating how causality is expressed in natural language."}, {"id": 235, "string": "Finally, the constraints connecting causal relations to temporal relations are designed in this paper as \"if A is the cause of B, then A must be before B\"."}, {"id": 236, "string": "People have suggested other possibilities that involve the includes and simultaneously relations."}, {"id": 237, "string": "While these other relations are simply different interpretations of temporal precedence (and can be easily incorporated in our framework), we find that they rarely happen in our dataset."}, {"id": 238, "string": "Conclusion We presented a novel joint framework, Temporal and Causal Reasoning (TCR), using CCMs and ILP to the extraction problem of temporal and causal relations between events."}, {"id": 239, "string": "To show the benefit of TCR, we have developed a new dataset that jointly annotates temporal and causal annotations, and then exhibited that TCR can improve both temporal and causal components."}, {"id": 240, "string": "We hope that this notable improvement can foster more interest in jointly studying multiple aspects of events (e.g., event sequencing, coreference, parent-child relations) towards the goal of understanding events in natural language."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 32}, {"section": "Related Work", "n": "2", "start": 33, "end": 66}, {"section": "Temporal and Causal Reasoning", "n": "3", "start": 67, "end": 70}, {"section": "Temporal Component", "n": "3.1", "start": 71, "end": 114}, {"section": "Full Model with Causal Relations", "n": "3.2", "start": 115, "end": 122}, {"section": "Scoring Functions", "n": "3.3", "start": 123, "end": 133}, {"section": "Convert the Joint Inference into an ILP", "n": "3.4", "start": 134, "end": 147}, {"section": "Experiments", "n": "4", "start": 148, "end": 149}, {"section": "Temporal Performance on TB-Dense", "n": "4.1", "start": 150, "end": 177}, {"section": "Data Preparation", "n": "4.2.1", "start": 178, "end": 193}, {"section": "Results", "n": "4.2.2", "start": 194, "end": 218}, {"section": "Discussion", "n": "5", "start": 219, "end": 236}, {"section": "Conclusion", "n": "6", "start": 237, "end": 240}], "figures": [{"filename": "../figure/image/1010-Table4-1.png", "caption": "Table 4: Comparison between the proposed method and existing ones, in terms of both temporal and causal performances. See Sec. 4.2.1 for description of our new dataset. Per the McNemar’s test, the joint system is significantly better than both baselines with p<0.05. Lines 4-5 provide the best possible performance the joint system could achieve if gold temporal/causal relations were given.", "page": 7, "bbox": {"x1": 77.75999999999999, "x2": 284.15999999999997, "y1": 62.879999999999995, "y2": 149.28}}, {"filename": "../figure/image/1010-Table1-1.png", "caption": "Table 1: Transitivity relations based on the label set reduction scheme 2 in Fig. 1. If (m1,m2) 7→ r1 and (m2,m3) 7→ r2, then the relation of (m1,m3) must be chosen from Trans(r1, r2), ∀m1, m2, m3 ∈ M. The top part of the table uses r to represent generic rules compactly. Notations: before (b), after (a), includes (i), is included (ii), simultaneously (s), vague (v), and r̄ represents the reverse relation of r.", "page": 3, "bbox": {"x1": 352.8, "x2": 480.47999999999996, "y1": 62.879999999999995, "y2": 188.16}}, {"filename": "../figure/image/1010-Figure1-1.png", "caption": "Figure 1: Two possible interpretations to the label set of RT = {b, a, i, ii, s, v} for the temporal relations between (A, B). “x” means that the label is ignored. Brackets represent time intervals along the time axis. Scheme 2 is adopted consistently in this work.", "page": 3, "bbox": {"x1": 91.67999999999999, "x2": 269.28, "y1": 64.8, "y2": 217.92}}, {"filename": "../figure/image/1010-Table3-1.png", "caption": "Table 3: Statistics of our new dataset with both temporal and causal relations annotated, compared with existing datasets. T-Link: Temporal relation. C-Link: Causal relation. The new dataset is much denser than Causal-TB in both T-Links and C-Links.", "page": 6, "bbox": {"x1": 315.84, "x2": 517.4399999999999, "y1": 62.879999999999995, "y2": 114.24}}]}