{"title": "Leveraging Transliterations from Multiple Languages", "abstract": "While past research on machine transliteration has focused on a single transliteration task, there exist a variety of supplemental transliterations available in other languages. Given an input for English-to-Hindi transliteration, for example, transliterations from other languages such as Japanese or Hebrew may be helpful in the transliteration process. In this paper, we propose the application of such supplemental transliterations to English-to-Hindi machine transliteration via an SVM re-ranking method with features based on n-gram alignments as well as system and alignment scores. This method achieves a relative improvement of over 10% over the base system used on its own. We further apply this method to system combination, demonstrating just under 5% relative improvement.", "text": [{"id": 0, "string": "Introduction The focus of significant previous work in machine transliteration, including that presented at past NEWS Shared Tasks (Li et al., 2009; Kumaran et al., 2010b) , has been on single transliteration tasks in isolation of other other languages."}, {"id": 1, "string": "This is despite the fact that the various languages provided represent a significant quantity of potentially useful data that is being ignored."}, {"id": 2, "string": "In this NEWS 2011 Shared Task submission, we present a method which beneficially applies supplemental transliterations from other languages to English-to-Hindi transliteration."}, {"id": 3, "string": "In practice, this is a realistic situation in which transliterations from other languages can help."}, {"id": 4, "string": "For example, Wikipedia contains articles on guitarist John Petrucci in English and Japanese, but not in Hindi."}, {"id": 5, "string": "If we wanted to automatically generate a stub (skeleton) article in Hindi, we would need to transliterate his name into Hindi."}, {"id": 6, "string": "Since a Japanese version already exists, we could extract from it additional information to help with the transliteration process."}, {"id": 7, "string": "Importantly, since our article is about an American guitarist, we would explicitly want to start with the English (original) version of the name, and treat other languages as extra data, rather than vice versa."}, {"id": 8, "string": "In order to effectively incorporate the otherlanguage data, we apply SVM re-ranking in a manner that has previously been shown to provide significant improvement for grapheme-to-phoneme conversion (Bhargava and Kondrak, 2011) ."}, {"id": 9, "string": "This method is flexible enough to incorporate multiple languages; it employs features based on character alignments between potential outputs and existing transliterations from other languages, as well as scores of these alignments, which serve as a measure of similarity."}, {"id": 10, "string": "We apply this approach on top of the same DIRECTL+ system as submitted last year (Jiampojamarn et al., 2010b) for English-to-Hindi machine transliteration."}, {"id": 11, "string": "Compared to the base DI-RECTL+ performance, we are able to achieve significantly better results, with a relative performance increase of over 10%."}, {"id": 12, "string": "We also achieve improvements without supplemental transliterations by simply apply the same approach with another system's output as extra data."}, {"id": 13, "string": "We furthermore experiment with romanization for Hindi data as well as different alignment length settings for English-to-Chinese transliteration."}, {"id": 14, "string": "This paper presents methods, methodology, and results for the above experiments."}, {"id": 15, "string": "2 Leveraging multiple transliterations Bhargava and Kondrak (2011) present a method for applying transliterations to grapheme-to-phoneme conversion."}, {"id": 16, "string": "Here, we apply this method verbatim to machine transliteration."}, {"id": 17, "string": "The method is based on SVM re-ranking applied over n-best output lists generated by a base system."}, {"id": 18, "string": "Intuitively, we have an existing base transliteration system that, for a given input, provides a set of n scored outputs, with the correct output not always appearing in the top position."}, {"id": 19, "string": "In order to help bring the correct output to the top, we turn to existing transliterations of the input from other languages."}, {"id": 20, "string": "In order to leverage a variety of features and transliterations from all available languages, SVM re-ranking is applied to this task."}, {"id": 21, "string": "For each output, a feature vector is constructed."}, {"id": 22, "string": "Given alignments between the input and output, for example, binary indicator features based on grouping input and output n-grams in the style of DIRECTL+ (Jiampojamarn et al., 2010a) are constructed."}, {"id": 23, "string": "The base system's score for the output would be included as well, along with differences between the given output's score and the scores for the other outputs in the list."}, {"id": 24, "string": "This feature construction process is then repeated, replacing the input with an available transliteration, for each available transliteration language."}, {"id": 25, "string": "The score in this latter case is used as a measure of how \"similar\" a candidate output is to a \"reference\" transliteration from another language."}, {"id": 26, "string": "We refer to these other transliterations as supplemental transliterations."}, {"id": 27, "string": "While the score features provide a global measure of similarity, the n-gram features allow weights to be learned for character combinations between the candidate output and supplemental transliterations; this provides very fine-grained features that can explicitly use certain characters in supplemental transliterations to help determine the quality of a candidate output."}, {"id": 28, "string": "There are, however, some practicalities that must be considered."}, {"id": 29, "string": "Bhargava and Kondrak (2011) note the importance of applying multiple languages; they found it difficult to achieve significant improvements using transliterations from one language only."}, {"id": 30, "string": "This is due in part to noise in the data (which has been observed in some of the NEWS Shared Task data (Jiampojamarn et al., 2009 )) as well as differing conventions for various transliteration \"schemes\"."}, {"id": 31, "string": "These issues are handled implicitly in two ways: (1) the granularity of the n-gram features allows certain character combinations in the transliteration to be learned as being positive or negative indicators of a candidate output's quality, or that they should be ignored altogether; and (2) the use of multiple transliterations helps smooth out some of the noise."}, {"id": 32, "string": "While we do not examine these methods here for brevity's sake, Bhargava and Kon-drak (2011) show the effectiveness of the granular n-gram features vs. the score features as well as the importance of applying multiple transliteration languages."}, {"id": 33, "string": "Alignment of training data Practically, we must consider how to generate the alignments between the candidate output transliterations and the supplemental transliterations for the n-gram features, as well as how to generate the similarity scores."}, {"id": 34, "string": "M2M-ALIGNER (Jiampojamarn et al., 2007) addresses both of these."}, {"id": 35, "string": "M2M-ALIGNER is an unsupervised character alignment system, meaning that it can learn to align data given sufficient training data consisting of unaligned inputoutput pairs."}, {"id": 36, "string": "Once trained, M2M-ALIGNER will then produce an alignment for a new pair as well as an alignment score."}, {"id": 37, "string": "Because the algorithm is a many-to-many extension of the unsupervised edit distance algorithm, we can see that the alignment score should represent some notion of scriptagnostic similarity."}, {"id": 38, "string": "Since we will be applying M2M-ALIGNER between candidate output transliterations and supplemental transliterations for a variety of supplemental languages, we will need to build several alignment models, each being built from separate training data."}, {"id": 39, "string": "The majority of the task data are Englishsource, so for any entry in one language corpus we can easily find corresponding transliterations in other language corpora."}, {"id": 40, "string": "In other words, to generate training data for M2M-ALIGNER between the target transliteration language and a supplemental language, we need only intersect the two corpora on the basis of the common English input."}, {"id": 41, "string": "Table 1 shows the amount of overlap between the test data for the different English-source languages and the combined training and development data for the other English-source languages."}, {"id": 42, "string": "Note that the Chinese-and Korean-target corpora show very high coverage; however, we focus on Englishto-Hindi transliteration as it enables us to more closely examine the outputs based on our own linguistic familiarities."}, {"id": 43, "string": "The use of other corpora here requires that these results be submitted as a nonstandard run."}, {"id": 44, "string": "Note that, because there is not complete coverage for the English-to-Hindi test data, we simply submit the base system's results as-is in cases where there is no transliteration available from other languages."}, {"id": 45, "string": "Base systems Our principal base system that generates the n-best output lists is DIRECTL+, which has produced excellent results in the NEWS 2010 Shared Task on Transliteration (Jiampojamarn et al., 2010b) ."}, {"id": 46, "string": "For re-ranking, note that training a re-ranker requires training data where the base system scores are representative of unseen data so that the re-ranker does not simply learn to follow the base system; we therefore split the training data into ten folds and perform a sort-of cross validation with DIRECTL+."}, {"id": 47, "string": "This provides us with usable training data for reranking."}, {"id": 48, "string": "We tune the SVM's hyperparameter based on performance on the provided development data, and use the best DIRECTL+ settings established in the NEWS 2010 Shared Task (Jiampojamarn et al., 2010b) ."}, {"id": 49, "string": "Armed with optimal parameter settings, we combine the training and development data into a single set used to train our final DIRECTL+ system."}, {"id": 50, "string": "We also repeat the cross-validation process for training the re-ranker."}, {"id": 51, "string": "We also apply the SVM re-ranking approach to system combination."}, {"id": 52, "string": "In this case, we additionally train another system-here we use SE-QUITUR (Bisani and Ney, 2008 )-for English-to-Hindi transliteration."}, {"id": 53, "string": "During test time, we feed the input into both DIRECTL+ and SEQUITUR, and use the top SEQUITUR output as supplemental data."}, {"id": 54, "string": "We expect that sometimes SEQUITUR will provide a correct answer where DIRECTL+ does not; the hope is that the SVM re-ranking approach will be able to learn when this is the case based on the n-gram and score features."}, {"id": 55, "string": "Hindi romanization In addition to the above re-ranking approach, we experimented with a romanization method for the Hindi data."}, {"id": 56, "string": "Since consonant characters in the Devanagari alphabet have vowels included by default, we romanize the text in order to provide DIRECTL+ with direct individual control over the consonant and vowel components of the Hindi characters."}, {"id": 57, "string": "The default vowel is changed by means of diacriticlike characters, which in turn deletes the default vowel; this requires a context-sensitive (but still rule-based) romanization method, which we construct manually."}, {"id": 58, "string": "We then train DIRECTL+ on the romanized data; during testing, we take the romanized output and convert it back into Devanagari Unicode characters, again using a manuallyconstructed context-sensitive rule-based converter."}, {"id": 59, "string": "Table 2 shows that SVM re-ranking significantly improves the English-to-Hindi transliteration accuracy in comparison with the base system."}, {"id": 60, "string": "Leveraging all of the English-source transliteration corpora as supplemental data yields an increase of over 10%."}, {"id": 61, "string": "When applied using SEQUITUR's output as \"supplemental\" data, we see almost a 5% (relative) increase in word accuracy."}, {"id": 62, "string": "In contrast, our Hindi romanization approach decreases the accuracy."}, {"id": 63, "string": "This differs from the results of the successful application of romanization to Japanese (Jiampojamarn et al., 2010b) , demonstrating that it is not always possible to transfer an idea from one language to another."}, {"id": 64, "string": "Results The English-to-Chinese results, which use only the base DIRECTL+ system, demonstrate the importance of the alignment length parameter setting."}, {"id": 65, "string": "DIRECTL+ requires aligned data for input, and the maximum length of the alignments will have an effect on what DIRECTL+ learns to produce."}, {"id": 66, "string": "We submitted both 3-to-1 and 7-to-1 alignments because they gave similar results during development, and both were better than other tested possibilities."}, {"id": 67, "string": "In the final results, we see a substantial difference between the two alignment settings."}, {"id": 68, "string": "We hypothesize that the complexity of English-to-Chinese mappings is better captured by the alignments that map longer sequences of English letters to single Chinese characters."}, {"id": 69, "string": "making it difficult to generalize to new data."}, {"id": 70, "string": "Finally, we observe very good overall accuracy in the English-to-Japanese results (which also only use base DIRECTL+), which further confirm the effectiveness of DIRECTL+ when applied to machine transliteration."}, {"id": 71, "string": "Previous work There are three lines of research that are relevant to the work we have presented in this paper: (1) DI-RECTL+ and SEQUITUR for machine transliteration; (2) applying multiple languages; and (3) system combination."}, {"id": 72, "string": "For the NEWS 2009 and 2010 Shared Tasks, the discriminative DIRECTL+ system that incorporates many-to-many alignments, online maxmargin training and a phrasal decoder was shown to function well as a general string transduction tool; while originally designed for grapheme-tophoneme conversion, it produced excellent results for machine transliteration (Jiampojamarn et al., 2009; Jiampojamarn et al., 2010b) , leading us to re-use it here."}, {"id": 73, "string": "Finch and Sumita (2010) also submitted a top-performing system that was based in part on SEQUITUR, which is a generative system based on joint n-gram modelling (Bisani and Ney, 2008) ."}, {"id": 74, "string": "In this paper, we applied multiple transliteration languages to a single transliteration task."}, {"id": 75, "string": "While our method is based on SVM re-ranking with similar features as to those used in the base system (Bhargava and Kondrak, 2011) , there have been other explorations into incorporating other language data, particularly when data are scarce."}, {"id": 76, "string": "Zhang et al."}, {"id": 77, "string": "(2010) , for example, apply a pivot-ing approach to machine transliteration, and similarly Khapra et al."}, {"id": 78, "string": "(2010) propose to transliterate through \"bridge\" languages."}, {"id": 79, "string": "Along similar lines, Kumaran et al."}, {"id": 80, "string": "(2010a) find increases in accuracy using a linear-combination-of-scores system that combined the outputs of a direct transliteration system with a system that transliterated through a third language."}, {"id": 81, "string": "For statistical machine translation, Cohn and Lapata (2007) also explore the use of a third language."}, {"id": 82, "string": "Finally, we also touched briefly on system combination: we applied the SVM re-ranking method to combining the outputs of both DIRECTL+ and SEQUITUR, in particular treating DIRECTL+ as the base system and using SEQUITUR's best outputs to re-rank DIRECTL+'s output lists."}, {"id": 83, "string": "Finch and Sumita (2010) , in contrast, combine SEQUITUR's output with that of a phrase-based statistical machine translation system, achieving excellent results."}, {"id": 84, "string": "Where our approach is based on SVM reranking, theirs merged the outputs of the two systems together and then used a linear combination of the system scores to re-rank the combined list."}, {"id": 85, "string": "Conclusion In this paper, we described our submission to the NEWS 2011 Shared Task on machine transliteration."}, {"id": 86, "string": "Our focus was on incorporating supplemental data, using a method based on SVM re-ranking, with features derived from n-gram alignments and alignment scores."}, {"id": 87, "string": "We demonstrated improvements of over 10% when applying other transliteration data to English-to-Hindi machine transliteration, and just under 5% when applying another system's outputs in a similar manner."}, {"id": 88, "string": "We also found that the romanization of Hindi characters brings about a decrease in performance, and that the alignment length parameter in the DIRECTL+ system has a critical effects on the results."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 32}, {"section": "Alignment of training data", "n": "3", "start": 33, "end": 44}, {"section": "Base systems", "n": "4", "start": 45, "end": 54}, {"section": "Hindi romanization", "n": "5", "start": 55, "end": 63}, {"section": "Results", "n": "6", "start": 64, "end": 70}, {"section": "Previous work", "n": "7", "start": 71, "end": 84}, {"section": "Conclusion", "n": "8", "start": 85, "end": 88}], "figures": [{"filename": "../figure/image/1015-Table2-1.png", "caption": "Table 2: Word accuracy (%) for the various submitted runs. DTL is generic DIRECTL+; DTL+Rom. is DIRECTL+ trained on romanized data; DTL+SEQ is DIRECTL+ re-ranked with SEQUITUR outputs; and DTL+Supp. is DIRECTL+ re-ranked with supplemental transliteration data from other languages.", "page": 2, "bbox": {"x1": 312.96, "x2": 519.36, "y1": 64.8, "y2": 183.84}}, {"filename": "../figure/image/1015-Table1-1.png", "caption": "Table 1: The number of entries in the test data (per language) that have at least one supplemental transliteration available from another language corpus.", "page": 2, "bbox": {"x1": 106.56, "x2": 255.35999999999999, "y1": 65.28, "y2": 214.56}}]}