{"title": "A Multi-lingual Multi-task Architecture for Low-resource Sequence Labeling", "abstract": "We propose a multi-lingual multi-task architecture to develop supervised models with a minimal amount of labeled data for sequence labeling. In this new architecture, we combine various transfer models using two layers of parameter sharing. On the first layer, we construct the basis of the architecture to provide universal word representation and feature extraction capability for all models. On the second level, we adopt different parameter sharing strategies for different transfer schemes. This architecture proves to be particularly effective for low-resource settings, when there are less than 200 training sentences for the target task. Using Name Tagging as a target task, our approach achieved 4.3%-50.5% absolute Fscore gains compared to the mono-lingual single-task baseline model. 1 #1 [DUTCH]: If a Palestinian State is, however, the first thing the Palestinians will do. ⋆ [B] Als er een Palestijnse staat komt, is dat echter het eerste wat de Palestijnen zullen doen ⋆ [A] Als er een [S-MISC Palestijnse] staat komt, is dat echter het eerste wat de [S-MISC Palestijnen] zullen doen #2 [DUTCH]: That also frustrates the Muscovites, who still live in the proud capital of Russia but can not look at the soaps that the stupid farmers can see on the outside. ⋆ [B] Ook dat frustreert de Moskovieten , die toch in de fiere hoofdstad van Rusland wonen maar niet naar de soaps kunnen kijken die de domme boeren op de buiten wel kunnen zien ⋆ [A] Ook dat frustreert de [S-MISC Moskovieten] , die toch in de fiere hoofdstad van [S-LOC Rusland] wonen maar niet naar de soaps kunnen kijken die de domme boeren op de buiten wel kunnen zien #3 [DUTCH]: And the PMS centers are merging with the centers for school supervision, the MSTs.", "text": [{"id": 0, "string": "Introduction When we use supervised learning to solve Natural Language Processing (NLP) problems, we typically train an individual model for each task with task-specific labeled data."}, {"id": 1, "string": "However, our target task may be intrinsically linked to other tasks."}, {"id": 2, "string": "For example, Part-of-speech (POS) tagging and Name Tagging can both be considered as sequence labeling; Machine Translation (MT) and Abstractive Text Summarization both require the ability to understand the source text and generate natural language sentences."}, {"id": 3, "string": "Therefore, it is valuable to transfer knowledge from related tasks to the target task."}, {"id": 4, "string": "Multi-task Learning (MTL) is one of * * Part of this work was done when the first author was on an internship at Facebook."}, {"id": 5, "string": "1 The code of our model is available at https://github."}, {"id": 6, "string": "com/limteng-rpi/mlmt the most effective solutions for knowledge transfer across tasks."}, {"id": 7, "string": "In the context of neural network architectures, we usually perform MTL by sharing parameters across models (Ruder, 2017) ."}, {"id": 8, "string": "Previous studies (Collobert and Weston, 2008; Dong et al., 2015; Luong et al., 2016; Liu et al., 2018; Yang et al., 2017) have proven that MTL is an effective approach to boost the performance of related tasks such as MT and parsing."}, {"id": 9, "string": "However, most of these previous efforts focused on tasks and languages which have sufficient labeled data but hit a performance ceiling on each task alone."}, {"id": 10, "string": "Most NLP tasks, including some well-studied ones such as POS tagging, still suffer from the lack of training data for many low-resource languages."}, {"id": 11, "string": "According to Ethnologue 2 , there are 7, 099 living languages in the world."}, {"id": 12, "string": "It is an unattainable goal to annotate data in all languages, especially for tasks with complicated annotation requirements."}, {"id": 13, "string": "Furthermore, some special applications (e.g., disaster response and recovery) require rapid development of NLP systems for extremely low-resource languages."}, {"id": 14, "string": "Therefore, in this paper, we concentrate on enhancing supervised models in low-resource settings by borrowing knowledge learned from related high-resource languages and tasks."}, {"id": 15, "string": "In (Yang et al., 2017) , the authors simulated a low-resource setting for English and Spanish by downsampling the training data for the target task."}, {"id": 16, "string": "However, for most low-resource languages, the data sparsity problem also lies in related tasks and languages."}, {"id": 17, "string": "Under such circumstances, a single transfer model can only bring limited improvement."}, {"id": 18, "string": "To tackle this issue, we propose a multi-lingual multi-task architecture which combines different transfer models within a unified architecture through two levels of parameter sharing."}, {"id": 19, "string": "In the first level, we share character embeddings, character-level convolutional neural networks, and word-level long-short term memory layer across all models."}, {"id": 20, "string": "These components serve as a basis to connect multiple models and transfer universal knowledge among them."}, {"id": 21, "string": "In the second level, we adopt different sharing strategies for different transfer schemes."}, {"id": 22, "string": "For example, we use the same output layer for all Name Tagging tasks to share task-specific knowledge (e.g., I-PER 3 should not be assigned to the first word in a sentence)."}, {"id": 23, "string": "To illustrate our idea, we take sequence labeling as a case study."}, {"id": 24, "string": "In the NLP context, the goal of sequence labeling is to assign a categorical label (e.g., POS tag) to each token in a sentence."}, {"id": 25, "string": "It underlies a range of fundamental NLP tasks, including POS Tagging, Name Tagging, and chunking."}, {"id": 26, "string": "Experiments show that our model can effectively transfer various types of knowledge from different auxiliary tasks and obtains up to 50.5% absolute F-score gains on Name Tagging compared to the mono-lingual single-task baseline."}, {"id": 27, "string": "Additionally, our approach does not rely on a large amount of auxiliary task data to achieve the improvement."}, {"id": 28, "string": "Using merely 1% auxiliary data, we already obtain up to 9.7% absolute gains in Fscore."}, {"id": 29, "string": "Model Basic Architecture The goal of sequence labeling is to assign a categorical label to each token in a given sentence."}, {"id": 30, "string": "Though traditional methods such as Hidden Markov Models (HMMs) and Conditional Random Fields (CRFs) (Lafferty et al., 2001; Ratinov and Roth, 2009; Passos et al., 2014) achieved high performance on sequence labeling tasks, they typically relied on hand-crafted features, therefore it is difficult to adapt them to new tasks or languages."}, {"id": 31, "string": "To avoid task-specific engineering, (Collobert et al., 2011) proposed a feed-forward neural network model that only requires word embeddings trained on a large scale corpus as features."}, {"id": 32, "string": "After that, several neural models based on the combination of long-short term memory (LSTM) and CRFs (Ma and Hovy, 2016; Lample et al., 2016; Chiu and Nichols, 2016) were proposed and 3 We adopt the BIOES annotation scheme."}, {"id": 33, "string": "Prefixes B-, I-, E-, and S-represent the beginning of a mention, inside of a mention, the end of a mention and a single-token mention respectively."}, {"id": 34, "string": "The O tag is assigned to a word which is not part of any mention."}, {"id": 35, "string": "achieved better performance on sequence labeling tasks."}, {"id": 36, "string": "Figure 1: LSTM-CNNs: an LSTM-CRFs-based model for Sequence Labeling LSTM-CRFs-based models are well-suited for multi-lingual multi-task learning for three reasons: (1) They learn features from word and character embeddings and therefore require little feature engineering; (2) As the input and output of each layer in a neural network are abstracted as vectors, it is fairly straightforward to share components between neural models; (3) Character embeddings can serve as a bridge to transfer morphological and semantic information between languages with identical or similar scripts, without requiring cross-lingual dictionaries or parallel sentences."}, {"id": 37, "string": "Therefore, we design our multi-task multilingual architecture based on the LSTM-CNNs model proposed in (Chiu and Nichols, 2016) ."}, {"id": 38, "string": "The overall framework is illustrated in Figure 1 ."}, {"id": 39, "string": "First, each word w i is represented as the combination x i of two parts, word embedding and character feature vector, which is extracted from character embeddings of the characters in w i using convolutional neural networks (CharCNN)."}, {"id": 40, "string": "On top of that, a bidirectional LSTM processes the sequence x = {x 1 , x 2 , ...} in both directions and encodes each word and its context into a fixed-size vector h i ."}, {"id": 41, "string": "Next, a linear layer converts h i to a score vector y i , in which each component represents the predicted score of a target tag."}, {"id": 42, "string": "In order to model correlations between tags, a CRFs layer is added at the top to generate the best tagging path for the whole sequence."}, {"id": 43, "string": "In the CRFs layer, given an input sentence x of length L and the output of the linear layer y, the score of a sequence of tags z is defined as: S(x, y, z) = L ∑ t=1 (A z t−1 ,zt + y t,zt ), where A is a transition matrix in which A p,q represents the binary score of transitioning from tag p to tag q, and y t,z represents the unary score of assigning tag z to the t-th word."}, {"id": 44, "string": "Given the ground truth sequence of tags z, we maximize the following objective function during the training phase: O = log P (z|x) = S(x, y, z) − log ∑ z∈Z e S(x,y,z) , where Z is the set of all possible tagging paths."}, {"id": 45, "string": "We emphasize that our actual implementation differs slightly from the LSTM-CNNs model."}, {"id": 46, "string": "We do not use additional word-and characterlevel explicit symbolic features (e.g., capitalization and lexicon) as they may require additional language-specific knowledge."}, {"id": 47, "string": "Additionally, we transform character feature vectors using highway networks (Srivastava et al., 2015) , which is reported to enhance the overall performance by (Kim et al., 2016) and (Liu et al., 2018) ."}, {"id": 48, "string": "Highway networks is a type of neural network that can smoothly switch its behavior between transforming and carrying information."}, {"id": 49, "string": "Multi-task Multi-lingual Architecture MTL can be employed to improve performance on multiple tasks at the same time, such as MT and parsing in (Luong et al., 2016) ."}, {"id": 50, "string": "However, in our scenario, we only focused on enhancing the performance of a low-resource task, which is our target task or main task."}, {"id": 51, "string": "Our proposed architecture aims to transfer knowledge from a set of auxiliary tasks to the main task."}, {"id": 52, "string": "For simplicity, we refer to a model of a main (auxiliary) task as a main (auxiliary) model."}, {"id": 53, "string": "To jointly train multiple models, we perform multi-task learning using parameter sharing."}, {"id": 54, "string": "Let Θ i be the set of parameters for model m i and Θ i,j = Θ i ∩ Θ j be the shared parameters between m i and m j ."}, {"id": 55, "string": "When optimizing model m i , we update Θ i and hence Θ i,j ."}, {"id": 56, "string": "In this way, we can partially train model m j as Θ i,j ⊆ Θ j ."}, {"id": 57, "string": "Previously, each MTL model generally uses a single transfer scheme."}, {"id": 58, "string": "In order to merge different transfer models into a unified architecture, we employ two levels of parameter sharing as follows."}, {"id": 59, "string": "On the first level, we construct the basis of the architecture by sharing character embeddings, CharCNN and bidirectional LSTM among all models."}, {"id": 60, "string": "This level of parameter sharing aims to provide universal word representation and feature extraction capability for all tasks and languages."}, {"id": 61, "string": "Character Embeddings and Character-level CNNs."}, {"id": 62, "string": "Character features can represent morphological and semantic information; e.g., the English morpheme dis-usually indicates negation and reversal as in \"disagree\" and \"disapproval\"."}, {"id": 63, "string": "For low-resource languages lacking in data to suffice the training of high-quality word embeddings, character embeddings learned from other languages may provide crucial information for labeling, especially for rare and out-of-vocabulary words."}, {"id": 64, "string": "Take the English word \"overflying\" (flying over) as an example."}, {"id": 65, "string": "Even if it is rare or absent in the corpus, we can still infer the word meaning from its suffix over-(above), root fly, and prefix -ing (present participle form)."}, {"id": 66, "string": "In our architecture, we share character embeddings and the CharCNN between languages with identical or similar scripts to enhance word representation for low-resource languages."}, {"id": 67, "string": "Bidirectional LSTM."}, {"id": 68, "string": "The bidirectional LSTM layer is essential to extract character, word, and contextual information from a sentence."}, {"id": 69, "string": "However, with a large number of parameters, it cannot be fully trained only using the low-resource task data."}, {"id": 70, "string": "To tackle this issue, we share the bidirectional LSTM layer across all models."}, {"id": 71, "string": "Bear in mind that because our architecture does not require aligned cross-lingual word embeddings, sharing this layer across languages may confuse the model as it equally handles embeddings in different spaces."}, {"id": 72, "string": "Nevertheless, under low-resource circumstances, data sparsity is the most critical factor that affects the performance."}, {"id": 73, "string": "On top of this basis, we adopt different parameter sharing strategies for different transfer schemes."}, {"id": 74, "string": "For cross-task transfer, we use the same word embedding matrix across tasks so that they can mutually enhance word representations."}, {"id": 75, "string": "For cross-lingual transfer, we share the linear layer and CRFs layer among languages to transfer taskspecific knowledge, such as the transition score between two tags."}, {"id": 76, "string": "Word Embeddings."}, {"id": 77, "string": "For most words, in addition to character embeddings, word embeddings are still crucial to represent semantic informa-Figure 2: Multi-task Multi-lingual Architecture tion."}, {"id": 78, "string": "We use the same word embedding matrix for tasks in the same language."}, {"id": 79, "string": "The matrix is initialized with pre-trained embeddings and optimized as parameters during training."}, {"id": 80, "string": "Thus, task-specific knowledge can be encoded into the word embeddings by one task and subsequently utilized by another one."}, {"id": 81, "string": "For a low-resource language even without sufficient raw text, we mix its data with a related high-resource language to train word embeddings."}, {"id": 82, "string": "In this way, we merge both corpora and hence their vocabularies."}, {"id": 83, "string": "Recently, Conneau et al."}, {"id": 84, "string": "(2017) proposed a domain-adversarial method to align two monolingual word embedding matrices without crosslingual supervision such as a bilingual dictionary."}, {"id": 85, "string": "Although cross-lingual word embeddings are not required, we evaluate our framework with aligned embeddings generated using this method."}, {"id": 86, "string": "Experiment results show that the incorporation of crosslingual embeddings substantially boosts the performance under low-resource settings."}, {"id": 87, "string": "Linear Layer and CRFs."}, {"id": 88, "string": "As the tag set varies from task to task, the linear layer and CRFs can only be shared across languages."}, {"id": 89, "string": "We share these layers to transfer task-specific knowledge to the main model."}, {"id": 90, "string": "For example, our model corrects [S-PER Charles] [S-PER Picqué] to [B-PER Charles] [E-PER Picqué] because the CRFs layer fully trained on other languages assigns a low score to the rare transition S-PER→S-PER and promotes B-PER→E-PER."}, {"id": 91, "string": "In addition to the shared linear layer, we add an unshared language-specific linear layer to allow the model to behave differently toward some features for different languages."}, {"id": 92, "string": "For example, the suffix -ment usually indicates nouns in English whereas indicates adverbs in French."}, {"id": 93, "string": "We combine the output of the shared linear layer y u and the output of the language-specific linear layer y s using: y = g ⊙ y s + (1 − g) ⊙ y u , where g = σ(W g h + b g )."}, {"id": 94, "string": "W g and b g are optimized during training."}, {"id": 95, "string": "h is the LSTM hidden states."}, {"id": 96, "string": "As W g is a square matrix, y, y s , and y u have the same dimension."}, {"id": 97, "string": "Although we only focus on sequence labeling in this work, our architecture can be adapted for many NLP tasks with slight modification."}, {"id": 98, "string": "For example, for text classification tasks, we can take the last hidden state of the forward LSTM as the sentence representation and replace the CRFs layer with a Softmax layer."}, {"id": 99, "string": "In our model, each task has a separate object function."}, {"id": 100, "string": "To optimize multiple tasks within one model, we adopt the alternating training approach in (Luong et al., 2016) ."}, {"id": 101, "string": "At each training step, we sample a task d i with probability r i ∑ j r j , where r i is the mixing rate value assigned to d i ."}, {"id": 102, "string": "In our experiments, instead of tuning r i , we estimate it by: r i = µ i ζ i √ N i , where µ i is the task coefficient, ζ i is the language coefficient, and N i is the number of training examples."}, {"id": 103, "string": "µ i (or ζ i ) takes the value 1 if the task (or language) of d i is the same as that of the target task; Otherwise it takes the value 0.1."}, {"id": 104, "string": "For example, given English Name Tagging as the target task, the task coefficient µ and language coefficient ζ of Spanish Name Tagging are 0.1 and 1 respectively."}, {"id": 105, "string": "While assigning lower mixing rate values to auxiliary tasks, this formula also takes the amount of data into consideration."}, {"id": 106, "string": "Thus, auxiliary tasks receive higher probabilities to reduce overfitting when we have a smaller amount of main task data."}, {"id": 107, "string": "Experiments Data Sets For Name Tagging, we use the following data sets: Dutch (NLD) and Spanish (ESP) data from the CoNLL 2002 shared task (Tjong Kim Sang, 2002) , English (ENG) data from the CoNLL 2003 shared task (Tjong Kim Sang and De Meulder, 2003) , Russian (RUS) data from LDC2016E95 (Russian Representative Language Pack), and Chechen (CHE) data from TAC KBP 2017 10-Language EDL Pilot Evaluation Source Corpus 4 ."}, {"id": 108, "string": "We select Chechen as another target language in addition to Dutch and Spanish because it is a truly under-resourced language and its related language, Russian, also lacks NLP resources."}, {"id": 109, "string": "For POS Tagging, we use English, Dutch, Spanish, and Russian data from the CoNLL 2017 shared task (Zeman et al., 2017; Nivre et al., 2017) ."}, {"id": 110, "string": "In this data set, each token is annotated with two POS tags, UPOS (universal POS tag) and XPOS (language-specific POS tag)."}, {"id": 111, "string": "We use UPOS because it is consistent throughout all languages."}, {"id": 112, "string": "Experimental Setup We use 50-dimensional pre-trained word embeddings and 50-dimensional randomly initialized character embeddings."}, {"id": 113, "string": "We train word embeddings using the word2vec package 5 ."}, {"id": 114, "string": "English, Span-ish, and Dutch embeddings are trained on corresponding Wikipedia articles (2017-12-20 dumps) ."}, {"id": 115, "string": "Russian embeddings are trained on documents in LDC2016E95."}, {"id": 116, "string": "Chechen embeddings are trained on documents in TAC KBP 2017 10-Language EDL Pilot Evaluation Source Corpus."}, {"id": 117, "string": "To learn a mapping between mono-lingual word embeddings and obtain cross-lingual embeddings, we use the unsupervised model in the MUSE library 6 (Conneau et al., 2017) ."}, {"id": 118, "string": "Although word embeddings are fine-tuned during training, we update the embedding matrix in a sparse way and thus do not have to update a large number of parameters."}, {"id": 119, "string": "We optimize parameters using Stochastic Gradient Descent with momentum, gradient clipping and exponential learning rate decay."}, {"id": 120, "string": "At step t, the learning rate α t is updated using α t = α 0 * ρ t/T , where α 0 is the initial learning rate, ρ is the decay rate, and T is the decay step."}, {"id": 121, "string": "7 To reduce overfitting, we apply Dropout (Srivastava et al., 2014) to the output of the LSTM layer."}, {"id": 122, "string": "We conduct hyper-parameter optimization by exploring the space of parameters shown in Table 2 using random search (Bergstra and Bengio, 2012) ."}, {"id": 123, "string": "Due to time constraints, we only perform parameter sweeping on the Dutch Name Tagging task with 200 training examples."}, {"id": 124, "string": "We select the set of parameters that achieves the best performance on the development set and apply it to all models."}, {"id": 125, "string": "Comparison of Different Models In Figure 3 , 4, and 5, we compare our model with the mono-lingual single-task LSTM-CNNs model (denoted as baseline), cross-task transfer model, and cross-lingual transfer model in low-resource settings with Dutch, Spanish, and Chechen Name Tagging as the main task respectively."}, {"id": 126, "string": "We use English as the related language for Dutch and Spanish, and use Russian as the related language for Chechen."}, {"id": 127, "string": "For cross-task transfer, we take POS Tagging as the auxiliary task."}, {"id": 128, "string": "Because the CoNLL 2017 data does not include Chechen, we only use Russian POS Tagging and Russian Name Tagging as auxiliary tasks for Chechen Name Tagging."}, {"id": 129, "string": "We take Name Tagging as the target task for three reasons: (1) POS Tagging has a much lower requirement for the amount of training data."}, {"id": 130, "string": "For example, using only 10 training sentences, our baseline model achieves 75.5% and 82.9% prediction accuracy on Dutch and Spanish; (2) Compared to POS Tagging, Name Tagging has been considered as a more challenging task; (3) Existing POS Tagging resources are relatively richer than Name Tagging ones; e.g., the CoNLL 2017 data set provides POS Tagging training data for 45 languages."}, {"id": 131, "string": "Name Tagging also has a higher annotation cost as its annotation guidelines are usually more complicated."}, {"id": 132, "string": "We can see that our model substantially outperforms the mono-lingual single-task baseline model and obtains visible gains over single transfer models."}, {"id": 133, "string": "When trained with less than 50 main tasks training sentences, cross-lingual transfer consistently surpasses cross-task transfer, which is not surprising because in the latter scheme, the linear layer and CRFs layer of the main model are not shared with other models and thus cannot be fully trained with little data."}, {"id": 134, "string": "Because there are only 20,400 sentences in Chechen documents, we also experiment with the data augmentation method described in Section 2.2 by training word embeddings on a mixture of Russian and Chechen data."}, {"id": 135, "string": "This method yields additional 3.5%-10.0% absolute F-score gains."}, {"id": 136, "string": "We also experiment with transferring from English to Chechen."}, {"id": 137, "string": "Because Chechen uses Cyrillic alphabet , we convert its data set to Latin script."}, {"id": 138, "string": "Surprisingly, although these two languages are not close, we get more improvement by using English as the auxiliary language."}, {"id": 139, "string": "In Table 3 , we compare our model with state-ofthe-art models using all Dutch or Spanish Name Tagging data."}, {"id": 140, "string": "Results show that although we design this architecture for low-resource settings, it also achieves good performance in high-resource settings."}, {"id": 141, "string": "In this experiment, with sufficient training data for the target task, we perform another round of parameter sweeping."}, {"id": 142, "string": "We increase the embedding sizes and LSTM hidden state size to 100 and 225 respectively."}, {"id": 143, "string": "Qualitative Analysis In Table 4 , we compare Name Tagging results from the baseline model and our model, both trained with 100 main task sentences."}, {"id": 144, "string": "The first three examples show that shared character-level networks can transfer different levels of morphological and semantic information."}, {"id": 145, "string": "Table 3 : Comparison with state-of-the-art models."}, {"id": 146, "string": "In example #1, the baseline model fails to identify \"Palestijnen\", an unseen word in the Dutch data, while our model can recognize it because the shared CharCNN represents it in a way similar to its corresponding English word \"Palestinians\", which occurs 20 times."}, {"id": 147, "string": "In addition to mentions, the shared CharCNN can also improve representations of context words, such as \"staat\" (state) in the example."}, {"id": 148, "string": "For some words dissimilar to corresponding English words, the CharCNN may enhance their word representations by transferring morpheme-level knowledge."}, {"id": 149, "string": "For example, in sentence #2, our model is able to identify \"Rusland\" (Russia) as the suffix -land is usually associated with location names in the English data; e.g., Finland."}, {"id": 150, "string": "Furthermore, the CharCNN is capable of capturing some word-level patterns, such as capitalized hyphenated compound and acronym as example #3 shows."}, {"id": 151, "string": "In this sentence, neither \"PMScentra\" nor \"MST\" can be found in auxiliary task data, while we observe a number of similar expressions, such as American-style and LDP."}, {"id": 152, "string": "The transferred knowledge also helps reduce overfitting."}, {"id": 153, "string": "For example, in sentence #4, the baseline model mistakenly tags \"sección\" (section) and \"consellería\" (department) as organizations because their capitalized forms usually appear in Spanish organization names."}, {"id": 154, "string": "With knowledge learned in auxiliary tasks that a lowercased word is rarely tagged as a proper noun, our model is able to avoid overfitting and correct these errors."}, {"id": 155, "string": "Sentence #5 shows an opposite situation, where the capitalized word \"campesinos\" (farm worker) never appears in Spanish names."}, {"id": 156, "string": "In Table 5 , we show differences between cross-lingual transfer and cross-task transfer."}, {"id": 157, "string": "Although the cross-task transfer model recognizes \"Ingeborg Marx\" missed by the baseline model, it mistakenly assigns an S-PER tag to \"Marx\"."}, {"id": 158, "string": "Instead, from English Name Tagging, the cross-lingual transfer model borrows task-specific knowledge through the shared CRFs layer that (1) B-PER→S-PER is an invalid transition, and (2) even if we assign S-PER to \"Ingeborg\", it is rare to have continuous person names without any conjunction or punctuation."}, {"id": 159, "string": "Thus, the cross-lingual model promotes the sequence B-PER→E-PER."}, {"id": 160, "string": "In Figure 6 , we depict the change of tag distribution with the number of training sentences."}, {"id": 161, "string": "When trained with less than 100 sentences, the baseline model only correctly predicts a few tags dominated by frequent types."}, {"id": 162, "string": "By contrast, our model has a visibly higher recall and better predicts infrequent tags, which can be attributed to the implicit data augmentation and inductive bias introduced by MTL (Ruder, 2017) ."}, {"id": 163, "string": "For example, if all location names in the Dutch training data are single-token ones, the baseline model will inevitably overfit to the tag S-LOC and possibly label \"Caldera de Taburiente\" as [S-LOC Caldera] [S-LOC de] [S-LOC Taburiente], whereas with the shared CRFs layer fully trained on English Name Tagging, our model prefers B-LOC→I-LOC→E-LOC, which receives a higher transition score."}, {"id": 164, "string": "Ablation Studies In order to quantify the contributions of individual components, we conduct ablation studies on Dutch Name Tagging with different numbers of training sentences for the target task."}, {"id": 165, "string": "For the basic model, we we use separate LSTM layers and  remove the character embeddings, highway networks, language-specific layer, and Dropout layer."}, {"id": 166, "string": "As Table 6 shows, adding each component usually enhances the performance (F-score, %), while the impact also depends on the size of the target task data."}, {"id": 167, "string": "For example, the language-specific layer slightly impairs the performance with only 10 training sentences."}, {"id": 168, "string": "However, this is unsurpris-ing as it introduces additional parameters that are only trained by the target task data."}, {"id": 169, "string": "Table 6 : Performance comparison between models with different components (C: character embedding; L: shared LSTM; S: language-specific layer; H: highway networks; D: dropout)."}, {"id": 170, "string": "Effect of the Amount of Auxiliary Task Data For many low-resource languages, their related languages are also low-resource."}, {"id": 171, "string": "To evaluate our model's sensitivity to the amount of auxiliary task data, we fix the size of main task data and downsample all auxiliary task data with sample rates from 1% to 50%."}, {"id": 172, "string": "As Figure 7 shows, the performance goes up when we raise the sample rate from 1% to 20%."}, {"id": 173, "string": "However, we do not observe significant improvement when we further increase the sample rate."}, {"id": 174, "string": "By comparing scores in Figure 3 and Figure 7 , we can see that using only 1% auxiliary data, our model already obtains 3.7%-9.7% absolute F-score gains."}, {"id": 175, "string": "Due to space limitations, we only show curves for Dutch Name Tagging, while we observe similar results on other tasks."}, {"id": 176, "string": "Therefore, we may conclude that our model does not heavily rely on the amount of auxiliary task data."}, {"id": 177, "string": "Related Work Multi-task Learning has been applied in different NLP areas, such as machine translation (Luong et al., 2016; Dong et al., 2015; Domhan and Hieber, 2017 ), text classification (Liu et al., 2017) , dependency parsing , textual entailment (Hashimoto et al., 2017) , text summarization (Isonuma et al., 2017) and sequence labeling (Collobert and Weston, 2008; Søgaard and Goldberg, 2016; Rei, 2017; Peng and Dredze, 2017; Yang et al., 2017; von Däniken and Cieliebak, 2017; Aguilar et al., 2017; Liu et al., 2018) Collobert and Weston (2008) is an early attempt that applies MTL to sequence labeling."}, {"id": 178, "string": "The authors train a CNN model jointly on POS Tagging, Semantic Role Labeling, Name Tagging, chunking, and language modeling using parameter sharing."}, {"id": 179, "string": "Instead of using other sequence labeling tasks, Rei (2017) and Liu et al."}, {"id": 180, "string": "(2018) take language modeling as the secondary training objective to extract semantic and syntactic knowledge from large scale raw text without additional supervision."}, {"id": 181, "string": "In (Yang et al., 2017) , the authors propose three transfer models for crossdomain, cross-application, and cross-lingual trans-fer for sequence labeling, and also simulate a lowresource setting by downsampling the training data."}, {"id": 182, "string": "By contrast, we combine cross-task transfer and cross-lingual transfer within a unified architecture to transfer different types of knowledge from multiple auxiliary tasks simultaneously."}, {"id": 183, "string": "In addition, because our model is designed for lowresource settings, we share components among models in a different way (e.g., the LSTM layer is shared across all models)."}, {"id": 184, "string": "Differing from most MTL models, which perform supervisions for all tasks on the outermost layer, (Søgaard and Goldberg, 2016) proposes an MTL model which supervised tasks at different levels."}, {"id": 185, "string": "It shows that supervising low-level tasks such as POS Tagging at lower layer obtains better performance."}, {"id": 186, "string": "Conclusions and Future Work We design a multi-lingual multi-task architecture for low-resource settings."}, {"id": 187, "string": "We evaluate the model on sequence labeling tasks with three language pairs."}, {"id": 188, "string": "Experiments show that our model can effectively transfer different types of knowledge to improve the main model."}, {"id": 189, "string": "It substantially outperforms the mono-lingual single-task baseline model, cross-lingual transfer model, and crosstask transfer model."}, {"id": 190, "string": "The next step of this research is to apply this architecture to other types of tasks, such as Event Extract and Semantic Role Labeling that involve structure prediction."}, {"id": 191, "string": "We also plan to explore the possibility of integrating incremental learning into this architecture to adapt a trained model for new tasks rapidly."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 28}, {"section": "Basic Architecture", "n": "2.1", "start": 29, "end": 48}, {"section": "Multi-task Multi-lingual Architecture", "n": "2.2", "start": 49, "end": 106}, {"section": "Data Sets", "n": "3.1", "start": 107, "end": 111}, {"section": "Experimental Setup", "n": "3.2", "start": 112, "end": 124}, {"section": "Comparison of Different Models", "n": "3.3", "start": 125, "end": 142}, {"section": "Qualitative Analysis", "n": "3.4", "start": 143, "end": 163}, {"section": "Ablation Studies", "n": "3.5", "start": 164, "end": 169}, {"section": "Effect of the Amount of Auxiliary Task Data", "n": "3.6", "start": 170, "end": 176}, {"section": "Related Work", "n": "4", "start": 177, "end": 185}, {"section": "Conclusions and Future Work", "n": "5", "start": 186, "end": 191}], "figures": [{"filename": "../figure/image/1017-Figure4-1.png", "caption": "Figure 4: Performance on Spanish Name Tagging.", "page": 5, "bbox": {"x1": 308.64, "x2": 526.56, "y1": 282.71999999999997, "y2": 423.35999999999996}}, {"filename": "../figure/image/1017-Figure5-1.png", "caption": "Figure 5: Performance on Chechen Name Tagging.", "page": 5, "bbox": {"x1": 308.64, "x2": 525.6, "y1": 463.68, "y2": 603.36}}, {"filename": "../figure/image/1017-Figure3-1.png", "caption": "Figure 3: Performance on Dutch Name Tagging. We scale the horizontal axis to show more details under 100 sentences. Our Model*: our model with MUSE cross-lingual embeddings.", "page": 5, "bbox": {"x1": 308.15999999999997, "x2": 525.6, "y1": 62.4, "y2": 202.56}}, {"filename": "../figure/image/1017-Figure1-1.png", "caption": "Figure 1: LSTM-CNNs: an LSTM-CRFs-based model for Sequence Labeling", "page": 1, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 101.75999999999999, "y2": 264.96}}, {"filename": "../figure/image/1017-Table3-1.png", "caption": "Table 3: Comparison with state-of-the-art models.", "page": 6, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 61.44, "y2": 244.32}}, {"filename": "../figure/image/1017-Figure6-1.png", "caption": "Figure 6: The distribution of correctly predicted tags on Dutch Name Tagging. The height of each stack indicates the number of a certain tag.", "page": 6, "bbox": {"x1": 308.15999999999997, "x2": 524.64, "y1": 466.56, "y2": 604.8}}, {"filename": "../figure/image/1017-Table6-1.png", "caption": "Table 6: Performance comparison between models with different components (C: character embedding; L: shared LSTM; S: language-specific layer; H: highway networks; D: dropout).", "page": 7, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 471.84, "y2": 557.28}}, {"filename": "../figure/image/1017-Table4-1.png", "caption": "Table 4: Name Tagging results, each of which contains an English translation, result of the baseline", "page": 7, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 62.4, "y2": 379.2}}, {"filename": "../figure/image/1017-Table5-1.png", "caption": "Table 5: Comparing cross-task transfer and crosslingual transfer on Dutch Name Tagging with 100 training sentences.", "page": 7, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 432.47999999999996, "y2": 585.12}}, {"filename": "../figure/image/1017-Figure2-1.png", "caption": "Figure 2: Multi-task Multi-lingual Architecture", "page": 3, "bbox": {"x1": 72.0, "x2": 524.16, "y1": 62.879999999999995, "y2": 271.2}}, {"filename": "../figure/image/1017-Figure7-1.png", "caption": "Figure 7: The effect of the amount of auxiliary task data on Dutch Name Tagging.", "page": 8, "bbox": {"x1": 72.48, "x2": 289.44, "y1": 210.72, "y2": 337.91999999999996}}, {"filename": "../figure/image/1017-Table1-1.png", "caption": "Table 1: Name Tagging data set statistics: #token and #name (between parentheses).", "page": 4, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 446.88, "y2": 514.0799999999999}}, {"filename": "../figure/image/1017-Table2-1.png", "caption": "Table 2: Hyper-parameter search space.", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 464.64, "y2": 563.04}}]}