{"title": "No Metrics Are Perfect: Adversarial Reward Learning for Visual Storytelling", "abstract": "Though impressive results have been achieved in visual captioning, the task of generating abstract stories from photo streams is still a little-tapped problem. Different from captions, stories have more expressive language styles and contain many imaginary concepts that do not appear in the images. Thus it poses challenges to behavioral cloning algorithms. Furthermore, due to the limitations of automatic metrics on evaluating story quality, reinforcement learning methods with hand-crafted rewards also face difficulties in gaining an overall performance boost. Therefore, we propose an Adversarial REward Learning (AREL) framework to learn an implicit reward function from human demonstrations, and then optimize policy search with the learned reward function. Though automatic evaluation indicates slight performance boost over state-of-the-art (SOTA) methods in cloning expert behaviors, human evaluation shows that our approach achieves significant improvement in generating more human-like stories than SOTA systems. Code will be made available here 1 . * Equal contribution 1 https://github.com/littlekobe/AREL", "text": [{"id": 0, "string": "Introduction Recently, increasing attention has been focused on visual captioning (Chen et al., 2015; Wang et al., 2018c) , which aims at describing the content of an image or a video."}, {"id": 1, "string": "Though it has achieved impressive results, its capability of performing human-like understanding is still restrictive."}, {"id": 2, "string": "To further investigate machine's capa-Story #1: The brother and sister were ready for the first day of school."}, {"id": 3, "string": "They were excited to go to their first day and meet new friends."}, {"id": 4, "string": "They told their mom how happy they were."}, {"id": 5, "string": "They said they were going to make a lot of new friends ."}, {"id": 6, "string": "Then they got up and got ready to get in the car ."}, {"id": 7, "string": "Story #2: The brother did not want to talk to his sister."}, {"id": 8, "string": "The siblings made up."}, {"id": 9, "string": "They started to talk and smile."}, {"id": 10, "string": "Their parents showed up."}, {"id": 11, "string": "They were happy to see them."}, {"id": 12, "string": "shown here: each image is captioned with one sentence, and we also demonstrate two diversified stories that match the same image sequence."}, {"id": 13, "string": "bilities in understanding more complicated visual scenarios and composing more structured expressions, visual storytelling (Huang et al., 2016) has been proposed."}, {"id": 14, "string": "Visual captioning is aimed at depicting the concrete content of the images, and its expression style is rather simple."}, {"id": 15, "string": "In contrast, visual storytelling goes one step further: it summarizes the idea of a photo stream and tells a story about it."}, {"id": 16, "string": "Figure 1 shows an example of visual captioning and visual storytelling."}, {"id": 17, "string": "We have observed that stories contain rich emotions (excited, happy, not want) and imagination (siblings, parents, school, car) ."}, {"id": 18, "string": "It, therefore, requires the capability to associate with concepts that do not explicitly appear in the images."}, {"id": 19, "string": "Moreover, stories are more subjective, so there barely exists standard templates for storytelling."}, {"id": 20, "string": "As shown in Figure 1 , the same photo stream can be paired with diverse stories, different from each other."}, {"id": 21, "string": "This heavily increases the evaluation difficulty."}, {"id": 22, "string": "So far, prior work for visual storytelling (Huang et al., 2016; Yu et al., 2017b) is mainly inspired by the success of visual captioning."}, {"id": 23, "string": "Nevertheless, because these methods are trained by maximizing the likelihood of the observed data pairs, they are restricted to generate simple and plain description with limited expressive patterns."}, {"id": 24, "string": "In order to cope with the challenges and produce more human-like descriptions, Rennie et al."}, {"id": 25, "string": "(2016) have proposed a reinforcement learning framework."}, {"id": 26, "string": "However, in the scenario of visual storytelling, the common reinforced captioning methods are facing great challenges since the hand-crafted rewards based on string matches are either too biased or too sparse to drive the policy search."}, {"id": 27, "string": "For instance, we used the METEOR (Banerjee and Lavie, 2005) score as the reward to reinforce our policy and found that though the METEOR score is significantly improved, the other scores are severely harmed."}, {"id": 28, "string": "Here we showcase an adversarial example with an average METEOR score as high as 40.2: We had a great time to have a lot of the."}, {"id": 29, "string": "They were to be a of the."}, {"id": 30, "string": "They were to be in the."}, {"id": 31, "string": "The and it were to be the."}, {"id": 32, "string": "The, and it were to be the."}, {"id": 33, "string": "Apparently, the machine is gaming the metrics."}, {"id": 34, "string": "Conversely, when using some other metrics (e.g."}, {"id": 35, "string": "BLEU, CIDEr) to evaluate the stories, we observe an opposite behavior: many relevant and coherent stories are receiving a very low score (nearly zero)."}, {"id": 36, "string": "In order to resolve the strong bias brought by the hand-coded evaluation metrics in RL training and produce more human-like stories, we propose an Adversarial REward Learning (AREL) framework for visual storytelling."}, {"id": 37, "string": "We draw our inspiration from recent progress in inverse reinforcement learning (Ho and Ermon, 2016; Finn et al., 2016; Fu et al., 2017) and propose the AREL algorithm to learn a more intelligent reward function."}, {"id": 38, "string": "Specifically, we first incorporate a Boltzmann distribution to associate reward learning with distribution approximation, then design the adversarial process with two models -a policy model and a reward model."}, {"id": 39, "string": "The policy model performs the primitive actions and produces the story sequence, while the reward model is responsible for learning the implicit reward function from human demonstrations."}, {"id": 40, "string": "The learned reward function would be employed to optimize the policy in return."}, {"id": 41, "string": "For evaluation, we conduct both automatic metrics and human evaluation but observe a poor correlation between them."}, {"id": 42, "string": "Particularly, our method gains slight performance boost over the baseline systems on automatic metrics; human evaluation, however, indicates significant performance boost."}, {"id": 43, "string": "Thus we further discuss the limitations of the metrics and validate the superiority of our AREL method in performing more intelligent understanding of the visual scenes and generating more human-like stories."}, {"id": 44, "string": "Our main contributions are four-fold: • We propose an adversarial reward learning framework and apply it to boost visual story generation."}, {"id": 45, "string": "• We evaluate our approach on the Visual Storytelling (VIST) dataset and achieve the state-of-the-art results on automatic metrics."}, {"id": 46, "string": "• We empirically demonstrate that automatic metrics are not perfect for either training or evaluation."}, {"id": 47, "string": "• We design and perform a comprehensive human evaluation via Amazon Mechanical Turk, which demonstrates the superiority of the generated stories of our method on relevance, expressiveness, and concreteness."}, {"id": 48, "string": "Related Work Visual Storytelling Visual storytelling is the task of generating a narrative story from a photo stream, which requires a deeper understanding of the event flow in the stream."}, {"id": 49, "string": "Park and Kim (2015) has done some pioneering research on storytelling."}, {"id": 50, "string": "Chen et al."}, {"id": 51, "string": "(2017) proposed a multimodal approach for storyline generation to produce a stream of entities instead of human-like descriptions."}, {"id": 52, "string": "Recently, a more sophisticated dataset for visual storytelling (VIST) has been released to explore a more human-like understanding of grounded stories (Huang et al., 2016) ."}, {"id": 53, "string": "Yu et al."}, {"id": 54, "string": "(2017b) proposes a multi-task learning algorithm for both album summarization and paragraph generation, achieving the best results on the VIST dataset."}, {"id": 55, "string": "But these methods are still based on behavioral cloning and lack the ability to generate more structured stories."}, {"id": 56, "string": "Reinforcement Learning in Sequence Generation Recently, reinforcement learning (RL) has gained its popularity in many sequence generation tasks such as machine translation (Bahdanau et al., 2016) , visual captioning (Ren et al., 2017; Wang et al., 2018b) , summarization (Paulus et al., 2017; Chen et al., 2018) , etc."}, {"id": 57, "string": "The common wisdom of using RL is to view generating a word as an action and aim at maximizing the expected return by optimizing its policy."}, {"id": 58, "string": "As pointed in (Ranzato et al., 2015) , traditional maximum likelihood algorithm is prone to exposure bias and label bias, while the RL agent exposes the generative model to its own distribution and thus can perform better."}, {"id": 59, "string": "But these works usually utilize hand-crafted metric scores as the reward to optimize the model, which fails to learn more implicit semantics due to the limitations of automatic metrics."}, {"id": 60, "string": "Rethinking Automatic Metrics Automatic metrics, including BLEU (Papineni et al., 2002) , CIDEr , METEOR (Banerjee and Lavie, 2005), and ROUGE (Lin, 2004) , have been widely applied to the sequence generation tasks."}, {"id": 61, "string": "Using automatic metrics can ensure rapid prototyping and testing new models with fewer expensive human evaluation."}, {"id": 62, "string": "However, they have been criticized to be biased and correlate poorly with human judgments, especially in many generative tasks like response generation (Lowe et al., 2017; Liu et al., 2016) , dialogue system (Bruni and Fernández, 2017) and machine translation (Callison-Burch et al., 2006) ."}, {"id": 63, "string": "The naive overlap-counting methods are not able to reflect many semantic properties in natural language, such as coherence, expressiveness, etc."}, {"id": 64, "string": "Generative Adversarial Network Generative adversarial network (GAN) (Goodfellow et al., 2014 ) is a very popular approach for estimating intractable probabilities, which sidestep the difficulty by alternately training two models to play a min-max two-player game: min D max G E x∼p data [log D(x)] + E z∼pz [log D(G(z))] , where G is the generator and D is the discriminator, and z is the latent variable."}, {"id": 65, "string": "Recently, GAN has quickly been adopted to tackle discrete problems (Yu et al., 2017a; Wang et al., 2018a) ."}, {"id": 66, "string": "The basic idea is to use Monte Carlo policy gradient estimation (Williams, 1992) to update the parameters of the generator."}, {"id": 67, "string": "Inverse Reinforcement Learning Reinforcement learning is known to be hindered by the need for an extensive feature and reward engineering, especially under the unknown dynamics."}, {"id": 68, "string": "Therefore, inverse reinforcement learning (IRL) has been proposed to infer expert's reward function."}, {"id": 69, "string": "Previous IRL approaches include maximum margin approaches (Abbeel and Ng, 2004; Ratliff et al., 2006) and probabilistic approaches (Ziebart, 2010; Ziebart et al., 2008) ."}, {"id": 70, "string": "Recently, adversarial inverse reinforcement learning methods provide an efficient and scalable promise for automatic reward acquisition (Ho and Ermon, 2016; Finn et al., 2016; Fu et al., 2017; Henderson et al., 2017) ."}, {"id": 71, "string": "These approaches utilize the connection between IRL and energy-based model and associate every data with a scalar energy value by using Boltzmann distribution p θ (x) ∝ exp(−E θ (x))."}, {"id": 72, "string": "Inspired by these methods, we propose a practical AREL approach for visual storytelling to uncover a robust reward function from human demonstrations and thus help produce human-like stories."}, {"id": 73, "string": "3 Our Approach Problem Statement Here we consider the task of visual storytelling, whose objective is to output a word sequence W = (w 1 , w 1 , · · · , w T ), w t ∈ V given an input image stream of 5 ordered images I = (I 1 , I 2 , · · · , I 5 ), where V is the vocabulary of all output token."}, {"id": 74, "string": "We formulate the generation as a markov decision process and design a reinforcement learning framework to tackle it."}, {"id": 75, "string": "As described in Figure 2 , our AREL framework is mainly composed of two modules: a policy model π β (W ) and a reward model R θ (W )."}, {"id": 76, "string": "The policy model takes an image sequence I as the input and performs sequential actions (choosing words w from the vocabulary V) to form a narrative story W ."}, {"id": 77, "string": "The reward model CNN My brother recently graduated college."}, {"id": 78, "string": "It was a formal cap and gown event."}, {"id": 79, "string": "My mom and dad attended."}, {"id": 80, "string": "Later, my aunt and grandma showed up."}, {"id": 81, "string": "When the event was over he even got congratulated by the mascot."}, {"id": 82, "string": "Figure 3 : Overview of the policy model."}, {"id": 83, "string": "The visual encoder is a bidirectional GRU, which encodes the high-level visual features extracted from the input images."}, {"id": 84, "string": "Its outputs are then fed into the RNN decoders to generate sentences in parallel."}, {"id": 85, "string": "Encoder Decoder Finally, we concatenate all the generated sentences as a full story."}, {"id": 86, "string": "Note that the five decoders share the same weights."}, {"id": 87, "string": "is optimized by the adversarial objective (see Section 3.3) and aims at deriving a human-like reward from both human-annotated stories and sampled predictions."}, {"id": 88, "string": "Model Policy Model As is shown in Figure 3 , the policy model is a CNN-RNN architecture."}, {"id": 89, "string": "We fist feed the photo stream I = (I 1 , · · · , I 5 ) into a pretrained CNN and extract their high-level image features."}, {"id": 90, "string": "We then employ a visual encoder to further encode the image features as context vectors h i = [ ← − h i ; − → h i ]."}, {"id": 91, "string": "The visual encoder is a bidirectional gated recurrent units (GRU)."}, {"id": 92, "string": "In the decoding stage, we feed each context vector h i into a GRU-RNN decoder to generate a substory W i ."}, {"id": 93, "string": "Formally, the generation process can be written as: s i t = GRU(s i t−1 , [w i t−1 , h i ]) , (1) π β (w i t |w i 1:t−1 ) = sof tmax(W s s i t + b s ) , (2) where s i t denotes the t-th hidden state of i-th decoder."}, {"id": 94, "string": "We concatenate the previous token w i t−1 and the context vector h i as the input."}, {"id": 95, "string": "W s and b s are the projection matrix and bias, which output a probability distribution over the whole vocabulary V. Eventually, the final story W is the concatenation of the sub-stories W i ."}, {"id": 96, "string": "β denotes all the parameters of the encoder, the decoder, and the output layer."}, {"id": 97, "string": "Figure 4 : Overview of the reward model."}, {"id": 98, "string": "Our reward model is a CNN-based architecture, which utilizes convolution kernels with size 2, 3 and 4 to extract bigram, trigram and 4-gram representations from the input sequence embeddings."}, {"id": 99, "string": "Once the sentence representation is learned, it will be concatenated with the visual representation of the input image, and then be fed into the final FC layer to obtain the reward."}, {"id": 100, "string": "Reward Model The reward model R θ (W ) is a CNN-based architecture (see Figure 4 )."}, {"id": 101, "string": "Instead of giving an overall score for the whole story, we apply the reward model to different story parts (substories) W i and compute partial rewards, where i = 1, · · · , 5."}, {"id": 102, "string": "We observe that the partial rewards are more fine-grained and can provide better guidance for the policy model."}, {"id": 103, "string": "We first query the word embeddings of the substory (one sentence in most cases)."}, {"id": 104, "string": "Next, multiple convolutional layers with different kernel sizes are used to extract the n-grams features, which are then projected into the sentence-level representation space by pooling layers (the design here is inspired by Kim (2014) )."}, {"id": 105, "string": "In addition to the textual features, evaluating the quality of a story should also consider the image features for relevance."}, {"id": 106, "string": "Therefore, we then combine the sentence representation with the visual feature of the input image through concatenation and feed them into the final fully connected decision layer."}, {"id": 107, "string": "In the end, the reward model outputs an estimated reward value R θ (W )."}, {"id": 108, "string": "The process can be written in formula: R θ (W ) = W r (f conv (W ) + W i I CN N ) + b r , (3) where W r , b r denotes the weights in the output layer, and f conv denotes the operations in CNN."}, {"id": 109, "string": "I CN N is the high-level visual feature extracted from the image, and W i projects it into the sentence representation space."}, {"id": 110, "string": "θ includes all the pa-rameters above."}, {"id": 111, "string": "Learning Reward Boltzmann Distribution In order to associate story distribution with reward function, we apply EBM to define a Reward Boltzmann distribution: p θ (W ) = exp(R θ (W )) Z θ , (4) Where W is the word sequence of the story and p θ (W ) is the approximate data distribution, and Z θ = W exp(R θ (W )) denotes the partition function."}, {"id": 112, "string": "According to the energy-based model (Le-Cun et al., 2006) , the optimal reward function R * (W ) is achieved when the Reward-Boltzmann distribution equals to the \"real\" data distribution p θ (W ) = p * (W )."}, {"id": 113, "string": "Adversarial Reward Learning We first introduce an empirical distribution p e (W ) = 1(W ∈D) |D| to represent the empirical distribution of the training data, where D denotes the dataset with |D| stories and 1 denotes an indicator function."}, {"id": 114, "string": "We use this empirical distribution as the \"good\" examples, which provides the evidence for the reward function to learn from."}, {"id": 115, "string": "In order to approximate the Reward Boltzmann distribution towards the \"real\" data distribution p * (W ), we design a min-max two-player game, where the Reward Boltzmann distribution p θ aims at maximizing the its similarity with empirical distribution p e while minimizing that with the \"faked\" data generated from policy model π β ."}, {"id": 116, "string": "On the contrary, the policy distribution π β tries to maximize its similarity with the Boltzmann distribution p θ ."}, {"id": 117, "string": "Formally, the adversarial objective function is defined as max β min θ KL(pe(W )||p θ (W )) − KL(π β (W )||p θ (W )) ."}, {"id": 118, "string": "(5) We further decompose it into two parts."}, {"id": 119, "string": "First, because the objective J β of the story generation policy is to minimize its similarity with the Boltzmann distribution p θ , the optimal policy that minimizes KL-divergence is thus π(W ) ∼ exp(R θ (W )), meaning if R θ is optimal, the optimal π β = π * ."}, {"id": 120, "string": "In formula, J β = − KL(π β (W )||p θ (W )) = E W ∼π β (W ) [R θ (W )] + H(π β (W )) , (6) Algorithm where H denotes the entropy of the policy model."}, {"id": 121, "string": "On the other hand, the objective J θ of the reward function is to distinguish between humanannotated stories and machine-generated stories."}, {"id": 122, "string": "Hence it is trying to minimize the KL-divergence with the empirical distribution p e and maximize the KL-divergence with the approximated policy distribution π β : J θ =KL(pe(W )||p θ (W )) − KL(π β (W )||p θ (W )) = W [pe(W )R θ (W ) − π β (W )R θ (W )] − H(pe) + H(π β ) , (7) Since H(π β ) and H(p e ) are irrelevant to θ, we denote them as constant C. Therefore, the objective J θ can be further derived as J θ = E W ∼pe(W ) [R θ (W )] − E W ∼π β (W ) [R θ (W )] + C ."}, {"id": 123, "string": "(8) Here we propose to use stochastic gradient descent to optimize these two models alternately."}, {"id": 124, "string": "Formally, the gradients can be written as ∂J θ ∂θ = E W ∼pe(W ) ∂R θ (W ) ∂θ − E W ∼π β (W ) ∂R θ (W ) ∂θ , ∂J β ∂β = E W ∼π β (W ) (R θ (W ) + log π θ (W ) − b) ∂ log π β (W ) ∂β , (9) where b is the estimated baseline to reduce the variance."}, {"id": 125, "string": "Training & Testing As described in Algorithm 1, we introduce an alternating algorithm to train these two models using stochastic gradient descent."}, {"id": 126, "string": "During testing, the policy model is used with beam search to produce the story."}, {"id": 127, "string": "Experiments and Analysis Experimental Setup VIST Dataset The VIST dataset (Huang et al., 2016) is the first dataset for sequential vision-tolanguage tasks including visual storytelling, which consists of 10,117 Flickr albums with 210,819 unique photos."}, {"id": 128, "string": "In this paper, we mainly evaluate our AREL method on this dataset."}, {"id": 129, "string": "After filtering the broken images 2 , there are 40,098 training, 4,988 validation, and 5,050 testing samples."}, {"id": 130, "string": "Each sample contains one story that describes 5 selected images from a photo album (mostly one sentence per image)."}, {"id": 131, "string": "And the same album is paired with 5 different stories as references."}, {"id": 132, "string": "In our experiments, we used the same split settings as in (Huang et al., 2016; Yu et al., 2017b) for a fair comparison."}, {"id": 133, "string": "Evaluation Metrics In order to comprehensively evaluate our method on storytelling dataset, we adopted both the automatic metrics and human evaluation as our criterion."}, {"id": 134, "string": "Four diverse automatic metrics were used in our experiments: BLEU, METEOR, ROUGE-L, and CIDEr."}, {"id": 135, "string": "We utilized the open source evaluation code 3 used in (Yu et al., 2017b) ."}, {"id": 136, "string": "For human evaluation, we employed the Amazon Mechanical Turk to perform two kinds of user studies (see Section 4.3 for more details)."}, {"id": 137, "string": "Training Details We employ pretrained ResNet-152 model  to extract image features from the photo stream."}, {"id": 138, "string": "We built a vocabulary of size 9,837 to include words appearing more than three times in the training set."}, {"id": 139, "string": "More training details can be found at Appendix B."}, {"id": 140, "string": "Automatic Evaluation In this section, we compare our AREL method with the state-of-the-art methods as well as standard reinforcement learning algorithms on automatic evaluation metrics."}, {"id": 141, "string": "Then we further discuss the limitations of the hand-crafted metrics on evaluating human-like stories."}, {"id": 142, "string": "Comparison with SOTA on Automatic Metrics In Table 1 , we compare our method with Huang et al."}, {"id": 143, "string": "(2016) and Yu et al."}, {"id": 144, "string": "(2017b) , which report achieving best-known results on the VIST dataset."}, {"id": 145, "string": "We first implement a strong baseline model (XEss), which share the same architecture with our policy model but is trained with cross-entropy loss and scheduled sampling."}, {"id": 146, "string": "Besides, we adopt the traditional generative adversarial training for comparison (GAN)."}, {"id": 147, "string": "As shown in Table 1 , our XEss model already outperforms the best-known re- Table 1 : Automatic evaluation on the VIST dataset."}, {"id": 148, "string": "We report BLEU (B), METEOR (M), ROUGH-L (R), and CIDEr (C) scores of the SOTA systems and the models we implemented, including XE-ss, GAN and AREL."}, {"id": 149, "string": "AREL-s-N denotes AREL models with sigmoid as output activation and alternate frequency as N, while ARELt-N denoting AREL models with tahn as the output activation (N = 50 or 100)."}, {"id": 150, "string": "sults on the VIST dataset, and the GAN model can bring a performance boost."}, {"id": 151, "string": "We then use the XEss model to initialize our policy model and further train it with AREL."}, {"id": 152, "string": "Evidently, our AREL model performs the best and achieves the new state-ofthe-art results across all metrics."}, {"id": 153, "string": "But, compared with the XE-ss model, the performance gain is minor, especially on METEOR and ROUGE-L scores."}, {"id": 154, "string": "However, in Sec."}, {"id": 155, "string": "4.3, the extensive human evaluation has indicated that our AREL framework brings a significant improvement on generating human-like stories over the XE-ss model."}, {"id": 156, "string": "The inconsistency of automatic evaluation and human evaluation lead to a suspect that these hand-crafted metrics lack the ability to fully evaluate stories' quality due to the complicated characteristics of the stories."}, {"id": 157, "string": "Therefore, we conduct experiments to analyze and discuss the defects of the automatic metrics in section 4.2."}, {"id": 158, "string": "Limitations of Automatic Metrics As we claimed in the introduction, string-match-based automatic metrics are not perfect and fail to evaluate some semantic characteristics of the stories, like the expressiveness and coherence of the stories."}, {"id": 159, "string": "In order to confirm our conjecture, we utilize automatic metrics as rewards to reinforce the visual storytelling model by adopting policy gradient with baseline to train the policy model."}, {"id": 160, "string": "The quantitative results are demonstrated in Table 1 ."}, {"id": 161, "string": "Apparently, METEOR-RL and ROUGE-RL are severely ill-posed: they obtain the highest scores on their own metrics but damage the other met- Table 2 : Comparison with different RL models with different metric scores as the rewards."}, {"id": 162, "string": "We report the average scores of the AREL models as AREL (avg)."}, {"id": 163, "string": "Although METEOR-RL and ROUGE-RL models achieve very high scores on their own metrics, the underlined scores are severely damaged."}, {"id": 164, "string": "Actually, they are gaming their own metrics with nonsense sentences."}, {"id": 165, "string": "rics severely."}, {"id": 166, "string": "We observe that these models are actually overfitting to a given metric while losing the overall coherence and semantical correctness."}, {"id": 167, "string": "Same as METEOR score, there is also an adversarial example for ROUGE-L 4 , which is nonsense but achieves an average ROUGE-L score of 33.8."}, {"id": 168, "string": "Besides, as can be seen in Table 1 , after reinforced training, BLEU-RL and CIDEr-RL do not bring a consistent improvement over the XE-ss model."}, {"id": 169, "string": "We plot the histogram distributions of both BLEU-3 and CIDEr scores on the test set in Figure 5 ."}, {"id": 170, "string": "An interesting fact is that there are a large number of samples with nearly zero score on both metrics."}, {"id": 171, "string": "However, we observed those \"zero-score\" samples are not pointless results; instead, lots of them make sense and deserve a better score than zero."}, {"id": 172, "string": "Here is a \"zero-score\" example on BLEU-3: I had a great time at the restaurant today."}, {"id": 173, "string": "The food was delicious."}, {"id": 174, "string": "I had a lot of food."}, {"id": 175, "string": "The food was delicious."}, {"id": 176, "string": "T had a great time."}, {"id": 177, "string": "The corresponding reference is The table of food was a pleasure to see!"}, {"id": 178, "string": "Our food is both nutritious and beautiful!"}, {"id": 179, "string": "Our chicken was especially tasty!"}, {"id": 180, "string": "We love greens as they taste great and are healthy!"}, {"id": 181, "string": "The fruit was a colorful display that tantalized our palette..  theme \"food and eating\", which showcases the defeats of using BLEU and CIDEr scores as a reward for RL training."}, {"id": 182, "string": "Moreover, we compare the human evaluation scores with these two metric scores in Figure 5 ."}, {"id": 183, "string": "Noticeably, both BLEU-3 and CIDEr have a poor correlation with the human evaluation scores."}, {"id": 184, "string": "Their distributions are more biased and thus cannot fully reflect the quality of the generated stories."}, {"id": 185, "string": "In terms of BLEU, it is extremely hard for machines to produce the exact 3-gram or 4-gram matching, so the scores are too low to provide useful guidance."}, {"id": 186, "string": "CIDEr measures the similarity of a sentence to the majority of the references."}, {"id": 187, "string": "However, the references to the same image sequence are photostream different from each other, so the score is very low and not suitable for this task."}, {"id": 188, "string": "In contrast, our AREL framework can lean a more robust reward function from human-annotated stories, which is able to provide better guidance to the policy and thus improves its performances over different metrics."}, {"id": 189, "string": "Although the prediction is not as good as the reference, it is actually coherent and relevant to the Comparison with GAN We here compare our method with traditional GAN (Goodfellow et al., 2014) , the update rule for generator can be generally classified into two categories."}, {"id": 190, "string": "We demonstrate their corresponding objectives and ours as follows: GAN 1 : J β = E W ∼p β [− log R θ (W )] , GAN 2 : J β = E W ∼p β [log(1 − R θ (W ))] , ours : J β = E W ∼p β [−R θ (W )] ."}, {"id": 191, "string": "As discussed in Arjovsky et al."}, {"id": 192, "string": "(2017) , GAN 1 is prone to the unstable gradient issue and GAN 2 is prone to the vanishing gradient issue."}, {"id": 193, "string": "Analytically, our method does not suffer from these two common issues and thus is able converge to optimum solutions more easily."}, {"id": 194, "string": "From Table 1 , we can observe slight gains of using AREL over GAN Figure 5 : Metric score distributions."}, {"id": 195, "string": "We plot the histogram distributions of BLEU-3 and CIDEr scores on the test set, as well as the human evaluation score distribution on the test samples."}, {"id": 196, "string": "For a fair comparison, we use the Turing test results to calculate the human evaluation scores (see Section 4.3)."}, {"id": 197, "string": "Basically, 0.2 score is given if the generated story wins the Turing test, 0.1 for tie, and 0 if losing."}, {"id": 198, "string": "Each sample has 5 scores from 5 judges, and we use the sum as the human evaluation score, so it is in the range [0, 1]."}, {"id": 199, "string": "with automatic metrics, therefore we further deploy human evaluation for a better comparison."}, {"id": 200, "string": "Human Evaluation Automatic metrics cannot fully evaluate the capability of our AREL method."}, {"id": 201, "string": "Therefore, we perform two different kinds of human evaluation studies on Amazon Mechanical Turk: Turing test and pairwise human evaluation."}, {"id": 202, "string": "For both tasks, we use 150 stories (750 images) sampled from the test set, each assigned to 5 workers to eliminate human variance."}, {"id": 203, "string": "We batch six items as one assignment and insert an additional assignment as a sanity check."}, {"id": 204, "string": "Besides, the order of the options within each item is shuffled to make a fair comparison."}, {"id": 205, "string": "Turing Test We first conduct five independent Turing tests for XE-ss, BLEU-RL, CIDEr-RL, GAN, and AREL models, during which the worker is given one human-annotated sample and one machine-generated sample, and needs to decide which is human-annotated."}, {"id": 206, "string": "As shown in Table 3, our AREL model significantly outperforms all the other baseline models in the Turing test: it has much more chances to fool AMT worker (the ratio is AREL:XE-ss:BLEU-RL:CIDEr-RL:GAN = 45.8%:28.3%:32.1%:19.7%:39.5%), which confirms the superiority of our AREL framework in generating human-like stories."}, {"id": 207, "string": "Unlike automatic metric evaluation, the Turing test has indicated a much larger margin between AREL and other competing algorithms."}, {"id": 208, "string": "Thus, we empirically confirm that metrics are not perfect in evaluating many implicit semantic properties of natural language."}, {"id": 209, "string": "Besides, the Turing test of our AREL model reveals that nearly half of the workers are fooled by our machine generation, indicating a preliminary success toward generating human-like stories."}, {"id": 210, "string": "Pairwise Comparison In order to have a clear comparison with competing algorithms with respect to different semantic features of the stories, we further perform four pairwise comparison tests: AREL vs XE-ss/BLEU-RL/CIDEr-RL/GAN."}, {"id": 211, "string": "For each photo stream, the worker is presented with two generated stories and asked to make decisions from the three aspects: relevance 5 , expressiveness 6 and concreteness 7 ."}, {"id": 212, "string": "This head-tohead compete is designed to help us understand in what aspect our model outperforms the competing algorithms, which is displayed in Table 4 ."}, {"id": 213, "string": "Consistently on all the three comparisons, a large majority of the AREL stories trumps the competing systems with respect to their relevance, XE-ss We took a trip to the mountains."}, {"id": 214, "string": "There were many different kinds of different kinds."}, {"id": 215, "string": "We had a great time."}, {"id": 216, "string": "He was a great time."}, {"id": 217, "string": "It was a beautiful day."}, {"id": 218, "string": "AREL The family decided to take a trip to the countryside."}, {"id": 219, "string": "There were so many different kinds of things to see."}, {"id": 220, "string": "The family decided to go on a hike."}, {"id": 221, "string": "I had a great time."}, {"id": 222, "string": "At the end of the day, we were able to take a picture of the beautiful scenery."}, {"id": 223, "string": "Humancreated Story We went on a hike yesterday."}, {"id": 224, "string": "There were a lot of strange plants there."}, {"id": 225, "string": "I had a great time."}, {"id": 226, "string": "We drank a lot of water while we were hiking."}, {"id": 227, "string": "The view was spectacular."}, {"id": 228, "string": "expressiveness, and concreteness."}, {"id": 229, "string": "Therefore, it empirically confirms that our generated stories are more relevant to the image sequences, more coherent and concrete than the other algorithms, which however is not explicitly reflected by the automatic metric evaluation."}, {"id": 230, "string": "Figure 6 gives a qualitative comparison example between AREL and XE-ss models."}, {"id": 231, "string": "Looking at the individual sentences, it is obvious that our results are more grammatically and semantically correct."}, {"id": 232, "string": "Then connecting the sentences together, we observe that the AREL story is more coherent and describes the photo stream more accurately."}, {"id": 233, "string": "Thus, our AREL model significantly surpasses the XEss model on all the three aspects of the qualitative example."}, {"id": 234, "string": "Besides, it won the Turing test (3 out 5 AMT workers think the AREL story is created by a human)."}, {"id": 235, "string": "In the appendix, we also show a negative case that fails the Turing test."}, {"id": 236, "string": "Qualitative Analysis Conclusion In this paper, we not only introduce a novel adversarial reward learning algorithm to generate more human-like stories given image sequences, but also empirically analyze the limitations of the automatic metrics for story evaluation."}, {"id": 237, "string": "We believe there are still lots of improvement space in the narrative paragraph generation tasks, like how to better simulate human imagination to create more vivid and diversified stories."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 47}, {"section": "Related Work", "n": "2", "start": 48, "end": 72}, {"section": "Problem Statement", "n": "3.1", "start": 73, "end": 87}, {"section": "Model", "n": "3.2", "start": 88, "end": 109}, {"section": "Learning", "n": "3.3", "start": 110, "end": 126}, {"section": "Experimental Setup", "n": "4.1", "start": 127, "end": 138}, {"section": "Automatic Evaluation", "n": "4.2", "start": 139, "end": 199}, {"section": "Human Evaluation", "n": "4.3", "start": 200, "end": 233}, {"section": "Conclusion", "n": "5", "start": 234, "end": 237}], "figures": [{"filename": "../figure/image/1021-Table1-1.png", "caption": "Table 1: Automatic evaluation on the VIST dataset. We report BLEU (B), METEOR (M), ROUGH-L (R), and CIDEr (C) scores of the SOTA systems and the models we implemented, including XE-ss, GAN and AREL. AREL-s-N denotes AREL models with sigmoid as output activation and alternate frequency as N, while ARELt-N denoting AREL models with tahn as the output activation (N = 50 or 100).", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 527.04, "y1": 62.879999999999995, "y2": 166.07999999999998}}, {"filename": "../figure/image/1021-Table2-1.png", "caption": "Table 2: Comparison with different RL models with different metric scores as the rewards. We report the average scores of the AREL models as AREL (avg). Although METEOR-RL and ROUGE-RL models achieve very high scores on their own metrics, the underlined scores are severely damaged. Actually, they are gaming their own metrics with nonsense sentences.", "page": 6, "bbox": {"x1": 72.0, "x2": 297.12, "y1": 62.879999999999995, "y2": 144.96}}, {"filename": "../figure/image/1021-Table3-1.png", "caption": "Table 3: Turing test results.", "page": 6, "bbox": {"x1": 324.96, "x2": 508.32, "y1": 61.44, "y2": 145.92}}, {"filename": "../figure/image/1021-Figure2-1.png", "caption": "Figure 2: AREL framework for visual storytelling.", "page": 2, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 62.879999999999995, "y2": 175.2}}, {"filename": "../figure/image/1021-Table4-1.png", "caption": "Table 4: Pairwise human comparisons. The results indicate the consistent superiority of our AREL model in generating more human-like stories than the SOTA methods.", "page": 7, "bbox": {"x1": 74.88, "x2": 523.1999999999999, "y1": 252.48, "y2": 310.08}}, {"filename": "../figure/image/1021-Figure5-1.png", "caption": "Figure 5: Metric score distributions. We plot the histogram distributions of BLEU-3 and CIDEr scores on the test set, as well as the human evaluation score distribution on the test samples. For a fair comparison, we use the Turing test results to calculate the human evaluation scores (see Section 4.3). Basically, 0.2 score is given if the generated story wins the Turing test, 0.1 for tie, and 0 if losing. Each sample has 5 scores from 5 judges, and we use the sum as the human evaluation score, so it is in the range [0, 1].", "page": 7, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 61.44, "y2": 164.16}}, {"filename": "../figure/image/1021-Figure4-1.png", "caption": "Figure 4: Overview of the reward model. Our reward model is a CNN-based architecture, which utilizes convolution kernels with size 2, 3 and 4 to extract bigram, trigram and 4-gram representations from the input sequence embeddings. Once the sentence representation is learned, it will be concatenated with the visual representation of the input image, and then be fed into the final FC layer to obtain the reward.", "page": 3, "bbox": {"x1": 308.15999999999997, "x2": 525.12, "y1": 62.879999999999995, "y2": 177.6}}, {"filename": "../figure/image/1021-Figure3-1.png", "caption": "Figure 3: Overview of the policy model. The visual encoder is a bidirectional GRU, which encodes the high-level visual features extracted from the input images. Its outputs are then fed into the RNN decoders to generate sentences in parallel. Finally, we concatenate all the generated sentences as a full story. Note that the five decoders share the same weights.", "page": 3, "bbox": {"x1": 72.96, "x2": 290.4, "y1": 63.839999999999996, "y2": 203.51999999999998}}, {"filename": "../figure/image/1021-Figure6-1.png", "caption": "Figure 6: Qualitative comparison example with XE-ss. The direct comparison votes (AREL:XE-ss:Tie) were 5:0:0 on Relevance, 4:0:1 on Expressiveness, and 5:0:0 on Concreteness.", "page": 8, "bbox": {"x1": 72.0, "x2": 525.12, "y1": 152.64, "y2": 233.28}}]}