{"title": "Multimodal Machine Translation with Embedding Prediction", "abstract": "Multimodal machine translation is an attractive application of neural machine translation (NMT). It helps computers to deeply understand visual objects and their relations with natural languages. However, multimodal NMT systems suffer from a shortage of available training data, resulting in poor performance for translating rare words. In NMT, pretrained word embeddings have been shown to improve NMT of low-resource domains, and a search-based approach is proposed to address the rare word problem. In this study, we effectively combine these two approaches in the context of multimodal NMT and explore how we can take full advantage of pretrained word embeddings to better translate rare words. We report overall performance improvements of 1.24 METEOR and 2.49 BLEU and achieve an improvement of 7.67 F-score for rare word translation.", "text": [{"id": 0, "string": "Introduction In multimodal machine translation, a target sentence is translated from a source sentence together with related nonlinguistic information such as visual information."}, {"id": 1, "string": "Recently, neural machine translation (NMT) has superseded traditional statistical machine translation owing to the introduction of the attentional encoder-decoder model, in which machine translation is treated as a sequence-tosequence learning problem and is trained to pay attention to the source sentence while decoding (Bahdanau et al., 2015) ."}, {"id": 2, "string": "Most previous studies on multimodal machine translation are classified into two categories: visual feature adaptation and data augmentation."}, {"id": 3, "string": "In visual feature adaptation, multitask learning (Elliott and Kádár, 2017) and feature integration architecture (Caglayan et al., 2017a; Calixto et al., 2017) are proposed to improve neural network models."}, {"id": 4, "string": "Data augmentation aims to deal with the fact that the size of available datasets for multimodal translation is quite small."}, {"id": 5, "string": "To alleviate this problem, parallel corpora without a visual source (Elliott and Kádár, 2017; Grönroos et al., 2018) and pseudo-parallel corpora obtained using back-translation (Helcl et al., 2018) are used as additional learning resources."}, {"id": 6, "string": "Due to the availability of parallel corpora for NMT, Qi et al."}, {"id": 7, "string": "(2018) suggested that initializing the encoder with pretrained word embedding improves the translation performance in low-resource language pairs."}, {"id": 8, "string": "Recently, Kumar and Tsvetkov (2019) proposed an NMT model that predicts the embedding of output words and searches for the output word instead of calculating the probability using the softmax function."}, {"id": 9, "string": "This model performed as well as conventional NMT, and it significantly improved the translation accuracy for rare words."}, {"id": 10, "string": "In this study, we introduce an NMT model with embedding prediction for multimodal machine translation that fully uses pretrained embeddings to improve the translation accuracy for rare words."}, {"id": 11, "string": "The main contributions of this study are as follows: 1."}, {"id": 12, "string": "We propose a novel multimodal machine translation model with embedding prediction and explore various settings to take full advantage of word embeddings."}, {"id": 13, "string": "2."}, {"id": 14, "string": "We show that pretrained word embeddings improve the model performance, especially when translating rare words."}, {"id": 15, "string": "Multimodal Machine Translation with Embedding Prediction We integrate an embedding prediction framework (Kumar and Tsvetkov, 2019) with the multimodal machine translation model and take advantage of pretrained word embeddings."}, {"id": 16, "string": "To highlight the effect of pretrained word embeddings and embedding prediction architecture, we adopt IMAGINA-TION (Elliott and Kádár, 2017) as a simple multimodal baseline."}, {"id": 17, "string": "IMAGINATION jointly learns machine translation and visual latent space models."}, {"id": 18, "string": "It is based on a conventional NMT model for a machine translation task."}, {"id": 19, "string": "In latent space learning, a source sentence and the paired image are mapped closely in the latent space."}, {"id": 20, "string": "We use the latent space learning model as it is, except for the preprocessing of images."}, {"id": 21, "string": "The models for each task share the same textual encoder in a multitask scenario."}, {"id": 22, "string": "The loss function for multitask learning is the linear interpolation of loss functions for each task."}, {"id": 23, "string": "J = λJ T (θ, ϕ T ) + (1 − λ)J V (θ, ϕ V ) (1) where θ is the parameter of the shared encoder; ϕ T and ϕ V are parameters of the machine translation model and latent space model, respectively; and λ is the interpolation coefficient 1 ."}, {"id": 24, "string": "Neural Machine Translation with Embedding Prediction The machine translation part in our proposed model is an extension of Bahdanau et al."}, {"id": 25, "string": "(2015) ."}, {"id": 26, "string": "However, instead of using the probability of each word in the decoder, it searches for output words based on their similarity with word embeddings."}, {"id": 27, "string": "Once the model predicts a word embedding, its nearest neighbor in the pretrained word embeddings is selected as the system output."}, {"id": 28, "string": "e j = tanh(W o s j + b o ) (2) y j = argmin w∈V {d(ê j , e(w))} (3) where s j ,ê j , andŷ j are the hidden state of the decoder, predicted embedding, and system output, respectively, for each timestep j in the decoding process."}, {"id": 29, "string": "e(w) is the pretrained word embedding for a target word w. d is a distance function that is used to calculate the word similarity."}, {"id": 30, "string": "W o and b o are parameters of the output layer."}, {"id": 31, "string": "We adopt margin-based ranking loss (Lazaridou et al., 2015) as the loss function 1 We use λ = 0.01 in the experiment."}, {"id": 32, "string": "of the machine translation model."}, {"id": 33, "string": "J T (θ, ϕ T ) = M ∑ j max{0, γ + d(ê j , e(w − j )) −d(ê j , e(y j ))} (4) w − j = argmax w∈V {d(ê j , e(w)) − d(ê j , e(y j )) (5) where M is the length of a target sentence and γ is the margin 2 ."}, {"id": 34, "string": "w − j is a negative sample that is close to the predicted embedding and far from the gold embedding as measuring using d. Pretrained word embeddings are also used to initialize the embedding layers of the encoder and decoder, and the output layer of the decoder."}, {"id": 35, "string": "The embedding layer of the encoder is updated during training, and the embedding layer of the decoder is fixed to the initial value."}, {"id": 36, "string": "Visual Latent Space Learning The decoder of this model calculates the average vector over the hidden states h i in the encoder and maps it to the final vectorv in the latent space."}, {"id": 37, "string": "v = tanh(W v · 1 N N ∑ i h i ) (6) where N is the length of an input sentence and W v ∈ R N * M is learned parameter of the model."}, {"id": 38, "string": "We use max margin loss as the loss function; it learns to make corresponding latent vectors of a source sentence and the paired image closer."}, {"id": 39, "string": "J V (θ, ϕ V ) = ∑ v ′ ̸ =v max{0, α+d(v, v ′ )−d(v, v)} (7) where v is the latent vector of the paired image; v ′ , the image vector for other examples; and α, the margin that adjusts the sparseness of each vector in the latent space 3 ."}, {"id": 40, "string": "Experiment Dataset We train, validate, and test our model with the Multi30k (Elliott et al., 2016) dataset published in the WMT17 Shared Task."}, {"id": 41, "string": "We choose French as the source language and English as the target one."}, {"id": 42, "string": "The vocabulary size of both the source and the target languages is 10,000."}, {"id": 43, "string": "Following Kumar and Tsvetkov (2019) , byte pair encoding (Sennrich et al., 2016) is not applied."}, {"id": 44, "string": "The source and target sentences are preprocessed with lower-casing, tokenizing and normalizing the punctuation."}, {"id": 45, "string": "Visual features are extracted using pretrained ResNet (He et al., 2016) ."}, {"id": 46, "string": "Specifically, we encode all images in Multi30k with ResNet-50 and pick out the hidden state in the pool5 layer as a 2,048dimension visual feature."}, {"id": 47, "string": "We calculate the centroid of visual features in the training dataset as the bias vector and subtract the bias vector from all visual features in the training, validation and test datasets."}, {"id": 48, "string": "Model The model is implemented using nmtpytorch toolkit v3.0.0 4 (Caglayan et al., 2017b) ."}, {"id": 49, "string": "The shared encoder has 256 hidden dimensions, and therefore the bidirectional GRU has 512 dimensions."}, {"id": 50, "string": "The decoder in NMT model has 256 hidden dimension."}, {"id": 51, "string": "The input word embedding size and output vector size is 300 each."}, {"id": 52, "string": "The latent space vector size is 2,048."}, {"id": 53, "string": "We used the Adam optimizer with learning rate of 0.0004."}, {"id": 54, "string": "The gradient norm is clipped to 1.0."}, {"id": 55, "string": "The dropout rate is 0.3."}, {"id": 56, "string": "BLEU (Papineni et al., 2002) and METEOR (Denkowski and Lavie, 2014) are used as performance metrics."}, {"id": 57, "string": "We also evaluated the models using the F-score of each word; this shows how accurately each word is translated into target sentences, as was proposed in Kumar and Tsvetkov (2019) ."}, {"id": 58, "string": "The F-score is calculated as the harmonic mean of the precision (fraction of produced sentences with a word that is in the references sentences) and the recall (fraction of reference sentences with a word that is in model outputs)."}, {"id": 59, "string": "We ran the experiment three times with different random seeds and obtained the mean and variance for each model."}, {"id": 60, "string": "To clarify the effect of pretrained embeddings on machine translation, we also initialized the encoder and decoder of our models with random values instead of pretrained embeddings, and investigated the effect of fixing decoder embeddings."}, {"id": 61, "string": "Word Embedding We use publicly available pretrained Fast-Text (Bojanowski et al., 2017) embeddings (Grave et al., 2018 trained on Wikipedia and Common Crawl using the CBOW algorithm, and the dimension is 300."}, {"id": 62, "string": "The embedding for unknown words is calculated as the average embedding over words that are a part of pretrained embeddings but are not included in the vocabularies."}, {"id": 63, "string": "Both the target and the source embeddings are preprocessed according to Mu and Viswanath (2018) , in which all embeddings are debiased to make the average embedding into a zero vector and the top five principal components are subtracted for each embedding."}, {"id": 64, "string": "Table 1 shows the overall performance of the proposed and baseline models."}, {"id": 65, "string": "Compared with randomly initialized models, our model outperforms the text-only baseline by +2.49 BLEU and +1.24 METEOR, and the multimodal baseline by +2.31 BLEU and +1.09 METEOR, respectively."}, {"id": 66, "string": "While pretrained embeddings improve NMT/IMAGINATION models as well, the improved models are still beyond our model."}, {"id": 67, "string": "Table 2 shows the results of ablation experiments of the initialization and fine-tuning methods."}, {"id": 68, "string": "The pretrained embedding models outperform other models by up to +2.77 BLEU and +1.37 METEOR."}, {"id": 69, "string": "Results Discussion Rare Words Our model shows a great improvement for low-frequency words."}, {"id": 70, "string": "Figure 1 shows a variety of F-score according to the word frequency in the training corpus."}, {"id": 71, "string": "Whereas IMAG-INATION improves the translation accuracy uniformly, our model shows substantial improvement   for rare words."}, {"id": 72, "string": "Word Embeddings Furthermore, we found that decoder embeddings must be fixed to improve multimodal machine translation with embedding prediction."}, {"id": 73, "string": "When we allow fine-tuning on the embedding layer, the performance drops below the baseline."}, {"id": 74, "string": "It seems that fine-tuning embeddings in NMT with embedding prediction makes the model search for common words more than expected, thus preventing it from predicting rare words."}, {"id": 75, "string": "More interestingly, using pretrained FastText embeddings on the decoder rather than the encoder improves performance."}, {"id": 76, "string": "This finding is different from Qi et al."}, {"id": 77, "string": "(2018) , in which only the encoder benefits from pretrained embeddings."}, {"id": 78, "string": "Compared with the model initialized with a random value, initializing the decoder with the embedding results in an increase of +1.80 BLEU; in contrast, initializing the encoder results in an increase of only +0.11 BLEU."}, {"id": 79, "string": "This is caused by the multitask learning model that trains the encoder with images and takes it away from what the embedding prediction model wants to learn from the sentences."}, {"id": 80, "string": "Visual Feature We also investigated the effect of images and its preprocessing in NMT with embedding prediction ( Table 3 )."}, {"id": 81, "string": "The interesting result is that multitask learning with raw images would not help the predictive model."}, {"id": 82, "string": "Debiasing images is an essential preprocessing for NMT with embedding prediction to use images effectively in multitask learning scenario."}, {"id": 83, "string": "Translation Examples In Table 4 , we show French-English translations generated by different models."}, {"id": 84, "string": "In the left example, our proposed model correctly translates \"voûte\" into \"archway\" (occurs five times in the training set), Although the baseline model translates it to its synonym having higher frequency (nine times for \"arch\" and 12 times for \"monument\")."}, {"id": 85, "string": "At the same time, our outputs tend to be less fluent for long sentences."}, {"id": 86, "string": "The right example shows that our model translates some words (\"patterned\" and \"carpet\") more concisely; however, it generates a less fluent sentence than the baseline."}, {"id": 87, "string": "Related Works Most studies on multimodal machine translation are divided into two categories: visual feature adaptation and data augmentation."}, {"id": 88, "string": "First, in visual feature adaptation, visual features are extracted using image processing techniques and then integrated into a machine translation model."}, {"id": 89, "string": "In contrast, most multitask learning models use latent space learning as their auxiliary task."}, {"id": 90, "string": "Elliott and Kádár (2017) proposed the IMAGINATION model that learns to construct the corresponding visual feature from the textual hidden states of a source sentence."}, {"id": 91, "string": "The visual model shares its encoder with the machine translation model; this helps in improving the textual encoder."}, {"id": 92, "string": "Second, in data augmentation, parallel corpora without images are widely used as additional train-Image Source un homme en vélo pédale devant une voûte ."}, {"id": 93, "string": "quatre hommes , dont trois portent des kippas , sont assis sur un tapisà motifs bleu et vert olive ."}, {"id": 94, "string": "Reference a man on a bicycle pedals through an archway ."}, {"id": 95, "string": "four men , three of whom are wearing prayer caps , are sitting on a blue and olive green patterned mat ."}, {"id": 96, "string": "NMT a man on a bicycle pedal past an arch ."}, {"id": 97, "string": "four men , three of whom are wearing aprons , are sitting on a blue and green speedo carpet ."}, {"id": 98, "string": "IMAG+ a man on a bicycle pedals outside a monument ."}, {"id": 99, "string": "four men , three of them are wearing alaska , are sitting on a blue patterned carpet and green green seating ."}, {"id": 100, "string": "Ours a man on a bicycle pedals in front of a archway ."}, {"id": 101, "string": "four men , three are wearing these are wearing these are sitting on a blue and green patterned mat ."}, {"id": 102, "string": "ing data."}, {"id": 103, "string": "Grönroos et al."}, {"id": 104, "string": "(2018) trained their multimodal model with parallel corpora and achieved state-of-the-art performance in the WMT 2018."}, {"id": 105, "string": "However, the use of monolingual corpora has seldom been studied in multimodal machine translation."}, {"id": 106, "string": "Our study proposes using word embeddings that are pretrained on monolingual corpora."}, {"id": 107, "string": "Conclusion We have proposed a multimodal machine translation model with embedding prediction and showed that pretrained word embeddings improve the performance in multimodal translation tasks, especially when translating rare words."}, {"id": 108, "string": "In the future, we will tailor the training corpora for embedding learning, especially for handling the embedding for unknown words in the context of multimodal machine translation."}, {"id": 109, "string": "We will also incorporate visual features into contextualized word embeddings."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 14}, {"section": "Multimodal Machine Translation with Embedding Prediction", "n": "2", "start": 15, "end": 23}, {"section": "Neural Machine Translation with Embedding Prediction", "n": "2.1", "start": 24, "end": 35}, {"section": "Visual Latent Space Learning", "n": "2.2", "start": 36, "end": 39}, {"section": "Dataset", "n": "3.1", "start": 40, "end": 47}, {"section": "Model", "n": "3.2", "start": 48, "end": 60}, {"section": "Word Embedding", "n": "3.3", "start": 61, "end": 68}, {"section": "Discussion", "n": "5", "start": 69, "end": 86}, {"section": "Related Works", "n": "6", "start": 87, "end": 105}, {"section": "Conclusion", "n": "7", "start": 106, "end": 109}], "figures": [{"filename": "../figure/image/1024-Table1-1.png", "caption": "Table 1: Results on Multi30k validation and test dataset. NMT denotes the text-only conventional NMT model (Bahdanau et al., 2015) and IMAG+ denotes our reimplementation of the IMAGINATION (Elliott and Kádár, 2017) model. “+ pretrained” models are initialized with pretrained embeddings.", "page": 2, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 62.4, "y2": 176.16}}, {"filename": "../figure/image/1024-Table4-1.png", "caption": "Table 4: French to English translation examples in the Multi30k test set.", "page": 4, "bbox": {"x1": 74.88, "x2": 523.1999999999999, "y1": 65.75999999999999, "y2": 325.92}}, {"filename": "../figure/image/1024-Figure1-1.png", "caption": "Figure 1: F-score of word prediction per frequency breakdown in training corpus.", "page": 3, "bbox": {"x1": 72.0, "x2": 299.03999999999996, "y1": 236.64, "y2": 379.2}}, {"filename": "../figure/image/1024-Table2-1.png", "caption": "Table 2: Results on test dataset with variations of model initialization and fine-tuning in decoder.", "page": 3, "bbox": {"x1": 72.0, "x2": 303.36, "y1": 63.36, "y2": 181.92}}, {"filename": "../figure/image/1024-Table3-1.png", "caption": "Table 3: Ablation experiments of visual features. “− Debias” denotes the result without subtracting the bias vector. “− Images” shows the result of text-only NMT with embedding prediction.", "page": 3, "bbox": {"x1": 319.68, "x2": 513.12, "y1": 62.4, "y2": 143.04}}]}