{"title": "Five Centuries of Monarchy in Korea: Mining the Text of the Annals of the Joseon Dynasty", "abstract": "We present a quantitative study of the Annals of the Joseon Dynasty, the daily written records of the five hundred years of a monarchy in Korea. We first introduce the corpus, which is a series of books describing the historical facts during the Joseon dynasty. We then define three categories of the monarchial ruling styles based on the written records and compare the twentyfive kings in the monarchy. Finally, we investigate how kings show different ruling styles for various topics within the corpus. Through this study, we introduce a very unique corpus of monarchial records that span an entire monarchy of five hundred years and illustrate how text mining can be applied to answer important historical questions.", "text": [{"id": 0, "string": "Introduction Historical documents are usually studied qualitatively by researchers focusing on a close reading of a small number of documents."}, {"id": 1, "string": "However, for a large corpus of historical texts, qualitative methods have limitations, thus quantitative approaches have been introduced recently (Moretti, 2005; Jockers, 2013) ."}, {"id": 2, "string": "There is also research in applying text mining and natural language processing methods to identify patterns in a corpus of large and longitudinal documents (Mimno, 2012) ."}, {"id": 3, "string": "In this paper, we introduce a unique corpus of historical documents from the written records that span almost five hundred years from the fourteenth century up to the late nineteenth century within the Korean peninsula."}, {"id": 4, "string": "We apply text mining to this corpus to show the power of a computational approach in answering historical questions."}, {"id": 5, "string": "We first introduce The Annals of the Joseon Dynasty (Chunchugwan, 1863) ."}, {"id": 6, "string": "Joseon is the last monarchial nation in the Korean Peninsula from its founding in 1392 up to 1910."}, {"id": 7, "string": "The Annals of the Joseon Dynasty are a series of books of historical facts, recorded almost daily during the Joseon dynasty."}, {"id": 8, "string": "Whenever a king abdicated the throne, the Chunchugwan (office for annals compilation) updated the Annals for that king from all related official and unofficial documents."}, {"id": 9, "string": "The Annals contain political, economic, social and cultural topics during the corresponding time periods."}, {"id": 10, "string": "To illustrate the application of a text mining approach, we analyze each king's ruling style from the Annals of the Joseon dynasty."}, {"id": 11, "string": "Being a monarchial system, almost all decisions within the government are confirmed by the king, where the king can make the decision on his own, or after discussing it with the government officials."}, {"id": 12, "string": "We identify the patterns of each king's decision making and compare the patterns among the kings."}, {"id": 13, "string": "The results show interesting patterns of the kings' ruling styles, including the tendency to make arbitrary decisions of the kings who were later dethroned because of tyranny."}, {"id": 14, "string": "Additionally, we apply a topic model to the corpus and analyze the kings' ruling style for each topic."}, {"id": 15, "string": "The Annals of the Joseon Dynasty In this section, we describe the details of The Annals of the Joseon Dynasty (from here referred to as the AJD) (Chunchugwan, 1863) and our process for building a corpus of the AJD."}, {"id": 16, "string": "In its entirety, the AJD consists of records from twentyseven kings over 519 years."}, {"id": 17, "string": "However, the last two kings' (Gojong, Sunjong) books are usually excluded from research by historians because many facts are distorted."}, {"id": 18, "string": "We follow that convention and use the books of the first twenty-five kings."}, {"id": 19, "string": "These records, in their original Chinese text and in the Korean translations, are available publicly through   Joseon was a monarchy, but a king could not make all decisions by himself."}, {"id": 20, "string": "Instead, Joseon adopted a government system that most of the public issues are discussed with the government officials (Park, 1983; Kim, 2008) before the king made the decisions, which are all recorded in the AJD."}, {"id": 21, "string": "Hence, by analyzing the decision making process in the AJD, we can understand each king's ruling style."}, {"id": 22, "string": "Categorizing ruling style In Joseon dynasty, the king was the final decision maker."}, {"id": 23, "string": "Even when the government officials discussed the public issues, a king's approval was needed."}, {"id": 24, "string": "We can categorize each king's decision making process into three types."}, {"id": 25, "string": "First, a king can order directly without discussion, which we call Arbitrary Decision (AD)."}, {"id": 26, "string": "Second, a king can discuss an issue with the officials and then direct his   order, which we call Discussion and Order (DO)."}, {"id": 27, "string": "Third, a king can discuss an issue with the officials and then decide to follow the officials' suggestion, which we call Discussion and Follow (DF)."}, {"id": 28, "string": "The difference between DO and DF is that in DO, the king acts aggressively with his own opinion."}, {"id": 29, "string": "From these observations, we ask two research questions: 1) Can we identify and categorize kings with different ruling styles?"}, {"id": 30, "string": "2) Do kings' ruling styles differ depending on the topic?"}, {"id": 31, "string": "Method To understand each king's ruling style, we first identify relevant articles that contain the king's decision making because many of the articles describe non-governmental affairs, such as the weather, or simple status reports."}, {"id": 32, "string": "These relevant articles contain direct quotations of the words of the king or the government official."}, {"id": 33, "string": "The original texts do not contain any quotation marks, but translators added them to distinguish explicit quotations, which we can use to identify these relevant articles."}, {"id": 34, "string": "Its size is 126K, 36% over all articles."}, {"id": 35, "string": "Each article contains who said what for an issue, and king's final actions are written mostly in the last part of the article."}, {"id": 36, "string": "For example, the underlined last sentence in Figure 1b says that the king followed the official's suggestion."}, {"id": 37, "string": "Hence, to identify king's action for each issue, we focus on the last sentence in each article."}, {"id": 38, "string": "First, we identify that the setence subject is the king, because some issues are dealt by others."}, {"id": 39, "string": "For example, Sunjo, Heonjong and Cheoljong's mother or grandmother ruled as regent, so her decisions are recorded in the AJD."}, {"id": 40, "string": "To identify the part of speech in Korean, we used HanNanum (Choi et al., 2012) ."}, {"id": 41, "string": "And, we investigate the verbs that indicating decisions including order, follow, approval and reject."}, {"id": 42, "string": "We use sixty verbs that describe king's decision specifically, and table 2 shows example words."}, {"id": 43, "string": "Finally, we classify these decisions into three types: 1) the king orders without discussions with the officials, and we label them as AD, 2) the king orders, approves, or rejects verbs in which their original Chinese characters show active decision making by the king, and we label them as DO, and 3) the king follows or discusses verbs which show passive submission by the king, and we label them as DF."}, {"id": 44, "string": "To identify topics, we use a Bayesian topic model, LDA (Blei et al., 2003) ."}, {"id": 45, "string": "We implement it using Gibbs sampling (Griffiths and Steyvers, 2004) , set 300 topics, and optimized hyperparameters after 100 iterations (Asuncion et al., 2009) ."}, {"id": 46, "string": "We remove stopwords and words with document frequency of 30 or smaller."}, {"id": 47, "string": "Results and Discussions We investigate the difference of ruling style between kings."}, {"id": 48, "string": "We run multinomial test (Read and Cressie, 1988 ) between king's ruling style distributions."}, {"id": 49, "string": "Result shows that almost all kings are different significant from others (p < 0.001)."}, {"id": 50, "string": "It means that each king has his own ruling style."}, {"id": 51, "string": "Figure 2 shows the distribution of each category of ruling style."}, {"id": 52, "string": "Overall, many kings do not act arbitrary."}, {"id": 53, "string": "They discuss about many of the national affairs with officials."}, {"id": 54, "string": "But, Taejo who is the   founder of the Joseon dynasty shows high value of AD."}, {"id": 55, "string": "And Yeonsangun and Gwanghaegun who are evaluated as a tyrant also show high value of it."}, {"id": 56, "string": "So we can imagine that tyrants tend to act arbitrarily."}, {"id": 57, "string": "We also identified those kings whose ruling style differed most from other kings."}, {"id": 58, "string": "We use JS divergence which is the symmetric measure of the difference between two probability distributions."}, {"id": 59, "string": "We compute JS divergence with each king pair's ruling style distributions."}, {"id": 60, "string": "Result shows that Heonjong (0.1220) and Yeonsangun (0.0998) have highest distance value."}, {"id": 61, "string": "It means their ruling style are quite different from other kings."}, {"id": 62, "string": "Because Heonjong's grandmother governed the Joseon each year, so his actions are quite few."}, {"id": 63, "string": "But, unlike Yeonsangun, Gwanghaegun (0.0454) who is known as a tyrant has similar value mean distance from other kings (0.0434)."}, {"id": 64, "string": "It means his ruling style is quite similar to other kings, and this result supports previous results in Korean historical study (Kye, 2008 ) that re-evaluate his reputation."}, {"id": 65, "string": "We investigate the difference of king's ruling style based on the topic."}, {"id": 66, "string": "We run multinomial test (Read and Cressie, 1988 ) between king's overall ruling style distribution and specific distribution given a topic."}, {"id": 67, "string": "Results show that some ruling styles given a topic are different significant from overall (p < 0.01)."}, {"id": 68, "string": "It means that the king's ruling style when the topic is given is different from his usual style."}, {"id": 69, "string": "Table 3 shows examples of topic."}, {"id": 70, "string": "Figure 3 shows four kings' overall ruling style and specific one given a topic."}, {"id": 71, "string": "Comparing with the leftmost bars which is overall ruling style of the king, each ruling style given a topic is different from it."}, {"id": 72, "string": "And, we can see that kings show similar/different ruling style for a topic."}, {"id": 73, "string": "For example, kings tend to discuss and order (DO) to officials for retirement and remission topics."}, {"id": 74, "string": "And, Sejong the Great and Gwanghaegun discuss and follow (DF) officials' words for agricultural topic."}, {"id": 75, "string": "But, for grants topic, Yeonsangun and Gwanghaegun act more arbitrarily (AD) than overall ruling style, and Sejong the Great follows more official's opinions (DF)."}, {"id": 76, "string": "Conclusion and Future Work We introduced long and large historical documents, The Annals of the Joseon Dynasty."}, {"id": 77, "string": "It contains lots of topics such as political, economic, social and cultural over 500 years."}, {"id": 78, "string": "We looked at the ruling style of kings in Joseon dynasty and its difference by topics by computational methods."}, {"id": 79, "string": "This is ongoing work, and we are looking to find more hidden structures in the AJD."}, {"id": 80, "string": "Currently, historians evaluate the king's reputations (Park, 2004; Lee, 2010) ."}, {"id": 81, "string": "This evaluation is done by many aspects, but one of the important feature is king's ruling style (Kim, 2008) ."}, {"id": 82, "string": "So we are looking to improve methods for analyzing ruling style more specifically."}, {"id": 83, "string": "For example, we will look at the relationship with officials, especially who can make the king follows his opinion."}, {"id": 84, "string": "This approach can be used to measure king's leadership."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 14}, {"section": "The Annals of the Joseon Dynasty", "n": "2", "start": 15, "end": 21}, {"section": "Categorizing ruling style", "n": "3.1", "start": 22, "end": 30}, {"section": "Method", "n": "3.2", "start": 31, "end": 46}, {"section": "Results and Discussions", "n": "3.3", "start": 47, "end": 75}, {"section": "Conclusion and Future Work", "n": "4", "start": 76, "end": 84}], "figures": [{"filename": "../figure/image/1027-Table2-1.png", "caption": "Table 2: Example verbs for identifying king’s decision in the AJD. Words are written in Korean and Chinese alphabet.", "page": 2, "bbox": {"x1": 72.0, "x2": 295.2, "y1": 229.44, "y2": 295.2}}, {"filename": "../figure/image/1027-Figure2-1.png", "caption": "Figure 2: Joseon king’s ruling styles. Each king shows quite different ruling style (p < 0.001).", "page": 2, "bbox": {"x1": 96.96, "x2": 503.03999999999996, "y1": 61.44, "y2": 187.2}}, {"filename": "../figure/image/1027-Table1-1.png", "caption": "Table 1: Name, period of reign and the number of months and articles for 27 kings in Joseon dynasty", "page": 1, "bbox": {"x1": 72.0, "x2": 299.52, "y1": 293.28, "y2": 570.72}}, {"filename": "../figure/image/1027-Figure1-1.png", "caption": "Figure 1: Screenshot and structure of an article in the annals of the Joseon dynasty", "page": 1, "bbox": {"x1": 101.75999999999999, "x2": 496.32, "y1": 61.44, "y2": 246.23999999999998}}, {"filename": "../figure/image/1027-Figure3-1.png", "caption": "Figure 3: King’s ruling styles given a topic. It differs from overall ruling style (leftmost bars) (p < 0.01).", "page": 3, "bbox": {"x1": 79.67999999999999, "x2": 518.4, "y1": 61.44, "y2": 150.72}}, {"filename": "../figure/image/1027-Table3-1.png", "caption": "Table 3: Example of different topics (p < 0.01) from overall ruling style distribution", "page": 3, "bbox": {"x1": 72.96, "x2": 290.4, "y1": 196.32, "y2": 294.71999999999997}}]}