{"title": "Towards discourse annotation and sentiment analysis of the Basque Opinion Corpus", "abstract": "Discourse information is crucial for a better understanding of the text structure and it is also necessary to describe which part of an opinionated text is more relevant or to decide how a text span can change the polarity (strengthen or weaken) of other span by means of coherence relations. This work presents the first results on the annotation of the Basque Opinion Corpus using Rhetorical Structure Theory (RST). Our evaluation results and analysis show us the main avenues to improve on a future annotation process. We have also extracted the subjectivity of several rhetorical relations and the results show the effect of sentiment words in relations and the influence of each relation in the semantic orientation value.", "text": [{"id": 0, "string": "1 Introduction Sentiment analysis is a task that extracts subjective information for texts."}, {"id": 1, "string": "There are different objectives and challenges in sentiment analysis: i) document level sentiment classification, that determines whether an evaluation is positive or negative (Pang et al., 2002; Turney, 2002) ; ii) subjectivity classification at sentence level which determines if one sentence has subjective or objective (factual) information (Wiebe et al., 1999) and iii) aspect and entity level in which the target of one positive or negative opinion is identified (Hu and Liu, 2004) ."}, {"id": 2, "string": "In order to attain those objectives, some resources and tools are needed."}, {"id": 3, "string": "Apart from basic resources as a sentiment lexicon, a corpus with subjective information for sentiment analysis is indispensable."}, {"id": 4, "string": "Moreover, such corpora are necessary for two approaches to sentiment analysis."}, {"id": 5, "string": "One approach is based on linguistic knowledge, where a corpus is needed to analyze different linguistic phenomena related to sentiment analysis."}, {"id": 6, "string": "The second approach is based on statistics and, in this case, the corpus is useful to extract patterns of different linguistic phenomena."}, {"id": 7, "string": "The aim of this work is to annotate the rhetorical structure of an opinionated corpus in Basque to check out the semantic orientation of rhetorical relations."}, {"id": 8, "string": "This annotation was performed following the Rhetorical Structure Theory (RST) (Mann and Thompson, 1988) ."}, {"id": 9, "string": "We have used the Basque version of SO-CAL tool to analyze the semantic orientation of this corpus (Taboada et al., 2011) ."}, {"id": 10, "string": "This paper has been organized as follows: after presenting related work in Section 2, Section 3 describes the theoretical framework, the corpus for study and the methodology of annotation as well as the analysis of the corpus carried out."}, {"id": 11, "string": "Then, Section 4 explains the results of the annotation process, the inter-annotator agreement and the results with regard to analysis in the subjectivity of the corpus."}, {"id": 12, "string": "After that, Section 5 discusses the results."}, {"id": 13, "string": "Finally, Section 6 concludes the paper, also proposing directions for future work."}, {"id": 14, "string": "Related work The creation of a specific corpus and its annotation at different linguistic levels has been very a common task in natural language processing."}, {"id": 15, "string": "As far as a corpus for sentiment analysis is concerned, information related to subjectivity and different grammar-levels has been annotated in different projects."}, {"id": 16, "string": "Refaee and Rieser (2014) annotate the Arabic Twitter Corpus for subjectivity and sentiment analysis."}, {"id": 17, "string": "They collect 8,868 tweets in Arabic by random search."}, {"id": 18, "string": "Two native speakers of Arabic annotated the tweets."}, {"id": 19, "string": "On the one hand, they annotate the semantic orientation of each tweet."}, {"id": 20, "string": "On the other hand, they also annotate different grammatical characteristics of tweets such as syntactic, morphological and semantic features as well as stylistic and social features."}, {"id": 21, "string": "They do not annotate any discourse related feature."}, {"id": 22, "string": "They obtain a Kappa inter-annotator agreement of 0.84."}, {"id": 23, "string": "The majority of corpora for sentiment analysis are annotated with subjectivity information."}, {"id": 24, "string": "There are fewer corpora annotated with discourse information for the same task."}, {"id": 25, "string": "Chardon et al."}, {"id": 26, "string": "(2013) present a corpus for sentiment analysis annotated with discourse information."}, {"id": 27, "string": "They annotate the corpus using Segmented Discourse Representation Theory (SDRT), creating two corpora: i) movie reviews from AlloCinéf.fr and ii) news reaction from Lemonde.fr."}, {"id": 28, "string": "They collect 211 texts, annotated at EDU and document level."}, {"id": 29, "string": "At the EDU level, subjectivity is annotated while at the document level, subjectivity and discourse relations are annotated."}, {"id": 30, "string": "Results in subjectivity show that, at EDU level, Cohen's Kappa varies between 0.69 and 0.44 depending on the corpus and, at the document level, Kappa is between 0.73 and 0.58, respectively."}, {"id": 31, "string": "They do not give results regarding the annotation of discourse relations."}, {"id": 32, "string": "Asher et al."}, {"id": 33, "string": "(2009) create a corpus with discourse and subjectivity annotation."}, {"id": 34, "string": "They categorize opinions in four groups (REPORTING, JUDGMENT, ADVISE and SENTIMENT), using SDRT as the annotation framework for discourse."}, {"id": 35, "string": "Exactly, they use five types of rhetorical relations (CONTRAST/CORRECTION, EXPLA-NATION, RESULT and CONTINUATION)."}, {"id": 36, "string": "They collect three corpora (movie reviews, letters and news reports) in English and French."}, {"id": 37, "string": "150 texts are in French and 186 texts in English."}, {"id": 38, "string": "According to Kappa measure, in opinion categorization, the inter-annotator agreement is 95% while in discourse segmentation it is 82%."}, {"id": 39, "string": "Mittal et al."}, {"id": 40, "string": "(2013) follow a similar methodology."}, {"id": 41, "string": "By the annotation of negation and discourse relations in a corpus, they measure the improvement made in sentiment classification."}, {"id": 42, "string": "They collect 662 reviews in Hindi from review websites (380 with a positive opinion and 282 with a negative one)."}, {"id": 43, "string": "Regarding discourse, they annotate violating expectation conjunctions that oppose or refute the current discourse segment."}, {"id": 44, "string": "According to their results, after implementing negation and discourse information to HindiSentiWord-Net (HSWN), the accuracy of the tool increases from 50.45 to 80.21."}, {"id": 45, "string": "They do not mention the inter-annotating agreement of violating expectation conjunctions."}, {"id": 46, "string": "To sum up, this section gives us a general overview about discourse-based annotated corpora for sentiment analysis."}, {"id": 47, "string": "Corpora have been made for specific aims, annotating only some characteristics or features related to discourse and discourse relations."}, {"id": 48, "string": "This situation differs from our work, because our work describes the annotation process of the relational discourse structure and how the function in the rhetorical relation affect to the analysis in the semantic orientation."}, {"id": 49, "string": "3 Theoretical framework and methodology 3.1 Theoretical framework: Rhetorical Structure Theory We have annotated the opinion text corpus using the principles of Rhetorical Structure Theory (RST) (Mann and Thompson, 1988; Taboada and Mann, 2006) , as it is the most used framework in the annotation of discourse structure and coherence relations in Basque where there are some tools (Iruskieta et al., 2013 (Iruskieta et al., , 2015b to study rhetorical relations."}, {"id": 50, "string": "According to this framework, a text is coherent when it can be represented in one discourse-tree (RS-tree)."}, {"id": 51, "string": "In a discourse-tree, there are elementary discourse units (EDU) that are interrelated."}, {"id": 52, "string": "The relations are called coherence relations and the sum of these coherence relations forms a discourse-tree."}, {"id": 53, "string": "Moreover, the text spans present in a discourse relation may enter into new relations, so relations can form compound and recursive structures."}, {"id": 54, "string": "Elementary discourse units are text spans that usually contain a verb, except in some specific situations."}, {"id": 55, "string": "The union of two or more EDUs creates a coherence relation."}, {"id": 56, "string": "There are initially 25 types of coherence relations in RST."}, {"id": 57, "string": "In some cases, one EDU is more important than other one and, in this case, the most important EDU in the relation is called nucleus-unit (basic information) while the less important or the auxiliary EDU is called satellite-unit (additional information)."}, {"id": 58, "string": "Coherence relations of this type are called hypotactic relations."}, {"id": 59, "string": "In contrast, in other relations, EDUs have the same importance and, consequently, all of them are nucleus."}, {"id": 60, "string": "The relations with EDUs of same rank are called paratactic relations."}, {"id": 61, "string": "The task that selects the nucleus in a relation is called nuclearity."}, {"id": 62, "string": "Hypotactic relations are also divided into two groups according to their effect on the reader."}, {"id": 63, "string": "Some relations are subject matter and they are re-lated to the content of text spans."}, {"id": 64, "string": "For example, CAUSE, CONDITION or SUMMARY are subject matter relations."}, {"id": 65, "string": "On the other hand, the aim of other relations is to create some effect on the reader."}, {"id": 66, "string": "They are more rhetorical in their way of functioning."}, {"id": 67, "string": "EVIDENCE, ANTITHESIS or MO-TIVATION belong to this group."}, {"id": 68, "string": "Figure 1 presents a partial discourse-tree of an opinion text (tagged with the code LIB29)."}, {"id": 69, "string": "The text is segmented and each text span is a discourse unit (EDU)."}, {"id": 70, "string": "The discourse units are linked by different types of rhetorical relations."}, {"id": 71, "string": "For instance, the EDUs numbered with 15 and 16 are linked by an ELABORATION relation and the EDUs ranging from 15 to 20 are linked by LIST (multinuclear relation)."}, {"id": 72, "string": "On the other hand, the EDU numbered 2 is the central unit of this text because other relations in the text are linked to it and this text span is not attached to another one (with the exception of multinuclear relations)."}, {"id": 73, "string": "According to Taboada and Stede (2009) , there are three steps in RST-based text annotation: 1-Segmentation of the text in text spans."}, {"id": 74, "string": "Spans are usually clauses."}, {"id": 75, "string": "2-Examination of clear relations between the units."}, {"id": 76, "string": "If there is a clear relation, then mark it."}, {"id": 77, "string": "If not, the unit belongs to a higher-level relation."}, {"id": 78, "string": "In other words, the text span is part of a larger unit."}, {"id": 79, "string": "3-Continue linking the relations until all the EDUs belong to one relation."}, {"id": 80, "string": "Following Iruskieta et al."}, {"id": 81, "string": "(2014) we think that it is recommendable, after segmenting the corpus, to identify first the central unit, and then mark the relations between different text spans."}, {"id": 82, "string": "The Basque Opinion Corpus The corpus used for this study is the Basque Opinion Corpus (Alkorta et al., 2016) ."}, {"id": 83, "string": "This corpus has been created with 240 opinion texts collected from different websites."}, {"id": 84, "string": "Some of them are newspapers (for instance, Berria and Argia) while others are specialized websites (for example, Zinea for movies and Kritiken Hemeroteka for literature)."}, {"id": 85, "string": "The corpus is multidomain and, in total, there are opinion texts of six different domains: sports, politics, music, movies, literature books and weather."}, {"id": 86, "string": "The corpus is doubly balanced."}, {"id": 87, "string": "That is, each domain has the same quantity of opinion texts (40 per domain) and each semantic orientation (positive or negative subjectivity) has the same quantity of opinion texts per each domain (20 positive and 20 negative texts per domain)."}, {"id": 88, "string": "We extract preliminary corpus information using the morphosyntactical analysis tool Analhitza (Otegi et al., 2017) : 52,092 tokens and 3,711 sentences."}, {"id": 89, "string": "We made preliminary checks to decide whether the corpus is useful for sentiment analysis."}, {"id": 90, "string": "The opinion texts are subjective, so the frequency information of the first person should be high."}, {"id": 91, "string": "The results show that the first person appearance is of 1.21% in a Basque objective corpus (Basque Wikipedia) whereas its appearance is of 8.37% in the Basque Opinion Corpus."}, {"id": 92, "string": "As far as the presence of adjectives is concerned, both corpora show similar results."}, {"id": 93, "string": "From all the types of grammatical categories, 8.50% of the words correspond to adjectives in Basque Wikipedia and 9.82% in the corpus for study."}, {"id": 94, "string": "Other interesting features for sentiment analysis, such as negation, irrealis blocking and discourse markers, have also been found in the corpus."}, {"id": 95, "string": "Methodological steps We have followed several steps to annotate the Basque Opinion Corpus using the RST framework: A1 A2 Total Movie 21 + 9 9 30 Weather 10 + 5 5 15 Literature 5 20 + 5 25 Total 50 39 70  of literature reviews have been annotated by one annotator and other 5 texts from the same domain by two."}, {"id": 96, "string": "In total, 19 texts from 70 (27.14%) have been annotated by two annotators."}, {"id": 97, "string": "2-Annotation procedure and process."}, {"id": 98, "string": "We decided to follow the annotation guidelines proposed by Das and Taboada (2018) ."}, {"id": 99, "string": "Each person annotated four or five texts per day during two or three weeks."}, {"id": 100, "string": "The time to annotate documents varied according to the domain."}, {"id": 101, "string": "The texts corresponding to the weather domain are shorter and, consequently, easier to annotate while texts about movies as well as those of the literature domain are more difficult because their writing style is more implicit (less indicators and relation signals) and complex (longer at least)."}, {"id": 102, "string": "Approximately, each weather text was annotated in 20 minutes while movie and literature texts were annotated in one hour."}, {"id": 103, "string": "3-Measurement of inter-annotator agreement."}, {"id": 104, "string": "In order to check the quality of the annotation process, inter-annotator agreement was measured."}, {"id": 105, "string": "This was calculated manually following the qualitative evaluation method (Iruskieta et al., 2015a) using F-measure."}, {"id": 106, "string": "In this measurement, in contrast with the automatic tool, the central subconstituent factor was not taken into account."}, {"id": 107, "string": "4-Semantic orientation extraction."}, {"id": 108, "string": "Using the Basque version of the SO-CAL tool (Taboada et al., 2011) , we have extracted the subjective information of rhetorical relations in the three domains of the corpus in order to check how the type of rhetorical relation affects their sentiment valence."}, {"id": 109, "string": "SO-CAL needs a sentiment lexicon where words have a sentiment valence between −5 and +5."}, {"id": 110, "string": "The Basque version of the sentiment lexicon contains 1,237 entries."}, {"id": 111, "string": "We have extracted the sentiment valence of 75 instances if CONCESSION and EVALUATION relations."}, {"id": 112, "string": "From the 75 CONCESSION relations, 16 come from the weather domain, 34 from literature and 25 from movies."}, {"id": 113, "string": "In the case of EVALU-ATION, 19 come from weather, 31 from literature and 25 from weather."}, {"id": 114, "string": "5-Results."}, {"id": 115, "string": "On the one hand, we have calculated the percentage of rhetorical relations with the same label annotated by two persons."}, {"id": 116, "string": "On the other hand, we have measured accumulated values of sentiment valences in nuclei and satellites in texts of different domains."}, {"id": 117, "string": "Table 2 shows the inter-annotator agreement of rhetorical relations (RR) between both annotators."}, {"id": 118, "string": "This agreement was calculated following the qualitative method (Iruskieta et al., 2015a) ."}, {"id": 119, "string": "According to these results, the highest agreement has been reached in the domain of weather where 17 of 39 relations (43.59%) have been annotated with the same relation label."}, {"id": 120, "string": "After that, inter-annotator agreement in literature is 41.67% (70 from 168)."}, {"id": 121, "string": "Finally, the domain of movies obtained the lowest results, since the agreement is 37.73% (83 of 220)."}, {"id": 122, "string": "Taking all domains into account, 39.81% of the rhetorical relations have been annotated in the same way (170 relations of 427)."}, {"id": 123, "string": "The disagreements are due to different reasons: i) both annotators have to train more to reach a higher agreement and to obtain better results."}, {"id": 124, "string": "ii) opinionative texts are more open than news or scientific abstracts."}, {"id": 125, "string": "Therefore, there is more place for different interpretations."}, {"id": 126, "string": "Results Inter-annotator agreement Domain Agreement ( Subjectivity extraction from rhetorical relations The annotation of the corpus using Rhetorical Structure Theory allows us to check the usefulness of the corpus."}, {"id": 127, "string": "We have extracted the subjectivity from different types of rhetorical relations using the Basque version of the SO-CAL tool and we have been able to check the distribution of words with sentiment valence in each type of rhetorical relation and domain."}, {"id": 128, "string": "We have analyzed how words with sentiment valence appear in nuclei as well as satellites of CONCESSION and EVALUATION 1 in three domains."}, {"id": 129, "string": "The results 2 are presented in Table 3 ."}, {"id": 130, "string": "In the case of CONCESSION, the presence of words with sentiment valence in nuclei (47.21%) and satellites (52.79%) is similar in the three domains, although satellites show a higher proportion."}, {"id": 131, "string": "In contrast, in the case of EVALUATION, words with sentiment valence are more concentrated on satellites (55.00%) in comparison with nuclei (45.00%)."}, {"id": 132, "string": "The only exception is weather, where nucleus prevail over satellites as far as the concentration of words with sentiment valence is concerned 3 ."}, {"id": 133, "string": "This information contrast between discourse and sentiment analysis provides us the option to understand what happens there."}, {"id": 134, "string": "For example, in CONCESSION, the nucleus presents a situation affirmed by the author and the satellite shows a situation which is apparently inconsistent but also affirmed by the author (Mann and Taboada, 2005) ."}, {"id": 135, "string": "In other words, the probability of an opinion appearance is similar in both."}, {"id": 136, "string": "The sentiment valence of the nucleus prevails over the satellite but the application of Basque SO-CAL does not give the correct result because the tool does not apply any discourse processing and, consequently, in this CONCESSION relation, nuclei as well as satellite are given the same weight."}, {"id": 137, "string": "( In Example (1), the semantic orientation of the nucleus is positive while the semantic orientation of the satellite is negative."}, {"id": 138, "string": "The sum is positive and, in this case, SO-CAL correctly assigns the semantic orientation of the overall rhetorical relation."}, {"id": 139, "string": "In contrast, in Example (2), according to SO-CAL, the sentiment orientation of the relation is negative but it should be positive, because the semantic orientation of the nucleus is positive."}, {"id": 140, "string": "This example clarifies how discourse information is needed in lexicon-based sentiment classifiers such as in Example (3) , the nucleus as well as the satellite and the rhetorical relation have positive semantic orientation and SO-CAL assigns correctly the semantic orientation."}, {"id": 141, "string": "Another type of rhetorical relation is EVALU-ATION, where the satellite makes an evaluative comment about the situation presented in the nucleus (Mann and Taboada, 2005) ."}, {"id": 142, "string": "That means that the words with subjective information are more likely to appear in the satellite."}, {"id": 143, "string": "Here, we can see some specific characteristics of each rhetorical relation."}, {"id": 144, "string": "Unlike CONCES-SION, there is a concentration of words with sentiment valence in the satellite while words with sentiment valence have little presence in the nucleus."}, {"id": 145, "string": "In fact, the sentiment valence of nuclei is never higher than +1 whereas satellites have a higher sentiment valence than ±3 in all the cases."}, {"id": 146, "string": "In these three Examples (4, 5 and 6), the Basque version of the SO-CAL tool guesses correctly the semantic orientation of rhetorical relations."}, {"id": 147, "string": "For example, in Example (6), the semantic orientation of nucleus is positive and of satellite is negative."}, {"id": 148, "string": "The sum of the two EDUs is negative and SO-CAL correctly assigns a −3.4 sentiment valence."}, {"id": 149, "string": "This does not happen in all cases because the tool has not implemented any type of discourse information processing."}, {"id": 150, "string": "Anyway, the tool provides information about semantic orientation that is necessary to study the relation between sentiment analysis and rhetorical relations."}, {"id": 151, "string": "Discussion Inter-annotator agreement Regarding inter-annotator agreement (Table 2) , the agreement goes from 37.73% to 43.59%."}, {"id": 152, "string": "However, some domains do not show regularity regarding agreement."}, {"id": 153, "string": "For example, in the case of reviews (domain of literature), inter-annotator agreement is situated between 38% and 48%, except in two texts where the agreement is lower (26% and 30%)."}, {"id": 154, "string": "In the same line, in the weather domain, some texts show higher agreement than the average in the domain."}, {"id": 155, "string": "If we evaluate this doubly annotated corpus by automatic means in a more strict scenario (if and only if the central subconstituent is the same) following Iruskieta et al."}, {"id": 156, "string": "(2015a) , we can observe and evaluate other aspects of rhetorical structure, such as: • Constituent (C) describes all the EDUs that compose each discourse unit or span."}, {"id": 157, "string": "• Attachment point is the node in the RS-tree to which the relation is attached."}, {"id": 158, "string": "• N-S or nuclearity specifies if the compared relations share the same direction (NS, NS or NN)."}, {"id": 159, "string": "• Relation determines if both annotators have assigned 4 the same type of rhetorical relation to the attachment point of two or more EDUs in order to get the same effect."}, {"id": 160, "string": "Another aspect to take into consideration is that the manual and automatic evaluation does not show the same results with regard to interannotator agreement of the type of relation."}, {"id": 161, "string": "According to a manual evaluation, inter-annotator  agreement is 39.81% while the automatic evaluation shows an agreement of 31.72%."}, {"id": 162, "string": "As we have noted before, this difference comes due to the fact that the automatic comparison is made in a strict scenario and some relations are not compared, because the description of the central subconstituent of such relations is slightly different."}, {"id": 163, "string": "The inter-annotator agreement results given by the automatic tool offer complementary information related to the annotation of the corpus."}, {"id": 164, "string": "As Table 4 shows, the inter-annotator agreement is low in the case of type of relation but the results are better in other aspects of rhetorical relations such as constituent and nuclearity."}, {"id": 165, "string": "The agreement in attachment point achieves 0.40 that is low still but constituent as well as nuclearity have achieved the inter-annotator agreement of 0.52 and 0.66, respectively."}, {"id": 166, "string": "On the other hand, another interesting aspect is that there is no difference between domains as far as the agreement of different aspects related to writing style is concerned."}, {"id": 167, "string": "It is surprising because the type and the way to express opinions are very different for each domain."}, {"id": 168, "string": "In the weather domain, texts are short and clear and the language is direct."}, {"id": 169, "string": "In contrast, in literature and movies, texts are longer, more diffuse and they use figurative expression many times."}, {"id": 170, "string": "Even so, the weather domain obtains lowest results in three aspects mentioned in Table 4 but the type of relation obtains a better result compared to other domains."}, {"id": 171, "string": "The interpretation of inter-annotator agreement suggests that in the evaluation of some rhetorical relations the agreement is lower while other aspects related to rhetorical relations like constituent and nuclearity obtain a better agreement."}, {"id": 172, "string": "We have also discovered that specially ELABORATION, EVALUATION and some multinuclear relations show higher disagreement."}, {"id": 173, "string": "Relevant RR disagreement: confusion matrix In order to know the differences of these disagreements, we have also measured the type of rhetorical relations with the highest disagreement."}, {"id": 174, "string": "With that aim, we have calculated a confusion matrix, and then we have identified the most controversial rhetorical relations."}, {"id": 175, "string": "Results are shown in Table 5 ."}, {"id": 176, "string": "According to Table 5 , ELABORATION has been used by one annotator whereas the other has employed a more informative relation."}, {"id": 177, "string": "In two cases, the first annotator (A1) has annotated an EVALUATION relation while the other annotator (A2) has annotated MOTIVATION and IN-TERPRETATION."}, {"id": 178, "string": "In other case, A2 has annotated ELABORATION whereas A1 has tagged RESULT."}, {"id": 179, "string": "In total, there are 19 instances in which ELABORATION has been annotated by one of the annotators."}, {"id": 180, "string": "Moreover, there are 4 instances of disagreement between INTERPRETATION and JUSTIFICATION."}, {"id": 181, "string": "Finally, there are also disagreements in multinuclear relations."}, {"id": 182, "string": "While A2 has annotated CONTRAST in 10 relations, A1 has employed CONCESSION and EVALUATION."}, {"id": 183, "string": "There are also 4 instances of disagreement between LIST and CONJUNCTION."}, {"id": 184, "string": "Our interpretation of this results is that one annotator (A1) tends to annotate more general rhetorical relations (e. g. ELABORATION) while other annotator (A2) annotates more precise relations."}, {"id": 185, "string": "When it comes to multinuclear relations, it seems that A1 annotator has a tendency to not an-notate multinuclear relations."}, {"id": 186, "string": "Checking the usefulness of the corpus for sentiment analysis The second aim of this work has been to check the usefulness of the corpus for sentiment analysis."}, {"id": 187, "string": "Firstly, the results have shown that in some cases the Basque version of SO-CAL does not assign a suitable semantic orientation to all the rhetorical relations, even when the semantic orientation of EDUs of the relation is correct."}, {"id": 188, "string": "This means that the information of rhetorical relations would be needed in order to make a lexicon-based sentiment classification."}, {"id": 189, "string": "In other words, this suggests that it would be recommendable to assign weights to EDUs of rhetorical relations to model their effect on sentiment analysis."}, {"id": 190, "string": "Each type of rhetorical relation has different characteristics and, consequently, the way to assign weights to EDUs in each relation must be different."}, {"id": 191, "string": "For that reason, we have made a preliminary study with the purpose of checking how different types of rhetorical relations present a semantic orientation and what is the distribution of words with sentiment valence in rhetorical relations."}, {"id": 192, "string": "The study of CONCESSION has shown that i) the probability of sentiment words appearing in nuclei as well as satellites is similar, and that ii) nucleus always prevails over the satellite and, consequently, the semantic orientation of nucleus must be the semantic orientation of all the rhetorical relation."}, {"id": 193, "string": "However, the semantic orientation of the satellite must be also taken into consideration in the semantic orientation of all the rhetorical relation."}, {"id": 194, "string": "Although comparing with nucleus, satellite has to be less important."}, {"id": 195, "string": "The opposite situation happens in EVALUA-TION."}, {"id": 196, "string": "Here, we can see that words with sentiment valence concentrate more on the satellite while there are fewer words with sentiment valence in the nucleus."}, {"id": 197, "string": "That means that the weight must be assigned to the satellite because that part of the relation is more important from the point of view of sentiment analysis."}, {"id": 198, "string": "This interpretation of the results suggests that the Basque Opinion Corpus annotated using RST can be useful for different tasks of sentiment analysis, in fact, the preliminary analysis made with rhetorical relations shows some characteristics and differences that are related to rhetorical relations."}, {"id": 199, "string": "Conclusion and Future Work In this work, we have annotated a part of the Basque Opinion Corpus using Rhetorical Structure Theory."}, {"id": 200, "string": "Then, we have measured interannotator agreement."}, {"id": 201, "string": "The manual evaluation of the results shows that the inter-annotator agreement of the type of rhetorical relations is 39.81%."}, {"id": 202, "string": "On the other hand, using an automatic tool we have obtained more fine-grained results regarding aspects of relations and attachment, as well as nuclearity, with an inter-annotator agreement higher than 0.5."}, {"id": 203, "string": "We have also identified that ELABO-RATION, EVALUATION and some multinuclear relations show the highest disagreement."}, {"id": 204, "string": "On the other hand, we have also checked the usefulness of this annotated corpus for sentiment analysis and the first results show that it is useful to extract subjectivity information of different rhetorical relations."}, {"id": 205, "string": "In CONCESSION relations, the semantic orientation of the nucleus always prevails but the valence of the satellite must also be taken into consideration."}, {"id": 206, "string": "In EVALUATION relations, words with sentiment valence concentrate on satellite."}, {"id": 207, "string": "In future, firstly, we plan to build extended annotation guidelines to annotate the corpus with more reliability."}, {"id": 208, "string": "This would be the previous step before annotating the entire corpus."}, {"id": 209, "string": "On the other hand, we would like to continue analyzing how the subjective information is distributed in relations."}], "headers": [{"section": "Related work", "n": "2", "start": 14, "end": 81}, {"section": "The Basque Opinion Corpus", "n": "3.2", "start": 82, "end": 94}, {"section": "Methodological steps", "n": "3.3", "start": 95, "end": 125}, {"section": "Subjectivity extraction from rhetorical relations", "n": "4.2", "start": 126, "end": 150}, {"section": "Inter-annotator agreement", "n": "5.1", "start": 151, "end": 172}, {"section": "Relevant RR disagreement: confusion matrix", "n": "5.1.1", "start": 173, "end": 185}, {"section": "Checking the usefulness of the corpus for sentiment analysis", "n": "5.2", "start": 186, "end": 198}, {"section": "Conclusion and Future Work", "n": "6", "start": 199, "end": 209}], "figures": [{"filename": "../figure/image/1030-Table3-1.png", "caption": "Table 3: Accumulated values of sentiment valences in nuclei and satellites for each domain.", "page": 5, "bbox": {"x1": 74.88, "x2": 523.1999999999999, "y1": 62.879999999999995, "y2": 161.28}}, {"filename": "../figure/image/1030-Table4-1.png", "caption": "Table 4: Inter-annotator agreement results given by the automatic tool.", "page": 6, "bbox": {"x1": 89.75999999999999, "x2": 507.35999999999996, "y1": 62.879999999999995, "y2": 147.35999999999999}}, {"filename": "../figure/image/1030-Table5-1.png", "caption": "Table 5: Disagreement in rhetorical relations.", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 528.0, "y1": 313.44, "y2": 406.08}}, {"filename": "../figure/image/1030-Table1-1.png", "caption": "Table 1: Number of texts annotated by two annotators. The number after the sum sign indicates the quantity of texts with double annotation.", "page": 2, "bbox": {"x1": 326.88, "x2": 503.03999999999996, "y1": 466.56, "y2": 538.0799999999999}}, {"filename": "../figure/image/1030-Figure1-1.png", "caption": "Figure 1: Part of a discourse-tree of the LIB29 review annotated with the RST framework.", "page": 3, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 61.44, "y2": 282.24}}, {"filename": "../figure/image/1030-Table2-1.png", "caption": "Table 2: Inter-annotator agreement in different domains of the corpus measured by hand.", "page": 4, "bbox": {"x1": 72.0, "x2": 299.03999999999996, "y1": 196.79999999999998, "y2": 268.32}}]}