{"title": "What Action Causes This? Towards Naive Physical Action-Effect Prediction", "abstract": "Despite recent advances in knowledge representation, automated reasoning, and machine learning, artificial agents still lack the ability to understand basic actioneffect relations regarding the physical world, for example, the action of cutting a cucumber most likely leads to the state where the cucumber is broken apart into smaller pieces. If artificial agents (e.g., robots) ever become our partners in joint tasks, it is critical to empower them with such action-effect understanding so that they can reason about the state of the world and plan for actions. Towards this goal, this paper introduces a new task on naive physical action-effect prediction, which addresses the relations between concrete actions (expressed in the form of verbnoun pairs) and their effects on the state of the physical world as depicted by images. We collected a dataset for this task and developed an approach that harnesses web image data through distant supervision to facilitate learning for action-effect prediction. Our empirical results have shown that web data can be used to complement a small number of seed examples (e.g., three examples for each action) for model learning. This opens up possibilities for agents to learn physical action-effect relations for tasks at hand through communication with humans with a few examples.", "text": [{"id": 0, "string": "Introduction Causation in the physical world has long been a central discussion to philosophers who study casual reasoning and explanation (Ducasse, 1926; Gopnik et al., 2007) , to mathematicians or com-puter scientists who apply computational approaches to model cause-effect prediction (Pearl et al., 2009) , and to domain experts (e.g., medical doctors) who attempt to understand the underlying cause-effect relations (e.g., disease and symptoms) for their particular inquires."}, {"id": 1, "string": "Apart from this wide range of topics, this paper investigates a specific kind of causation, the very basic causal relations between a concrete action (expressed in the form of a verb-noun pair such as \"cut-cucumber\") and the change of the physical state caused by this action."}, {"id": 2, "string": "We call such relations naive physical action-effect relations."}, {"id": 3, "string": "For example, given an image as shown in Figure 1, we would have no problem predicting what actions can cause the state of the world depicted in the image, e.g., slicing an apple will likely lead to the state."}, {"id": 4, "string": "On the other hand, given a statement \"slice an apple\", it would not be hard for us to imagine what state change may happen to the apple."}, {"id": 5, "string": "We can make such action-effect prediction because we have developed an understanding of this kind of basic action-effect relations at a very young age (Baillargeon, 2004) ."}, {"id": 6, "string": "What happens to machines?"}, {"id": 7, "string": "Will artificial agents be able to make the same kind of predictions?"}, {"id": 8, "string": "The answer is not yet."}, {"id": 9, "string": "Despite tremendous progress in knowledge representation, automated reasoning, and machine learning, artificial agents still lack the understanding of naive causal relations regarding the physical world."}, {"id": 10, "string": "This is one of the bottlenecks in machine intelligence."}, {"id": 11, "string": "If artificial agents ever become capable of working with humans as partners, they will need to have this kind of physical action-effect understanding to help them reason, learn, and perform actions."}, {"id": 12, "string": "To address this problem, this paper introduces a new task on naive physical action-effect prediction."}, {"id": 13, "string": "This task supports both cause predic- tion: given an image which describes a state of the world, identify the most likely action (in the form of a verb-noun pair, from a set of candidates) that can result in that state; and effect prediction: given an action in the form of a verb-noun pair, identify images (from a set of candidates) that depicts the most likely effects on the state of the world caused by that action."}, {"id": 14, "string": "Note that there could be different ways to formulate this problem, for example, both causes and effects are in the form of language or in the form of images/videos."}, {"id": 15, "string": "Here we intentionally frame the action as a language expression (i.e., a verb-noun pair) and the effect as depicted in an image in order to make a connection between language and perception."}, {"id": 16, "string": "This connection is important for physical agents that not only can perceive and act, but also can communicate with humans in language."}, {"id": 17, "string": "As a first step, we collected a dataset of 140 verb-noun pairs."}, {"id": 18, "string": "Each verb-noun pair is annotated with possible effects described in language and depicted in images (where language descriptions and image descriptions are collected separately)."}, {"id": 19, "string": "We have developed an approach that applies distant supervision to harness web data for bootstrapping action-effect prediction models."}, {"id": 20, "string": "Our empirical results have shown that, using a simple bootstrapping strategy, our approach can combine the noisy web data with a small number of seed examples to improve action-effect prediction."}, {"id": 21, "string": "In addition, for a new verb-noun pair, our approach can infer its effect descriptions and predict action-effect relations only based on 3 image examples."}, {"id": 22, "string": "The contributions of this paper are three folds."}, {"id": 23, "string": "First, it introduces a new task on physical actioneffect prediction, a first step towards an under-standing of causal relations between physical actions and the state of the physical world."}, {"id": 24, "string": "Such ability is central to robots which not only perceive from the environment, but also act to the environment through planning."}, {"id": 25, "string": "To our knowledge, there is no prior work that attempts to connect actions (in language) and effects (in images) in this nature."}, {"id": 26, "string": "Second, our approach harnesses the large amount of image data available on the web with minimum supervision."}, {"id": 27, "string": "It has shown that physical action-effect models can be learned through a combination of a few annotated examples and a large amount of un-annotated web data."}, {"id": 28, "string": "This opens up the possibility for humans to teach robots new tasks through language communication with a small number of examples."}, {"id": 29, "string": "Third, we have created a dataset for this task, which is available to the community 1 ."}, {"id": 30, "string": "Our bootstrapping approach can serve as a baseline for future work on this topic."}, {"id": 31, "string": "In the following sections, we first describe our data collection effort, then introduce the bootstrapping approach for action-effect prediction, and finally present results from our experiments."}, {"id": 32, "string": "Related Work In the NLP community, there has been extensive work that models cause-effect relations from text (Cole et al., 2005; Do et al., 2011; Yang and Mao, 2014) ."}, {"id": 33, "string": "Most of these previous studies address high-level causal relations between events, for example, \"the collapse of the housing bubble\" causes the effect of \"stock prices to fall\" (Sharp et al., 2016) ."}, {"id": 34, "string": "They do not concern the kind of naive physical action-effect relations in this paper."}, {"id": 35, "string": "There is also an increasing amount of effort on capturing commonsense knowledge, for example, through knowledge base population."}, {"id": 36, "string": "Except for few (Yatskar et al., 2016) that acquires knowledge from images, most of the previous effort apply information extraction techniques to extract facts from a large amount of web data (Dredze et al., 2010; Rajani and Mooney, 2016) ."}, {"id": 37, "string": "DBPedia (Lehmann et al., 2015) , Freebase (Bollacker et al., 2008), and YAGO (Suchanek et al., 2007) knowledge bases contain millions of facts about the world such as people and places."}, {"id": 38, "string": "However, they do not contain basic cause-effect knowledge related to concrete actions and their effects to the world."}, {"id": 39, "string": "Recent work started looking into phys-ical causality of action verbs  and other physical properties of verbs (Forbes and Choi, 2017; Zellers and Choi, 2017; Chao et al., 2015) ."}, {"id": 40, "string": "But they do not address action-effect prediction."}, {"id": 41, "string": "The idea of modeling object physical state change has also been studied in the computer vision community (Fire and Zhu, 2016) ."}, {"id": 42, "string": "Computational models have been developed to infer object states from observations and to further predict future state changes (Zhou and Berg, 2016; Wu et al., 2016 Wu et al., , 2017 )."}, {"id": 43, "string": "The action recognition task can be treated as detecting the transformation on object states (Fathi and Rehg, 2013; Yang et al., 2013; Wang et al., 2016) ."}, {"id": 44, "string": "However these previous works only focus on the visual presentation of motion effects."}, {"id": 45, "string": "Recent years have seen an increasing amount of work integrating language and vision, for example, visual question answering (Antol et al., 2015; Fukui et al., 2016; Lu et al., 2016) , image description generation (Xu et al., 2015; Vinyals et al., 2015) , and grounding language to perception Roy, 2005; Tellex et al., 2011; Misra et al., 2017) ."}, {"id": 46, "string": "While many approaches require a large amount of training data, recent works have developed zero/few shot learning for language and vision (Mukherjee and Hospedales, 2016; Xu et al., 2016 Xu et al., , 2017a Tsai and Salakhutdinov, 2017) ."}, {"id": 47, "string": "Different from these previous works, this paper introduces a new task that connects language with vision for physical action-effect prediction."}, {"id": 48, "string": "In the robotics community, an important task is to enable robots to follow human natural language instructions."}, {"id": 49, "string": "Previous works (She et al., 2014; Misra et al., 2015; Chai, 2016, 2017) explicitly model verb semantics as desired goal states and thus linking natural language commands with underlying planning systems for action planning and execution."}, {"id": 50, "string": "However, these studies were carried out either in a simulated world or in a carefully curated simple environment within the limitation of the robot's manipulation system."}, {"id": 51, "string": "And they only focus on a very limited set of domain specific actions which often only involve the change of locations."}, {"id": 52, "string": "In this work, we study a set of open-domain physical actions and a variety of effects perceived from the environment (i.e., from images)."}, {"id": 53, "string": "Action-Effect Data Collection We collected a dataset to support the investigation on physical action-effect prediction."}, {"id": 54, "string": "This dataset consists of actions expressed in the form of verbnoun pairs, effects of actions described in language, and effects of actions depicted in images."}, {"id": 55, "string": "Note that, as we would like to have a wide range of possible effects, language data and image data are collected separately."}, {"id": 56, "string": "Actions (verb-noun pairs)."}, {"id": 57, "string": "We selected 40 nouns that represent everyday life objects, most of them are from the COCO dataset (Lin et al., 2014) , with a combination of food, kitchen ware, furniture, indoor objects, and outdoor objects."}, {"id": 58, "string": "We also identified top 3000 most frequently used verbs from Google Syntactic N-gram dataset (Goldberg and Orwant, 2013 ) (Verbargs set)."}, {"id": 59, "string": "And we extracted top frequent verb-noun pairs containing a verb from the top 3000 verbs and a noun in the 40 nouns which hold a dobj (i.e., direct object) dependency relation."}, {"id": 60, "string": "This resulted in 6573 candidate verbnoun pairs."}, {"id": 61, "string": "As changes to an object can occur at various dimensions (e.g., size, color, location, attachment, etc."}, {"id": 62, "string": "), we manually selected a subset of verb-noun pairs based on the following criteria: (1) changes to the objects are visible (as opposed to other types such as temperature change, etc."}, {"id": 63, "string": "); and (2) changes reflect one particular dimension as opposed to multiple dimensions (as entailed by high-level actions such as \"cook a meal\", which correspond to multiple dimensions of change and can be further decomposed into basic actions)."}, {"id": 64, "string": "As a result, we created a subset of 140 verb-noun pairs (containing 62 unique verbs and 39 unique nouns) for our investigation."}, {"id": 65, "string": "Effects Described in Language."}, {"id": 66, "string": "The basic knowledge about physical action-effect is so fundamental and shared among humans."}, {"id": 67, "string": "It is often presupposed in our communication and not explicitly stated."}, {"id": 68, "string": "Thus, it is difficult to extract naive action-effect relations from the existing textual data (e.g., web)."}, {"id": 69, "string": "This kind of knowledge is also not readily available in commonsense knowledge bases such as ConceptNet (Speer and Havasi, 2012) ."}, {"id": 70, "string": "To overcome this problem, we applied crowd-sourcing (Amazon Mechanical Turk) and collected a dataset of language descriptions describing effects for each of the 140 verb-noun pairs."}, {"id": 71, "string": "The workers were shown a verb-noun pair, and were asked to use their own words and imag- Action Effect Text ignite paper The paper is on fire."}, {"id": 72, "string": "soak shirt The shirt is thoroughly wet."}, {"id": 73, "string": "fry potato The potatoes become crisp and golden."}, {"id": 74, "string": "stain shirt There is a visible mark on the shirt."}, {"id": 75, "string": "inations to describe what changes might occur to the corresponding object as a result of the action."}, {"id": 76, "string": "Each verb-noun pair was annotated by 10 different annotators, which has led to a total of 1400 effect descriptions."}, {"id": 77, "string": "Table 1 shows some examples of collected effect descriptions."}, {"id": 78, "string": "These effect language descriptions allow us to derive seed effect knowledge in a symbolic form."}, {"id": 79, "string": "Effects Depicted in Images."}, {"id": 80, "string": "For each action, three students searched the web and collected a set of images depicting potential effects."}, {"id": 81, "string": "Specifically, given a verb-noun pair, each of the three students was asked to collect at least 5 positive images and 5 negative images."}, {"id": 82, "string": "Positive images are those deemed to capture the resulting world state of the action."}, {"id": 83, "string": "And negative images are those deemed to capture some state of the related object (i.e., the nouns in the verb-noun pairs), but are not the resulting state of the corresponding action."}, {"id": 84, "string": "Then, each student was also asked to provide positive or negative labels for the images collected by the other two students."}, {"id": 85, "string": "As a result each image has three positive/negative labels."}, {"id": 86, "string": "We only keep the images whose labels are agreed by all three students."}, {"id": 87, "string": "In total, the dataset contains 4163 images."}, {"id": 88, "string": "On average, each action has 15 positive images, and 15 negative images."}, {"id": 89, "string": "Figure 2 shows several examples of positive images and negative images of the action peel-orange."}, {"id": 90, "string": "The positive images show an orange in a peeled state, while the negative images show oranges in different states (orange as a whole, orange slices, orange juice, etc.)."}, {"id": 91, "string": "Action-Effect Prediction Action-effect prediction is to connect actions (as causes) to the effects of actions."}, {"id": 92, "string": "Specifically, given an image which depicts a state of the world, our task is to predict what concrete actions could cause the state of the world."}, {"id": 93, "string": "This task is different from traditional action recognition as the underlying actions (e.g., human body posture/movement) are not captured by the images."}, {"id": 94, "string": "In this regard, it is also different from image description generation."}, {"id": 95, "string": "We frame the problem as a few-shot learning task, by only providing a few human-labelled images for each action at the training stage."}, {"id": 96, "string": "Given the very limited training data, we attempt to make use of web-search images."}, {"id": 97, "string": "Web search has been adopted by previous computer vision studies to acquire training data (Fergus et al., 2005; Kennedy et al., 2006; Berg et al., 2010; Otani et al., 2016) ."}, {"id": 98, "string": "Compared with human annotations, web-search comes at a much lower cost, but with a trade-off of poor data quality."}, {"id": 99, "string": "To address this issue, we apply a bootstrapping approach that aims to handle data with noisy labels."}, {"id": 100, "string": "The first question is what search terms should be used for image search."}, {"id": 101, "string": "There are two options."}, {"id": 102, "string": "The first option is to directly use the action terms (i.e., verb-noun pairs) to search images and the downloaded web images are referred to as action web images."}, {"id": 103, "string": "As desired images should be depicting effects of an action, terms describing effects become a natural choice."}, {"id": 104, "string": "The second option is to use the key phrases extracted from language effect descriptions to search the web."}, {"id": 105, "string": "The downloaded web images are referred to as effect web images."}, {"id": 106, "string": "Extracting Effect Phrases from Language Data We first apply chunking (shallow parsing) using the SENNA software (Collobert et al., 2011) to break an effect description into phrases such as noun phrases (NP), verb phrases (VP), prepositional phrases (PP), adjectives (ADJP), adverbs (ADVP), etc."}, {"id": 107, "string": "After some examination, we found that most of the effect descriptions follow simple syntactic patterns."}, {"id": 108, "string": "For a verb-noun pair, around 80% of its effect descriptions start with the same noun as the subject."}, {"id": 109, "string": "In an effect description, the  change of state associated with the noun is mainly captured by some key phrases."}, {"id": 110, "string": "For example, an adjective phrase usually describes a physical state; verbs like be, become, turn, get often indicate a description of change of the state."}, {"id": 111, "string": "Based on these observations, we defined a set of patterns to identify phrases that describe physical states of an object."}, {"id": 112, "string": "In total 1997 effect phrases were extracted from the language data."}, {"id": 113, "string": "Table 2 shows some example patterns and example effect phrases that are extracted."}, {"id": 114, "string": "Downloading Web Images The purpose of querying search engine is to retrieve images of objects in certain effect states."}, {"id": 115, "string": "To form image searching keywords, the effect phrases are concatenated with the corresponding noun phrases, for example, \"apple + into thin pieces\"."}, {"id": 116, "string": "The image search results are downloaded and used as supplementary training data for the action-effect prediction models."}, {"id": 117, "string": "However, web images can be noisy."}, {"id": 118, "string": "First of all, not all of the automatically extracted effect phrases describe visible state of objects."}, {"id": 119, "string": "Even if a phrase represents visible object states, the retrieved results may not be relevant."}, {"id": 120, "string": "Figure 3 shows some example image search results using queries describing the object name \"book\", and describing the object state such as \"book is on fire\", \"book is set aflame\"."}, {"id": 121, "string": "These state phrases were used by human annotators to describe the effect of the action \"burn a book\"."}, {"id": 122, "string": "We can see that the images returned from the query \"book is set aflame\" are not depicting the physical effect state of \"burn a book\"."}, {"id": 123, "string": "Therefore, it's important to identify images with relevant effect states to train the model."}, {"id": 124, "string": "To do that, we applied a bootstrapping method to handle the noisy web images as described in Section 4.3."}, {"id": 125, "string": "For an action (i.e., a verb-noun pair), it has multiple corresponding effect phrases, and all of their image search results are treated as training images for this action."}, {"id": 126, "string": "Since both the human annotated image data (Section 3) and the web-search image data were obtained from Internet search engines, they may book book is on fire book is set aflame Figure 3 : Examples of image search results."}, {"id": 127, "string": "have duplicates."}, {"id": 128, "string": "As part of the annotated images are used as test data to evaluate the models, it is important to remove duplicates."}, {"id": 129, "string": "We designed a simple method to remove any images from the web-search image set that has a duplicate in the human annotated set."}, {"id": 130, "string": "We first embed all images into feature vectors using pre-trained CNNs."}, {"id": 131, "string": "For each web-search image, we calculate its cosine similarity score with each of the annotated images."}, {"id": 132, "string": "And we simply remove the web images that have a score larger than 0.95."}, {"id": 133, "string": "Models We formulate the action-effect prediction task as a multi-class classification problem."}, {"id": 134, "string": "Given an image, the model will output a probability distribution q over the candidate actions (i.e., verb-noun pairs) that can potentially cause the effect depicted in the image."}, {"id": 135, "string": "Specifically for model training, we are given a set of human annotated seeding image data {x, t} and a set of web-search image data {x , t }."}, {"id": 136, "string": "Here x and x are the images (depicting effect states), and t and t are their classification targets (i.e., actions that cause the effects)."}, {"id": 137, "string": "Each target vector is the observed image label, t ∈ {0, 1} C , i t i = 1, and C is the number of classes (i.e., actions)."}, {"id": 138, "string": "The human annotated targets t can be trusted."}, {"id": 139, "string": "But the targets of web-search images t are usually very noisy."}, {"id": 140, "string": "Bootstrapping method has been shown to be an effective method to handle noisy labelled data (Rosenberg et al., 2005; Whitney and Sarkar, 2012; Reed et al., 2014) ."}, {"id": 141, "string": "The objective of the cross-entropy loss is defined as follows: L(t, q) = C i=1 t i log (q i ), (1) where q are the predicted class probabilities, and C is the number of classes."}, {"id": 142, "string": "To handle the noisy labels in the web-search data {x , t }, we adopt a bootstrapping objective following Reed's work (Reed et al., 2014) : L(t , q) = C i=1 [βt i + (1 − β)z i ] log (q i ), (2) where β ∈ [0, 1] is a model parameter to be assigned, z is the one-hot vector of the prediction q, z i = 1, if i = argmax q k , k = 1 ."}, {"id": 143, "string": "."}, {"id": 144, "string": "."}, {"id": 145, "string": "C. The model architecture is shown in Figure 4 ."}, {"id": 146, "string": "After each training batch, the current model will be used to make predictions q on images in the next batch."}, {"id": 147, "string": "And the target probabilities is calculated as a linear combination of the current predictions q and the observed noisy labels t ."}, {"id": 148, "string": "The idea behind this bootstrapping strategy is to ensure the consistency of the model's predictions."}, {"id": 149, "string": "By first initializing the model on the seeding image data, the bootstrapping approach allows the model to trust more on the web images that are consistent with the seeding data."}, {"id": 150, "string": "Evaluation We evaluate the models on the action-effect prediction task."}, {"id": 151, "string": "Given an image that illustrates a state of the world, the goal is to predict what action could cause that state."}, {"id": 152, "string": "Given an action in the form of a verb-noun pair, the goal is to identify images that depict the most likely effects on the state of the world caused by that action."}, {"id": 153, "string": "For each of the 140 verb-noun pairs, we use 10% of the human annotated images as the seeding image data for training, and use 30% for development and the rest 60% for test."}, {"id": 154, "string": "The seeding image data set contains 408 images."}, {"id": 155, "string": "On average, each verb-noun pair has less than 3 seeding images (including positive images and negative images)."}, {"id": 156, "string": "The development set contains 1252 images."}, {"id": 157, "string": "The test set contains 2503 images."}, {"id": 158, "string": "The model parameters were selected based on the performance on the development set."}, {"id": 159, "string": "As a given image may not be relevant to any effect, we add a background class to refer to images where effects are not caused by any action in the space of actions."}, {"id": 160, "string": "So the total of classes for our evaluation model is 141."}, {"id": 161, "string": "For each verb-noun pair and each of the effect phrases, around 40 images were downloaded from the Bing image search engine and used as candidate training examples."}, {"id": 162, "string": "In total we have 6653 action web images and 59575 effect web images."}, {"id": 163, "string": "Methods for Comparison All the methods compared are based on one neural network structure."}, {"id": 164, "string": "We use ResNet (He et al., 2016) pre-trained on ImageNet (Deng et al., 2009) to extract image features."}, {"id": 165, "string": "The extracted image features are fed to a fully connected layer with rectified linear units and then to a softmax layer to make predictions."}, {"id": 166, "string": "More specifically, we compare the following configurations: (1) BS+Seed+Act+Eff."}, {"id": 167, "string": "The bootstrapping approach trained on the seeding images, the action web images, and the effect web images."}, {"id": 168, "string": "During the training stage, the model was first trained on the seeding image data using vanilla cross-entropy objective (Equation 1)."}, {"id": 169, "string": "Then it was further trained on a combination of the seeding image data and web-search data using the bootstrapping objective (Equation 2)."}, {"id": 170, "string": "In the experiments we set β = 0.3."}, {"id": 171, "string": "(2) BS+Seed+Act."}, {"id": 172, "string": "The bootstrapping approach trained in the same fashion as (1)."}, {"id": 173, "string": "The only difference is that this method does not use the effect web images."}, {"id": 174, "string": "(3) Seed+Act+Eff."}, {"id": 175, "string": "A baseline method trained on a combination of the seeding images, the web action images, and the web effect images, using the vanilla cross-entropy objective."}, {"id": 176, "string": "(4) Seed+Act."}, {"id": 177, "string": "A baseline method trained on a combination of the seeding images and the action web images, using the vanilla cross-entropy objective."}, {"id": 178, "string": "Table 4 : Results for the action-effect prediction task (given an image, rank all the actions)."}, {"id": 179, "string": "(5) Seed."}, {"id": 180, "string": "A baseline method that was only trained on the seeding image data, using the vanilla crossentropy objective."}, {"id": 181, "string": "Evaluation Results We apply the trained classification model to all of the test images."}, {"id": 182, "string": "Based on the matrix of prediction scores, we can evaluate action-effect prediction from two angles: (1) given an action class, rank all the candidate images; (2) given an image, rank all the candidate action classes."}, {"id": 183, "string": "Table 3 and 4 show the results for these two angels respectively."}, {"id": 184, "string": "We report both mean average precision (MAP) and top prediction accuracy."}, {"id": 185, "string": "Overall, BS+Seed+Act+Eff gives the best performance."}, {"id": 186, "string": "By comparing the bootstrap approach with baseline approaches (i.e., BS+Seed+Act+Eff vs. Seed+Act+Eff, and BS+Seed+Act vs. Seed+Act), the bootstrapping approaches clearly outperforms their counterparts, demonstrating its ability in handling noisy web data."}, {"id": 187, "string": "Comparing BS+Seed+Act+Eff with BS+Seed+Act, we can see that BS+Seed+Act+Eff performs better."}, {"id": 188, "string": "This indicates the use of effect descriptions can bring more relevant images to train better models for action-effect prediction."}, {"id": 189, "string": "In Table 4 , the poor performance of Seed+Act+Eff and Seed+Act shows that it is risky to fully rely on the noisy web search results."}, {"id": 190, "string": "These two methods had trouble in distinguishing the background class from the rest."}, {"id": 191, "string": "We further trained another multi-class classifier with web effect images, using their corresponding effect phrases as class labels."}, {"id": 192, "string": "Given a test image, we apply this new classifier to predict the effect descriptions of this image."}, {"id": 193, "string": "Figure 5 shows some example images, their predicted actions based on our bootstrapping approach and their predicted effect phrases based on the new classifier."}, {"id": 194, "string": "These examples also demonstrate another advantage of incorporating seed effect knowledge from language data: it provides state descriptions that can be used to better explain the perceived state."}, {"id": 195, "string": "Such explanation can be crucial in human-agent communication for action planning and reasoning."}, {"id": 196, "string": "Generalizing Effect Knowledge to New Verb-Noun Pairs In real applications, it is very likely that we do not have the effect knowledge (i.e., language effect descriptions) for every verb-noun pair."}, {"id": 197, "string": "And annotat-  ing effect knowledge using language (as shown in Section 3) can be very expensive."}, {"id": 198, "string": "In this section, we describe how to potentially generalize seed effect knowledge to new verb-noun pairs through an embedding model."}, {"id": 199, "string": "Action-Effect Embedding Model The structure of our model is shown in Figure 6 ."}, {"id": 200, "string": "It is composed of two sub-networks: one for verbnoun pairs (i.e., action) and the other one for effect phrases (i.e, effect)."}, {"id": 201, "string": "The action or effect is fed into an LSTM encoder and then to two fully-connected layers."}, {"id": 202, "string": "The output is an action embedding v c and effect embedding v e ."}, {"id": 203, "string": "The networks are trained by minimizing the following cosine embedding loss function: L(v c , v e ) = 1 − s(v c , v e ), if (c, e) ∈ T max(0, s(v c , v e )), if (c, e) / ∈ T s(·, ·) is the cosine similarity between vectors."}, {"id": 204, "string": "T is a collection of action-effect pairs."}, {"id": 205, "string": "Suppose c is an input for action and e is an input for effect, this loss function will learn an action and effect semantic space that maximizes the similarities between c and e if they have an action-effect relation (i.e., (c, e) ∈ T )."}, {"id": 206, "string": "During training, the negative actioneffect pairs (i.e., (c, e) / ∈ T ) are randomly sampled from data."}, {"id": 207, "string": "In the experiments, the negative sampling ratio is set to 25."}, {"id": 208, "string": "That is, for each positive action-effect pair, 25 negative pairs are created through random sampling."}, {"id": 209, "string": "At the inference step, given an unseen verbnoun pair, we embed it into the action and effect semantic space."}, {"id": 210, "string": "Its embedding vector will be used to calculate similarities with all the embedding vectors of the candidate effect phrases."}, {"id": 211, "string": "Table 6 : Results for the action-effect prediction task (given an image, rank all the actions)."}, {"id": 212, "string": "Evaluation We divided the 140 verb-noun pairs into 70% training set (98 verb-noun pairs), 10% development set (14) and 20% test set (28) ."}, {"id": 213, "string": "For the actioneffect embedding model, we use pre-trained GloVe word embeddings (Pennington et al., 2014) as input to the LSTM."}, {"id": 214, "string": "The embedding model was trained using the language effect data corresponding to the training verb-noun pairs, and then it was applied to predict effect phrases for the unseen verb-noun pairs in the test set."}, {"id": 215, "string": "For each unseen verb-noun pair, we collected its top five predicted effect phrases."}, {"id": 216, "string": "Each predicted effect phrase was then used as query keywords to download web effect images."}, {"id": 217, "string": "This set of web images are referred to as pEff and will be used in training the actioneffect prediction model."}, {"id": 218, "string": "For each of the 28 test (i.e., new) verb-noun pairs, we use the same ratio 10% (about 3 examples) of the human annotated images as the seeding images, which were combined with downloaded web images to train the prediction model."}, {"id": 219, "string": "The remaining 30% and 60% are used as the development set, and the test set."}, {"id": 220, "string": "We compare the following different configurations: (1) BS+Seed+Act+pEff."}, {"id": 221, "string": "The bootstrapping approach trained on the seeding images, the action web images, and the web images downloaded using the predicted effect phrases."}, {"id": 222, "string": "(2) BS+Seed+Act+Eff."}, {"id": 223, "string": "The bootstrapping approach trained on the seeding images, the action web images, and the effect web images (downloaded using ground-truth effect phrases)."}, {"id": 224, "string": "(3) BS+Seed+Act."}, {"id": 225, "string": "The bootstrapping approach trained on the seeding images and the action web Action Text Predicted Effect Text chop carrot carrot into sandwiches, carrot is sliced, carrot is cut thinly, carrot into different pieces, carrot is divided ignite paper paper is being charred , paper is being burned, paper is set, paper is being destroyed, paper is lit mash potato potato into chunks, potato into sandwiches, potato into slices, potato is chewed, potato into smaller pieces images."}, {"id": 226, "string": "(4) Seed."}, {"id": 227, "string": "A baseline only trained on the seeding images."}, {"id": 228, "string": "Table 5 and 6 show the results for the action-effect prediction task for unseen verbnoun pairs."}, {"id": 229, "string": "From the results we can see that BS+Seed+Act+pEff achieves close performance compared with BS+Seed+Act+Eff, which uses human annotated effect phrases."}, {"id": 230, "string": "Although in most cases, BS+Seed+Act+pEff outperforms the baseline, which seems to point to the possibility that semantic embedding space can be employed to extend effect knowledge to new verb-noun pairs."}, {"id": 231, "string": "However, the current results are not conclusive partly due to the small testing set."}, {"id": 232, "string": "More in-depth evaluation is needed in the future."}, {"id": 233, "string": "Table 7 shows top predicted effect phrases for several new verb-noun pairs."}, {"id": 234, "string": "After analyzing the action-effect prediction results we notice that generalizing the effect knowledge to a verb-noun pair that contains an unseen verb tends to be more difficult than generalizing to a verb-noun pair that contains an unseen noun."}, {"id": 235, "string": "Among the 28 test verbnoun pairs, 12 of them contain unseen verbs and known nouns, 7 of them contain unseen nouns and known verbs."}, {"id": 236, "string": "For the task of ranking images given an action, the mean average precision is 0.447 for the unseen verb cases and 0.584 for the unseen noun cases."}, {"id": 237, "string": "Although not conclusive, this might indicate that, verbs tend to capture more information about the effect states of the world than nouns."}, {"id": 238, "string": "Discussion and Conclusion When robots operate in the physical world, they not only need to perceive the world, but also need to act to the world."}, {"id": 239, "string": "They need to understand the current state, to map their goals to the world state, and to plan for actions that can lead to the goals."}, {"id": 240, "string": "All of these point to the importance of the ability to understand causal relations between actions and the state of the world."}, {"id": 241, "string": "To address this issue, this paper introduces a new task on action-effect prediction."}, {"id": 242, "string": "Particularly, we focus on modeling the connection between an action (a verb-noun pair) and its effect as illustrated in an image and treat natural language effect descriptions as side knowledge to help acquiring web image data and bootstrap training."}, {"id": 243, "string": "Our current model is very simple and performance is yet to be improved."}, {"id": 244, "string": "We plan to apply more advanced approaches in the future, for example, attention models that jointly capture actions, image states, and effect descriptions."}, {"id": 245, "string": "We also plan to incorporate action-effect prediction to humanrobot collaboration, for example, to bridge the gap of commonsense knowledge about the physical world between humans and robots."}, {"id": 246, "string": "This paper presents an initial investigation on action-effect prediction."}, {"id": 247, "string": "There are many challenges and unknowns, from problem formulation to knowledge representation; from learning and inference algorithms to methods and metrics for evaluations."}, {"id": 248, "string": "Nevertheless, we hope this work can motivate more research in this area, enabling physical action-effect reasoning, towards agents which can perceive, act, and communicate with humans in the physical world."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 31}, {"section": "Related Work", "n": "2", "start": 32, "end": 52}, {"section": "Action-Effect Data Collection", "n": "3", "start": 53, "end": 90}, {"section": "Action-Effect Prediction", "n": "4", "start": 91, "end": 105}, {"section": "Extracting Effect Phrases from Language Data", "n": "4.1", "start": 106, "end": 113}, {"section": "Downloading Web Images", "n": "4.2", "start": 114, "end": 132}, {"section": "Models", "n": "4.3", "start": 133, "end": 149}, {"section": "Evaluation", "n": "4.4", "start": 150, "end": 195}, {"section": "Generalizing Effect Knowledge to New", "n": "5", "start": 196, "end": 198}, {"section": "Action-Effect Embedding Model", "n": "5.1", "start": 199, "end": 211}, {"section": "Evaluation", "n": "5.2", "start": 212, "end": 237}, {"section": "Discussion and Conclusion", "n": "6", "start": 238, "end": 248}], "figures": [{"filename": "../figure/image/1045-Figure4-1.png", "caption": "Figure 4: Architecture for the action-effect prediction model with bootstrapping.", "page": 5, "bbox": {"x1": 74.39999999999999, "x2": 286.08, "y1": 64.8, "y2": 184.32}}, {"filename": "../figure/image/1045-Figure1-1.png", "caption": "Figure 1: Images showing the effects of “slice an apple”.", "page": 1, "bbox": {"x1": 86.88, "x2": 275.03999999999996, "y1": 65.75999999999999, "y2": 213.12}}, {"filename": "../figure/image/1045-Table4-1.png", "caption": "Table 4: Results for the action-effect prediction task (given an image, rank all the actions).", "page": 6, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 422.88, "y2": 486.24}}, {"filename": "../figure/image/1045-Figure5-1.png", "caption": "Figure 5: Several example test images and their predicted actions and predicted effect descriptions. The actions in bold are ground-truth labels.", "page": 6, "bbox": {"x1": 90.72, "x2": 507.35999999999996, "y1": 63.839999999999996, "y2": 240.0}}, {"filename": "../figure/image/1045-Table3-1.png", "caption": "Table 3: Results for the action-effect prediction task (given an action, rank all the candidate images).", "page": 6, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 299.52, "y2": 364.32}}, {"filename": "../figure/image/1045-Table6-1.png", "caption": "Table 6: Results for the action-effect prediction task (given an image, rank all the actions).", "page": 7, "bbox": {"x1": 324.0, "x2": 508.32, "y1": 175.68, "y2": 228.95999999999998}}, {"filename": "../figure/image/1045-Figure6-1.png", "caption": "Figure 6: Architecture of the action-effect embedding model.", "page": 7, "bbox": {"x1": 79.67999999999999, "x2": 282.24, "y1": 63.839999999999996, "y2": 216.0}}, {"filename": "../figure/image/1045-Table5-1.png", "caption": "Table 5: Results for the action-effect prediction task (given an action, rank all the candidate images).", "page": 7, "bbox": {"x1": 324.0, "x2": 508.32, "y1": 62.879999999999995, "y2": 115.19999999999999}}, {"filename": "../figure/image/1045-Table1-1.png", "caption": "Table 1: Example action and effect text from our collected data.", "page": 3, "bbox": {"x1": 76.8, "x2": 285.12, "y1": 62.879999999999995, "y2": 115.19999999999999}}, {"filename": "../figure/image/1045-Figure2-1.png", "caption": "Figure 2: Positive images (top row) and negative images (bottom row) of the action peel-orange.", "page": 3, "bbox": {"x1": 314.88, "x2": 517.4399999999999, "y1": 63.839999999999996, "y2": 199.2}}, {"filename": "../figure/image/1045-Table7-1.png", "caption": "Table 7: Example predicted effect phrases for new verb-noun pairs. Unseen verbs and nouns are shown in bold.", "page": 8, "bbox": {"x1": 97.92, "x2": 265.44, "y1": 62.879999999999995, "y2": 225.12}}, {"filename": "../figure/image/1045-Table2-1.png", "caption": "Table 2: Example patterns that are used to extract effect phrases (bold) from sample sentences.", "page": 4, "bbox": {"x1": 88.8, "x2": 509.28, "y1": 63.839999999999996, "y2": 126.24}}, {"filename": "../figure/image/1045-Figure3-1.png", "caption": "Figure 3: Examples of image search results.", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 525.12, "y1": 166.56, "y2": 255.35999999999999}}]}