{"title": "Efficient Low-rank Multimodal Fusion with Modality-Specific Factors", "abstract": "Multimodal research is an emerging field of artificial intelligence, and one of the main research problems in this field is multimodal fusion. The fusion of multimodal data is the process of integrating multiple unimodal representations into one compact multimodal representation. Previous research in this field has exploited the expressiveness of tensors for multimodal representation. However, these methods often suffer from exponential increase in dimensions and in computational complexity introduced by transformation of input into tensor. In this paper, we propose the Lowrank Multimodal Fusion method, which performs multimodal fusion using low-rank tensors to improve efficiency. We evaluate our model on three different tasks: multimodal sentiment analysis, speaker trait analysis, and emotion recognition. Our model achieves competitive results on all these tasks while drastically reducing computational complexity. Additional experiments also show that our model can perform robustly for a wide range of low-rank settings, and is indeed much more efficient in both training and inference compared to other methods that utilize tensor representations.", "text": [{"id": 0, "string": "Introduction Multimodal research has shown great progress in a variety of tasks as an emerging research field of artificial intelligence."}, {"id": 1, "string": "Tasks such as speech recognition (Yuhas et al., 1989) , emotion recognition, (De Silva et al., 1997) , (Chen et al., 1998) , (Wöllmer et al., 2013) , sentiment analysis, (Morency et al., 2011 ) * equal contributions as well as speaker trait analysis and media description (Park et al., 2014a) have seen a great boost in performance with developments in multimodal research."}, {"id": 2, "string": "However, a core research challenge yet to be solved in this domain is multimodal fusion."}, {"id": 3, "string": "The goal of fusion is to combine multiple modalities to leverage the complementarity of heterogeneous data and provide more robust predictions."}, {"id": 4, "string": "In this regard, an important challenge has been on scaling up fusion to multiple modalities while maintaining reasonable model complexity."}, {"id": 5, "string": "Some of the recent attempts (Fukui et al., 2016) ,  at multimodal fusion investigate the use of tensors for multimodal representation and show significant improvement in performance."}, {"id": 6, "string": "Unfortunately, they are often constrained by the exponential increase of cost in computation and memory introduced by using tensor representations."}, {"id": 7, "string": "This heavily restricts the applicability of these models, especially when we have more than two views of modalities in the dataset."}, {"id": 8, "string": "In this paper, we propose the Low-rank Multimodal Fusion, a method leveraging low-rank weight tensors to make multimodal fusion efficient without compromising on performance."}, {"id": 9, "string": "The overall architecture is shown in Figure 1 ."}, {"id": 10, "string": "We evaluated our approach with experiments on three multimodal tasks using public datasets and compare its performance with state-of-the-art models."}, {"id": 11, "string": "We also study how different low-rank settings impact the performance of our model and show that our model performs robustly within a wide range of rank settings."}, {"id": 12, "string": "Finally, we perform an analysis of the impact of our method on the number of parameters and run-time with comparison to other fusion methods."}, {"id": 13, "string": "Through theoretical analysis, we show that our model can scale linearly in the number of modalities, and our experiments also show a corresponding speedup in training when compared with Overview of our Low-rank Multimodal Fusion model structure: LMF first obtains the unimodal representation z a , z v , z l by passing the unimodal inputs x a , x v , x l into three sub-embedding networks f v , f a , f l respectively."}, {"id": 14, "string": "LMF produces the multimodal output representation by performing low-rank multimodal fusion with modality-specific factors."}, {"id": 15, "string": "The multimodal representation can be then used for generating prediction tasks."}, {"id": 16, "string": "other tensor-based models."}, {"id": 17, "string": "The main contributions of our paper are as follows: • We propose the Low-rank Multimodal Fusion method for multimodal fusion that can scale linearly in the number of modalities."}, {"id": 18, "string": "• We show that our model compares to state-ofthe-art models in performance on three multimodal tasks evaluated on public datasets."}, {"id": 19, "string": "• We show that our model is computationally efficient and has fewer parameters in comparison to previous tensor-based methods."}, {"id": 20, "string": "Related Work Multimodal fusion enables us to leverage complementary information present in multimodal data, thus discovering the dependency of information on multiple modalities."}, {"id": 21, "string": "Previous studies have shown that more effective fusion methods translate to better performance in models, and there's been a wide range of fusion methods."}, {"id": 22, "string": "Early fusion is a technique that uses feature concatenation as the method of fusion of different views."}, {"id": 23, "string": "Several works that use this method of fusion (Poria et al., 2016) , (Wang et al., 2016) use input-level feature concatenation and use the concatenated features as input, sometimes even removing the temporal dependency present in the modalities (Morency et al., 2011) ."}, {"id": 24, "string": "The drawback of this class of method is that although it achieves fusion at an early stage, intra-modal interactions are potentially suppressed, thus losing out on the context and temporal dependencies within each modality."}, {"id": 25, "string": "On the other hand, late fusion builds separate models for each modality and then integrates the outputs together using a method such as majority voting or weighted averaging (Wortwein and Scherer, 2017) , (Nojavanasghari et al., 2016) ."}, {"id": 26, "string": "Since separate models are built for each modality, inter-modal interactions are usually not modeled effectively."}, {"id": 27, "string": "Given these shortcomings, more recent work focuses on intermediate approaches that model both intra-and inter-modal dynamics."}, {"id": 28, "string": "Fukui et al."}, {"id": 29, "string": "(2016) proposes to use Compact Bilinear Pooling over the outer product of visual and linguistic representations to exploit the interactions between vision and language for visual question answering."}, {"id": 30, "string": "Similar to the idea of exploiting interactions,  proposes Tensor Fusion Network, which computes the outer product between unimodal representations from three different modalities to compute a tensor representation."}, {"id": 31, "string": "These methods exploit tensor representations to model inter-modality interactions and have shown a great success."}, {"id": 32, "string": "However, such methods suffer from exponentially increasing computational complexity, as the outer product over multiple modalities results in extremely high dimensional tensor representations."}, {"id": 33, "string": "For unimodal data, the method of low-rank tensor approximation has been used in a variety of applications to implement more efficient tensor operations."}, {"id": 34, "string": "Razenshteyn et al."}, {"id": 35, "string": "(2016) proposes a modified weighted version of low-rank approximation, and Koch and Lubich (2010) applies the method towards temporally dependent data to obtain lowrank approximations."}, {"id": 36, "string": "As for applications, Lei et al."}, {"id": 37, "string": "(2014) proposes a low-rank tensor technique for dependency parsing while Wang and Ahuja (2008) uses the method of low-rank approximation applied directly on multidimensional image data (Datumas-is representation) to enhance computer vision applications."}, {"id": 38, "string": "Hu et al."}, {"id": 39, "string": "(2017) proposes a low-rank tensor-based fusion framework to improve the face recognition performance using the fusion of facial attribute information."}, {"id": 40, "string": "However, none of these previous work aims to apply low-rank tensor techniques for multimodal fusion."}, {"id": 41, "string": "Our Low-rank Multimodal Fusion method provides a much more efficient method to compute tensor-based multimodal representations with much fewer parameters and computational complexity."}, {"id": 42, "string": "The efficiency and performance of our approach are evaluated on different downstream tasks, namely sentiment analysis, speaker-trait recognition and emotion recognition."}, {"id": 43, "string": "Low-rank Multimodal Fusion In this section, we start by formulating the problem of multimodal fusion and introducing fusion methods based on tensor representations."}, {"id": 44, "string": "Tensors are powerful in their expressiveness but do not scale well to a large number of modalities."}, {"id": 45, "string": "Our proposed model decomposes the weights into low-rank factors, which reduces the number of parameters in the model."}, {"id": 46, "string": "This decomposition can be performed efficiently by exploiting the parallel decomposition of low-rank weight tensor and input tensor to compute tensor-based fusion."}, {"id": 47, "string": "Our method is able to scale linearly with the number of modalities."}, {"id": 48, "string": "Multimodal Fusion using Tensor Representations In this paper, we formulate multimodal fusion as a multilinear function which are encoding unimodal information of the M different modalities, the goal of multimodal fusion is to integrate the unimodal representations into one compact multimodal representation for downstream tasks."}, {"id": 49, "string": "Tensor representation is one successful approach for multimodal fusion."}, {"id": 50, "string": "It first requires a transformation of the input representations into a highdimensional tensor and then mapping it back to a lower-dimensional output vector space."}, {"id": 51, "string": "Previous works have shown that this method is more effective than simple concatenation or pooling in terms of capturing multimodal interactions , (Fukui et al., 2016) ."}, {"id": 52, "string": "Tensors are usually created by taking the outer product over the input modalities."}, {"id": 53, "string": "In addition, in order to be able to model the interactions between any subset of modalities using one tensor,  proposed a simple extension to append 1s to the unimodal representations before taking the outer product."}, {"id": 54, "string": "The input tensor Z formed by the unimodal representation is computed by: f ∶ V 1 × V 2 × ... × V M → H where V 1 , V 2 , ..., V M are Z = M ⊗ m=1 z m , z m ∈ R dm (1) where ⊗ M m=1 denotes the tensor outer product over a set of vectors indexed by m, and z m is the input representation with appended 1s."}, {"id": 55, "string": "The input tensor Z ∈ R d 1 ×d 2 ×...d M is then passed through a linear layer g(⋅) to to produce a vector representation: h = g(Z; W, b) = W ⋅ Z + b, h, b ∈ R dy (2) where W is the weight of this layer and b is the bias."}, {"id": 56, "string": "With Z being an order-M tensor (where M is the number of input modalities), the weight W will naturally be a tensor of order-(M + 1) in Figure 2 for the bi-modal case."}, {"id": 57, "string": "One of the main drawbacks of tensor fusion is that we have to explicitly create the highdimensional tensor Z."}, {"id": 58, "string": "The dimensionality of Z will increase exponentially with the number of modalities as ∏ M m=1 d m ."}, {"id": 59, "string": "The number of parameters to learn in the weight tensor W will also increase exponentially."}, {"id": 60, "string": "This not only introduces a lot of computation but also exposes the model to risks of overfitting."}, {"id": 61, "string": "R d 1 ×d 2 ×...×d M ×d h ."}, {"id": 62, "string": "The extra (M + 1)-th dimension Low-rank Multimodal Fusion with Modality-Specific Factors As a solution to the problems of tensor-based fusion, we propose Low-rank Multimodal Fusion (LMF)."}, {"id": 63, "string": "LMF parameterizes g(⋅) from Equation 2 with a set of modality-specific low-rank factors that can be used to recover a low-rank weight tensor, in contrast to the full tensor W. Moreover, we show that by decomposing the weight into a set of low-rank factors, we can exploit the fact that the tensor Z actually decomposes into {z m } M m=1 , which allows us to directly compute the output h without explicitly tensorizing the unimodal representations."}, {"id": 64, "string": "LMF reduces the number of parameters as well as the computation complexity involved in tensorization from being exponential in M to linear."}, {"id": 65, "string": "Low-rank Weight Decomposition The idea of LMF is to decompose the weight tensor W into M sets of modality-specific factors."}, {"id": 66, "string": "However, since W itself is an order-(M + 1) tensor, commonly used methods for decomposition will result in M + 1 parts."}, {"id": 67, "string": "Hence, we still adopt the view introduced in Section 3.1 that W is formed by d h order-M tensors W k ∈ R d 1 ×...×d M , k = 1, ..., d h stacked together."}, {"id": 68, "string": "We can then decompose each W k separately."}, {"id": 69, "string": "For an order-M tensor W k ∈ R d 1 ×...×d M , there always exists an exact decomposition into vectors in the form of: W k = R i=1 M ⊗ m=1 w (i) m,k , w (i) m,k ∈ R d m (3) The minimal R that makes the decomposition valid is called the rank of the tensor."}, {"id": 70, "string": "The vector sets {{w (i) m,k } M m=1 } R i=1 are called the rank R decomposition factors of the original tensor."}, {"id": 71, "string": "In LMF, we start with a fixed rank r, and parameterize the model with r decomposition factors {{w (i) m,k } M m=1 } r i=1 , k = 1, ."}, {"id": 72, "string": ".., d h that can be used to reconstruct a low-rank version of these W k ."}, {"id": 73, "string": "We can regroup and concatenate these vectors into M modality-specific low-rank factors."}, {"id": 74, "string": "Let w (i) m = [w (i) m,1 , w (i) m,2 , ..., w (i) m,d h ], then for modality m, {w (i) m } r i=1 is its corresponding low-rank factors."}, {"id": 75, "string": "And we can recover a low-rank weight tensor by: W = r i=1 M ⊗ m=1 w (i) m (4) Hence equation 2 can be computed by h = r i=1 M ⊗ m=1 w (i) m ⋅ Z (5) Note that for all m, w (i) m ∈ R dm×d h shares the same size for the second dimension."}, {"id": 76, "string": "We define their outer product to be over only the dimensions that are not shared: w (i) m ⊗ w (i) n ∈ R dm×dn×d h ."}, {"id": 77, "string": "A bimodal example of this procedure is illustrated in Figure 3 ."}, {"id": 78, "string": "Nevertheless, by introducing the low-rank factors, we now have to compute the reconstruction of W = ∑ r i=1 ⊗ M m=1 w (i) m for the forward computation."}, {"id": 79, "string": "Yet this introduces even more computation."}, {"id": 80, "string": "Efficient Low-rank Fusion Exploiting Parallel Decomposition In this section, we will introduce an efficient procedure for computing h, exploiting the fact that tensor Z naturally decomposes into the original input {z m } M m=1 , which is parallel to the modalityspecific low-rank factors."}, {"id": 81, "string": "In fact, that is the main reason why we want to decompose the weight tensor into M modality-specific factors."}, {"id": 82, "string": "Using the fact that Z = ⊗ M m=1 z m , we can simplify equation 5: where Λ M m=1 denotes the element-wise product over a sequence of tensors: Λ 3 h = r i=1 M ⊗ m=1 w (i) m ⋅ Z = r i=1 M ⊗ m=1 w (i) m ⋅ Z = r i=1 M ⊗ m=1 w (i) m ⋅ M ⊗ m=1 z m = M Λ m=1 r i=1 w (i) m ⋅ z m ( t=1 x t = x 1 ○ x 2 ○ x 3 ."}, {"id": 83, "string": "An illustration of the trimodal case of equation 6 is shown in Figure 1 ."}, {"id": 84, "string": "We can also derive equation 6 for a bimodal case to clarify what it does: h = r i=1 w (i) a ⊗ w (i) v ⋅ Z = r i=1 w (i) a ⋅ z a ○ r i=1 w (i) v ⋅ z v (7) An important aspect of this simplification is that it exploits the parallel decomposition of both Z and W, so that we can compute h without actually creating the tensor Z from the input representations z m ."}, {"id": 85, "string": "In addition, different modalities are decoupled in the simplified computation of h, which allows for easy generalization of our approach to an arbitrary number of modalities."}, {"id": 86, "string": "Adding a new modality can be simply done by adding another set of modality-specific factors and extend Equation 7."}, {"id": 87, "string": "Last but not least, Equation 6 consists of fully differentiable operations, which enables the parameters {w (i) m } r i=1 m = 1, ..., M to be learned end-to-end via back-propagation."}, {"id": 88, "string": "Using Equation 6, we can compute h directly from input unimodal representations and their modal-specific decomposition factors, avoiding the weight-lifting of computing the large input tensor Z and W, as well as the r linear transformation."}, {"id": 89, "string": "Instead, the input tensor and subsequent linear projection are computed implicitly together in Equation 6, and this is far more efficient than the original method described in Section 3.1."}, {"id": 90, "string": "Indeed, LMF reduces the computation complexity of tensorization and fusion from O(d y ∏ M m=1 d m ) to O(d y × r × ∑ M m=1 d m ) ."}, {"id": 91, "string": "In practice, we use a slightly different form of Equation 6, where we concatenate the low-rank factors into M order-3 tensors and swap the order in which we do the element-wise product and summation: h = r i=1 M Λ m=1 w (1) m , w (2) m , ..., w (r) m ⋅ẑ m i,∶ (8) and now the summation is done along the first dimension of the bracketed matrix."}, {"id": 92, "string": "[⋅] i,∶ indicates the i-th slice of a matrix."}, {"id": 93, "string": "In this way, we can parameterize the model with M order-3 tensors, instead of parameterizing with sets of vectors."}, {"id": 94, "string": "Experimental Methodology We compare LMF with previous state-of-the-art baselines, and we use the Tensor Fusion Networks (TFN)  as a baseline for tensorbased approaches, which has the most similar structure with us except that it explicitly forms the large multi-dimensional tensor for fusion across different modalities."}, {"id": 95, "string": "We design our experiments to better understand the characteristics of LMF."}, {"id": 96, "string": "Our goal is to answer the following four research questions: (1) Impact of Multimodal Low-rank Fusion: Direct comparison between our proposed LMF model and the previous TFN model."}, {"id": 97, "string": "(2) Comparison with the State-of-the-art: We evaluate the performance of LMF and state-of-theart baselines on three different tasks and datasets."}, {"id": 98, "string": "(3) Complexity Analysis: We study the modal complexity of LMF and compare it with the TFN model."}, {"id": 99, "string": "(4) Rank Settings: We explore performance of LMF with different rank settings."}, {"id": 100, "string": "The results of these experiments are presented in Section 5."}, {"id": 101, "string": "Datasets We perform our experiments on the following multimodal datasets, CMU-MOSI (Zadeh et al., 2016a) ,  POM (Park et al., 2014b) , and IEMOCAP (Busso et al., 2008) for sentiment analysis, speaker traits recognition, and emotion recognition task, where the goal is to identify speakers emotions based on the speakers' verbal and nonverbal behaviors."}, {"id": 102, "string": "Features Each dataset consists of three modalities, namely language, visual, and acoustic modalities."}, {"id": 103, "string": "To reach the same time alignment across modalities, we perform word alignment using P2FA (Yuan and Liberman, 2008) which allows us to align the three modalities at the word granularity."}, {"id": 104, "string": "We calculate the visual and acoustic features by taking the average of their feature values over the word time interval ."}, {"id": 105, "string": "Language We use pre-trained 300-dimensional Glove word embeddings (Pennington et al., 2014) to encode a sequence of transcribed words into a sequence of word vectors."}, {"id": 106, "string": "Visual The library Facet 1 is used to extract a set of visual features for each frame (sampled at 30Hz) including 20 facial action units, 68 facial landmarks, head pose, gaze tracking and HOG features (Zhu et al., 2006) ."}, {"id": 107, "string": "Acoustic We use COVAREP acoustic analysis framework (Degottex et al., 2014) to extract a set of low-level acoustic features, including 12 Mel frequency cepstral coefficients (MFCCs), pitch, voiced/unvoiced segmentation, glottal source, peak slope, and maxima dispersion quotient features."}, {"id": 108, "string": "Model Architecture In order to compare our fusion method with previous work, we adopt a simple and straightforward model architecture 2 for extracting unimodal representations."}, {"id": 109, "string": "Since we have three modalities for each dataset, we simply designed three unimodal sub-embedding networks, denoted as f a , f v , f l , to extract unimodal representations z a , z v , z l from unimodal input features x a , x v , x l ."}, {"id": 110, "string": "For acoustic and visual modality, the sub-embedding network is a simple 2-layer feed-forward neural network, and for language modality, we used an LSTM (Hochreiter and Schmidhuber, 1997) to extract representations."}, {"id": 111, "string": "The model architecture is illustrated in Figure 1 ."}, {"id": 112, "string": "Baseline Models We compare the performance of LMF to the following baselines and state-of-the-art models in multimodal sentiment analysis, speaker trait recognition, and emotion recognition."}, {"id": 113, "string": "Support Vector Machines Support Vector Machines (SVM) (Cortes and Vapnik, 1995) is a widely used non-neural classifier."}, {"id": 114, "string": "This baseline is trained on the concatenated multimodal features for classification or regression task (Pérez-Rosas et al., 2013) , (Park et al., 2014a) , (Zadeh et al., 2016b) ."}, {"id": 115, "string": "Deep Fusion The Deep Fusion model (DF) (Nojavanasghari et al., 2016) trains one deep neural model for each modality and then combine the output of each modality network with a joint neural network."}, {"id": 116, "string": "Tensor Fusion Network The Tensor Fusion Network (TFN)  explicitly models view-specific and cross-view dynamics by creating a multi-dimensional tensor that captures uni-modal, bimodal and trimodal interactions across three modalities."}, {"id": 117, "string": "Memory Fusion Network The Memory Fusion Network (MFN) (Zadeh et al., 2018a) accounts for view-specific and cross-view interactions and continuously models them through time with a special attention mechanism and summarized through time with a Multi-view Gated Memory."}, {"id": 118, "string": "Bidirectional Contextual LSTM The Bidirectional Contextual LSTM (BC-LSTM) , (Fukui et al., 2016) performs contextdependent fusion of multimodal data."}, {"id": 119, "string": "Multi-View LSTM The Multi-View LSTM (MV-LSTM) (Rajagopalan et al., 2016) aims to capture both modality-specific and cross-modality interactions from multiple modalities by partitioning the memory cell and the gates corresponding to multiple modalities."}, {"id": 120, "string": "Multi-attention Recurrent Network The Multiattention Recurrent Network (MARN) (Zadeh et al., 2018b) explicitly models interactions between modalities through time using a neural component called the Multi-attention Block (MAB) and storing them in the hybrid memory called the Long-short Term Hybrid Memory (LSTHM)."}, {"id": 121, "string": "Evaluation Metrics Multiple evaluation tasks are performed during our evaluation: multi-class classification and regression."}, {"id": 122, "string": "The multi-class classification task is applied to all three multimodal datasets, and the regression task is applied to the CMU-MOSI and the POM dataset."}, {"id": 123, "string": "For binary classification and multiclass classification, we report F1 score and accuracy Acc−k where k denotes the number of classes."}, {"id": 124, "string": "Specifically, Acc−2 stands for the binary classification."}, {"id": 125, "string": "For regression, we report Mean Absolute Error (MAE) and Pearson correlation (Corr)."}, {"id": 126, "string": "Higher values denote better performance for all metrics except for MAE."}, {"id": 127, "string": "Results and Discussion In this section, we present and discuss the results from the experiments designed to study the research questions introduced in section 4."}, {"id": 128, "string": "Impact of Low-rank Multimodal Fusion In this experiment, we compare our model directly with the TFN model since it has the most similar structure to our model, except that TFN explicitly forms the multimodal tensor fusion."}, {"id": 129, "string": "The com-parison reported in the last two rows of Table 2 demonstrates that our model significantly outperforms TFN across all datasets and metrics."}, {"id": 130, "string": "This competitive performance of LMF compared to TFN emphasizes the advantage of Low-rank Multimodal Fusion."}, {"id": 131, "string": "Comparison with the State-of-the-art We compare our model with the baselines and stateof-the-art models for sentiment analysis, speaker traits recognition and emotion recognition."}, {"id": 132, "string": "Results are shown in Table 2 ."}, {"id": 133, "string": "LMF is able to achieve competitive and consistent results across all datasets."}, {"id": 134, "string": "On the multimodal sentiment regression task, LMF outperforms the previous state-of-the-art model on MAE and Corr."}, {"id": 135, "string": "Note the multiclass accuracy is calculated by mapping the range of continuous sentiment values into a set of intervals that are used as discrete classes."}, {"id": 136, "string": "On the multimodal speaker traits Recognition task, we report the average evaluation score over 16 speaker traits and shows that our model achieves the state-of-the-art performance over all three evaluation metrics on the POM dataset."}, {"id": 137, "string": "On the multimodal emotion recognition task, our model achieves better results compared to the stateof-the-art models across all emotions on the F1 score."}, {"id": 138, "string": "F1-emotion in the evaluation metrics indicates the F1 score for a certain emotion class."}, {"id": 139, "string": "Complexity Analysis Theoretically, the model complexity of our fusion method is O(d y × r × ∑ M m=1 d m ) compared to O(d y ∏ M m=1 d m ) of TFN from Section 3.1."}, {"id": 140, "string": "In practice, we calculate the total number of parameters used in each model, where we choose M = 3, d 1 = 32, d 2 = 32, d 3 = 64, r = 4, d y = 1."}, {"id": 141, "string": "Under this hyper-parameter setting, our model contains about 1.1e6 parameters while TFN contains about 12.5e6 parameters, which is nearly 11 times more."}, {"id": 142, "string": "Note that, the number of parameters above counts not only the parameters in the multimodal fusion stage but also the parameters in the subnetworks."}, {"id": 143, "string": "Furthermore, we evaluate the computational complexity of LMF by measuring the training and testing speeds between LMF and TFN."}, {"id": 144, "string": "Table 3 illustrates the impact of Low-rank Multimodal Fusion on the training and testing speeds compared with TFN model."}, {"id": 145, "string": "Here we set rank to be 4 since it can generally achieve fairly competent performance."}, {"id": 146, "string": "Based on these results, performing a low-rank multimodal fusion with modality-specific low-rank factors significantly reduces the amount of time needed for training and testing the model."}, {"id": 147, "string": "On an NVIDIA Quadro K4200 GPU, LMF trains with an average frequency of 1134.82 IPS (data point inferences per second) while the TFN model trains at an average of 340.74 IPS."}, {"id": 148, "string": "Rank Settings To evaluate the impact of different rank settings for our LMF model, we measure the change in performance on the CMU-MOSI dataset while varying Figure 4 : The Impact of different rank settings on Model Performance: As the rank increases, the results become unstable and low rank is enough in terms of the mean absolute error."}, {"id": 149, "string": "the number of rank."}, {"id": 150, "string": "The results are presented in Figure 4 ."}, {"id": 151, "string": "We observed that as the rank increases, the training results become more and more unstable and that using a very low rank is enough to achieve fairly competent performance."}, {"id": 152, "string": "Conclusion In this paper, we introduce a Low-rank Multimodal Fusion method that performs multimodal fusion with modality-specific low-rank factors."}, {"id": 153, "string": "LMF scales linearly in the number of modalities."}, {"id": 154, "string": "LMF achieves competitive results across different multimodal tasks."}, {"id": 155, "string": "Furthermore, LMF demonstrates a significant decrease in computational complexity from exponential to linear time."}, {"id": 156, "string": "In practice, LMF effectively improves the training and testing efficiency compared to TFN which performs multimodal fusion with tensor representations."}, {"id": 157, "string": "Future work on similar topics could explore the applications of using low-rank tensors for attention models over tensor representations, as they can be even more memory and computationally intensive."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 19}, {"section": "Related Work", "n": "2", "start": 20, "end": 42}, {"section": "Low-rank Multimodal Fusion", "n": "3", "start": 43, "end": 47}, {"section": "Multimodal Fusion using Tensor Representations", "n": "3.1", "start": 48, "end": 61}, {"section": "Low-rank Multimodal Fusion with Modality-Specific Factors", "n": "3.2", "start": 62, "end": 64}, {"section": "Low-rank Weight Decomposition", "n": "3.2.1", "start": 65, "end": 79}, {"section": "Efficient Low-rank Fusion Exploiting Parallel Decomposition", "n": "3.2.2", "start": 80, "end": 93}, {"section": "Experimental Methodology", "n": "4", "start": 94, "end": 98}, {"section": "Datasets", "n": "4.1", "start": 99, "end": 101}, {"section": "Features", "n": "4.2", "start": 102, "end": 107}, {"section": "Model Architecture", "n": "4.3", "start": 108, "end": 111}, {"section": "Baseline Models", "n": "4.4", "start": 112, "end": 120}, {"section": "Evaluation Metrics", "n": "4.5", "start": 121, "end": 124}, {"section": "Results and Discussion", "n": "5", "start": 125, "end": 127}, {"section": "Impact of Low-rank Multimodal Fusion", "n": "5.1", "start": 128, "end": 130}, {"section": "Comparison with the State-of-the-art", "n": "5.2", "start": 131, "end": 138}, {"section": "Complexity Analysis", "n": "5.3", "start": 139, "end": 147}, {"section": "Rank Settings", "n": "5.4", "start": 148, "end": 151}, {"section": "Conclusion", "n": "6", "start": 152, "end": 157}], "figures": [{"filename": "../figure/image/1058-Table1-1.png", "caption": "Table 1: The speaker independent data splits for training, validation, and test sets.", "page": 5, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 62.879999999999995, "y2": 114.24}}, {"filename": "../figure/image/1058-Figure1-1.png", "caption": "Figure 1: Overview of our Low-rank Multimodal Fusion model structure: LMF first obtains the unimodal representation za, zv, zl by passing the unimodal inputs xa, xv, xl into three sub-embedding networks fv, fa, fl respectively. LMF produces the multimodal output representation by performing low-rank multimodal fusion with modality-specific factors. The multimodal representation can be then used for generating prediction tasks.", "page": 1, "bbox": {"x1": 74.39999999999999, "x2": 522.24, "y1": 66.72, "y2": 274.08}}, {"filename": "../figure/image/1058-Figure4-1.png", "caption": "Figure 4: The Impact of different rank settings on Model Performance: As the rank increases, the results become unstable and low rank is enough in terms of the mean absolute error.", "page": 7, "bbox": {"x1": 72.0, "x2": 302.4, "y1": 565.4399999999999, "y2": 708.9599999999999}}, {"filename": "../figure/image/1058-Table3-1.png", "caption": "Table 3: Comparison of the training and testing speeds between TFN and LMF. The second and the third columns indicate the number of data point inferences per second (IPS) during training and testing time respectively. Both models are implemented in the same framework with equivalent running environment.", "page": 7, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 214.56, "y2": 247.2}}, {"filename": "../figure/image/1058-Figure2-1.png", "caption": "Figure 2: Tensor fusion via tensor outer product", "page": 3, "bbox": {"x1": 75.84, "x2": 286.56, "y1": 65.75999999999999, "y2": 150.23999999999998}}, {"filename": "../figure/image/1058-Figure3-1.png", "caption": "Figure 3: Decomposing weight tensor into low-rank factors (See Section 3.2.1 for details.)", "page": 4, "bbox": {"x1": 77.75999999999999, "x2": 521.28, "y1": 67.67999999999999, "y2": 183.35999999999999}}]}