{"title": "Analyzing Linguistic Differences between Owner and Staff Attributed Tweets", "abstract": "Research on social media has to date assumed that all posts from an account are authored by the same person. In this study, we challenge this assumption and study the linguistic differences between posts signed by the account owner or attributed to their staff. We introduce a novel data set of tweets posted by U.S. politicians who self-reported their tweets using a signature. We analyze the linguistic topics and style features that distinguish the two types of tweets. Predictive results show that we are able to distinguish between owner and staff attributed tweets with good accuracy, even when not using any training data from that account.", "text": [{"id": 0, "string": "Introduction Social media has become one of the main venues for breaking news that come directly from primary sources."}, {"id": 1, "string": "Platforms such as Twitter have started to play a key role in elections (Politico, 2017) and have become widely used by public figures to disseminate their activities and opinions."}, {"id": 2, "string": "However, posts are rarely authored by the public figure who owns the account; rather, they are posted by staff who update followers on the thoughts, stances and activities of the owner."}, {"id": 3, "string": "This study introduces a new application of Natural Language Processing: predicting which posts from a Twitter account are authored by the owner of an account."}, {"id": 4, "string": "Direct applications include predicting owner authored tweets for unseen users and can be useful to political or PR advisers to gain a better understanding on how to craft more personal or engaging messages."}, {"id": 5, "string": "Past research has experimented with predicting user types or traits from tweets (Pennacchiotti and Popescu, 2011; McCorriston et al., 2015) ."}, {"id": 6, "string": "However, all these studies have relied on the assumption that tweets posted from an account were all written by the same person."}, {"id": 7, "string": "No previous study has looked at predicting which tweets from the same Twitter account were authored by different persons, here staffers or the owner of the Twitter account."}, {"id": 8, "string": "Figure 1 shows an example of a U.S. politician who signs their tweets by adding '-PM' at the end of the tweet."}, {"id": 9, "string": "Staff posts are likely to be different in terms of topics, style, timing or impact to posts attributed to the owner of the account."}, {"id": 10, "string": "The goal of the present study is thus to: • analyze linguistic differences between the two types of tweets in terms of words, topics, style, type and impact; • build a model that predicts if a tweet is attributed to the account owner or their staff."}, {"id": 11, "string": "To this end, we introduce a novel data set consisting of over 200,000 tweets from accounts of 147 U.S. politicians that are attributed to the owner or their staff."}, {"id": 12, "string": "1 Evaluation on unseen accounts leads to an accuracy of up to .741 AUC."}, {"id": 13, "string": "Similar account sharing behaviors exists in several other domains such as Twitter accounts of entertainers (artists, TV hosts), public figures or CEOs who employ staff to author their tweets or with organi-zational accounts, which alternate between posting messages about important company updates and tweets about promotions, PR activity or customer service."}, {"id": 14, "string": "Direct applications of our analysis include automatically predicting staff tweets for unseen users and gaining a better understanding on how to craft more personal messages which can be useful to political or PR advisers."}, {"id": 15, "string": "Related Work Several studies have looked at predicting the type of a Twitter account, most frequently between individual or organizational, using linguistic features (De Choudhury et al., 2012; McCorriston et al., 2015; Mac Kim et al., 2017) ."}, {"id": 16, "string": "A broad literature has been devoted to predicting personal traits from language use on Twitter, such as gender (Burger et al., 2011) , age (Nguyen et al., 2011) , geolocation (Cheng et al., 2010) , political preference (Volkova et al., 2014; , income , impact (Lampos et al., 2014) , socioeconomic status (Aletras and Chamberlain, 2018) , race (Preoţiuc-Pietro and Ungar, 2018) or personality (Schwartz et al., 2013a; Preoţiuc-Pietro et al., 2016 )."}, {"id": 17, "string": "Related to our task is authorship attribution, where the goal is to predict the author of a given text."}, {"id": 18, "string": "With few exceptions (Schwartz et al., 2013b) , this was attempted on larger documents or books (Popescu and Dinu, 2007; Stamatatos, 2009; Juola et al., 2008; Koppel et al., 2009 )."}, {"id": 19, "string": "In our case, the experiments are set up as the same binary classification task regardless of the account (owner vs. staffer) which, unlike authorship attribution, allows for experiments across multiple user accounts."}, {"id": 20, "string": "Additionally, in most authorship attribution studies, differences between authors consist mainly of the topics they write about."}, {"id": 21, "string": "Our experimental setup limits the extent to which topic presence impacts the prediction, as all tweets are posted by US politicians and within the topics of the tweets from an account should be similar to each other."}, {"id": 22, "string": "Pastiche detection is another related area of research (Dinu et al., 2012) , where models are trained to distinguish between an original text and a text written by one who aims to imitate the style of the original author, resulting in the documents having similar topics."}, {"id": 23, "string": "Data We build a data set of Twitter accounts used by both the owner (the person who the account represents) and their staff."}, {"id": 24, "string": "Several Twitter users attribute the authorship of a subset of their tweets to themselves by signing these with their initials or a hashtag, following the example of Barack Obama (Time, 2011) ."}, {"id": 25, "string": "The rest of the tweets are implicitly attributed to their staff."}, {"id": 26, "string": "Thus, we use the Twitter user description to identify potential accounts where owners sign their tweets."}, {"id": 27, "string": "We collect in total 1,365 potential user descriptions from Twitter that match a set of keyphrases indicative of personal tweet signatures (i.e., tweets by me signed, tweets signed, tweets are signed, staff unless noted, tweets from staff unless signed, tweets signed by, my tweets are signed)."}, {"id": 28, "string": "We then manually check all descriptions and filter out those not mentioning a signature, leaving us with 628 accounts."}, {"id": 29, "string": "We aim to perform our analysis on a set of users from the same domain to limit variations caused by topic and we observe that the most numerous category of users who sign their messages are U.S. politicians, which leaves us with 147 accounts."}, {"id": 30, "string": "We download all the tweets posted by these accounts that are accessible through the Twitter API (a maximum of 3,200)."}, {"id": 31, "string": "We remove the retweets made by an account, as these are not attributed to either the account owner or their staff."}, {"id": 32, "string": "This results in a data set with a total of 202,024 tweets."}, {"id": 33, "string": "We manually identified each user's signature from their profile description."}, {"id": 34, "string": "To assign labels to tweets, we automatically matched the signature to each tweet using a regular expression."}, {"id": 35, "string": "We remove the signature from all predictive experiments and feature analyses as this would make the classification task trivial."}, {"id": 36, "string": "In total, 9,715 tweets (4.8% of the total) are signed by the account owners."}, {"id": 37, "string": "While our task is to predict if a tweet is attributed to the owner or its staff, we assume this as a proxy to authorship if account owners are truthful when using the signature in their tweets."}, {"id": 38, "string": "There is little incentive for owners to be untruthful, with potentially serious negative ramifications associated with public deception."}, {"id": 39, "string": "We use DLATK, which handles social media content and markup such as emoticons or hashtags (Schwartz et al., 2017) ."}, {"id": 40, "string": "Further, we anonymize all usernames present in the tweet and URLs and replace them with placeholder tokens."}, {"id": 41, "string": "Features We use a broad set of linguistic features motivated by past research on user trait prediction  in our attempt to predict and interpret the difference between owner and staff attributed tweets."}, {"id": 42, "string": "These include: LIWC."}, {"id": 43, "string": "Traditional psychology studies use a dictionary-based approach to representing text."}, {"id": 44, "string": "The most popular method is based on Linguistic Inquiry and Word Count (LIWC) (Pennebaker et al., 2001) consisting of 73 manually constructed lists of words (Pennebaker et al., 2015) including some specific parts-of-speech, topical or stylistic categories."}, {"id": 45, "string": "Each message is thereby represented as a frequency distribution over these categories."}, {"id": 46, "string": "Word2Vec Clusters."}, {"id": 47, "string": "An alternative to LIWC is to use automatically generated word clusters."}, {"id": 48, "string": "These clusters of words can be thought of as topics, i.e., groups of words that are semantically and/or syntactically similar."}, {"id": 49, "string": "The clusters help reduce the feature space and provide good interpretability."}, {"id": 50, "string": "We use the method by  to compute topics using Word2Vec similarity (Mikolov et al., 2013) and spectral clustering (Shi and Malik, 2000; von Luxburg, 2007) of different sizes."}, {"id": 51, "string": "We present results using 200 topics as this gave the best predictive results."}, {"id": 52, "string": "Each message is thus represented as an unweighted distribution over clusters."}, {"id": 53, "string": "Sentiment & Emotions."}, {"id": 54, "string": "We also investigate the extent to which tweets posted by the account owner express more or fewer emotions."}, {"id": 55, "string": "The most popular model of discrete emotions is the Ekman model (Ekman, 1992; Strapparava and Mihalcea, 2008; Strapparava et al., 2004) which posits the existence of six basic emotions: anger, disgust, fear, joy, sadness and surprise."}, {"id": 56, "string": "We automatically quantify these emotions from our Twitter data set using a publicly available crowd-sourcing derived lexicon of words associated with any of the six emotions, as well as general positive and negative sentiment Turney, 2010, 2013) ."}, {"id": 57, "string": "Using these models, we assign sentiment and emotion probabilities to each message."}, {"id": 58, "string": "Unigrams."}, {"id": 59, "string": "We use the bag-of-words representation to reduce each message to a normalised frequency distribution over the vocabulary consisting of all words used by at least 20% of the users (2,099 words in total)."}, {"id": 60, "string": "We chose this smaller vocabulary that is more representative of words used by a larger set of users such that models would be able to transfer better to unseen users."}, {"id": 61, "string": "Tweet Features."}, {"id": 62, "string": "We compute additional tweetlevel features such as: the length in characters and tokens (Length), the type of tweet encoding if this is an @-reply or contains a URL (Tweet Type), the time of the tweet represented as a one-hot vector over the hour of day and day of week (Post Time) and the number of retweets and likes the tweet received (Impact)."}, {"id": 63, "string": "Although the latter features are not available in a real-time predictive scenario, they are useful for analysis."}, {"id": 64, "string": "Prediction Our hypothesis is that tweets attributed to the owner of the account are different than those attributed to staff, and that these patterns generalize to held-out accounts not included in the training data."}, {"id": 65, "string": "Hence, we build predictive models and test them in two setups."}, {"id": 66, "string": "First, we split the users into ten folds."}, {"id": 67, "string": "Tweets used in training are all posted by 80% of the users, tweets from 10% of the users are used for hyperparameter tuning and tweets from the final 10% of the users are used in testing (Users)."}, {"id": 68, "string": "In the second experimental setup, we split all tweets into ten folds using the same split sizes (Tweets)."}, {"id": 69, "string": "We report the average performance across the ten folds."}, {"id": 70, "string": "Due to class imbalance -only 4.8% of tweets are posted by the account owners -results are measured in ROC AUC, which is a more suitable metric in this setup."}, {"id": 71, "string": "In our predictive experiments, we used logistic regression with Elastic Net regularization."}, {"id": 72, "string": "As features, we use all feature types described in the previous section separately as well as together using a logistic regression model combining all feature sets (Combined)."}, {"id": 73, "string": "The results using both experimental setups -holding-out tweets or users -are presented in Table 1 ."}, {"id": 74, "string": "Results show that we can predict owner tweets with good performance and consistently better than chance, even when we have no training data for the users in the test set."}, {"id": 75, "string": "The held-out user experimental setup is more challenging as reflected by lower predictive numbers for most language features, except for the LIWC features."}, {"id": 76, "string": "One potential explanation for the high performance of the LIWC features in this setup is that these are low dimensional and are better at identifying general patterns which transfer better to unseen users rather than overfit the users from the training data."}, {"id": 77, "string": "Table 1 : Predictive results with each feature type for classifying tweets attributed to account owners or staffers, measured using ROC AUC."}, {"id": 78, "string": "Evaluation is performed using 10-fold cross-validation by holding out in each fold either: 10% of the tweets (Tweets) or all tweets posted by 10% of the users (Users)."}, {"id": 79, "string": "Analysis In this section we investigate the linguistic and tweet features distinctive of tweets attributed to the account owner and to staff."}, {"id": 80, "string": "A few accounts are outliers in the frequency of their signed tweets, with up to 80% owner attributed tweets compared to only 4.8% on average."}, {"id": 81, "string": "We perform our analysis on a subset of the data, in order for our linguistic analysis not to be driven by a few prolific users or by any imbalance in the ratio of owner/staff tweets across users."}, {"id": 82, "string": "The data set is obtained as follows."}, {"id": 83, "string": "Each account can contribute a minimum of 10, maximum of 100 owner attributed tweets."}, {"id": 84, "string": "We then sample staff attributed tweets from each account such that these are nine times the number of tweets signed by the owner."}, {"id": 85, "string": "Newer messages are preferred when sampling."}, {"id": 86, "string": "This leads to a data set of 28,150 tweets with exactly a tenth of them attributed to the account owners (2,815)."}, {"id": 87, "string": "We perform analysis of all previously described feature sets using Pearson correlations following Schwartz et al."}, {"id": 88, "string": "(2013a) ."}, {"id": 89, "string": "We compute Pearson correlations independently for each feature between its distribution across messages (features are first normalized to sum up to unit for each message) and a variable encoding if the tweet was attributed to the account owner or not."}, {"id": 90, "string": "We correct for multiple comparisons using Simes correction."}, {"id": 91, "string": "Top unigrams correlated with owner attributed tweets are presented in Table 3 , with the other group textual features (LIWC categories, Word2Vec topics and emotion features) in Table 2 ."}, {"id": 92, "string": "Tweet feature results are presented in Table 4 ."}, {"id": 93, "string": "LIWC Features r Name Top Words .111 FUNCTION to, the, for, in, of, and, a, is, on, out .102 PRONOUN our, we, you, i, your, my, us, his .101 AFFECT great, thank, support, thanks, proud, care .098 SOCIAL our, we, you, your, who, us, his, help, they .107 PREP to, for, in, of, on, at, with, Our analysis shows that owner tweets are associated to a greater extent with language destined to convey emotion or a state of being and to signal a personal relationship with another political figure."}, {"id": 94, "string": "Tweets of congratulations, condolences and support are also specific of signed tweets."}, {"id": 95, "string": "These tweets tend to be retweeted less by others, but get more likes than staff attributed tweets."}, {"id": 96, "string": "Tweets attributed to account owners are more likely to be posted on weekends, are less likely to be replies to others and contain less links to websites or images."}, {"id": 97, "string": "Remarkably, there are no textual features significantly correlated with staff attributed tweets."}, {"id": 98, "string": "An analysis showed that these are more diverse and thus no significant patterns are consistent in association with text features such as unigrams, topic or LIWC categories."}, {"id": 99, "string": "Conclusions This study introduced a novel application of NLP: predicting if tweets from an account are attributed to their owner or to staffers."}, {"id": 100, "string": "Past research on predicting and studying Twitter account characteristics such as type or personal traits (e.g., gender, age) assumed that the same person is authoring all posts from that account."}, {"id": 101, "string": "Using a novel data set, we showed that owner attributed tweets exhibit distinct linguistic patterns to those attributed to staffers."}, {"id": 102, "string": "Even when tested on held-out user accounts, our predictive model of owner tweets reaches an average performance of .741 AUC."}, {"id": 103, "string": "Future work could study other types of accounts with similar posting behaviors such as organizational accounts, explore other sources for ground truth tweet identity information (Robinson, 2016) or study the effects of user traits such as gender or political affiliation in tweeting signed content."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 14}, {"section": "Related Work", "n": "2", "start": 15, "end": 22}, {"section": "Data", "n": "3", "start": 23, "end": 40}, {"section": "Features", "n": "4", "start": 41, "end": 63}, {"section": "Prediction", "n": "5", "start": 64, "end": 78}, {"section": "Analysis", "n": "6", "start": 79, "end": 98}, {"section": "Conclusions", "n": "7", "start": 99, "end": 103}], "figures": [{"filename": "../figure/image/1063-Table1-1.png", "caption": "Table 1: Predictive results with each feature type for classifying tweets attributed to account owners or staffers, measured using ROC AUC. Evaluation is performed using 10-fold cross-validation by holding out in each fold either: 10% of the tweets (Tweets) or all tweets posted by 10% of the users (Users).", "page": 3, "bbox": {"x1": 96.96, "x2": 265.44, "y1": 62.879999999999995, "y2": 221.28}}, {"filename": "../figure/image/1063-Table4-1.png", "caption": "Table 4: Mean values of tweet features in owner and staff attributed tweets. All differences between means shown in this table are significant at p < .001, MannWhitney U test, Simes corrected.", "page": 3, "bbox": {"x1": 333.59999999999997, "x2": 499.2, "y1": 604.8, "y2": 703.1999999999999}}, {"filename": "../figure/image/1063-Table2-1.png", "caption": "Table 2: Pearson correlations of group features (maximum six per type) with owner attributed tweets. No features are significantly correlated with staff attributed tweets. All correlations are significant at p < .01, twotailed t-test, Simes corrected.", "page": 3, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 72.48, "y2": 279.36}}, {"filename": "../figure/image/1063-Table3-1.png", "caption": "Table 3: Unigrams with the highest Pearson correlations to owner tweets. No unigrams are significantly correlated with staff attributed tweets. All correlations are significant at p < .01, two-tailed t-test, Simes corrected.", "page": 3, "bbox": {"x1": 340.8, "x2": 491.03999999999996, "y1": 368.64, "y2": 514.0799999999999}}, {"filename": "../figure/image/1063-Figure1-1.png", "caption": "Figure 1: Example of a politician account where signed tweets are attributed to the account owner.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 221.76, "y2": 375.36}}]}