{"title": "NICT at WAT 2015", "abstract": "Translation systems of our NICT team at the 2nd Workshop on Asian Translation (WAT 2015) are described in this paper. We participated in two translation tasks: Japanese-to-English (JE) and Korean-to-Japanese (KJ). A baseline phrased-based (PB) statistical machine translation (SMT) system in Moses was used. On JE translation, two pre-reordering approaches were applied: a simple reverse preordering and a dependency-based approach. On KJ translation, the processing was purely conducted on character-level. Evaluation results show that even simple approaches can improve JE and KJ PB SMT significantly. These techniques can be easily applied in practice because of the simplicity. 42", "text": [{"id": 0, "string": "Introduction Statistical machine translation (SMT) techniques have been well developed and widely applied in practice."}, {"id": 1, "string": "Linguistic knowledge-free SMT frameworks, such as phrase-based (PB) SMT (Koehn et al., 2003) and hierarchical phrase-based SMT (HIERO) (Chiang, 2007) , handle many translation tasks efficiently as long as sufficient training data prepared."}, {"id": 2, "string": "Further, sophisticated syntacticallydriven approaches (Neubig, 2013) give better performance than PB SMT and HIERO on difficult translation tasks (Neubig, 2014) ."}, {"id": 3, "string": "At the 2nd Workshop on Asian Translation (WAT 2015) (Nakazawa et al., 2015) , our intention is to test the efficiency of several simple techniques for Japanese-to-English (JE) and Korean-to-Japanese (KJ) translation, specifically, pre-reordering approaches for JE translation and character-based processing for KJ translation."}, {"id": 4, "string": "On JE translation, we found the simple reverse preordering approach proposed by Katz-Brown and Collins (2008) performed as well as a welldesigned dependency-based approach, in improving a PB SMT baseline."}, {"id": 5, "string": "Considering the simplicity of the reverse preordering, we think the approach should be used more widely for JE translation."}, {"id": 6, "string": "On KJ translation, we found even a pure character-based approach outperformed the organizer's baseline a lot, due to the similarity of the two languages on their vocabularies and syntaxes."}, {"id": 7, "string": "We give descriptions of the approaches in the following sections."}, {"id": 8, "string": "2 Pre-reordering for JE Translation As Japanese and English have dramatically different word orders, the performance of word reordering affects translation results significantly."}, {"id": 9, "string": "Among different lines of researches, pre-reordering has been widely applied in practice and still studied in recent researches (de Gispert et al., 2015; Hoshino et al., 2015) ."}, {"id": 10, "string": "For the JE translation task of WAT 2015, we test two pre-reordering approaches."}, {"id": 11, "string": "The first one is the reverse preordering (REV-REO) proposed by Katz-Brown and Collins (2008) for the NTCIR-7 JE Patent MT translation task."}, {"id": 12, "string": "Another one is a recently proposed dependency-based approach (DEP-REO) (Ding et al., 2015) 1 with welldesigned rules."}, {"id": 13, "string": "We select the two approaches because they are on two extremes, that REV-REO is an approach needs no syntactic analysis at all, while the DEP-REO makes a good use of the dependency structure of Japanese sentences."}, {"id": 14, "string": "As both approaches have been described in detail in their original papers, We do not give repeated descriptions but just state several details in experiments."}, {"id": 15, "string": "For DEP-REO, the processes were completely identical to the experiments in Ding et al."}, {"id": 16, "string": "(2015) , where the tool chain of MeCab 2 and CaboCha 3 1 A non-refereed version in Japanese is Ding et al."}, {"id": 17, "string": "(2014a) ."}, {"id": 18, "string": "2 http://taku910.github.io/mecab/ 3 http://taku910.github.io/cabocha/ (Kudo and Matsumoto, 2002) based on IPA system for Japanese morphemes was used."}, {"id": 19, "string": "For REV-REO, an important point is to avoid the reordering across punctuations 4 ."}, {"id": 20, "string": "In the experiments, we used four marks to compose the punctuation set: U+002C 5 , U+FF0C 6 , U+3001 7 , and U+3002 8 ."}, {"id": 21, "string": "For the Japanese topic marker wa, which plays the key role of the approach, we did not judge it only by the surface form, but also referred to the specific tag joshi, kakarijoshi 9 ."}, {"id": 22, "string": "Character-based KJ Translation As Korean and Japanese share so many similar features, we tried a purely character-based approach in WAT 2015."}, {"id": 23, "string": "The process was identical to Ding et al."}, {"id": 24, "string": "(2014b) ."}, {"id": 25, "string": "Specifically, no morphological analysis or text normalization 10 were conducted except (unicode) characters were separated using spaces."}, {"id": 26, "string": "The original space is replaced by a <sp> tag and the original tab is replaced by a <tab> tag 11 ."}, {"id": 27, "string": "The processes were applied consistently on training and test sets."}, {"id": 28, "string": "We found even the above-mentioned trivial process led to satisfactory performance on KJ translation."}, {"id": 29, "string": "We further found a post-processing of bracket balancing (because the data contain many brackets) could give a slight improvement in performance."}, {"id": 30, "string": "We will describe the process in the following Section 4."}, {"id": 31, "string": "Experiment and Evaluation We used the PB SMT system in Moses 12 (Koehn et al., 2007) for JE and KJ translation tasks."}, {"id": 32, "string": "Basically, we used identical settings as the organizer used in the baseline."}, {"id": 33, "string": "However, there were several differences as follows."}, {"id": 34, "string": "• We used SRILM 13 (Stolcke, 2002) for lan-4 otherwise the reordering will become excessive."}, {"id": 35, "string": "5 i.e., the ordinary comma."}, {"id": 36, "string": "6 \"fullwidth comma\", the Chinese comma."}, {"id": 37, "string": "7 \"ideographic comma\", the Japanese tōten."}, {"id": 38, "string": "8 \"ideographic full stop\", the Japanese kuten."}, {"id": 39, "string": "9 Because the DEP-REO is totally based on the IPA system, we also used the system for REV-REO."}, {"id": 40, "string": "Actually 100% of the surface form wa were tagged as joshi, kakarijoshi by MeCab in our experiments."}, {"id": 41, "string": "10 We only introduce the minimum rewriting to replace the \"|\", \"[\", \"]\" to full-width characters for Moses' decoder."}, {"id": 42, "string": "11 The spaces mainly appeared on the Korean side due to its orthography."}, {"id": 43, "string": "Those occasional spaces on the Japanese side were also replaced with tags."}, {"id": 44, "string": "• We used MeCab (IPA) and CaboCha to process Japanese sentences in JE translation."}, {"id": 45, "string": "• We used no tools for Korean and Japanese morphological analysis in KJ translation, instead, the max-phrase-length were set to 9 in translation model training."}, {"id": 46, "string": "We selected the optimal distortion limit (DL) in PB SMT decoding by indoor experiments 14 and used the selected setting in the final submissions."}, {"id": 47, "string": "stable performance across different DLs."}, {"id": 48, "string": "The phenomenon is in agree to Ding et al."}, {"id": 49, "string": "(2015) ."}, {"id": 50, "string": "Table 2 shows the experimental results on KJ translation results."}, {"id": 51, "string": "We tested different DLs of 0, 3, and 6 with the lexicalized orientation reordering model (+Lex.-Reo.)."}, {"id": 52, "string": "The performance has only quite slight changes under different DLs."}, {"id": 53, "string": "We also tested the monotone translation (DL = 0) without reordering model (−Lex.-Reo.)."}, {"id": 54, "string": "The change on performance is still insignificant."}, {"id": 55, "string": "So a pure monotone translation is enough for KJ and a reordering model helps little."}, {"id": 56, "string": "The phenomenon is in agree to Ding et al."}, {"id": 57, "string": "(2014b) ."}, {"id": 58, "string": "We have observed there are many brackets in the data of KJ translation task."}, {"id": 59, "string": "The translations of brackets are not consistent in training data and PB SMT cannot handle bracket pairs well in decoding."}, {"id": 60, "string": "We used a simple post-processing for bracket balancing according to the following steps."}, {"id": 61, "string": "1."}, {"id": 62, "string": "Getting 1, 000-best list for each output 15 ; 2."}, {"id": 63, "string": "Selecting the m-th candidate, where m is min(arg min n |#L n −#R n |); #L n and #R n are counts of \"(\" and \")\" in the n-th candidate; 3."}, {"id": 64, "string": "Inserting untranslated source-side \")\" to the selected candidate after the translated parts of its preceding character 16 , when (a) its paired \"(\" on source side is translated to a \"(\" on target side; (b) it has no paired \"(\" on source side but follows numbers / alphabets."}, {"id": 65, "string": "The described brackets balancing brought a gain about +0.2 BLEU scores on devtest set, which is larger than the effect of DL and reordering models."}, {"id": 66, "string": "We consider specific post-processing will improve KJ translation more."}, {"id": 67, "string": "The evaluation results of our submission are listed in Table 3 and Table 4 ."}, {"id": 68, "string": "Our local evaluation on automatic measures had slight but not significant differences compared with the organizer's in cases."}, {"id": 69, "string": "On JE translation, our baseline was a little lower than the organizer's baseline, as the experimental settings were not totally identical to the organizer's ones, we think the difference is acceptable."}, {"id": 70, "string": "Both REV-REO and DEP-REO improved the baseline (ours) approximately one point on BLEU score, but REV-REO gave a larger improvement on RIBES."}, {"id": 71, "string": "On KJ translation, the listed scores are all based on the MeCab's analysis."}, {"id": 72, "string": "Our baseline, i.e., a character-based one, outperformed the organizer's baseline more than one BLEU score and the bracket balancing still gave a further improvement around +0.2 BLEU scores."}, {"id": 73, "string": "As to the human evaluations, our approaches still have stable improvement."}, {"id": 74, "string": "On JE translation, the DEP-REO has a more obvious improvement than REV-REO, although the BLEU scores of the two approaches are nearly the same."}, {"id": 75, "string": "We consider the using of specific syntactic information in DEP-REO brings benefits in human evaluation."}, {"id": 76, "string": "On KJ translation, the automatic and human evaluations have consistent results, that our character-based baseline performs better than organizer's baseline and post-processing gives further improvement."}, {"id": 77, "string": "Discussion From the evaluation results, we have observed that simple (or, naïve) approaches can give satisfactory improvement for a PB SMT baseline."}, {"id": 78, "string": "We show examples of REV-REO and DEP-REO in Fig."}, {"id": 79, "string": "1 and  Fig."}, {"id": 80, "string": "2, respectively ."}, {"id": 81, "string": "JE and KJ translation examples are shown in Table 5 and Fig."}, {"id": 82, "string": "3, respectively ."}, {"id": 83, "string": "On JE translation, in our opinion, the REV-REO approach should be used as a new baseline in future, due to its simplicity and efficiency."}, {"id": 84, "string": "The REV-REO only needs morphological analysis, which is needed after all for a general SMT task."}, {"id": 85, "string": "As the Japanese topic marker wa is available across different POS systems 17 , the REV-REO is actually an approach with strong ability of generalization 18 ."}, {"id": 86, "string": "On KJ translation, we illustrated characterbased processing led to good performance due to the similarity of the two languages."}, {"id": 87, "string": "Actually, our approach is more like a transliteration process rather than a translation process."}, {"id": 88, "string": "Although an SMT system gives satisfactory performance on KJ translation, we would like to state several issues for KJ SMT in practice."}, {"id": 89, "string": "• Although the syntaxes are similar between Korean and Japanese, there are differences in collocations of verbs and postpositions (case markers) 19 ."}, {"id": 90, "string": "Specific process or stronger models are needed for correct translation if such a collocation is over a long-range."}, {"id": 91, "string": "• Negation is purely realized by suffixes 20 in Japanese, but can be realized by both suffixes 21 and prefixes 22 in Korean."}, {"id": 92, "string": "So, reordering is needed when a Korean negative prefix is translated into Japanese, unless we have 17 Of course, the specific tag is different."}, {"id": 93, "string": "18 We believe (although we have not done experiments) the REV-REO should work for Korean-to-English translation task as well because Korean has a topic marker (n)eun which is very similar to Japanese wa."}, {"id": 94, "string": "19 Here are examples for some common verbs."}, {"id": 95, "string": "Japanese noru and Korean tada, both have the meaning of to ride; noru requires a dative marker ni but tada requires an accusative marker (r)eul (the equivalent Japanese accusative marker is wo)."}, {"id": 96, "string": "Japanese naru and Korean toeda, both have the meaning of to become; naru requires a dative marker ni but toeda requires a nominative marker i / ga (the equivalent Japanese nominative marker is ga)."}, {"id": 97, "string": "20 Analyzed as auxiliary verbs, e.g., nai, nu, mai, etc."}, {"id": 98, "string": "21 Analyzed as auxiliary verbs, e.g., anta, anida, etc."}, {"id": 99, "string": "22 Analyzed as adverbs, e.g., an and mot."}, {"id": 100, "string": "a translation table covering all the negation forms of all the verbs."}, {"id": 101, "string": "Specific process is also needed for this phenomenon."}, {"id": 102, "string": "• Specific named entity recognition / translation modules are needed for correct translation of proper nouns."}, {"id": 103, "string": "Conclusion We have described the translation systems of NICT team for JE and KJ translation task at WAT 2015)."}, {"id": 104, "string": "Although the approaches we used are very simple, their efficiency has been proved by the evaluation."}, {"id": 105, "string": "We expect these techniques to be more widely applied in the community of Asian NLP."}, {"id": 106, "string": "BASELINE the proposed psrf psrf modulation type than the simple structure REV-REO the proposed psrf is simple structure than psrf modulation type DEP-REO the proposed psrf structure is simpler than psrf modulation type REFERENCE and , the proposed psrf has simpler structure than that of modulated psrf Table 5 : JE translation examples."}, {"id": 107, "string": "The inputs for BASELINE, REV-REO, and DEP-REO are the original Japanese sentence at the top of Fig."}, {"id": 108, "string": "1 (and Fig."}, {"id": 109, "string": "2 The Japanese sentence at the bottom is the output by the character-level translation; the alignment between input and output is also shown."}, {"id": 110, "string": "The output is nearly identical to the reference translation except an insignificantly redundant tōten (underlined)."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 21}, {"section": "Character-based KJ Translation", "n": "3", "start": 22, "end": 30}, {"section": "Experiment and Evaluation", "n": "4", "start": 31, "end": 76}, {"section": "Discussion", "n": "5", "start": 77, "end": 102}, {"section": "Conclusion", "n": "6", "start": 103, "end": 110}], "figures": [{"filename": "../figure/image/1068-Table4-1.png", "caption": "Table 4: Evaluation of our submission on KJ translation compared with the organizer’s PB SMT baseline.", "page": 2, "bbox": {"x1": 97.92, "x2": 499.2, "y1": 192.48, "y2": 267.36}}, {"filename": "../figure/image/1068-Table3-1.png", "caption": "Table 3: Evaluation of our submission on JE translation compared with the organizer’s PB SMT baseline.", "page": 2, "bbox": {"x1": 96.96, "x2": 500.15999999999997, "y1": 62.879999999999995, "y2": 150.23999999999998}}, {"filename": "../figure/image/1068-Figure1-1.png", "caption": "Figure 1: Example of REV-REO. The original Japanese sentence at the top is segmented after the topic marker and the morphemes within each segment are reversed.", "page": 4, "bbox": {"x1": 141.6, "x2": 456.47999999999996, "y1": 66.72, "y2": 158.4}}, {"filename": "../figure/image/1068-Figure3-1.png", "caption": "Figure 3: KJ translation example on a part of a Korean sentence. The gray blocks show the spaces used in Korean orthography. The characters24 above hanguls show the Sino-Korean morphemes. The Japanese sentence at the bottom is the output by the character-level translation; the alignment between input and output is also shown. The output is nearly identical to the reference translation except an insignificantly redundant tōten (underlined).", "page": 4, "bbox": {"x1": 85.44, "x2": 512.16, "y1": 578.4, "y2": 643.1999999999999}}, {"filename": "../figure/image/1068-Table5-1.png", "caption": "Table 5: JE translation examples. The inputs for BASELINE, REV-REO, and DEP-REO are the original Japanese sentence at the top of Fig. 1 (and Fig. 2), reordered Japanese sentence at the bottom of Fig. 1, and reordered sentence at the bottom of Fig. 2, respectively.", "page": 4, "bbox": {"x1": 96.96, "x2": 501.12, "y1": 444.47999999999996, "y2": 503.03999999999996}}, {"filename": "../figure/image/1068-Figure2-1.png", "caption": "Figure 2: Example of DEP-REO. The original Japanese sentence at the top is reordered on both chunkand morpheme-level based on its dependency structure.", "page": 4, "bbox": {"x1": 134.88, "x2": 463.2, "y1": 224.64, "y2": 378.71999999999997}}, {"filename": "../figure/image/1068-Table1-1.png", "caption": "Table 1: Devtest set BLEU score and RIBES on JE translation.", "page": 1, "bbox": {"x1": 324.96, "x2": 508.32, "y1": 62.879999999999995, "y2": 257.28}}, {"filename": "../figure/image/1068-Table2-1.png", "caption": "Table 2: Devtest set BLEU score and RIBES on KJ translation (morpheme level, by MeCab).", "page": 1, "bbox": {"x1": 310.56, "x2": 521.28, "y1": 310.56, "y2": 396.96}}]}