{"title": "Get To The Point: Summarization with Pointer-Generator Networks", "abstract": "Neural sequence-to-sequence models have provided a viable new approach for abstractive text summarization (meaning they are not restricted to simply selecting and rearranging passages from the original text). However, these models have two shortcomings: they are liable to reproduce factual details inaccurately, and they tend to repeat themselves. In this work we propose a novel architecture that augments the standard sequence-to-sequence attentional model in two orthogonal ways. First, we use a hybrid pointer-generator network that can copy words from the source text via pointing, which aids accurate reproduction of information, while retaining the ability to produce novel words through the generator. Second, we use coverage to keep track of what has been summarized, which discourages repetition. We apply our model to the CNN / Daily Mail summarization task, outperforming the current abstractive state-of-the-art by at least 2 ROUGE points.", "text": [{"id": 0, "string": "Introduction Summarization is the task of condensing a piece of text to a shorter version that contains the main information from the original."}, {"id": 1, "string": "There are two broad approaches to summarization: extractive and abstractive."}, {"id": 2, "string": "Extractive methods assemble summaries exclusively from passages (usually whole sentences) taken directly from the source text, while abstractive methods may generate novel words and phrases not featured in the source text -as a human-written abstract usually does."}, {"id": 3, "string": "The extractive approach is easier, because copying large Original Text (truncated): lagos, nigeria (cnn) a day after winning nigeria's presidency, muhammadu buhari told cnn's christiane amanpour that he plans to aggressively fight corruption that has long plagued nigeria and go after the root of the nation's unrest."}, {"id": 4, "string": "buhari said he'll \"rapidly give attention\" to curbing violence in the northeast part of nigeria, where the terrorist group boko haram operates."}, {"id": 5, "string": "by cooperating with neighboring nations chad, cameroon and niger, he said his administration is confident it will be able to thwart criminals and others contributing to nigeria's instability."}, {"id": 6, "string": "for the first time in nigeria's history, the opposition defeated the ruling party in democratic elections."}, {"id": 7, "string": "buhari defeated incumbent goodluck jonathan by about 2 million votes, according to nigeria's independent national electoral commission."}, {"id": 8, "string": "the win comes after a long history of military rule, coups and botched attempts at democracy in africa's most populous nation."}, {"id": 9, "string": "Baseline Seq2Seq + Attention: UNK UNK says his administration is confident it will be able to destabilize nigeria's economy."}, {"id": 10, "string": "UNK says his administration is confident it will be able to thwart criminals and other nigerians."}, {"id": 11, "string": "he says the country has long nigeria and nigeria's economy."}, {"id": 12, "string": "Pointer-Gen: muhammadu buhari says he plans to aggressively fight corruption in the northeast part of nigeria."}, {"id": 13, "string": "he says he'll \"rapidly give attention\" to curbing violence in the northeast part of nigeria."}, {"id": 14, "string": "he says his administration is confident it will be able to thwart criminals."}, {"id": 15, "string": "Pointer-Gen + Coverage: muhammadu buhari says he plans to aggressively fight corruption that has long plagued nigeria."}, {"id": 16, "string": "he says his administration is confident it will be able to thwart criminals."}, {"id": 17, "string": "the win comes after a long history of military rule, coups and botched attempts at democracy in africa's most populous nation."}, {"id": 18, "string": "Figure 1 : Comparison of output of 3 abstractive summarization models on a news article."}, {"id": 19, "string": "The baseline model makes factual errors, a nonsensical sentence and struggles with OOV words muhammadu buhari."}, {"id": 20, "string": "The pointer-generator model is accurate but repeats itself."}, {"id": 21, "string": "Coverage eliminates repetition."}, {"id": 22, "string": "The final summary is composed from several fragments."}, {"id": 23, "string": "chunks of text from the source document ensures baseline levels of grammaticality and accuracy."}, {"id": 24, "string": "On the other hand, sophisticated abilities that are crucial to high-quality summarization, such as paraphrasing, generalization, or the incorporation of real-world knowledge, are possible only in an abstractive framework (see Figure 5 )."}, {"id": 25, "string": "Due to the difficulty of abstractive summarization, the great majority of past work has been extractive (Kupiec et al., 1995; Paice, 1990; Saggion and Poibeau, 2013) ."}, {"id": 26, "string": "However, the recent success of sequence-to-sequence models (Sutskever Figure 2 : Baseline sequence-to-sequence model with attention."}, {"id": 27, "string": "The model may attend to relevant words in the source text to generate novel words, e.g., to produce the novel word beat in the abstractive summary Germany beat Argentina 2-0 the model may attend to the words victorious and win in the source text."}, {"id": 28, "string": "et al., 2014) , in which recurrent neural networks (RNNs) both read and freely generate text, has made abstractive summarization viable Rush et al., 2015; Zeng et al., 2016) ."}, {"id": 29, "string": "Though these systems are promising, they exhibit undesirable behavior such as inaccurately reproducing factual details, an inability to deal with out-of-vocabulary (OOV) words, and repeating themselves (see Figure 1 )."}, {"id": 30, "string": "In this paper we present an architecture that addresses these three issues in the context of multi-sentence summaries."}, {"id": 31, "string": "While most recent abstractive work has focused on headline generation tasks (reducing one or two sentences to a single headline), we believe that longer-text summarization is both more challenging (requiring higher levels of abstraction while avoiding repetition) and ultimately more useful."}, {"id": 32, "string": "Therefore we apply our model to the recently-introduced CNN/ Daily Mail dataset (Hermann et al., 2015; , which contains news articles (39 sentences on average) paired with multi-sentence summaries, and show that we outperform the stateof-the-art abstractive system by at least 2 ROUGE points."}, {"id": 33, "string": "Our hybrid pointer-generator network facilitates copying words from the source text via pointing (Vinyals et al., 2015) , which improves accuracy and handling of OOV words, while retaining the ability to generate new words."}, {"id": 34, "string": "The network, which can be viewed as a balance between extractive and abstractive approaches, is similar to Gu et al."}, {"id": 35, "string": "'s (2016) CopyNet and Miao and Blunsom's (2016) Forced-Attention Sentence Compression, that were applied to short-text summarization."}, {"id": 36, "string": "We propose a novel variant of the coverage vector (Tu et al., 2016) from Neural Machine Translation, which we use to track and control coverage of the source document."}, {"id": 37, "string": "We show that coverage is remarkably effective for eliminating repetition."}, {"id": 38, "string": "Our Models In this section we describe (1) our baseline sequence-to-sequence model, (2) our pointergenerator model, and (3) our coverage mechanism that can be added to either of the first two models."}, {"id": 39, "string": "The code for our models is available online."}, {"id": 40, "string": "1 Sequence-to-sequence attentional model Our baseline model is similar to that of , and is depicted in Figure 2 ."}, {"id": 41, "string": "The tokens of the article w i are fed one-by-one into the encoder (a single-layer bidirectional LSTM), producing a sequence of encoder hidden states h i ."}, {"id": 42, "string": "On each step t, the decoder (a single-layer unidirectional LSTM) receives the word embedding of the previous word (while training, this is the previous word of the reference summary; at test time it is the previous word emitted by the decoder), and has decoder state s t ."}, {"id": 43, "string": "The attention distribution a t is calculated as in Bahdanau et al."}, {"id": 44, "string": "(2015) : e t i = v T tanh(W h h i +W s s t + b attn ) (1) a t = softmax(e t ) (2) where v, W h , W s and b attn are learnable parameters."}, {"id": 45, "string": "The attention distribution can be viewed as Figure 3 : Pointer-generator model."}, {"id": 46, "string": "For each decoder timestep a generation probability p gen ∈ [0, 1] is calculated, which weights the probability of generating words from the vocabulary, versus copying words from the source text."}, {"id": 47, "string": "The vocabulary distribution and the attention distribution are weighted and summed to obtain the final distribution, from which we make our prediction."}, {"id": 48, "string": "Note that out-of-vocabulary article words such as 2-0 are included in the final distribution."}, {"id": 49, "string": "Best viewed in color."}, {"id": 50, "string": "a probability distribution over the source words, that tells the decoder where to look to produce the next word."}, {"id": 51, "string": "Next, the attention distribution is used to produce a weighted sum of the encoder hidden states, known as the context vector h * t : h * t = ∑ i a t i h i (3) The context vector, which can be seen as a fixedsize representation of what has been read from the source for this step, is concatenated with the decoder state s t and fed through two linear layers to produce the vocabulary distribution P vocab : P vocab = softmax(V (V [s t , h * t ] + b) + b ) (4) where V , V , b and b are learnable parameters."}, {"id": 52, "string": "P vocab is a probability distribution over all words in the vocabulary, and provides us with our final distribution from which to predict words w: P(w) = P vocab (w) (5) During training, the loss for timestep t is the negative log likelihood of the target word w * t for that timestep: loss t = − log P(w * t ) (6) and the overall loss for the whole sequence is: loss = 1 T ∑ T t=0 loss t (7) Pointer-generator network Our pointer-generator network is a hybrid between our baseline and a pointer network (Vinyals et al., 2015) , as it allows both copying words via pointing, and generating words from a fixed vocabulary."}, {"id": 53, "string": "In the pointer-generator model (depicted in Figure  3 ) the attention distribution a t and context vector h * t are calculated as in section 2.1."}, {"id": 54, "string": "In addition, the generation probability p gen ∈ [0, 1] for timestep t is calculated from the context vector h * t , the decoder state s t and the decoder input x t : p gen = σ (w T h * h * t + w T s s t + w T x x t + b ptr ) (8) where vectors w h * , w s , w x and scalar b ptr are learnable parameters and σ is the sigmoid function."}, {"id": 55, "string": "Next, p gen is used as a soft switch to choose between generating a word from the vocabulary by sampling from P vocab , or copying a word from the input sequence by sampling from the attention distribution a t ."}, {"id": 56, "string": "For each document let the extended vocabulary denote the union of the vocabulary, and all words appearing in the source document."}, {"id": 57, "string": "We obtain the following probability distribution over the extended vocabulary: P(w) = p gen P vocab (w) + (1 − p gen ) ∑ i:w i =w a t i (9) Note that if w is an out-of-vocabulary (OOV) word, then P vocab (w) is zero; similarly if w does not appear in the source document, then ∑ i:w i =w a t i is zero."}, {"id": 58, "string": "The ability to produce OOV words is one of the primary advantages of pointer-generator models; by contrast models such as our baseline are restricted to their pre-set vocabulary."}, {"id": 59, "string": "The loss function is as described in equations (6) and (7) , but with respect to our modified probability distribution P(w) given in equation (9) ."}, {"id": 60, "string": "Coverage mechanism Repetition is a common problem for sequenceto-sequence models (Tu et al., 2016; , and is especially pronounced when generating multi-sentence text (see Figure 1 )."}, {"id": 61, "string": "We adapt the coverage model of Tu et al."}, {"id": 62, "string": "(2016) to solve the problem."}, {"id": 63, "string": "In our coverage model, we maintain a coverage vector c t , which is the sum of attention distributions over all previous decoder timesteps: c t = ∑ t−1 t =0 a t (10) Intuitively, c t is a (unnormalized) distribution over the source document words that represents the degree of coverage that those words have received from the attention mechanism so far."}, {"id": 64, "string": "Note that c 0 is a zero vector, because on the first timestep, none of the source document has been covered."}, {"id": 65, "string": "The coverage vector is used as extra input to the attention mechanism, changing equation (1) to: e t i = v T tanh(W h h i +W s s t + w c c t i + b attn ) (11) where w c is a learnable parameter vector of same length as v. This ensures that the attention mechanism's current decision (choosing where to attend next) is informed by a reminder of its previous decisions (summarized in c t )."}, {"id": 66, "string": "This should make it easier for the attention mechanism to avoid repeatedly attending to the same locations, and thus avoid generating repetitive text."}, {"id": 67, "string": "We find it necessary (see section 5) to additionally define a coverage loss to penalize repeatedly attending to the same locations: covloss t = ∑ i min(a t i , c t i ) (12) Note that the coverage loss is bounded; in particular covloss t ≤ ∑ i a t i = 1."}, {"id": 68, "string": "Equation (12) differs from the coverage loss used in Machine Translation."}, {"id": 69, "string": "In MT, we assume that there should be a roughly oneto-one translation ratio; accordingly the final coverage vector is penalized if it is more or less than 1."}, {"id": 70, "string": "Our loss function is more flexible: because summarization should not require uniform coverage, we only penalize the overlap between each attention distribution and the coverage so far -preventing repeated attention."}, {"id": 71, "string": "Finally, the coverage loss, reweighted by some hyperparameter λ , is added to the primary loss function to yield a new composite loss function: loss t = − log P(w * t ) + λ ∑ i min(a t i , c t i ) (13) 3 Related Work Neural abstractive summarization."}, {"id": 72, "string": "Rush et al."}, {"id": 73, "string": "(2015) were the first to apply modern neural networks to abstractive text summarization, achieving state-of-the-art performance on DUC-2004 and Gigaword, two sentence-level summarization datasets."}, {"id": 74, "string": "Their approach, which is centered on the attention mechanism, has been augmented with recurrent decoders , Abstract Meaning Representations (Takase et al., 2016), hierarchical networks , variational autoencoders (Miao and Blunsom, 2016) , and direct optimization of the performance metric (Ranzato et al., 2016) , further improving performance on those datasets."}, {"id": 75, "string": "However, large-scale datasets for summarization of longer text are rare."}, {"id": 76, "string": "adapted the DeepMind question-answering dataset (Hermann et al., 2015) for summarization, resulting in the CNN/Daily Mail dataset, and provided the first abstractive baselines."}, {"id": 77, "string": "The same authors then published a neural extractive approach (Nallapati et al., 2017) , which uses hierarchical RNNs to select sentences, and found that it significantly outperformed their abstractive result with respect to the ROUGE metric."}, {"id": 78, "string": "To our knowledge, these are the only two published results on the full dataset."}, {"id": 79, "string": "Prior to modern neural methods, abstractive summarization received less attention than extractive summarization, but Jing (2000) explored cutting unimportant parts of sentences to create summaries, and Cheung and Penn (2014) explore sentence fusion using dependency trees."}, {"id": 80, "string": "Pointer-generator networks."}, {"id": 81, "string": "The pointer network (Vinyals et al., 2015) is a sequence-tosequence model that uses the soft attention distribution of Bahdanau et al."}, {"id": 82, "string": "(2015) to produce an output sequence consisting of elements from the input sequence."}, {"id": 83, "string": "The pointer network has been used to create hybrid approaches for NMT (Gulcehre et al., 2016) , language modeling (Merity et al., 2016) , and summarization (Gu et al., 2016; Gulcehre et al., 2016; Miao and Blunsom, 2016; Zeng et al., 2016) ."}, {"id": 84, "string": "Our approach is close to the Forced-Attention Sentence Compression model of Miao and Blunsom (2016) and the CopyNet model of Gu et al."}, {"id": 85, "string": "(2016) , with some small differences: (i) We calculate an explicit switch probability p gen , whereas Gu et al."}, {"id": 86, "string": "induce competition through a shared softmax function."}, {"id": 87, "string": "(ii) We recycle the attention distribution to serve as the copy distribution, but Gu et al."}, {"id": 88, "string": "use two separate distributions."}, {"id": 89, "string": "(iii) When a word appears multiple times in the source text, we sum probability mass from all corresponding parts of the attention distribution, whereas Miao and Blunsom do not."}, {"id": 90, "string": "Our reasoning is that (i) calculating an explicit p gen usefully enables us to raise or lower the probability of all generated words or all copy words at once, rather than individually, (ii) the two distributions serve such similar purposes that we find our simpler approach suffices, and (iii) we observe that the pointer mechanism often copies a word while attending to multiple occurrences of it in the source text."}, {"id": 91, "string": "Our approach is considerably different from that of Gulcehre et al."}, {"id": 92, "string": "(2016) and ."}, {"id": 93, "string": "Those works train their pointer components to activate only for out-of-vocabulary words or named entities (whereas we allow our model to freely learn when to use the pointer), and they do not mix the probabilities from the copy distribution and the vocabulary distribution."}, {"id": 94, "string": "We believe the mixture approach described here is better for abstractive summarization -in section 6 we show that the copy mechanism is vital for accurately reproducing rare but in-vocabulary words, and in section 7.2 we observe that the mixture model enables the language model and copy mechanism to work together to perform abstractive copying."}, {"id": 95, "string": "Coverage."}, {"id": 96, "string": "Originating from Statistical Machine Translation (Koehn, 2009) , coverage was adapted for NMT by Tu et al."}, {"id": 97, "string": "(2016) and , who both use a GRU to update the coverage vector each step."}, {"id": 98, "string": "We find that a simpler approach -summing the attention distributions to obtain the coverage vector -suffices."}, {"id": 99, "string": "In this respect our approach is similar to Xu et al."}, {"id": 100, "string": "(2015) , who apply a coverage-like method to image cap-tioning, and Chen et al."}, {"id": 101, "string": "(2016) , who also incorporate a coverage mechanism (which they call 'distraction') as described in equation (11) into neural summarization of longer text."}, {"id": 102, "string": "Temporal attention is a related technique that has been applied to NMT (Sankaran et al., 2016) and summarization ."}, {"id": 103, "string": "In this approach, each attention distribution is divided by the sum of the previous, which effectively dampens repeated attention."}, {"id": 104, "string": "We tried this method but found it too destructive, distorting the signal from the attention mechanism and reducing performance."}, {"id": 105, "string": "We hypothesize that an early intervention method such as coverage is preferable to a post hoc method such as temporal attention -it is better to inform the attention mechanism to help it make better decisions, than to override its decisions altogether."}, {"id": 106, "string": "This theory is supported by the large boost that coverage gives our ROUGE scores (see Table 1 ), compared to the smaller boost given by temporal attention for the same task ."}, {"id": 107, "string": "Dataset We use the CNN/Daily Mail dataset (Hermann et al., 2015; , which contains online news articles (781 tokens on average) paired with multi-sentence summaries (3.75 sentences or 56 tokens on average)."}, {"id": 108, "string": "We used scripts supplied by  to obtain the same version of the the data, which has 287,226 training pairs, 13,368 validation pairs and 11,490 test pairs."}, {"id": 109, "string": "Both the dataset's published results (Nallapati et al., , 2017 use the anonymized version of the data, which has been pre-processed to replace each named entity, e.g., The United Nations, with its own unique identifier for the example pair, e.g., @entity5."}, {"id": 110, "string": "By contrast, we operate directly on the original text (or non-anonymized version of the data), 2 which we believe is the favorable problem to solve because it requires no pre-processing."}, {"id": 111, "string": "Experiments For all experiments, our model has 256dimensional hidden states and 128-dimensional word embeddings."}, {"id": 112, "string": "For the pointer-generator models, we use a vocabulary of 50k words for both source and target -note that due to the pointer network's ability to handle OOV words, we can use For the baseline model, we also try a larger vocabulary size of 150k."}, {"id": 113, "string": "Note that the pointer and the coverage mechanism introduce very few additional parameters to the network: for the models with vocabulary size 50k, the baseline model has 21,499,600 parameters, the pointer-generator adds 1153 extra parameters (w h * , w s , w x and b ptr in equation 8), and coverage adds 512 extra parameters (w c in equation 11)."}, {"id": 114, "string": "Unlike , we do not pretrain the word embeddings -they are learned from scratch during training."}, {"id": 115, "string": "We train using Adagrad (Duchi et al., 2011) with learning rate 0.15 and an initial accumulator value of 0.1."}, {"id": 116, "string": "(This was found to work best of Stochastic Gradient Descent, Adadelta, Momentum, Adam and RM-SProp)."}, {"id": 117, "string": "We use gradient clipping with a maximum gradient norm of 2, but do not use any form of regularization."}, {"id": 118, "string": "We use loss on the validation set to implement early stopping."}, {"id": 119, "string": "During training and at test time we truncate the article to 400 tokens and limit the length of the summary to 100 tokens for training and 120 tokens at test time."}, {"id": 120, "string": "3 This is done to expedite training and testing, but we also found that truncating the article can raise the performance of the model (see section 7.1 for more details)."}, {"id": 121, "string": "For training, we found it efficient to start with highly-truncated sequences, then raise the maximum length once converged."}, {"id": 122, "string": "We train on a single Tesla K40m GPU with a batch size of 16."}, {"id": 123, "string": "At test time our summaries are produced using beam search with beam size 4."}, {"id": 124, "string": "We trained both our baseline models for about 600,000 iterations (33 epochs) -this is similar to the 35 epochs required by Nallapati et al."}, {"id": 125, "string": "'s (2016) best model."}, {"id": 126, "string": "Training took 4 days and 14 hours for the 50k vocabulary model, and 8 days 21 hours for the 150k vocabulary model."}, {"id": 127, "string": "We found the pointer-generator model quicker to train, requiring less than 230,000 training iterations (12.8 epochs); a total of 3 days and 4 hours."}, {"id": 128, "string": "In particular, the pointer-generator model makes much quicker progress in the early phases of training."}, {"id": 129, "string": "To obtain our final coverage model, we added the coverage mechanism with coverage loss weighted to λ = 1 (as described in equation 13), and trained for a further 3000 iterations (about 2 hours)."}, {"id": 130, "string": "In this time the coverage loss converged to about 0.2, down from an initial value of about 0.5."}, {"id": 131, "string": "We also tried a more aggressive value of λ = 2; this reduced coverage loss but increased the primary loss function, thus we did not use it."}, {"id": 132, "string": "We tried training the coverage model without the loss function, hoping that the attention mechanism may learn by itself not to attend repeatedly to the same locations, but we found this to be ineffective, with no discernible reduction in repetition."}, {"id": 133, "string": "We also tried training with coverage from the first iteration rather than as a separate training phase, but found that in the early phase of training, the coverage objective interfered with the main objective, reducing overall performance."}, {"id": 134, "string": "Results Preliminaries Our results are given in Table 1 ."}, {"id": 135, "string": "We evaluate our models with the standard ROUGE metric (Lin, 2004b) , reporting the F 1 scores for ROUGE-1, ROUGE-2 and ROUGE-L (which respectively measure the word-overlap, bigram-overlap, and longest common sequence between the reference summary and the summary to be evaluated)."}, {"id": 136, "string": "We obtain our ROUGE scores using the pyrouge package."}, {"id": 137, "string": "4 We also evaluate with the METEOR metric (Denkowski and Lavie, 2014) , both in exact match mode (rewarding only exact matches between words) and full mode (which additionally rewards matching stems, synonyms and paraphrases)."}, {"id": 138, "string": "5 In addition to our own models, we also report the lead-3 baseline (which uses the first three sentences of the article as a summary), and compare to the only existing abstractive  and extractive (Nallapati et al., 2017) models on the full dataset."}, {"id": 139, "string": "The output of our models is available online."}, {"id": 140, "string": "6 Given that we generate plain-text summaries but 2017) generate anonymized summaries (see Section 4), our ROUGE scores are not strictly comparable."}, {"id": 141, "string": "There is evidence to suggest that the original-text dataset may result in higher ROUGE scores in general than the anonymized dataset -the lead-3 baseline is higher on the former than the latter."}, {"id": 142, "string": "One possible explanation is that multi-word named entities lead to a higher rate of n-gram overlap."}, {"id": 143, "string": "Unfortunately, ROUGE is the only available means of comparison with Nallapati et al."}, {"id": 144, "string": "'s work."}, {"id": 145, "string": "Nevertheless, given that the disparity in the lead-3 scores is (+1.1 ROUGE-1, +2.0 ROUGE-2, +1.1 ROUGE-L) points respectively, and our best model scores exceed  by (+4.07 ROUGE-1, +3.98 ROUGE-2, +3.73 ROUGE-L) points, we may estimate that we outperform the only previous abstractive system by at least 2 ROUGE points allround."}, {"id": 146, "string": "Observations We find that both our baseline models perform poorly with respect to ROUGE and METEOR, and in fact the larger vocabulary size (150k) does not seem to help."}, {"id": 147, "string": "Even the better-performing baseline (with 50k vocabulary) produces summaries with several common problems."}, {"id": 148, "string": "Factual details are frequently reproduced incorrectly, often replacing an uncommon (but in-vocabulary) word with a morecommon alternative."}, {"id": 149, "string": "For example in Figure 1 , the baseline model appears to struggle with the rare word thwart, producing destabilize instead, which leads to the fabricated phrase destabilize nigeria's economy."}, {"id": 150, "string": "Even more catastrophically, the summaries sometimes devolve into repetitive nonsense, such as the third sentence produced by the baseline model in Figure 1 ."}, {"id": 151, "string": "In addition, the baseline model can't reproduce out-of-vocabulary words (such as muhammadu buhari in Figure 1) ."}, {"id": 152, "string": "Further examples of all these problems are provided in the supplementary material."}, {"id": 153, "string": "Our pointer-generator model achieves much better ROUGE and METEOR scores than the baseline, despite many fewer training epochs."}, {"id": 154, "string": "The difference in the summaries is also marked: outof-vocabulary words are handled easily, factual details are almost always copied correctly, and there are no fabrications (see Figure 1 )."}, {"id": 155, "string": "However, repetition is still very common."}, {"id": 156, "string": "Our pointer-generator model with coverage improves the ROUGE and METEOR scores further, convincingly surpassing the best abstractive model Article: smugglers lure arab and african migrants by offering discounts to get onto overcrowded ships if people bring more potential passengers, a cnn investigation has revealed."}, {"id": 157, "string": "(...) Summary: cnn investigation uncovers the business inside a human smuggling ring."}, {"id": 158, "string": "Article: eyewitness video showing white north charleston police officer michael slager shooting to death an unarmed black man has exposed discrepancies in the reports of the first officers on the scene."}, {"id": 159, "string": "(...) Summary: more questions than answers emerge in controversial s.c. police shooting."}, {"id": 160, "string": "Figure 5 : Examples of highly abstractive reference summaries (bold denotes novel words)."}, {"id": 161, "string": "of  by several ROUGE points."}, {"id": 162, "string": "Despite the brevity of the coverage training phase (about 1% of the total training time), the repetition problem is almost completely eliminated, which can be seen both qualitatively ( Figure  1 ) and quantitatively (Figure 4 )."}, {"id": 163, "string": "However, our best model does not quite surpass the ROUGE scores of the lead-3 baseline, nor the current best extractive model (Nallapati et al., 2017) ."}, {"id": 164, "string": "We discuss this issue in section 7.1."}, {"id": 165, "string": "Discussion Comparison with extractive systems It is clear from Table 1 that extractive systems tend to achieve higher ROUGE scores than abstractive, and that the extractive lead-3 baseline is extremely strong (even the best extractive system beats it by only a small margin)."}, {"id": 166, "string": "We offer two possible explanations for these observations."}, {"id": 167, "string": "Firstly, news articles tend to be structured with the most important information at the start; this partially explains the strength of the lead-3 baseline."}, {"id": 168, "string": "Indeed, we found that using only the first 400 tokens (about 20 sentences) of the article yielded significantly higher ROUGE scores than using the first 800 tokens."}, {"id": 169, "string": "Secondly, the nature of the task and the ROUGE metric make extractive approaches and the lead-3 baseline difficult to beat."}, {"id": 170, "string": "The choice of content for the reference summaries is quite subjective -sometimes the sentences form a self-contained summary; other times they simply showcase a few interesting details from the article."}, {"id": 171, "string": "Given that the articles contain 39 sentences on average, there are many equally valid ways to choose 3 or 4 highlights in this style."}, {"id": 172, "string": "Abstraction introduces even more options (choice of phrasing), further decreas-ing the likelihood of matching the reference summary."}, {"id": 173, "string": "For example, smugglers profit from desperate migrants is a valid alternative abstractive summary for the first example in Figure 5 , but it scores 0 ROUGE with respect to the reference summary."}, {"id": 174, "string": "This inflexibility of ROUGE is exacerbated by only having one reference summary, which has been shown to lower ROUGE's reliability compared to multiple reference summaries (Lin, 2004a) ."}, {"id": 175, "string": "Due to the subjectivity of the task and thus the diversity of valid summaries, it seems that ROUGE rewards safe strategies such as selecting the first-appearing content, or preserving original phrasing."}, {"id": 176, "string": "While the reference summaries do sometimes deviate from these techniques, those deviations are unpredictable enough that the safer strategy obtains higher ROUGE scores on average."}, {"id": 177, "string": "This may explain why extractive systems tend to obtain higher ROUGE scores than abstractive, and even extractive systems do not significantly exceed the lead-3 baseline."}, {"id": 178, "string": "To explore this issue further, we evaluated our systems with the METEOR metric, which rewards not only exact word matches, but also matching stems, synonyms and paraphrases (from a predefined list)."}, {"id": 179, "string": "We observe that all our models receive over 1 METEOR point boost by the inclusion of stem, synonym and paraphrase matching, indicating that they may be performing some abstraction."}, {"id": 180, "string": "However, we again observe that the lead-3 baseline is not surpassed by our models."}, {"id": 181, "string": "It may be that news article style makes the lead-3 baseline very strong with respect to any metric."}, {"id": 182, "string": "We believe that investigating this issue further is an important direction for future work."}, {"id": 183, "string": "How abstractive is our model?"}, {"id": 184, "string": "We have shown that our pointer mechanism makes our abstractive system more reliable, copying factual details correctly more often."}, {"id": 185, "string": "But does the ease of copying make our system any less abstractive?"}, {"id": 186, "string": "Figure 6 shows that our final model's summaries contain a much lower rate of novel n-grams (i.e., those that don't appear in the article) than the reference summaries, indicating a lower degree of abstraction."}, {"id": 187, "string": "Note that the baseline model produces novel n-grams more frequently -however, this statistic includes all the incorrectly copied words, UNK tokens and fabrications alongside the good instances of abstraction."}, {"id": 188, "string": "Figure 6 : Although our best model is abstractive, it does not produce novel n-grams (i.e., n-grams that don't appear in the source text) as often as the reference summaries."}, {"id": 189, "string": "The baseline model produces more novel n-grams, but many of these are erroneous (see section 7.2)."}, {"id": 190, "string": "Article: andy murray (...) is into the semi-finals of the miami open , but not before getting a scare from 21 year-old austrian dominic thiem, who pushed him to 4-4 in the second set before going down 3-6 6-4, 6-1 in an hour and three quarters."}, {"id": 191, "string": "(...) Summary: andy murray defeated dominic thiem 3-6 6-4, 6-1 in an hour and three quarters."}, {"id": 192, "string": "Article: (...) wayne rooney smashes home during manchester united 's 3-1 win over aston villa on saturday."}, {"id": 193, "string": "(...) Summary: manchester united beat aston villa 3-1 at old trafford on saturday."}, {"id": 194, "string": "Figure 7 : Examples of abstractive summaries produced by our model (bold denotes novel words)."}, {"id": 195, "string": "In particular, Figure 6 shows that our final model copies whole article sentences 35% of the time; by comparison the reference summaries do so only 1.3% of the time."}, {"id": 196, "string": "This is a main area for improvement, as we would like our model to move beyond simple sentence extraction."}, {"id": 197, "string": "However, we observe that the other 65% encompasses a range of abstractive techniques."}, {"id": 198, "string": "Article sentences are truncated to form grammatically-correct shorter versions, and new sentences are composed by stitching together fragments."}, {"id": 199, "string": "Unnecessary interjections, clauses and parenthesized phrases are sometimes omitted from copied passages."}, {"id": 200, "string": "Some of these abilities are demonstrated in Figure 1 , and the supplementary material contains more examples."}, {"id": 201, "string": "Figure 7 shows two examples of more impressive abstraction -both with similar structure."}, {"id": 202, "string": "The dataset contains many sports stories whose summaries follow the X beat Y score on day tem-plate, which may explain why our model is most confidently abstractive on these examples."}, {"id": 203, "string": "In general however, our model does not routinely produce summaries like those in Figure 7 , and is not close to producing summaries like in Figure 5 ."}, {"id": 204, "string": "The value of the generation probability p gen also gives a measure of the abstractiveness of our model."}, {"id": 205, "string": "During training, p gen starts with a value of about 0.30 then increases, converging to about 0.53 by the end of training."}, {"id": 206, "string": "This indicates that the model first learns to mostly copy, then learns to generate about half the time."}, {"id": 207, "string": "However at test time, p gen is heavily skewed towards copying, with a mean value of 0.17."}, {"id": 208, "string": "The disparity is likely due to the fact that during training, the model receives word-by-word supervision in the form of the reference summary, but at test time it does not."}, {"id": 209, "string": "Nonetheless, the generator module is useful even when the model is copying."}, {"id": 210, "string": "We find that p gen is highest at times of uncertainty such as the beginning of sentences, the join between stitched-together fragments, and when producing periods that truncate a copied sentence."}, {"id": 211, "string": "Our mixture model allows the network to copy while simultaneously consulting the language model -enabling operations like stitching and truncation to be performed with grammaticality."}, {"id": 212, "string": "In any case, encouraging the pointer-generator model to write more abstractively, while retaining the accuracy advantages of the pointer module, is an exciting direction for future work."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 36}, {"section": "Our Models", "n": "2", "start": 37, "end": 39}, {"section": "Sequence-to-sequence attentional model", "n": "2.1", "start": 40, "end": 52}, {"section": "Pointer-generator network", "n": "2.2", "start": 53, "end": 59}, {"section": "Coverage mechanism", "n": "2.3", "start": 60, "end": 106}, {"section": "Dataset", "n": "4", "start": 107, "end": 110}, {"section": "Experiments", "n": "5", "start": 111, "end": 133}, {"section": "Preliminaries", "n": "6.1", "start": 134, "end": 145}, {"section": "Observations", "n": "6.2", "start": 146, "end": 164}, {"section": "Comparison with extractive systems", "n": "7.1", "start": 165, "end": 183}, {"section": "How abstractive is our model?", "n": "7.2", "start": 184, "end": 212}], "figures": [{"filename": "../figure/image/1075-Figure1-1.png", "caption": "Figure 1: Comparison of output of 3 abstractive summarization models on a news article. The baseline model makes factual errors, a nonsensical sentence and struggles with OOV words muhammadu buhari. The pointer-generator model is accurate but repeats itself. Coverage eliminates repetition. The final summary is composed from several fragments.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 221.76, "y2": 459.35999999999996}}, {"filename": "../figure/image/1075-Table1-1.png", "caption": "Table 1: ROUGE F1 and METEOR scores on the test set. Models and baselines in the top half are abstractive, while those in the bottom half are extractive. Those marked with * were trained and evaluated on the anonymized dataset, and so are not strictly comparable to our results on the original text. All our ROUGE scores have a 95% confidence interval of at most ±0.25 as reported by the official ROUGE script. The METEOR improvement from the 50k baseline to the pointer-generator model, and from the pointer-generator to the pointer-generator+coverage model, were both found to be statistically significant using an approximate randomization test with p < 0.01.", "page": 5, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 62.879999999999995, "y2": 200.16}}, {"filename": "../figure/image/1075-Figure2-1.png", "caption": "Figure 2: Baseline sequence-to-sequence model with attention. The model may attend to relevant words in the source text to generate novel words, e.g., to produce the novel word beat in the abstractive summary Germany beat Argentina 2-0 the model may attend to the words victorious and win in the source text.", "page": 1, "bbox": {"x1": 93.6, "x2": 503.03999999999996, "y1": 61.44, "y2": 226.07999999999998}}, {"filename": "../figure/image/1075-Figure4-1.png", "caption": "Figure 4: Coverage eliminates undesirable repetition. Summaries from our non-coverage model contain many duplicated n-grams while our coverage model produces a similar number as the reference summaries.", "page": 6, "bbox": {"x1": 314.4, "x2": 519.36, "y1": 63.839999999999996, "y2": 223.2}}, {"filename": "../figure/image/1075-Figure3-1.png", "caption": "Figure 3: Pointer-generator model. For each decoder timestep a generation probability pgen ∈ [0,1] is calculated, which weights the probability of generating words from the vocabulary, versus copying words from the source text. The vocabulary distribution and the attention distribution are weighted and summed to obtain the final distribution, from which we make our prediction. Note that out-of-vocabulary article words such as 2-0 are included in the final distribution. Best viewed in color.", "page": 2, "bbox": {"x1": 93.6, "x2": 503.03999999999996, "y1": 61.44, "y2": 287.03999999999996}}, {"filename": "../figure/image/1075-Figure5-1.png", "caption": "Figure 5: Examples of highly abstractive reference summaries (bold denotes novel words).", "page": 7, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 62.879999999999995, "y2": 198.23999999999998}}, {"filename": "../figure/image/1075-Figure6-1.png", "caption": "Figure 6: Although our best model is abstractive, it does not produce novel n-grams (i.e., n-grams that don’t appear in the source text) as often as the reference summaries. The baseline model produces more novel n-grams, but many of these are erroneous (see section 7.2).", "page": 8, "bbox": {"x1": 77.75999999999999, "x2": 286.08, "y1": 65.28, "y2": 216.0}}, {"filename": "../figure/image/1075-Figure7-1.png", "caption": "Figure 7: Examples of abstractive summaries produced by our model (bold denotes novel words).", "page": 8, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 323.52, "y2": 449.28}}]}