{"title": "Extractive Headline Generation Based on Learning to Rank for Community Question Answering", "abstract": "User-generated content such as the questions on community question answering (CQA) forums does not always come with appropriate headlines, in contrast to the news articles used in various headline generation tasks. In such cases, we cannot use paired supervised data, e.g., pairs of articles and headlines, to learn a headline generation model. To overcome this problem, we propose an extractive headline generation method based on learning to rank for CQA that extracts the most informative substring from each question as its headline. Experimental results show that our method outperforms several baselines, including a prefix-based method, which is widely used in real services.", "text": [{"id": 0, "string": "Introduction Community question answering (CQA) is a service where users can post their questions and answer the questions from other users."}, {"id": 1, "string": "The quality of a CQA service is inevitably linked to how many questions are answered in a short amount of time."}, {"id": 2, "string": "To this end, the headline of a posted question plays a key role, as it is the first thing users see in a question list or push notification on a smartphone."}, {"id": 3, "string": "However, questions in a CQA service do not always have appropriate headlines because the questions are written by various users who basically do not have any specialized knowledge in terms of writing such content, in contrast to news articles written by professional editors."}, {"id": 4, "string": "In fact, the biggest CQA service in Japan, Yahoo!"}, {"id": 5, "string": "Chiebukuro 1 , does not even provide an input field for headlines in the submission form of questions, as general users do not have enough patience and tend not to post questions if even just one required field is added to the form."}, {"id": 6, "string": "This service alternatively uses the prefix of a question as its headline as in Figure 1(a) , where the headline \" (Nice to meet you."}, {"id": 7, "string": "Thank you in advance."}, {"id": 8, "string": "At work ...)\" is created from the prefix of the content."}, {"id": 9, "string": "Obviously, this headline is uninformative because  of the lack of actual content, which is related to an initial unrequited love of a woman in the workplace."}, {"id": 10, "string": "Figure 1(b) shows how ineffective such an uninformative headline is for a smartphone push notification, where users would have practically zero motivation to click on it and answer since they cannot imagine what kind of question is being asked."}, {"id": 11, "string": "This negative effect has been confirmed on a commercial CQA service (Section 2)."}, {"id": 12, "string": "In this work, we take an extractive approach for improving uninformative headlines."}, {"id": 13, "string": "Although there have recently been many studies on abstractive headline generation (as described in Section 6), we do not follow any of these approaches because the content we deal with has no correct headlines and also the abstractive methods can yield erroneous output."}, {"id": 14, "string": "This latter issue is important in practical terms because correct output is critical for a commercial service."}, {"id": 15, "string": "If by some chance an erroneous headline, or one including politically incorrect phrases, is sent to all users, the service's credibility can be lost instantly."}, {"id": 16, "string": "Therefore, we formalize our task as an extraction problem of a fixed-length substring from a question as its headline."}, {"id": 17, "string": "In this setting, we can assume that outputs never include such errors caused by the service, as the outputs are substrings of user-posted questions."}, {"id": 18, "string": "Note that they have no coherence errors in selecting multiple sentences as in normal extractive summarization tasks."}, {"id": 19, "string": "While it is true that these outputs might contain inappropriate expressions authored by users, this type of error is beyond our scope since it is a different inevitable problem."}, {"id": 20, "string": "Furthermore, the situation of \"the service generated an inappropriate expression by itself\" is significantly worse than the situation of \"a user posted an inappropriate question to the service, and the service displayed it\"."}, {"id": 21, "string": "Therefore, it is difficult to directly use abstractive methods for commercial services from a business standpoint."}, {"id": 22, "string": "Our approach involves preparing headline candidates and ranking them."}, {"id": 23, "string": "The formal description is as follows."}, {"id": 24, "string": "Let q be a target question to be translated into a headline."}, {"id": 25, "string": "We first prepare a set S(q) of headline candidates from the question q."}, {"id": 26, "string": "Note that the set S(q) is restricted to a set of fixed-length substrings given a length n, i.e., S(q) ⊆ {x | x ⪯ q, |x| = n}, where x ⪯ q means that x is a substring of q."}, {"id": 27, "string": "Then we extract the best headline that maximizes a score function f q (x), which represents the \"headline-ness\" score of a candidate x ∈ S(q) with respect to the target question q, as follows: argmax x∈S(q) f q (x)."}, {"id": 28, "string": "(1) To ensure simplicity of implementation and understandability from users, we use a set of the fixed-length prefixes of all sentences in a question q as the candidate set S(q) (Section 3)."}, {"id": 29, "string": "Because the problem is to select the best candidate from among several targets, the score function f q (x) is naturally trained by learning to rank (Section 4)."}, {"id": 30, "string": "The main contributions of this paper are as follows."}, {"id": 31, "string": "• We report empirical evidence of the negative effect of uninformative headlines on a commercial CQA service (Section 2)."}, {"id": 32, "string": "We additionally show that our task can reduce uninformative headlines by using simple dictionary matching, which dramatically improves the average answer rate of questions by as much as 2.4 times."}, {"id": 33, "string": "• We propose an extractive headline generation method based on learning to rank for CQA (Section 4) that extracts the most informative substring (prefix of mid-sentence) from each question as its headline."}, {"id": 34, "string": "To the best of our knowledge, our work is the first attempt to address such a task from a practical standpoint, although there have been many related studies (Section 6)."}, {"id": 35, "string": "Experimental results show that our method outperforms several baselines, including the dictionary-based method (Section 5)."}, {"id": 36, "string": "• We create a dataset for our headline generation task (Section 3), where headline candidates extracted from questions are ranked by crowdsourcing with respect to \"headline-ness\", that is, whether or not each headline candidate is appropriate for the headline of the corresponding question."}, {"id": 37, "string": "Negative Effect of Uninformative Headlines We conducted A/B testing on the push notifications of smartphones in collaboration with Yahoo!"}, {"id": 38, "string": "Chiebukuro, as shown in Figure 1 (b)."}, {"id": 39, "string": "We first prepared a dictionary of typical first sentences that cause uninformative headlines."}, {"id": 40, "string": "This dictionary was manually selected from frequent first sentences and consists of 913 sentences including greetings such as \" (Good morning)\", \" Changed uninformative Unchanged uninformative Informative 0.75% 0.31% 0.45% Table 1 : Average answer rates of three question groups in A/B testing."}, {"id": 41, "string": "(Good afternoon)\", and \" (Nice to meet you)\", and fixed phrases such as \" (Can I ask you something)\", \" (Please tell me)\", and \" (Thank you in advance)\"."}, {"id": 42, "string": "We assumed that a question with a prefix match in the dictionary has an uninformative prefix headline and classified such questions into an uninformative group."}, {"id": 43, "string": "For convenience, we also classified the other questions into an informative group, although they might include not so informative headlines."}, {"id": 44, "string": "We further randomly divided the uninformative group into two equal groups: changed and unchanged."}, {"id": 45, "string": "In the changed uninformative group, each headline is extracted as the prefix of the first (informative) sentence that does not match with the dictionary, which is the same as DictDel explained in Section 5.2."}, {"id": 46, "string": "The unchanged group remains in uninformative."}, {"id": 47, "string": "For comparison of these groups, we used the average answer rate over notified questions in each group as an evaluation measure, defined as Average answer rate = No."}, {"id": 48, "string": "of questions answered from the notification No."}, {"id": 49, "string": "of notified questions ."}, {"id": 50, "string": "(2) Note that we use a percentage expression (%) for easy reading."}, {"id": 51, "string": "Table 1 shows the evaluation results of the A/B testing during a 1-month period (Feb. 2 -Mar."}, {"id": 52, "string": "4, 2018) , where about three million questions were sent to users."}, {"id": 53, "string": "Comparing the unchanged uninformative group with the informative group, we can see that the average answer rate of the uninformative questions, 0.31%, is actually lower than that of the informative questions, 0.45%."}, {"id": 54, "string": "Comparing the changed and unchanged uninformative groups, the average answer rate of the changed questions, 0.75%, is much higher than that of the unchanged questions, 0.31%."}, {"id": 55, "string": "This means that even a simple dictionary-based method can dramatically improve the quality of the uninformative headlines, i.e., by as much as 2.4 times."}, {"id": 56, "string": "We confirmed that the difference is statistically significant on a one-tailed Wilcoxon signed-rank test (p < 0.05)."}, {"id": 57, "string": "Note that the average answer rate represents a conversion rate (or rate of target actions), which is more important than a click-through rate (or rate of initial actions)."}, {"id": 58, "string": "The average answer rate is one of the most important indicators for a CQA service, while the click-through rate can be meaninglessly high if the service sends headlines that are fake or too catchy."}, {"id": 59, "string": "We should point out that low answer rates are sufficient for the service, since it has 44M users: i.e., each question has an average of 2.4 answers, as the service currently has 189M questions and 462M answers."}, {"id": 60, "string": "Dataset Creation We created a dataset for our headline generation task based on the Yahoo!"}, {"id": 61, "string": "Chiebukuro dataset 2 , which is a dataset including questions and answers provided from a Japanese CQA service, Yahoo!"}, {"id": 62, "string": "Chiebukuro."}, {"id": 63, "string": "We first prepared headline candidates from this dataset as in Section 3.1 and then conducted a crowdsourcing task specified in Section 3.2."}, {"id": 64, "string": "In Section 3.3, we report the results of the crowdsourcing task."}, {"id": 65, "string": "Preparation of Headline Candidates We extracted only questions from the Chiebukuro dataset and split each question into sentences by using punctuation marks (i.e., the exclamation (\" \"), question (\" \"), and full stop (\" \") marks)."}, {"id": 66, "string": "We regarded 20 Japanese characters that are basically extracted from each sentence as a headline candidate x ∈ S(q) in Eq."}, {"id": 67, "string": "(1), since this setting is used for push notifications in the actual service in Figure 1 (b)."}, {"id": 68, "string": "More specifically, the headline candidate is created as follows: 1."}, {"id": 69, "string": "If the sentence is the first one in the question, we extract the first 19 characters and put an ellipsis mark (\" \") at the end."}, {"id": 70, "string": "(a) Example of our crowdsourcing task."}, {"id": 71, "string": "Posted Question: Nice to meet you, I am a man in my 30s."}, {"id": 72, "string": "Please give me your advice on a pressing concern I have."}, {"id": 73, "string": "A dog kept in the next house barks from morning to night."}, {"id": 74, "string": "Neighbors have given the owner cautions against it, but there is no improvement."}, {"id": 75, "string": "This area has only private houses, not rented houses, so I cannot move out."}, {"id": 76, "string": "However, I will go crazy if I have to keep enduring this."}, {"id": 77, "string": "How can I effectively manage this problem?"}, {"id": 78, "string": "..."}, {"id": 79, "string": "Please give me your advice on a pressing concern ... (b) English translation of left example."}, {"id": 80, "string": "Figure 2 : Examples of (a) our crowdsourcing task and (b) its English translation."}, {"id": 81, "string": "In the case where the length of a candidate is less than 20 characters, we include some of the next sentence in order to maximize use of display space."}, {"id": 82, "string": "We included questions with more than five sentences for the purpose of efficiently collecting ranking information."}, {"id": 83, "string": "All told, we prepared 10,000 questions containing more than five headline candidates each."}, {"id": 84, "string": "Figure 2 shows an example of our crowdsourcing task (a) and its English translation (b)."}, {"id": 85, "string": "This task involves a posted question and headline candidates corresponding to the question."}, {"id": 86, "string": "We asked workers to select the best candidate from options after reading the posted question."}, {"id": 87, "string": "A relative evaluation, where workers select the best candidate, was used instead of an absolute evaluation, where workers select a score from 0 to 10 for each candidate, because we wanted to obtain as accurate a headline as possible, and it might be difficult for workers to select an appropriate absolute score."}, {"id": 88, "string": "The workers were instructed as follows (English translation): Crowdsourcing Task Various candidate headlines are listed as options for a posted question in a Q&A service."}, {"id": 89, "string": "After reading the question, please select the best option from the list so that users can guess the content of the question and distinguish it from other ones."}, {"id": 90, "string": "Please remove uninformative ones such as greetings, self-introductions, and unspecific expressions."}, {"id": 91, "string": "We explain how to judge the appropriateness of each candidate by means of the example in Figure 2 ."}, {"id": 92, "string": "After examining the posted question, we can assume that the most important content is \"he is annoyed by the barking of a dog kept in the next house\"."}, {"id": 93, "string": "On the basis of this assumption, option 6 is the best one, since the headline \"A dog kept in the next house barks from morning\" is enough to help answerers deduce that \"the questioner is annoyed by the sound\"."}, {"id": 94, "string": "Option 1 is inappropriate because although the answerers might be able to guess that \"the questioner cannot move out\", this matter is not the central one."}, {"id": 95, "string": "Option 2 is uninformative because it consists merely of greetings and self-introduction, and option 3, while a question sentence, is unspecific."}, {"id": 96, "string": "Option 4 enables answerers to guess that this question is related to an issue involving pets, but they cannot grasp the specific content."}, {"id": 97, "string": "Option 5 specifies a likely damage due to the trouble, but the reason (trouble) is more important for the answering than the result (damage)."}, {"id": 98, "string": "Option 7 directly shows that \"the questioner is annoyed and wants some advice\", but answerers cannot understand why he/she is annoyed."}, {"id": 99, "string": "The detailed implementation of our task is as follows."}, {"id": 100, "string": "First we randomly sorted the candidates of each question (shown in Figure 2 (a)) to avoid position bias by the workers."}, {"id": 101, "string": "We included ten actual questions and a dummy question so that workers would always have to answer one dummy question per every ten actual questions."}, {"id": 102, "string": "A dummy question is a question with a clear answer inserted to eliminate fraud workers (i.e., workers who randomly select answers without actually reading them)."}, {"id": 103, "string": "Each question was answered by ten workers so each headline candidate had a vote score from 0 to 10 representing whether or not the candidate was appropriate for a headline."}, {"id": 104, "string": "This task took nine days and was answered by 1,558 workers."}, {"id": 105, "string": "As a result, our dataset consists of 10,000 questions, each of which has more than five headline candidates with accompanying \"headline-ness\" scores."}, {"id": 106, "string": "Analysis of Crowdsourcing Results We analyzed our dataset to determine how much room for improvement our task has compared to the prefix headline."}, {"id": 107, "string": "It is well known that the first sentence can be a strong baseline in many summarization tasks, so the prefix headline is also expected to perform well."}, {"id": 108, "string": "Figure 3 shows the statistical information based on sentence position that includes the (a) ratio of the true best (most voted) candidates, (b) average votes, and (c) average rank (in order of votes) over the candidates at each sentence position."}, {"id": 109, "string": "Looking at the true best candidates (a), the ratio 61.8% for the 1st sentence clarifies the effectiveness of the prefix headline, as expected."}, {"id": 110, "string": "Conversely, we still have room for improvement for the prefix headline up to 38.2%."}, {"id": 111, "string": "Our goal is to improve the uninformative headlines of 38.2% while keeping the remaining 61.8% unchanged."}, {"id": 112, "string": "The other two figures (b) and (c) also support the above discussion."}, {"id": 113, "string": "Furthermore, we qualitatively checked the crowdsourcing quality."}, {"id": 114, "string": "Workers successfully eliminated uninformative candidates including greetings and self-introductions, while one or two workers sometimes chose ones that included a fixed phrase such as \"Please tell me ...\"."}, {"id": 115, "string": "This is probably because workers had different criteria regarding the \"unspecific expressions\" described in the instructions."}, {"id": 116, "string": "Since we cannot enumerate all of the concrete bad examples, we ignore this phenomenon with the expectation that a learning algorithm will reduce its negative effect."}, {"id": 117, "string": "Proposed Method In this section, we explain how to construct a headline generation model from the dataset presented in Section 3."}, {"id": 118, "string": "We took a ranking approach, i.e., learning to rank, for our task, rather than a simple regression one, since estimating absolute scores is not required for our purpose."}, {"id": 119, "string": "Even if two headline candidates (of different questions) have the same expression, their votes can be significantly different since the votes in our dataset are based on relative evaluation."}, {"id": 120, "string": "For example, the best candidate for Figure 2 was No."}, {"id": 121, "string": "6, but it might not be selected in other questions such as \"A dog kept in the next house barks from morning."}, {"id": 122, "string": "Does anybody know why dogs generally want to bark?\"."}, {"id": 123, "string": "Learning to rank is an application of machine learning that is typically used for ranking models in information retrieval systems."}, {"id": 124, "string": "The ranking models are basically learned from a supervised dataset consisting of triples (q, x, y), where q is a user's query, x is a document corresponding to q, and y is a relevance score of x with respect to q."}, {"id": 125, "string": "In this work, we formalize our task by regarding q, x, and y, as a posted question, a headline candidate, and a voted score in our dataset, respectively."}, {"id": 126, "string": "We used a pairwise ranking method that is also implemented as an instance of the well-known SVM tools LIBLINEAR  and LIBSVM (Kuo et al., 2014) ."}, {"id": 127, "string": "We used a linear model based on LIBLINEAR, an L2-regularized L2-loss linear rankSVM, for the experiments."}, {"id": 128, "string": "Let D be a dataset that consists of triples including a posted question q, a headline candidate x, and a voted score y, i.e., (q, x, y) ∈ D. In the pairwise ranking method, we train a ranking model as a binary classifier that determines whether the condition y i > y j is true or false for two candidates x i and x j in the same question (q i = q j )."}, {"id": 129, "string": "Specifically, we first define the index pairs of positive examples by P = {(i, j) | q i = q j , y i > y j , (x i , y i , q i ) ∈ D, (x j , y j , q j ) ∈ D}."}, {"id": 130, "string": "Note that we do not need to consider the negative examples N = {(j, i) | (i, j) ∈ P } since they yield the same formula as P in the optimization process."}, {"id": 131, "string": "The training of the pairwise ranking method is achieved by solving the following optimization problem using the set P of the index pairs: min w 1 2 w ⊤ w + C ∑ (i,j)∈P ℓ(w ⊤x i − w ⊤x j ), (3) where w is a weight vector to be learned,x i is a feature vector extracted from a headline candidate x, and C is the regularization parameter."}, {"id": 132, "string": "The function ℓ is a squared hinge loss, which is defined as ℓ(d) = max(0, 1 − d) 2 ."}, {"id": 133, "string": "Finally, we define the score function in Eq."}, {"id": 134, "string": "(1) as f q (x) = w ⊤x , wherex can be created by using q as well as x."}, {"id": 135, "string": "This score means the relative \"headline-ness\" of x."}, {"id": 136, "string": "Experiments Basic Settings The basic settings of the experiments are as follows."}, {"id": 137, "string": "We split our dataset into training and test sets consisting of 9,000 and 1,000 examples, respectively."}, {"id": 138, "string": "We used an implementation 3 based on LIBLIN-EAR for training our ranking model, i.e., a linear L2-regularized L2-loss rankSVM model , as described in Section 4."}, {"id": 139, "string": "The regularization parameter was optimized by cross validation and set as C = 0.125."}, {"id": 140, "string": "The feature vector for a headline candidate consists of three kinds of features: bag-of-words, embedding, and position information."}, {"id": 141, "string": "The bag-of-words feature is a sparse vector of 30,820 dimensions based on the tf-idf scores of nouns, verbs, interjections, conjunctions, adverbs, and adjectives in a candidate, where we used a Japanese morphological analyzer, MeCab 4 (Kudo et al., 2004) , with a neologism dictionary, NEologd 5 (Toshinori Sato and Okumura, 2017)."}, {"id": 142, "string": "The embedding feature is a dense vector of 100 dimensions based on a doc2vec model (Le and Mikolov, 2014) trained with all 3M sentences in the Chiebukuro dataset using the Gensim tool 6 ."}, {"id": 143, "string": "The position feature is a binary vector of ten dimensions, where each dimension represents the coarse position (or coverage) of a headline candidate for a question."}, {"id": 144, "string": "Specifically, we equally split a question (character sequence) into ten parts and set one to each dimension if and only if the corresponding part overlaps a candidate."}, {"id": 145, "string": "For example, candidate No."}, {"id": 146, "string": "2 in Figure 2 had a position feature (1, 1, 0, · · · , 0), since the candidate covers the first 2/10 of the whole question."}, {"id": 147, "string": "Similarly, No."}, {"id": 148, "string": "6 and No."}, {"id": 149, "string": "3 had (0, 0, 1, 1, 0, · · · , 0) and (0, · · · , 0, 1), respectively."}, {"id": 150, "string": "For constructing the feature vector of each headline candidate, we used the previous and next candidates in sentence order, in addition to the target candidate."}, {"id": 151, "string": "This is based on the idea that near candidates might have useful information for the target candidate."}, {"id": 152, "string": "Finally, we prepared each feature vector by concatenating nine feature vectors, i.e., the above three kinds of features for three candidates, and normalizing them."}, {"id": 153, "string": "Compared Methods We compared our method, MLRank, with the baselines listed below."}, {"id": 154, "string": "Prefix, DictDel, and Random are simple baselines, while Prefix and DictDel are practically strong."}, {"id": 155, "string": "ImpTfidf, SimTfidf, SimEmb, and LexRank are unsupervised baselines, and SVM and SVR are supervised ones."}, {"id": 156, "string": "• Prefix: Selects the first candidate in sentence order."}, {"id": 157, "string": "• DictDel: Selects the first (informative) candidate that does not match in the dictionary of uninformative headlines (Section 2)."}, {"id": 158, "string": "• Random: Randomly selects a candidate."}, {"id": 159, "string": "• ImpTfidf: Selects the most important candidate with the highest tf-idf value, where a tf-idf value is calculated by the sum of the elements in a bag-of-words feature (described in Section 5.1)."}, {"id": 160, "string": "• SimTfidf: Selects the most similar candidate to the original question, which is calculated by the cosine similarity between the bag-of-words features (in Section 5.1) of each candidate and the question."}, {"id": 161, "string": "• SimEmb: An embedding-based variation of SimTfidf with embedding features (in Section 5.1)."}, {"id": 162, "string": "• LexRank: Selects the candidate with the highest score based on LexRank 7 (Erkan and Radev, 2004) , which is a widely used unsupervised extractive summarization method based on the PageRank algorithm."}, {"id": 163, "string": "The graph expression of each question was constructed on the basis of cosine similarity of the tf-idf vectors corresponding to candidates."}, {"id": 164, "string": "• SVM: Selects the candidate with the highest confidence based on a model learned as a classification task, where candidates with nonzero votes were labeled as positive."}, {"id": 165, "string": "This setting was the best in our preliminary experiments."}, {"id": 166, "string": "We used the L2-regularized L2-loss support vector classification model (C = 0.0156) in LIBLINEAR."}, {"id": 167, "string": "The other settings were the same as those described in Section 5.1."}, {"id": 168, "string": "• SVR: Selects the candidate with the highest predicted votes based on a model learned as a regression task, where the target variable is the number of votes."}, {"id": 169, "string": "We used the L2-regularized L2-loss support vector regression model (C = 0.0625) in LIBLINEAR."}, {"id": 170, "string": "The other settings were the same as above."}, {"id": 171, "string": "• MLRank: Proposed method described in Section 4."}, {"id": 172, "string": "Evaluation Measures We defined three evaluation measures for evaluating each method on our headline generation task."}, {"id": 173, "string": "Change Rate from Prefix Headline We measured how much each method changed the default prefix headline in order to determine the effect of application to an actual CQA service."}, {"id": 174, "string": "We defined this measure as change rate from the prefix headline, as follows: Change rate = No."}, {"id": 175, "string": "of questions where the best candidate is not the prefix headline No."}, {"id": 176, "string": "of all questions ."}, {"id": 177, "string": "Clearly, the change rate of the default method that selects the prefix headline is 0%."}, {"id": 178, "string": "If the value is small, the effect on the service will be small, but if the value is higher than the ideal change rate of 38.2% (Section 3), there can be side effects even if the average result is good."}, {"id": 179, "string": "A higher change rate up to the ideal rate is desirable from a practical standpoint."}, {"id": 180, "string": "Winning Rate against Prefix Headline We measured how much each method won against the prefix headline to directly assess the quality of changed headlines."}, {"id": 181, "string": "We defined this measure as winning rate against the prefix headline, as follows: Winning rate = No."}, {"id": 182, "string": "of questions where the best candidate got more votes than the prefix headline No."}, {"id": 183, "string": "of questions where the best candidate is not the prefix headline ."}, {"id": 184, "string": "(5) We did not consider the first candidate (in sentence order) selected by each method, which is the same as the prefix headline, since they obviously have the same number of votes."}, {"id": 185, "string": "Average Votes We measured how appropriate the candidates selected by each method are in order to determine the overall performance."}, {"id": 186, "string": "We defined this measure as average votes, as follows: Average votes = Sum of votes for the best candidates for all questions No."}, {"id": 187, "string": "of questions ."}, {"id": 188, "string": "Note that the average votes score is different from the average votes score for position (Figure 3(b) ) in that the former is the average over the selected candidates while the latter is the average over the candidates at a sentence position."}, {"id": 189, "string": "This measure is related to (normalized) discounted cumulative gain (DCG), which is widely used as an evaluation measure of ranking models."}, {"id": 190, "string": "We often use DCG@k for evaluating top-k rankings, and the above definition acutally corresponds to DCG@1."}, {"id": 191, "string": "According to a well-known paper (Järvelin and Kekäläinen, 2002) in the information retrieval field, DCG is appropriate for graded-relevance judgments like our task, while precision (described below) is appropriate for binary-relevance ones."}, {"id": 192, "string": "Average votes is expected to be more appropriate than precision for our task because we want \"averagely better headlines than default ones\" rather than \"best ones\" from a practical standpoint."}, {"id": 193, "string": "Precision Precision is a widely used evaluation measure for classification tasks, and we added it to support an evaluation based on average votes."}, {"id": 194, "string": "We defined it with respect to the best candidate, i.e., precision@1, as follows: Precision = No."}, {"id": 195, "string": "of questions where the best candidate had the maximum votes No."}, {"id": 196, "string": "of questions ."}, {"id": 197, "string": "(7) Table 2 shows examples of headlines generated by the prefix method, Prefix, and the proposed method, MLRank."}, {"id": 198, "string": "Looking at the first example, we can see that our method successfully eliminated the selfintroduction phrase (\"I am a 27-year-old woman\")."}, {"id": 199, "string": "The headline (right) of our method allows answerers to know that the questioner is discouraged about how to encounter men from the phrase \"little chance of new encounters with men\", while the headline (left) of the prefix method lacks this important clue."}, {"id": 200, "string": "The second and third examples show similar effects to the first example."}, {"id": 201, "string": "In the second one, although there are few clues about what the question is with the prefix method, our method correctly included the important clue (\"honeymoon\")."}, {"id": 202, "string": "In the third one, our method appropriately eliminated the uninformative long phrase (\"I am sorry if the category is wrong\"), which is not a frequent fixed phrase."}, {"id": 203, "string": "The fourth example shows a slightly challenging case, where both headlines make it difficult to understand the question."}, {"id": 204, "string": "However, the headline of our method included the term \"winning bidder\", so at least the answerer can assume that the question is about some sort of auction trouble."}, {"id": 205, "string": "The fifth example is a clearly successful result, where our method extracted the main question point about \"welfare pension\" as a headline."}, {"id": 206, "string": "These results qualitatively demonstrate the effectiveness of our method."}, {"id": 207, "string": "Results Qualitative Analysis Quantitative Analysis We compared our method MLRank with the baselines in Section 5.2 on the headline generation task for our dataset in Section 3."}, {"id": 208, "string": "Table 3 shows the evaluation results based on the change rates, winning rates, average votes, and precision."}, {"id": 209, "string": "Looking at the average votes and precision, which represent the overall performances, our method MLRank clearly performed the best among all methods."}, {"id": 210, "string": "We confirmed that Table 3 : Evaluation results of our headline generation task for proposed method MLRank and baselines."}, {"id": 211, "string": "the relative improvement of the average votes of our method MLRank against every baseline including the prefix method Prefix is statistically significant on the basis of a one-tailed Wilcoxon signed-rank test (p < 0.01)."}, {"id": 212, "string": "The change and winning rates of our method are 9.9% and 94.9%, respectively."}, {"id": 213, "string": "This means that our method detected 9.9% of the uninformative headlines and improved them with the high accuracy of 94.9%."}, {"id": 214, "string": "In other words, our method could successfully improve the overall performance while simultaneously avoiding any negative side effects."}, {"id": 215, "string": "The ideal results (Ref) based on correct labels suggest that our method still has room for improvement, especially for the change rate."}, {"id": 216, "string": "The results of the other baselines are as follows."}, {"id": 217, "string": "Not surprisingly, the prefix method Prefix performed well."}, {"id": 218, "string": "This is consistent with the fact that the first sentence can be a good summary in many summarization tasks."}, {"id": 219, "string": "The random method Random performed the worst, also as expected."}, {"id": 220, "string": "The dictionarybased deletion method DictDel was relatively useful, although the change rate was small."}, {"id": 221, "string": "The reason the winning rate of DictDel is relatively low compared with MLRank is that there are some cases where a combination of uninformative expressions can yield likely clues."}, {"id": 222, "string": "For example, the self-introduction \"I am a newbie of this forum\" itself is basically uninformative for a question, but a combination with additional information such as \"I am a newbie of this forum."}, {"id": 223, "string": "Where can I change the password ...\" can be more informative than only the additional information \"... Where can I change the password since I forgot it after ...\" because the combination specifies the target site by the expression \"this forum\"."}, {"id": 224, "string": "The unsupervised methods, SimTfidf, SimTfidf, SimEmb, and LexRank, which are widely used for summarization tasks, performed worse than the prefix method Prefix."}, {"id": 225, "string": "Although the change rates are higher than our method, the winning rates are lower."}, {"id": 226, "string": "In other words, they yielded many bad headlines."}, {"id": 227, "string": "These results suggest that supervised learning specialized to the target task would be required."}, {"id": 228, "string": "Comparing the important sentence extraction method ImpTfidf and the similarity-based summarization method SimTfidf, we found that SimTfidf performed better."}, {"id": 229, "string": "This implies that the content information of each question is useful for our headline generation task, as is the case with other summarization tasks."}, {"id": 230, "string": "The similarity-based method SimEmb with embeddings performed worse than our expectation."}, {"id": 231, "string": "The reason seems to be that it was difficult to obtain meaningful document embeddings from long questions."}, {"id": 232, "string": "The graph-based method LexRank had a similar performance to SimTfidf, because LexRank tends to select a candidate similar to the question when only one candidate was selected."}, {"id": 233, "string": "The supervised methods, SVM and SVR, performed relatively well compared to the unsupervised methods, but they did not outperform the strong simple baselines, Prefix and DictDel, nor our method MLRank."}, {"id": 234, "string": "These results support the appropriateness of our approach."}, {"id": 235, "string": "Related Work In this section, we briefly explain several related studies from two aspects: headline generation task and CQA data."}, {"id": 236, "string": "As discussed below, our work is the first attempt to address an extractive headline generation task for a CQA service based on learning to rank the substrings of a question."}, {"id": 237, "string": "After Rush et al."}, {"id": 238, "string": "(2015) proposed a neural headline generation model, there have been many studies on the same headline generation task (Takase et al., 2016; Chopra et al., 2016; Kiyono et al., 2017; Ayana et al., 2017; Raffel et al., 2017) ."}, {"id": 239, "string": "However, all of them are abstractive methods that can yield erroneous output, and the training for them requires a lot of paired data, i.e., news articles and headlines."}, {"id": 240, "string": "There have also been several classical studies based on nonneural approaches to headline generation (Woodsend et al., 2010; Alfonseca et al., 2013; Colmenares et al., 2015) , but they basically addressed sentence compression after extracting important linguistic units such as phrases."}, {"id": 241, "string": "In other words, their methods can still yield erroneous output, although they would be more controllable than neural models."}, {"id": 242, "string": "One exception is the work of Alotaiby (2011) , where fixed-sized substrings were considered for headline generation."}, {"id": 243, "string": "Although that approach is similar to ours, Alotaiby only considered an unsupervised method based on similarity to the original text (almost the same as SimTfidf in Section 5.2), in contrast to our proposal based on learning to rank."}, {"id": 244, "string": "This implies that Alotaiby's method will also not perform well for our task, as shown in Section 5.4."}, {"id": 245, "string": "There have been several studies on extractive summarization (Kobayashi et al., 2015; Yogatama et al., 2015) based on sentence embeddings, but they were basically developed for extracting multiple sentences, which means that these methods are almost the same as SimEmb in Section 5.2 for our purpose, i.e., extraction of the best candidate."}, {"id": 246, "string": "This also implies that they will not be suitable for our task."}, {"id": 247, "string": "Furthermore, recent sophisticated neural models for extractive summarization (Cheng and Lapata, 2016; Nallapati et al., 2017) basically require large-scale paired data (e.g., article-headline) to automatically label candidates, as manual annotation is very costly."}, {"id": 248, "string": "However, such paired data do not always exist for real applications, as in our task described in Section 1."}, {"id": 249, "string": "There have been many studies using CQA data, but most of them are different from our task, i.e., dealing with answering questions (Surdeanu et al., 2008; Celikyilmaz et al., 2009; Bhaskar, 2013; Nakov et al., 2017) , retrieving similar questions (Lei et al., 2016; Romeo et al., 2016; Nakov et al., 2017) , and generating questions (Heilman and Smith, 2010) ."}, {"id": 250, "string": "Tamura et al."}, {"id": 251, "string": "(2005) focused on extracting a core sentence and identifying the question type as classification tasks for answering multiple-sentence questions."}, {"id": 252, "string": "Although their method is useful to retrieve important information, we cannot directly use it since our task requires shorter expressions for headlines than sentences."}, {"id": 253, "string": "In addition, they used a support vector machine as a classifier, which is almost the same as SVM in Section 5.2, and it is not expected to be suitable for our task, as shown in Section 5.4."}, {"id": 254, "string": "The work of Ishigaki et al."}, {"id": 255, "string": "(2017) is the most related one in that they summarized lengthy questions by using both abstractive and extractive approaches."}, {"id": 256, "string": "Their work is promising because our task is regarded as the construction of short summaries, but the training of their models requires a lot of paired data consisting of questions and their headlines, which means that their method cannot be used to our task."}, {"id": 257, "string": "Conclusion We proposed an extractive headline generation method based on learning to rank for CQA that extracts the most informative substring in each question as its headline."}, {"id": 258, "string": "We created a dataset for our task, where headline candidates in each question are ranked using crowdsourcing."}, {"id": 259, "string": "Our method outperformed several baselines, including a prefix-based method, which is widely used for cases where the display area is limited, such as the push notifications on smartphones."}, {"id": 260, "string": "The dataset created for our headline generation task will be made publicly available 8 ."}, {"id": 261, "string": "Although our task is basically designed for extractive summarization, this dataset can also be used for abstractive summarization as a side information for training abstractive models."}, {"id": 262, "string": "In future work, we will investigate how effectively our method can perform in practical situations, e.g., push notifications."}, {"id": 263, "string": "In addition, we will consider how to improve the change rate of our method while keeping its winning rate and how to create a useful dataset even if removing the length limitation."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 36}, {"section": "Negative Effect of Uninformative Headlines", "n": "2", "start": 37, "end": 59}, {"section": "Dataset Creation", "n": "3", "start": 60, "end": 64}, {"section": "Preparation of Headline Candidates", "n": "3.1", "start": 65, "end": 87}, {"section": "Crowdsourcing Task", "n": "3.2", "start": 88, "end": 105}, {"section": "Analysis of Crowdsourcing Results", "n": "3.3", "start": 106, "end": 116}, {"section": "Proposed Method", "n": "4", "start": 117, "end": 135}, {"section": "Basic Settings", "n": "5.1", "start": 136, "end": 152}, {"section": "Compared Methods", "n": "5.2", "start": 153, "end": 169}, {"section": "Evaluation Measures", "n": "5.3", "start": 170, "end": 234}, {"section": "Related Work", "n": "6", "start": 235, "end": 256}, {"section": "Conclusion", "n": "7", "start": 257, "end": 263}], "figures": []}