{"title": "The Language of Legal and Illegal Activity on the Darknet", "abstract": "The non-indexed parts of the Internet (the Darknet) have become a haven for both legal and illegal anonymous activity. Given the magnitude of these networks, scalably monitoring their activity necessarily relies on automated tools, and notably on NLP tools. However, little is known about what characteristics texts communicated through the Darknet have, and how well off-the-shelf NLP tools do on this domain. This paper tackles this gap and performs an in-depth investigation of the characteristics of legal and illegal text in the Darknet, comparing it to a clear net website with similar content as a control condition. Taking drug-related websites as a test case, we find that texts for selling legal and illegal drugs have several linguistic characteristics that distinguish them from one another, as well as from the control condition, among them the distribution of POS tags, and the coverage of their named entities in Wikipedia. 1", "text": [{"id": 0, "string": "Introduction The term \"Darknet\" refers to the subset of Internet sites and pages that are not indexed by search engines."}, {"id": 1, "string": "The Darknet is often associated with the \".onion\" top-level domain, whose websites are referred to as \"Onion sites\", and are reachable via the Tor network anonymously."}, {"id": 2, "string": "Under the cloak of anonymity, the Darknet harbors much illegal activity (Moore and Rid, 2016) ."}, {"id": 3, "string": "Applying NLP tools to text from the Darknet is thus important for effective law enforcement and intelligence."}, {"id": 4, "string": "However, little is known about the characteristics of the language used in the Darknet, and specifically on what distinguishes text on websites that conduct legal and illegal activity."}, {"id": 5, "string": "In * Equal contribution 1 Our code can be found in https://github.com/ huji-nlp/cyber."}, {"id": 6, "string": "Our data is available upon request."}, {"id": 7, "string": "fact, the only work we are aware of that classified Darknet texts into legal and illegal activity is Avarikioti et al."}, {"id": 8, "string": "(2018) , but they too did not investigate in what ways these two classes differ."}, {"id": 9, "string": "This paper addresses this gap, and studies the distinguishing features between legal and illegal texts in Onion sites, taking sites that advertise drugs as a test case."}, {"id": 10, "string": "We compare our results to a control condition of texts from eBay 2 pages that advertise products corresponding to drug keywords."}, {"id": 11, "string": "We find a number of distinguishing features."}, {"id": 12, "string": "First, we confirm the results of Avarikioti et al."}, {"id": 13, "string": "(2018) , that text from legal and illegal pages (henceforth, legal and illegal texts) can be distinguished based on the identity of the content words (bag-of-words) in about 90% accuracy over a balanced sample."}, {"id": 14, "string": "Second, we find that the distribution of POS tags in the documents is a strong cue for distinguishing between the classes (about 71% accuracy)."}, {"id": 15, "string": "This indicates that the two classes are different in terms of their syntactic structure."}, {"id": 16, "string": "Third, we find that legal and illegal texts are roughly as distinguishable from one another as legal texts and eBay pages are (both in terms of their words and their POS tags)."}, {"id": 17, "string": "The latter point suggests that legal and illegal texts can be considered distinct domains, which explains why they can be automatically classified, but also implies that applying NLP tools to Darknet texts is likely to face the obstacles of domain adaptation."}, {"id": 18, "string": "Indeed, we show that named entities in illegal pages are covered less well by Wikipedia, i.e., Wikification works less well on them."}, {"id": 19, "string": "This suggests that for high-performance text understanding, specialized knowledge bases and tools may be needed for processing texts from the Darknet."}, {"id": 20, "string": "By experimenting on a different domain in Tor (user-generated content), we show that the legal/illegal distinction generalizes across domains."}, {"id": 21, "string": "After discussing previous works in Section 2, we detail the datasets used in Section 3."}, {"id": 22, "string": "Differences in the vocabulary and named entities between the classes are analyzed in Section 4, before the presentation of the classification experiments (Section 5)."}, {"id": 23, "string": "Section 6 presents additional experiments, which explore cross-domain classification."}, {"id": 24, "string": "We further analyze and discuss the findings in Section 7."}, {"id": 25, "string": "Related Work The detection of illegal activities on the Web is sometimes derived from a more general topic classification."}, {"id": 26, "string": "For example, Biryukov et al."}, {"id": 27, "string": "(2014) classified the content of Tor hidden services into 18 topical categories, only some of which correlate with illegal activity."}, {"id": 28, "string": "Graczyk and Kinningham (2015) combined unsupervised feature selection and an SVM classifier for the classification of drug sales in an anonymous marketplace."}, {"id": 29, "string": "While these works classified Tor texts into classes, they did not directly address the legal/illegal distinction."}, {"id": 30, "string": "Some works directly addressed a specific type of illegality and a particular communication context."}, {"id": 31, "string": "Morris and Hirst (2012) used an SVM classifier to identify sexual predators in chatting message systems."}, {"id": 32, "string": "The model includes both lexical features, including emoticons, and behavioral features that correspond to conversational patterns."}, {"id": 33, "string": "Another example is the detection of pedophile activity in peer-to-peer networks (Latapy et al., 2013) , where a predefined list of keywords was used to detect child-pornography queries."}, {"id": 34, "string": "Besides lexical features, we here consider other general linguistic properties, such as syntactic structure."}, {"id": 35, "string": "Al Nabki et al."}, {"id": 36, "string": "(2017) presented DUTA (Darknet Usage Text Addresses), the first publicly available Darknet dataset, together with a manual classification into topical categories and subcategories."}, {"id": 37, "string": "For some of the categories, legal and illegal activities are distinguished."}, {"id": 38, "string": "However, the automatic classification presented in their work focuses on the distinction between different classes of illegal activity, without addressing the distinction between legal and illegal ones, which is the subject of the present paper."}, {"id": 39, "string": "Al Nabki et al."}, {"id": 40, "string": "(2019) extended the dataset to form DUTA-10K, which we use here."}, {"id": 41, "string": "Their results show that 20% of the hidden services correspond to \"suspicious\" activities."}, {"id": 42, "string": "The analysis was conducted using the text classifier presented in Al Nabki et al."}, {"id": 43, "string": "(2017) and manual verification."}, {"id": 44, "string": "Recently, Avarikioti et al."}, {"id": 45, "string": "(2018) presented another topic classification of text from Tor together with a first classification into legal and illegal activities."}, {"id": 46, "string": "The experiments were performed on a newly crawled corpus obtained by recursive search."}, {"id": 47, "string": "The legal/illegal classification was done using an SVM classifier in an active learning setting with bag-of-words features."}, {"id": 48, "string": "Legality was assessed in a conservative way where illegality is assigned if the purpose of the content is an obviously illegal action, even if the content might be technically legal."}, {"id": 49, "string": "They found that a linear kernel worked best and reported an F1 score of 85% and an accuracy of 89%."}, {"id": 50, "string": "Using the dataset of Al Nabki et al."}, {"id": 51, "string": "(2019) , and focusing on specific topical categories, we here confirm the importance of content words in the classification, and explore the linguistic dimensions supporting classification into legal and illegal texts."}, {"id": 52, "string": "Datasets Used Onion corpus."}, {"id": 53, "string": "We experiment with data from Darknet websites containing legal and illegal activity, all from the DUTA-10K corpus (Al Nabki et al., 2019) ."}, {"id": 54, "string": "We selected the \"drugs\" sub-domain as a test case, as it is a large domain in the corpus, that has a \"legal\" and \"illegal\" sub-categories, and where the distinction between them can be reliably made."}, {"id": 55, "string": "These websites advertise and sell drugs, often to international customers."}, {"id": 56, "string": "While legal websites often sell pharmaceuticals, illegal ones are often related to substance abuse."}, {"id": 57, "string": "These pages are directed by sellers to their customers."}, {"id": 58, "string": "eBay corpus."}, {"id": 59, "string": "As an additional dataset of similar size and characteristics, but from a clear net source, and of legal nature, we compiled a corpus of eBay pages."}, {"id": 60, "string": "eBay is one of the largest hosting sites for retail sellers of various goods."}, {"id": 61, "string": "Our corpus contains 118 item descriptions, each consisting of more than one sentence."}, {"id": 62, "string": "Item descriptions vary in price, item sold and seller."}, {"id": 63, "string": "The descriptions were selected by searching eBay for drug related terms, 3 and selecting search patterns to avoid over-repetition."}, {"id": 64, "string": "For example, where many sell the same product, only one example was added to the corpus."}, {"id": 65, "string": "Search queries also included filtering for price, so that each query resulted with different items."}, {"id": 66, "string": "Either because of advertisement strategies or the geographical dispersion of the sellers, the eBay corpus contains formal as well as informal language, and some item descriptions contain abbreviations and slang."}, {"id": 67, "string": "Importantly, eBay websites are assumed to conduct legal activity-even when discussing drug-related material, we find it is never the sale of illegal drugs but rather merchandise, tools, or otherwise related content."}, {"id": 68, "string": "Cleaning."}, {"id": 69, "string": "As preprocessing for all experiments, we apply some cleaning to the text of web pages in our corpora."}, {"id": 70, "string": "HTML markup is already removed in the original datasets, but much non-linguistic content remains, such as buttons, encryption keys, metadata and URLs."}, {"id": 71, "string": "We remove such text from the web pages, and join paragraphs to single lines (as newlines are sometimes present in the original dataset for display purposes only)."}, {"id": 72, "string": "We then remove any duplicate paragraphs, where paragraphs are considered identical if they share all but numbers (to avoid an over-representation of some remaining surrounding text from the websites, e.g."}, {"id": 73, "string": "\"Showing all 9 results\")."}, {"id": 74, "string": "Domain Differences As pointed out by Plank (2011) , there is no common ground as to what constitutes a domain."}, {"id": 75, "string": "Domain differences are attributed in some works to differences in vocabulary (Blitzer et al., 2006) and in other works to differences in style, genre and medium (McClosky, 2010) ."}, {"id": 76, "string": "While here we adopt an existing classification, based on the DUTA-10K corpus, we show in which way and to what extent it translates to distinct properties of the texts."}, {"id": 77, "string": "This question bears on the possibility of distinguishing between legal and illegal drug-related websites based on their text alone (i.e., without recourse to additional information, such as meta-data or network structure)."}, {"id": 78, "string": "We examine two types of domain differences between legal and illegal texts: vocabulary differences and named entities."}, {"id": 79, "string": "Vocabulary Differences To quantify the domain differences between texts from legal and illegal texts, we compute the frequency distribution of words in the eBay corpus, the legal and illegal drugs Onion corpora, and the entire Onion drug section (All Onion)."}, {"id": 80, "string": "Since any two sets of texts are bound to show some disparity between them, we compare the differences between domains to a control setting, where we randomly split each examined corpus into two halves, and compute the frequency distribution of each of them."}, {"id": 81, "string": "The inner consistency of each corpus, defined as the similarity of distributions between the two halves, serves as a reference point for the similarity between domains."}, {"id": 82, "string": "We refer to this measure as \"self-distance\"."}, {"id": 83, "string": "Following Plank and van Noord (2011) , we compute the Jensen-Shannon divergence and Variational distance (also known as L1 or Manhattan) as the comparison measures between the word frequency histograms."}, {"id": 84, "string": "pora lies between 0.40 to 0.45 by the Jensen-Shannon divergence, but the distance between each pair is 0.60 to 0.65, with the three approximately forming an equilateral triangle in the space of word distributions."}, {"id": 85, "string": "Similar results are obtained using Variational distance, and are omitted for brevity."}, {"id": 86, "string": "These results suggest that rather than regarding all drug-related Onion texts as one domain, with legal and illegal texts as sub-domains, they should be treated as distinct domains."}, {"id": 87, "string": "Therefore, using Onion data to characterize the differences between illegal and legal linguistic attributes is sensible."}, {"id": 88, "string": "In fact, it is more sensible than comparing Illegal Onion to eBay text, as there the legal/illegal distinction may be confounded by the differences between eBay and Onion data."}, {"id": 89, "string": "Differences in Named Entities In order to analyze the difference in the distribution of named entities between the domains, we used a Wikification technique (Bunescu and Paşca, 2006) , i.e., linking entities to their corresponding article in Wikipedia."}, {"id": 90, "string": "Using spaCy's 4 named entity recognition, we first extract all named entity mentions from all the corpora."}, {"id": 91, "string": "5 We then search for relevant Wikipedia entries for each named entity using the DBpedia Ontology API (Daiber et al., 2013) ."}, {"id": 92, "string": "For each domain we compute the total number of named entities and the percentage with corresponding Wikipedia articles."}, {"id": 93, "string": "The results were obtained by averaging the percentage of wikifiable named entities in each site per domain."}, {"id": 94, "string": "We also report the standard error for each average."}, {"id": 95, "string": "According to our results (Table 2) , the Wikification success ratios of eBay and Illegal 4 https://spacy.io 5 We use all named entity types provided by spaCy (and not only \"Product\") to get a broader perspective on the differences between the domains in terms of their named entities."}, {"id": 96, "string": "For example, the named entity \"Peru\" (of type \"Geopolitical Entity\") appears multiple times in Onion sites and is meant to imply the quality of a drug."}, {"id": 97, "string": "Onion named entities is comparable and relatively low."}, {"id": 98, "string": "However, sites selling legal drugs on Onion have a much higher Wikification percentage."}, {"id": 99, "string": "Presumably the named entities in Onion sites selling legal drugs are more easily found in public databases such as Wikipedia because they are mainly well-known names for legal pharmaceuticals."}, {"id": 100, "string": "However, in both Illegal Onion and eBay sites, the list of named entities includes many slang terms for illicit drugs and paraphernalia."}, {"id": 101, "string": "These slang terms are usually not well known by the general public, and are therefore less likely to be covered by Wikipedia and similar public databases."}, {"id": 102, "string": "In addition to the differences in Wikification ratios between the domains, it seems spaCy had trouble correctly identifying named entities in both Onion and eBay sites, possibly due to the common use of informal language and drugrelated jargon."}, {"id": 103, "string": "Eyeballing the results, there were a fair number of false positives (words and phrases that were found by spaCy but were not actually named entities), especially in Illegal Onion sites."}, {"id": 104, "string": "In particular, slang terms for drugs, as well as abbreviated drug terms, for example \"kush\" or \"GBL\", were being falsely picked up by spaCy."}, {"id": 105, "string": "6 To summarize, results suggest both that (1) legal and illegal texts are different in terms of their named entities and their coverage in Wikipedia, as well as that (2) standard databases and standard NLP tools for named entity recognition (and potentially other text understanding tasks), require considerable adaptation to be fully functional on text related to illegal activity."}, {"id": 106, "string": "Classification Experiments Here we detail our experiments in classifying text from different legal and illegal domains using various methods, to find the most important linguistic features distinguishing between the domains."}, {"id": 107, "string": "Another goal of the classification task is to confirm our finding that the domains are distinguishable."}, {"id": 108, "string": "Experimental setup."}, {"id": 109, "string": "We split each subset among {eBay, Legal Onion, Illegal Onion} into training, validation and test."}, {"id": 110, "string": "We select 456 training paragraphs, 57 validation paragraphs and 58 test paragraphs for each category (approximately a 80%/10%/10% split), randomly downsampling larger categories for an even division of labels."}, {"id": 111, "string": "Model."}, {"id": 112, "string": "To classify paragraphs into categories, we experiment with five classifiers: • NB (Naive Bayes) classifier with binary bagof-words features, i.e., indicator feature for each word."}, {"id": 113, "string": "This simple classifier features frequently in work on text classification in the Darknet."}, {"id": 114, "string": "• SVM (support vector machine) classifier with an RBF kernel, also with BoW features that count the number of words of each type."}, {"id": 115, "string": "• BoE (bag-of-embeddings): each word is represented with its 100-dimensional GloVe vector (Pennington et al., 2014) ."}, {"id": 116, "string": "BoE sum (BoE average ) sums (averages) the embeddings for all words in the paragraph to a single vector, and applies a 100-dimensional fully-connected layer with ReLU nonlinearity and dropout p = 0.2."}, {"id": 117, "string": "The word vectors are not updated during training."}, {"id": 118, "string": "Vectors for words not found in GloVe are set randomly ∼ N (µ GloVe , σ 2 GloVe )."}, {"id": 119, "string": "• seq2vec: same as BoE, but instead of averaging word vectors, we apply a single-layer 100-dimensional BiLSTM to the word vectors, and take the concatenated final hidden vectors from the forward and backward part as the input to a fully-connected layer (same hyper-parameters as above)."}, {"id": 120, "string": "• attention: we replace the word representations with contextualized pre-trained representations from ELMo ."}, {"id": 121, "string": "We then apply a self-attentive classification network (McCann et al., 2017) over the contextualized representations."}, {"id": 122, "string": "This architecture has proved very effective for classification in recent work (Tutek and Šnajder, 2018; Shen et al., 2018) ."}, {"id": 123, "string": "For the NB classifier we use BernoulliNB from scikit-learn 7 with α = 1, and for the SVM classifier we use SVC, also from scikit-learn, with γ = scale and tolerance=10 −5 ."}, {"id": 124, "string": "We use the AllenNLP library 8  to implement the neural network classifiers."}, {"id": 125, "string": "7 https://scikit-learn.org 8 https://allennlp.org Data manipulation."}, {"id": 126, "string": "In order to isolate what factors contribute to the classifiers' performance, we experiment with four manipulations to the input data (in training, validation and testing)."}, {"id": 127, "string": "Specifically, we examine the impact of variations in the content words, function words and shallow syntactic structure (represented through POS tags)."}, {"id": 128, "string": "For this purpose, we consider content words as words whose universal part-of-speech according to spaCy is one of the following: Results when applying these manipulations are compared to the full condition, where all words are available."}, {"id": 129, "string": "Settings."}, {"id": 130, "string": "We experiment with two settings, classifying paragraphs from different domains: • Training and testing on eBay pages vs. Legal drug-related Onion pages, as a control experiment to identify whether Onion pages differ from clear net pages."}, {"id": 131, "string": "• Training and testing on Legal Onion vs."}, {"id": 132, "string": "Illegal Onion drugs-related pages, to identify the difference in language between legal and illegal activity on Onion drug-related websites."}, {"id": 133, "string": "Results The accuracy scores for the different classifiers and settings are reported in Table 3 ."}, {"id": 134, "string": "confirmed by the drop in accuracy when content words are removed."}, {"id": 135, "string": "However, in this setting (drop cont."}, {"id": 136, "string": "), non-trivial performance is still obtained by the SVM classifier, suggesting that the domains are distinguishable (albeit to a lesser extent) based on the function word distribution alone."}, {"id": 137, "string": "Surprisingly, the more sophisticated neural classifiers perform worse than Naive Bayes."}, {"id": 138, "string": "This is despite using pre-trained word embeddings, and architectures that have proven beneficial for text classification."}, {"id": 139, "string": "It is likely that this is due to the small size of the training data, as well as the specialized vocabulary found in this domain, which is unlikely to be supported well by the pre-trained embeddings (see §4.2)."}, {"id": 140, "string": "Legal vs. illegal drugs."}, {"id": 141, "string": "Classifying legal and illegal pages within the drugs domain on Onion proved to be a more difficult task."}, {"id": 142, "string": "However, where content words are replaced with their POS tags, the SVM classifier distinguishes between legal and illegal texts with quite a high accuracy (70.7% on a balanced test set)."}, {"id": 143, "string": "This suggests that the syntactic structure is sufficiently different between the domains, so as to make them distinguishable in terms of their distribution of grammatical categories."}, {"id": 144, "string": "Illegality Detection Across Domains To investigate illegality detection across different domains, we perform classification experiments on the \"forums\" category that is also separated into legal and illegal sub-categories in DUTA-10K."}, {"id": 145, "string": "The forums contain user-written text in various topics."}, {"id": 146, "string": "Legal forums often discuss web design and other technical and non-technical activity on the internet, while illegal ones involve discussions about cyber-crimes and guides on how to commit them, as well as narcotics, racism and other criminal activities."}, {"id": 147, "string": "As this domain contains usergenerated content, it is more varied and noisy."}, {"id": 148, "string": "Experimental setup We use the cleaning process described in Section 3 and data splitting described in Section 5, with the same number of paragraphs."}, {"id": 149, "string": "We experiment with two settings: • Training and testing on Onion legal vs. illegal forums, to evaluate whether the insights observed in the drugs domain generalize to user-generated content."}, {"id": 150, "string": "• Training on Onion legal vs. illegal drugsrelated pages, and testing on Onion legal vs. illegal forums."}, {"id": 151, "string": "This cross-domain evaluation reveals whether the distinctions learned on  the drugs domain generalize directly to the forums domain."}, {"id": 152, "string": "Results Accuracy scores are reported in Table 4 ."}, {"id": 153, "string": "Legal vs. illegal forums."}, {"id": 154, "string": "Results when training and testing on forums data are much worse for the neural-based systems, probably due to the much noisier and more varied nature of the data."}, {"id": 155, "string": "However, the SVM model achieves an accuracy of 85.3% in the full setting."}, {"id": 156, "string": "Good performance is presented by this model even in the cases where the content words are dropped (drop."}, {"id": 157, "string": "cont.)"}, {"id": 158, "string": "or replaced by part-of-speech tags (pos cont."}, {"id": 159, "string": "), underscoring the distinguishability of legal in illegal content based on shallow syntactic structure in this domain as well."}, {"id": 160, "string": "Cross-domain evaluation."}, {"id": 161, "string": "Surprisingly, training on drugs data and evaluating on forums performs much better than in the in-domain setting for four out of five classifiers."}, {"id": 162, "string": "This implies that while the forums data is noisy, it can be accurately classified into legal and illegal content when training on the cleaner drugs data."}, {"id": 163, "string": "This also shows that illegal texts in Tor share common properties regardless of topical category."}, {"id": 164, "string": "The much lower results obtained by the models where content words are dropped (drop cont.)"}, {"id": 165, "string": "or converted to POS tags (pos cont."}, {"id": 166, "string": "), namely less than 70% as opposed to 89.7% when function words are dropped, suggest that some of these properties are lexical."}, {"id": 167, "string": "Discussion As shown in Section 4, the Legal Onion and Illegal Onion domains are quite distant in terms of word distribution and named entity Wikification."}, {"id": 168, "string": "Moreover, named entity recognition and Wikification work less well for the illegal domain, and so do state-of-the-art neural text classification architectures (Section 5), which present inferior re-  sults to simple bag-of-words model."}, {"id": 169, "string": "This is likely a result of the different vocabulary and syntax of text from Onion domain, compared to standard domains used for training NLP models and pretrained word embeddings."}, {"id": 170, "string": "This conclusion has practical implications: to effectively process text in Onion, considerable domain adaptation should be performed, and effort should be made to annotate data and extend standard knowledge bases to cover this idiosyncratic domain."}, {"id": 171, "string": "Another conclusion from the classification experiments is that the Onion Legal and Illegal Onion texts are harder to distinguish than eBay and Legal Onion, meaning that deciding on domain boundaries should consider syntactic structure, and not only lexical differences."}, {"id": 172, "string": "Analysis of texts from the datasets."}, {"id": 173, "string": "Looking at specific sentences (Figure 1 ) reveals that Legal Onion and Illegal Onion are easy to distinguish based on the identity of certain words, e.g., terms for legal and illegal drugs, respectively."}, {"id": 174, "string": "Thus looking at the word forms is already a good solu-tion for tackling this classification problem, which gives further insight as to why modern text classification (e.g., neural networks) do not present an advantage in terms of accuracy."}, {"id": 175, "string": "Analysis of manipulated texts."}, {"id": 176, "string": "Given that replacing content words with their POS tags substantially lowers performance for classification of legal vs illegal drug-related texts (see \"pos cont.\""}, {"id": 177, "string": "in Section 5), we conclude that the distribution of parts of speech alone is not as strong a signal as the word forms for distinguishing between the domains."}, {"id": 178, "string": "However, the SVM model does manage to distinguish between the texts even in this setting."}, {"id": 179, "string": "Indeed, Figure 2 demonstrates that there are easily identifiable patterns distinguishing between the domains, but that a bag-of-words approach may not be sufficiently expressive to identify them."}, {"id": 180, "string": "Analysis of learned feature weights."}, {"id": 181, "string": "As the Naive Bayes classifier was the most successful at distinguishing legal from illegal texts in the full setting (without input manipulation), we may conclude that the very occurrence of certain words provides a strong indication that an instance is taken from one class or the other."}, {"id": 182, "string": "Table 5 shows the most indicative features learned by the Naive Bayes classifier for the Legal Onion vs."}, {"id": 183, "string": "Illegal Onion classification in this setting."}, {"id": 184, "string": "Interestingly, many strong features are function words, providing another indication of the different distribution of function words in the two domains."}, {"id": 185, "string": "Conclusion In this paper we identified several distinguishing factors between legal and illegal texts, taking a variety of approaches, predictive (text classification), application-based (named entity Wikification), as well as an approach based on raw statistics."}, {"id": 186, "string": "Our results revealed that legal and illegal texts on the Darknet are not only distinguishable in terms of their words, but also in terms of their shallow syntactic structure, manifested in their POS tag and function word distributions."}, {"id": 187, "string": "Distinguishing features between legal and illegal texts are consistent enough between domains, so that a classifier trained on drug-related websites can be straightforwardly ported to classify legal and illegal texts from another Darknet domain (forums)."}, {"id": 188, "string": "Our results also show that in terms of vocabulary, legal texts and illegal texts are as distant from each other, as from comparable texts from eBay."}, {"id": 189, "string": "We conclude from this investigation that Onion pages provide an attractive testbed for studying distinguishing factors between the text of legal and illegal webpages, as they present challenges to offthe-shelf NLP tools, but at the same time have sufficient self-consistency to allow studies of the linguistic signals that separate these classes."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 24}, {"section": "Related Work", "n": "2", "start": 25, "end": 51}, {"section": "Datasets Used", "n": "3", "start": 52, "end": 73}, {"section": "Domain Differences", "n": "4", "start": 74, "end": 78}, {"section": "Vocabulary Differences", "n": "4.1", "start": 79, "end": 88}, {"section": "Differences in Named Entities", "n": "4.2", "start": 89, "end": 105}, {"section": "Classification Experiments", "n": "5", "start": 106, "end": 132}, {"section": "Results", "n": "5.1", "start": 133, "end": 143}, {"section": "Illegality Detection Across Domains", "n": "6", "start": 144, "end": 147}, {"section": "Experimental setup", "n": "6.1", "start": 148, "end": 151}, {"section": "Results", "n": "6.2", "start": 152, "end": 166}, {"section": "Discussion", "n": "7", "start": 167, "end": 184}, {"section": "Conclusion", "n": "8", "start": 185, "end": 189}], "figures": [{"filename": "../figure/image/1096-Table4-1.png", "caption": "Table 4: Test accuracy in percents for each classifier (rows) in each setting (columns) on forums data.", "page": 5, "bbox": {"x1": 314.88, "x2": 518.4, "y1": 65.28, "y2": 311.03999999999996}}, {"filename": "../figure/image/1096-Table3-1.png", "caption": "Table 3: Test accuracy in percents for each classifier (rows) in each setting (columns) on drugs-related data.", "page": 5, "bbox": {"x1": 78.72, "x2": 283.2, "y1": 65.75999999999999, "y2": 311.03999999999996}}, {"filename": "../figure/image/1096-Figure1-1.png", "caption": "Figure 1: Example paragraphs (data instances) from the training sets of the Legal Onion and Illegal Onion subsets of the drug-related corpus (ten examples from each). Each paragraph is trimmed to the first 50 characters for space reasons. Distinguishing lexical features are easily observed, e.g., names of legal and illegal drugs.", "page": 6, "bbox": {"x1": 98.88, "x2": 498.71999999999997, "y1": 63.839999999999996, "y2": 209.28}}, {"filename": "../figure/image/1096-Figure2-1.png", "caption": "Figure 2: Example paragraphs (data instances) from the training sets of the Legal Onion and Illegal Onion subsets of the drug-related corpus (ten examples from each), where content words are replaced with their parts of speech. Each paragraph is trimmed to the first 50 characters for space reasons. Different instances are shown than in Figure 1. Although harder to identify, distinguishing patterns are observable in this case too.", "page": 6, "bbox": {"x1": 110.39999999999999, "x2": 487.2, "y1": 267.36, "y2": 416.15999999999997}}, {"filename": "../figure/image/1096-Table1-1.png", "caption": "Table 1: Jensen-Shannon divergence between word distribution in all Onion drug sites, Legal and Illegal Onion drug sites, and eBay sites. Each domain was also split in half for within-domain comparison.", "page": 2, "bbox": {"x1": 71.52, "x2": 526.0799999999999, "y1": 61.44, "y2": 243.35999999999999}}, {"filename": "../figure/image/1096-Table5-1.png", "caption": "Table 5: Most indicative features for each class in NB classifier trained on Onion legal vs. illegal drugs, and the ratio between their number of occurrences in the “illegal” class and the “legal” class in the training set. Left: features with lowest ratio; right: features with highest ratio. While some strong features are entities, many are in fact function words.", "page": 7, "bbox": {"x1": 72.96, "x2": 289.44, "y1": 63.839999999999996, "y2": 341.28}}, {"filename": "../figure/image/1096-Table2-1.png", "caption": "Table 2: Average percentage of wikifiable named entities in a website per domain, with standard error.", "page": 3, "bbox": {"x1": 110.88, "x2": 251.04, "y1": 61.44, "y2": 121.92}}]}