{"title": "Evaluating Neural Machine Translation in English-Japanese Task", "abstract": "Recently, by scaling up neural network models and incorporating some techniques during the training, the performance of NMT models have already achieved the state-of-the-art in English-French translation task (Luong et al.,", "text": [{"id": 0, "string": "In this paper, we evaluate Neural Machine Translation (NMT) models in English-Japanese translation task."}, {"id": 1, "string": "Various network architectures with different recurrent units are tested."}, {"id": 2, "string": "Additionally, we examine the effect of using pre-reordered data for the training."}, {"id": 3, "string": "Our experiments show that even simple NMT models can produce better translations compared with all SMT baselines."}, {"id": 4, "string": "For NMT models, recovering unknown words is another key to obtaining good translations."}, {"id": 5, "string": "We describe a simple workaround to find missing translations with a back-off system."}, {"id": 6, "string": "To our surprise, performing prereordering on the training data hurts the model performance."}, {"id": 7, "string": "Finally, we provide a qualitative analysis demonstrates a specific error pattern in NMT translations which omits some information and thus fail to preserve the complete meaning."}, {"id": 8, "string": "Introduction In the last two decades, Statistical Machine Translation (SMT) with log-linear models in the core has shown promising results in the field."}, {"id": 9, "string": "However, as stated in (Duh and Kirchhoff, 2008) , log-linear models may suffer from the underfitting problem and thus give poor performance."}, {"id": 10, "string": "While for recurrent neural networks (RNNs), as demonstrated in (Mikolov et al., 2010) , they brought significant improvement in Natural Language Processing tasks."}, {"id": 11, "string": "In their research, RNNs are shown to be capable of giving more prediction power compared with conventional language models when large training data is given."}, {"id": 12, "string": "Using these neural lan-guage models to rescore SMT outputs generally gives better translation results (Auli and Gao, 2014) ."}, {"id": 13, "string": "Other approaches rescore with RNNs that predict the next word by taking the word in current step and S as inputs (Kalchbrenner and Blunsom, 2013; Cho, Merrienboer, et al., 2014) ."}, {"id": 14, "string": "Here, S is a vector representation summarizes the whole input sentence."}, {"id": 15, "string": "Neural machine translation is a brand-new approach that samples translation results directly from RNNs."}, {"id": 16, "string": "Most published models involve an encoder and a decoder in the network architecture (Sutskever, Vinyals, and Le, 2014) , called Encoder-Decoder approach."}, {"id": 17, "string": "Figure 1 gives a general overview of this approach."}, {"id": 18, "string": "In Figure 1 , the vector output S of the encoder RNN represents the whole input sentence."}, {"id": 19, "string": "Hence, S contains all information required to produce the translation."}, {"id": 20, "string": "In order to boost up the performance, (Sutskever, Vinyals, and Le, 2014) used stacked Long Short-Term Memory (LSTM) units for both encoder and decoder, their ensembled models outperformed phrasebased SMT baseline in English-French translation task."}, {"id": 21, "string": "and English-German translation task (Jean et al., 2015) ."}, {"id": 22, "string": "In this paper, we describe our works on applying NMT to English-Japanese translation task."}, {"id": 23, "string": "The main contributions of this work are detailed as follows: • We examined the effect of using different network architecture and recurrent units for English-Japanese translation • We empirically evaluated NMT models trained on pre-reordered data • We demonstrate a simple solution to recover unknown words in the translation results with a back-off system • We provide a qualitative analysis on the translation results of NMT models Recurrent neural networks Recurrent neural network is the solution for modeling temporal data with neural networks."}, {"id": 24, "string": "The framework of widely used modern RNN is introduced by Elman (Elman, 1990) , it is also known as Elman Network or Simple Recurrent Network."}, {"id": 25, "string": "At each time step, RNN updates its internal state h t based on a new input x t and the previous state h t−1 , produces an output y t ."}, {"id": 26, "string": "Generally, they are computed recursively by applying following operations: h t = f (W i x t + W h h t−1 + b h ) (1) y t = f (W o h t + b o ) (2) Where f is an element-wise non-linearity, such as sigmoid or tanh."}, {"id": 27, "string": "Figures 2 illustrates the computational graph of a RNN."}, {"id": 28, "string": "Solid lines in the figure mark out the Affine transformations followed with a non-linear activation."}, {"id": 29, "string": "Dashed lines indicate that the result of previous computation is just a parameter of next operation."}, {"id": 30, "string": "The bias term b h is omitted in the illustration."}, {"id": 31, "string": "RNN can be trained with Backpropagation Through Time (BPTT), which is a gradientbased technique that unfolds the network through time so as to compute the actual gradients of parameters in each time step."}, {"id": 32, "string": "Long short-term memory For RNN, as the internal state h t is completely changed in each time step, BPTT algorithm dilutes error information after each step of computation."}, {"id": 33, "string": "Hence, RNN suffers from the problem that it is difficult to capture longterm dependencies."}, {"id": 34, "string": "Long short-term memory units (Hochreiter and Schmidhuber, 1997) incorporate some gates to control the information flow."}, {"id": 35, "string": "In addition to the hidden units in RNN, memory cells are used to store long-term information, which is updated linearly."}, {"id": 36, "string": "Empirically, LSTM can preserve information for arbitrarily long periods of time."}, {"id": 37, "string": "Figure 3 gives an illustration of the computational graph of a basic LSTM unit."}, {"id": 38, "string": "In which, input gate i t , forget gate f t and output gate o t are marked with rhombuses."}, {"id": 39, "string": "\"×\" and \"+\" are element-wise multiplication and elementwise addition respectively."}, {"id": 40, "string": "The computational steps follows (Graves, 2013) , 11 weight parameters are involved in this model, compared with only 2 weight parameters in RNN."}, {"id": 41, "string": "We can see from Figure 3 that the memory cells c t can keep unchanged when f t outputs 1 and i t outputs 0."}, {"id": 42, "string": "Gated recurrent unit Gated recurrent unit (GRU) is originally proposed in (Cho, Merrienboer, et al., 2014) ."}, {"id": 43, "string": "Similarly to LSTM unit, GRU also has gating units to control the information flow."}, {"id": 44, "string": "While LSTM unit has a separate memory cell, GRU unit only maintains one kind of internal states, thus reduces computational complexity."}, {"id": 45, "string": "The computational graph of a GRU unit is demonstrated in Figure 4 ."}, {"id": 46, "string": "As shown in the figure, 6 weight parameters are involved."}, {"id": 47, "string": "Network architectures of Neural Machine Translation A basic architecture of NMT is called Encoder-Decoder approach (Sutskever, Vinyals, and Le, 2014) , which encodes the input sequence into a vector representation, then unrolls it to generate the output sequence."}, {"id": 48, "string": "Then softmax function is applied to the output layer in order to compute cross-entropy."}, {"id": 49, "string": "Instead of using one-hot embeddings for the tokens in the vocabulary, trainable word embeddings are used."}, {"id": 50, "string": "As a pre-processing step, \"<eos>\" token is appended to the end of each sequence."}, {"id": 51, "string": "When translating, the token with the highest probability in the output layer is sampled and input back to the neural network to get next output."}, {"id": 52, "string": "This is done recursively until \"<eos>\" is observed."}, {"id": 53, "string": "Figure 5 gives a detailed illustration of this architecture when using stacked multilayer recurrent units."}, {"id": 54, "string": "Soft-attention models in NMT As stated in (Cho, Merriënboer, et al., 2014) , two critical drawbacks exist in the basic Encoder-Decoder approach: (1) the performance degrades when the input sentence gets longer, (2) the vocabulary size in the target Attentional models are first proposed in the field of computer vision, which allows the recurrent network to focus on a small portion in the image at each step."}, {"id": 55, "string": "The internal state is updated only depends on this glimpse."}, {"id": 56, "string": "Softattention first evaluates the weights for all possible positions to attend, then make a weighted summarization of all hidden states in the encoder."}, {"id": 57, "string": "The summarized vector is finally used to update the internal state of the decoder."}, {"id": 58, "string": "Contrary to hard-attention mechanism which selects only one location at each step and thus has to be trained with reinforce learning techniques, soft-attention mechanism makes the computational graph differentiable and thus able to be trained with standard backpropagation."}, {"id": 59, "string": "Figure 6 : The recurrent network using softattention mechanism to predict next output."}, {"id": 60, "string": "The application of soft-attention mechanism in machine translation is firstly described in (Bahdanau, Cho, and Bengio, 2014) , which is referred as \"RNNsearch\" in this paper."}, {"id": 61, "string": "The computational graph of a soft-attention NMT model is illustrated in Figure 6 ."}, {"id": 62, "string": "In which, the encoder is replaced by a bi-directional RNN, the hidden states of two RNNs is finally concatenated in each input position."}, {"id": 63, "string": "At each time step of decoding, an alignment weight a i is computed based on the previous state of the decoder and the concatenated hidden state of position i in the encoder."}, {"id": 64, "string": "The alignment weights are finally normalized by softmax function."}, {"id": 65, "string": "The weighted summarization of the hidden states in the encoder is then fed into the decoder."}, {"id": 66, "string": "Hence, the internal state of the decoder is updated based on 3 inputs: the previous state, weighted summarization of the encoder and the target-side input token."}, {"id": 67, "string": "The empirical results in (Bahdanau, Cho, and Bengio, 2014) show that the performance of RNNsearch does not degrade severely like normal Encoder-Decoder approach."}, {"id": 68, "string": "Solutions of unknown words A critical practical problem of NMT is the fixed vocabulary size in the output layer."}, {"id": 69, "string": "As the output layer uses dense connections, enlarging it will significantly increase the computational complexity and thus slow down the training."}, {"id": 70, "string": "According to existing publications, two kinds of approaches are used to tackle this problem: model-specific and translationspecific approach."}, {"id": 71, "string": "Well known modelspecific approaches are noise-contrastive training (Mnih and Kavukcuoglu, 2013) and classbased models (Mikolov et al., 2010) ."}, {"id": 72, "string": "In (Jean et al., 2015) , another model-specific solution is proposed by using only a small set of target vocabulary at each update."}, {"id": 73, "string": "By using a very large target vocabulary, they were able to outperform the state-of-the-art system in English-German translation task."}, {"id": 74, "string": "Solutions of Translation-specific approach usually take advantage of the alignment of tokens in both sides."}, {"id": 75, "string": "For examples, the proposed method in (Luong et al., 2015) annotates the unknown target words with \"unkpos i \" instead of \"unk\"."}, {"id": 76, "string": "Where the subscript i is the position of the aligned source word for the unknown target word."}, {"id": 77, "string": "The alignments can be obtained by conventional aligners."}, {"id": 78, "string": "The purpose of this processing step put some cues for recovering missing words into the output."}, {"id": 79, "string": "By applying this approach, they were able to surpass the state-of-the-art SMT system in English-French translation task."}, {"id": 80, "string": "Experiments Experiment setup In our experiments, we are curious to see how NMT models work in English-Japanese translation and how well the existing approaches for unknown words fit into this setting."}, {"id": 81, "string": "As Japanese language drastically differs from English in terms of word order and grammar structure."}, {"id": 82, "string": "NMT models must capture the semantics of long-range dependencies in a sentence in order to translate it well."}, {"id": 83, "string": "We use Japanese-English Scientific Paper Abstract Corpus (ASPEC-JE) as training data and focus on evaluating the models for English-Japanese translation task."}, {"id": 84, "string": "In order to make the training time-efficient, we pick 1.5M sentences according to similarity score then filter out long sentences with more than 40 words in either English or Japanese side."}, {"id": 85, "string": "This processing step gives 1.1M sentences for training."}, {"id": 86, "string": "We randomly separate out 1,280 sentences as valid data."}, {"id": 87, "string": "As almost zero pre-knowledge of NMT experiments in English-Japanese translation can be found in publications, our purpose is to conduct a thorough experiment so that we can evaluate and compare different model architectures and recurrent units."}, {"id": 88, "string": "However, the limitation of computational resource and time disallows us to massively test various models, training schemes, and hyper-parameters."}, {"id": 89, "string": "In our experiments, we evaluated four kinds of models as follow: Most of the details of these models are common."}, {"id": 90, "string": "The recurrent layers of all the models contain 1024 neurons each."}, {"id": 91, "string": "The size of word embedding is 1000."}, {"id": 92, "string": "We truncate the sourceside and target-side vocabulary sizes to 80k and 40k respectively."}, {"id": 93, "string": "For all models, we insert a dense layer contains 600 neurons immediately before the output layer."}, {"id": 94, "string": "We basically use SGD with learning rate decay as optimization method, the batch size is 60 and initial learning rate is 1."}, {"id": 95, "string": "The gradients are clipped to ensure L2 norm lower than 3."}, {"id": 96, "string": "Although we sort the training data according to the input length, the order of batches is shuffled before training."}, {"id": 97, "string": "For LSTM units, we set the bias of forget gate to 1 before training (Jozefowicz, Zaremba, and Sutskever, 2015) ."}, {"id": 98, "string": "During the translation, we set beam size to 20, if no valid translation is obtained, then another trail with beam size of 1000 will be performed."}, {"id": 99, "string": "Evaluating models by perplexity For our in-house experiments, the evaluation of our models mainly relies on the perplexity measured on valid data, as a strong correlation between perplexity and translation performance is observed in many existing publications (Luong et al., 2015) ."}, {"id": 100, "string": "The changing perplexities of the models described in Section 5.1 are visualized in Figure 7 ."}, {"id": 101, "string": "In Figure 7 , we can see that soft-attention models with LSTM unit constantly outperforms the muti-layer Encoder-Decoder model."}, {"id": 102, "string": "This matches our expectation as the alignment between English and Japanese is too complicated thus it is difficult for simple Encoder-Decoder models to capture it correctly."}, {"id": 103, "string": "Another observation is that the performance of the soft-attention model with GRU unit is significantly lower than that with LSTM unit."}, {"id": 104, "string": "As this is conflict with the results reported in other publications (Jozefowicz, Zaremba, and Sutskever, 2015) , one possible explanation is that some implementation issues exist and further investigation is required."}, {"id": 105, "string": "One surprising observation is that using prereordered data to train soft-attention models does not benefit the perplexity, but degrades the performance by a small margin."}, {"id": 106, "string": "We show that the same conclusion can be drawn by measuring translation performance directly in latter sections."}, {"id": 107, "string": "Replacing unknown words Initially, we adapt the solution described in (Luong et al., 2015) , which annotate the unknown words with \"unkpos i \", where i is the position of aligned source word."}, {"id": 108, "string": "We find this require source-side and target-side sentences roughly aligned."}, {"id": 109, "string": "When testing on the softattention model with pre-reordered training data, we found this method can correctly point out the rough aligned position of a missing word."}, {"id": 110, "string": "This allows us to recover the missing output words with a dictionary or SMT systems."}, {"id": 111, "string": "However, for the training data in natural order, the position of aligned words in two languages differs drastically."}, {"id": 112, "string": "The solution described above can hardly be applied as it annotates the unknown words with relative positions."}, {"id": 113, "string": "Here, we propose a simple workaround for recovering the unknown words with a back-off system."}, {"id": 114, "string": "We translate the input sentence using both a NMT system and a baseline SMT system."}, {"id": 115, "string": "Assume the translation results are similar, then if we observe an unknown word in the result of the NMT system, then it is reasonable to infer that the rarest word in the baseline result which is missing in the NMT result should be this unknown translation."}, {"id": 116, "string": "This is demonstrated in Figure 8 , the rarest word in the baseline result is picked out to replace the unknown word in the NMT result."}, {"id": 117, "string": "Practically, the assumption will not be true, the results of NMT systems and conventional SMT systems differ tremendously."}, {"id": 118, "string": "Hence, some incorrect word replacements are introduced."}, {"id": 119, "string": "This method can be generalized to recover multiple unknown words by selecting the rarest word in a near position."}, {"id": 120, "string": "Evaluating translation performance In this section, we describe our submitted systems and report the evaluation results in the English-Japanese translation task of The 2nd Workshop on Asian Translation 1 (Nakazawa et al., 2015) ."}, {"id": 121, "string": "We train these models with AdaDelta for 5 epochs."}, {"id": 122, "string": "Then, we fine-tune the model with AdaGrad using an enlarged training data, that each sentence contains no more than 50 words."}, {"id": 123, "string": "With this fine-tuning step, we are able to achieve perplexity of 1.76 in valid data."}, {"id": 124, "string": "The automatic evaluation results are shown in Table 1 ."}, {"id": 125, "string": "Three SMT baselines are picked for comparison."}, {"id": 126, "string": "In the middle of the table, we list two single soft-attention NMT models with LSTM unit."}, {"id": 127, "string": "The results show that training models on pre-reordered corpus leads to degrading of translation performance, where the pre-reordering step is done using the model described in (Zhu, 2014) ."}, {"id": 128, "string": "Our submitted systems are basically an ensemble of two LSTM Search models trained on natural-order data, as shown in the bottom of Table 1 ."}, {"id": 129, "string": "After we replaced unknown words with the technique described in 5.3, we gained 0.8 BLEU on test data."}, {"id": 130, "string": "This is our first submitted system, marked with \"S1\"."}, {"id": 131, "string": "We also found it is useful to perform a sys-1 Our team ID is \"WEBLIO MT\" tem combination based on perplexity scores."}, {"id": 132, "string": "We evaluate the perplexity for all outputs produced by a baseline system and the NMT model."}, {"id": 133, "string": "These two sets of perplexity score are normalized by mean and standard deviation respectively."}, {"id": 134, "string": "Then for each NMT result, we rescore it with the difference of perplexity against the baseline system."}, {"id": 135, "string": "Intuitively, if the NMT result is better than the baseline result, the new score shall be a positive number."}, {"id": 136, "string": "In our experiment, we pick the system described in (Zhu, 2014) as baseline system."}, {"id": 137, "string": "We pick top-1000 results from NMT and the rest from the baseline system, this gives us a gain of 1.8 in BLEU."}, {"id": 138, "string": "30.000 Submitted system 1 (S1) 43.500 Submitted system 2 (S2) 53.750 Finally, we added 3 pre-reordered LSTM Search models to the ensemble, results in a 5model ensemble."}, {"id": 139, "string": "During the translation, these three models receive pre-reordered input, another two LSTM Search models receive input in natural order."}, {"id": 140, "string": "We gain 0.24 BLEU with this setting, and this is the second submitted system, marked with \"S2\"."}, {"id": 141, "string": "Human evaluation results of our submitted systems are shown in Table 2 ."}, {"id": 142, "string": "As we already know that pre-reordering does not help improving translation performance, a natural choice is to train more normal LSTM Search models and put into the ensemble."}, {"id": 143, "string": "We failed to do it because of insufficient time."}, {"id": 144, "string": "Qualitative analysis To find some insights in the translation results of NMT systems, we performed qualitative analysis on a proportion of held-out development data."}, {"id": 145, "string": "During the inspection, we found many errors share the same pattern."}, {"id": 146, "string": "It turns out that NMT model tends to make a perfect translation by omitting some information during the translation."}, {"id": 147, "string": "In this case, the output tends to be a valid sentence, but the meaning is partially lost."}, {"id": 148, "string": "One example of this phenomenon is shown in the following snippet: Input: this paper discusses some systematic uncertainties including casimir force , false force due to electric force , and various factors for irregular uncertainties due to patch field and detector noise ."}, {"id": 149, "string": "Conclusion In this paper, we performed a systematic evaluation of various kinds for NMT models in the setting of English-Japanese translation."}, {"id": 150, "string": "Based on the empirical evaluation results, we found soft-attention NMT models can already make good translation results in English-Japanese translation task."}, {"id": 151, "string": "Their performance surpasses all SMT baselines by a substantial margin according to RIBES scores."}, {"id": 152, "string": "We also found that NMT models can work well without extra data processing steps such as pre-reordering."}, {"id": 153, "string": "Finally, we described a simple workaround to recover unknown words with a back-off system."}, {"id": 154, "string": "However, a sophisticated solution for dealing with unknown words is still an open question in the English-Japanese setting."}, {"id": 155, "string": "As some patterns of mistakes can be observed from the translation results, there exists some space for further improvements."}], "headers": [{"section": "Introduction", "n": "1", "start": 8, "end": 22}, {"section": "Recurrent neural networks", "n": "2", "start": 23, "end": 31}, {"section": "Long short-term memory", "n": "2.1", "start": 32, "end": 41}, {"section": "Gated recurrent unit", "n": "2.2", "start": 42, "end": 46}, {"section": "Network architectures of Neural Machine Translation", "n": "3", "start": 47, "end": 53}, {"section": "Soft-attention models in NMT", "n": "3.1", "start": 54, "end": 67}, {"section": "Solutions of unknown words", "n": "4", "start": 68, "end": 79}, {"section": "Experiment setup", "n": "5.1", "start": 80, "end": 98}, {"section": "Evaluating models by perplexity", "n": "5.2", "start": 99, "end": 106}, {"section": "Replacing unknown words", "n": "5.3", "start": 107, "end": 119}, {"section": "Evaluating translation performance", "n": "5.4", "start": 120, "end": 143}, {"section": "Qualitative analysis", "n": "5.5", "start": 144, "end": 148}, {"section": "Conclusion", "n": "6", "start": 149, "end": 155}], "figures": [{"filename": "../figure/image/1097-Figure1-1.png", "caption": "Figure 1: Basic neural network architecture in Encoder-Decoder approach", "page": 0, "bbox": {"x1": 307.68, "x2": 535.1999999999999, "y1": 570.72, "y2": 640.3199999999999}}, {"filename": "../figure/image/1097-Table1-1.png", "caption": "Table 1: Automatic evaluation results in WAT2015", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 529.4399999999999, "y1": 107.52, "y2": 247.2}}, {"filename": "../figure/image/1097-Table2-1.png", "caption": "Table 2: Human evaluation results for submitted system in WAT2015", "page": 5, "bbox": {"x1": 333.59999999999997, "x2": 495.35999999999996, "y1": 524.64, "y2": 581.28}}, {"filename": "../figure/image/1097-Figure3-1.png", "caption": "Figure 3: An illustration of a basic LSTM unit", "page": 1, "bbox": {"x1": 307.68, "x2": 535.1999999999999, "y1": 577.4399999999999, "y2": 720.0}}, {"filename": "../figure/image/1097-Figure2-1.png", "caption": "Figure 2: An illustration of the computational graph of a RNN", "page": 1, "bbox": {"x1": 325.92, "x2": 508.32, "y1": 59.519999999999996, "y2": 109.92}}, {"filename": "../figure/image/1097-Figure4-1.png", "caption": "Figure 4: An illustration of a GRU unit", "page": 2, "bbox": {"x1": 72.0, "x2": 299.03999999999996, "y1": 229.44, "y2": 336.96}}, {"filename": "../figure/image/1097-Figure5-1.png", "caption": "Figure 5: Illustration of a basic neural network architecture for NMT with stacked multi-layer recurrent units.", "page": 2, "bbox": {"x1": 329.76, "x2": 503.03999999999996, "y1": 64.8, "y2": 188.16}}, {"filename": "../figure/image/1097-Figure6-1.png", "caption": "Figure 6: The recurrent network using softattention mechanism to predict next output.", "page": 2, "bbox": {"x1": 313.92, "x2": 524.16, "y1": 538.56, "y2": 715.1999999999999}}, {"filename": "../figure/image/1097-Figure8-1.png", "caption": "Figure 8: Illustration of replacing unknown words with a back-off system.", "page": 4, "bbox": {"x1": 307.68, "x2": 534.24, "y1": 630.72, "y2": 695.04}}, {"filename": "../figure/image/1097-Figure7-1.png", "caption": "Figure 7: Visualization of the training for different models.", "page": 4, "bbox": {"x1": 72.96, "x2": 295.2, "y1": 540.48, "y2": 698.4}}]}