{"title": "What Kind of Language Is Hard to Language-Model?", "abstract": "How language-agnostic are current state-ofthe-art NLP tools? Are there some types of language that are easier to model with current methods? In prior work (Cotterell et al., 2018) we attempted to address this question for language modeling, and observed that recurrent neural network language models do not perform equally well over all the highresource European languages found in the Europarl corpus. We speculated that inflectional morphology may be the primary culprit for the discrepancy. In this paper, we extend these earlier experiments to cover 69 languages from 13 language families using a multilingual Bible corpus. Methodologically, we introduce a new paired-sample multiplicative mixed-effects model to obtain language difficulty coefficients from at-least-pairwise parallel corpora. In other words, the model is aware of inter-sentence variation and can handle missing data. Exploiting this model, we show that \"translationese\" is not any easier to model than natively written language in a fair comparison. Trying to answer the question of what features difficult languages have in common, we try and fail to reproduce our earlier (Cotterell et al., 2018) observation about morphological complexity and instead reveal far simpler statistics of the data that seem to drive complexity in a much larger sample.", "text": [{"id": 0, "string": "Introduction Do current NLP tools serve all languages?"}, {"id": 1, "string": "Technically, yes, as there are rarely hard constraints that prohibit application to specific languages, as long as there is data annotated for the task."}, {"id": 2, "string": "However, in practice, the answer is more nuanced: as most studies seem to (unfairly) assume English is representative of the world's languages (Bender, 2009 ), we do not have a clear idea how well models perform cross-linguistically in a controlled setting."}, {"id": 3, "string": "In this work, we look at current methods for language modeling and attempt to determine whether  there are typological properties that make certain languages harder to language-model than others."}, {"id": 4, "string": "One of the oldest tasks in NLP (Shannon, 1951 ) is language modeling, which attempts to estimate a distribution p(x) over strings x of a language."}, {"id": 5, "string": "Recent years have seen impressive improvements with recurrent neural language models (e.g., Merity et al., 2018) ."}, {"id": 6, "string": "Language modeling is an important component of tasks such as speech recognition, machine translation, and text normalization."}, {"id": 7, "string": "It has also enabled the construction of contextual word embeddings that provide impressive performance gains in many other NLP tasks (Peters et al., 2018 )-though those downstream evaluations, too, have focused on a small number of (mostly English) datasets."}, {"id": 8, "string": "In prior work (Cotterell et al., 2018) , we compared languages in terms of the difficulty of language modeling, controlling for differences in content by using a multi-lingual, fully parallel text corpus."}, {"id": 9, "string": "Few such corpora exist: in that paper, we made use of the Europarl corpus which, unfortunately, is not very typologically diverse."}, {"id": 10, "string": "Using a corpus with relatively few (and often related) languages limits the kinds of conclusions that can be drawn from any resulting comparisons."}, {"id": 11, "string": "In this paper, we present an alternative method that does not require the corpus to be fully parallel, so that collections consisting of many more languages can be compared."}, {"id": 12, "string": "Empirically, we report language-modeling results on 62 languages from 13 language families using Bible translations, and on the 21 languages used in the European Parliament proceedings."}, {"id": 13, "string": "We suppose that a language model's surprisal on a sentence-the negated log of the probability it assigns to the sentence-reflects not only the length and complexity of the specific sentence, but also the general difficulty that the model has in predicting sentences of that language."}, {"id": 14, "string": "Given language models of diverse languages, we jointly recover each language's difficulty parameter."}, {"id": 15, "string": "Our regression formula explains the variance in the dataset better than previous approaches and can also deal with missing translations for some purposes."}, {"id": 16, "string": "Given these difficulty estimates, we conduct a correlational study, asking which typological features of a language are predictive of modeling difficulty."}, {"id": 17, "string": "Our results suggest that simple properties of a language-the word inventory and (to a lesser extent) the raw character sequence length-are statistically significant indicators of modeling difficulty within our large set of languages."}, {"id": 18, "string": "In contrast, we fail to reproduce our earlier results from Cotterell et al."}, {"id": 19, "string": "(2018) , 1 which suggested morphological complexity as an indicator of modeling complexity."}, {"id": 20, "string": "In fact, we find no tenable correlation to a wide variety of typological features, taken from the WALS dataset and other sources."}, {"id": 21, "string": "Additionally, exploiting our model's ability to handle missing data, we directly test the hypothesis that translationese leads to easier language-modeling (Baker, 1993; Lembersky et al., 2012) ."}, {"id": 22, "string": "We ultimately cast doubt on this claim, showing that, under the strictest controls, translationese is different, but not any easier to model according to our notion of difficulty."}, {"id": 23, "string": "We conclude with a recommendation: The world 1 We can certainly replicate those results in the sense that, using the surprisals from those experiments, we achieve the same correlations."}, {"id": 24, "string": "However, we did not reproduce the results under new conditions (Drummond, 2009 )."}, {"id": 25, "string": "Our new conditions included a larger set of languages, a more sophisticated difficulty estimation method, and-perhaps crucially-improved language modeling families that tend to achieve better surprisals (or equivalently, better perplexity)."}, {"id": 26, "string": "being small, typology is in practice a small-data problem."}, {"id": 27, "string": "there is a real danger that cross-linguistic studies will under-sample and thus over-extrapolate."}, {"id": 28, "string": "We outline directions for future, more robust, investigations, and further caution that future work of this sort should focus on datasets with far more languages, something our new methods now allow."}, {"id": 29, "string": "The Surprisal of a Sentence When trying to estimate the difficulty (or complexity) of a language, we face a problem: the predictiveness of a language model on a domain of text will reflect not only the language that the text is written in, but also the topic, meaning, style, and information density of the text."}, {"id": 30, "string": "To measure the effect due only to the language, we would like to compare on datasets that are matched for the other variables, to the extent possible."}, {"id": 31, "string": "The datasets should all contain the same content, the only difference being the language in which it is expressed."}, {"id": 32, "string": "Multitext for a Fair Comparison To attempt a fair comparison, we make use of multitext-sentence-aligned 2 translations of the same content in multiple languages."}, {"id": 33, "string": "Different surprisals on the translations of the same sentence reflect quality differences in the language models, unless the translators added or removed information."}, {"id": 34, "string": "3 In what follows, we will distinguish between the i th sentence in language j, which is a specific string s i j , and the i th intent, the shared abstract thought that gave rise to all the sentences s i1 , s i2 , ."}, {"id": 35, "string": "."}, {"id": 36, "string": ".. For simplicity, suppose for now that we have a fully parallel corpus."}, {"id": 37, "string": "We select, say, 80% of the intents."}, {"id": 38, "string": "4 We use the English sentences that express these intents to train an English language model, and test it on the sentences that express the remaining 20% of the intents."}, {"id": 39, "string": "We will later drop the assumption of a fully parallel corpus ( §3), which will help us to estimate the effects of translationese ( §6)."}, {"id": 40, "string": "Comparing Surprisal Across Languages Given some test sentence s i j , a language model p defines its surprisal: the negative log-likelihood NLL(s i j ) = − log 2 p(s i j )."}, {"id": 41, "string": "This can be interpreted as the number of bits needed to represent the sentence under a compression scheme that is derived from the language model, with high-probability sentences requiring the fewest bits."}, {"id": 42, "string": "Long or unusual sentences tend to have high surprisal-but high surprisal can also reflect a language's model's failure to anticipate predictable words."}, {"id": 43, "string": "In fact, language models for the same language are often comparatively evaluated by their average surprisal on a corpus (the cross-entropy)."}, {"id": 44, "string": "Cotterell et al."}, {"id": 45, "string": "(2018) similarly compared language models for different languages, using a multitext corpus."}, {"id": 46, "string": "Concretely, recall that s i j and s i j should contain, at least in principle, the same information for two languages j and j -they are translations of each other."}, {"id": 47, "string": "But, if we find that NLL(s i j ) > NLL(s i j ), we must assume that either s i j contains more information than s i j , or that our language model was simply able to predict it less well."}, {"id": 48, "string": "5 If we were to assume that our language models were perfect in the sense that they captured the true probability distribution of a language, we could make the former claim; but we suspect that much of the difference can be explained by our imperfect LMs rather than inherent differences in the expressed information (see the discussion in footnote 3)."}, {"id": 49, "string": "Our Language Models Specifically, the crude tools we use are recurrent neural network language models (RNNLMs) over different types of subword units."}, {"id": 50, "string": "For fairness, it is of utmost importance that these language models are open-vocabulary, i.e., they predict the entire string and cannot cheat by predicting only UNK (\"unknown\") for some words of the language."}, {"id": 51, "string": "6 Char-RNNLM The first open-vocabulary RNNLM is the one of Sutskever et al."}, {"id": 52, "string": "(2011) , whose model generates a sentence, not word by 5 The former might be the result of overt marking of, say, evidentiality or gender, which adds information."}, {"id": 53, "string": "We hope that these differences are taken care of by diligent translators producing faithful translations in our multitext corpus."}, {"id": 54, "string": "6 We restrict the set of characters to those that we see at least 25 times in the training set, replacing all others with a new symbol , as is common and easily defensible in openvocabulary language modeling ."}, {"id": 55, "string": "We make an exception for Chinese, where we only require each character to appear at least twice."}, {"id": 56, "string": "These thresholds result in negligible \"out-of-alphabet\" rates for all languages."}, {"id": 57, "string": "word, but rather character by character."}, {"id": 58, "string": "An obvious drawback of the model is that it has no explicit representation of reusable substrings , but the fact that it does not rely on a somewhat arbitrary word segmentation or tokenization makes it attractive for this study."}, {"id": 59, "string": "We use a more current version based on LSTMs (Hochreiter and Schmidhuber, 1997) , using the implementation of Merity et al."}, {"id": 60, "string": "(2018) with the char-PTB parameters."}, {"id": 61, "string": "BPE-RNNLM BPE-based open-vocabulary language models make use of sub-word units instead of either words or characters and are a strong baseline on multiple languages ."}, {"id": 62, "string": "Before training the RNN, byte pair encoding (BPE; Sennrich et al., 2016) is applied globally to the training corpus, splitting each word (i.e., each space-separated substring) into one or more units."}, {"id": 63, "string": "The RNN is then trained over the sequence of units, which looks like this: \"The |ex|os|kel|eton |is |gener|ally |blue\"."}, {"id": 64, "string": "The set of subword units is finite and determined from training data only, but it is a superset of the alphabet, making it possible to explain any novel word in held-out data via some segmentation."}, {"id": 65, "string": "7 One important thing to note is that the size of this set can be tuned by specifying the number of BPE merges, allowing us to smoothly vary between a word-level model (∞ merges) and a kind of character-level model (0 merges)."}, {"id": 66, "string": "As Figure 2 shows, the number of merges that maximizes log-likelihood of our dev set differs from language to language."}, {"id": 67, "string": "8 However, as we will see in Figure 3 , tuning this parameter does not substantially influence our results."}, {"id": 68, "string": "We therefore will refer to the model with 0.4|V | merges as BPE-RNNLM."}, {"id": 69, "string": "3 Aggregating Sentence Surprisals Cotterell et al."}, {"id": 70, "string": "(2018) evaluated the model for language j simply by its total surprisal i NLL(s i j )."}, {"id": 71, "string": "This comparative measure required a complete multitext corpus containing every sentence s i j (the expression of the intent i in language j)."}, {"id": 72, "string": "We relax this requirement by using a fully probabilistic regression model that can deal with missing data  ( Figure 1 )."}, {"id": 73, "string": "9 Our model predicts each sentence's surprisal y i j = NLL(s i j ) using an intent-specific \"information content\" factor n i , which captures the inherent surprisal of the intent, combined with a language-specific difficulty factor d j ."}, {"id": 74, "string": "This represents a better approach to varying sentence lengths and lets us work with missing translations in the test data (though it does not remedy our need for fully parallel language model training data)."}, {"id": 75, "string": "Model 1: Multiplicative Mixed-effects Model 1 is a multiplicative mixed-effects model: y i j = n i · exp(d j ) · exp( i j ) (1) i j ∼ N (0, σ 2 ) (2) This says that each intent i has a latent size of n imeasured in some abstract \"informational units\"that is observed indirectly in the various sentences s i j that express the intent."}, {"id": 76, "string": "Larger n i tend to yield longer sentences."}, {"id": 77, "string": "Sentence s i j has y i j bits of surprisal; thus the multiplier y i j/n i represents the number of bits that language j used to express each informational unit of intent i, under our language model of language j."}, {"id": 78, "string": "Our mixedeffects model assumes that this multiplier is lognormally distributed over the sentences i: that is, log( y i j/n i ) ∼ N (d j , σ 2 ), where mean d j is the dif- ficulty of language j."}, {"id": 79, "string": "That is, y i j/n i = exp(d j + i j ) where i j ∼ N (0, σ 2 ) is residual noise, yielding equations (1)-(2)."}, {"id": 80, "string": "10 We jointly fit the intent sizes n i and the language difficulties d j ."}, {"id": 81, "string": "9 Specifically, we deal with data missing completely at random (MCAR), a strong assumption on the data generation process."}, {"id": 82, "string": "More discussion on this can be found in Appendix A."}, {"id": 83, "string": "10 It is tempting to give each language its own σ 2 j parameter, but then the MAP estimate is pathological, since infinite likelihood can be attained by setting one language's σ 2 j to 0."}, {"id": 84, "string": "Model 2: Heteroscedasticity Because it is multiplicative, Model 1 appropriately predicts that in each language j, intents with large n i will not only have larger y i j values but these values will vary more widely."}, {"id": 85, "string": "However, Model 1 is homoscedastic: the variance σ 2 of log( y i j/n i ) is assumed to be independent of the independent variable n i , which predicts that the distribution of y i j should spread out linearly as the information content n i increases: e.g., p(y i j ≥ 13 | n i = 10) = p(y i j ≥ 26 | n i = 20)."}, {"id": 86, "string": "That assumption is questionable, since for a longer sentence, we would expect log y i j/n i to come closer to its mean d j as the random effects of individual translational choices average out."}, {"id": 87, "string": "11 We address this issue by assuming that y i j results from n i ∈ N independent choices: y i j = exp(d j ) · n i k=1 exp i jk (3) i jk ∼ N (0, σ 2 ) (4) The number of bits for the k th informational unit now varies by a factor of exp i jk that is log-normal and independent of the other units."}, {"id": 88, "string": "It is common to approximate the sum of independent log-normals by another log-normal distribution, matching mean and variance (Fenton-Wilkinson approximation; Fenton, 1960) , 12 yielding Model 2: y i j = n i · exp(d j ) · exp( i j ) (1) σ 2 i = ln 1 + exp(σ 2 )−1 n i (5) i j ∼ N σ 2 −σ 2 i 2 , σ 2 i , (6) in which the noise term i j now depends on n i ."}, {"id": 89, "string": "Unlike (4), this formula no longer requires n i ∈ N; we allow any n i ∈ R >0 , which will also let us use gradient descent in estimating n i ."}, {"id": 90, "string": "In effect, fitting the model chooses each n i so that the resulting intent-specific but languageindependent distribution of n i · exp( i j ) values, 13 11 Similarly, flipping a fair coin 10 times results in 5 ± 1.58 heads where 1.58 represents the standard deviation, but flipping it 20 times does not result in 10 ± 1.58 · 2 heads but rather 10 ± 1.58 · √ 2 heads."}, {"id": 91, "string": "Thus, with more flips, the ratio heads/flips tends to fall closer to its mean 0.5."}, {"id": 92, "string": "12 There are better approximations, but even the only slightly more complicated Schwartz-Yeh approximation (Schwartz and Yeh, 1982) already requires costly and complicated approximations in addition to lacking the generalizability to nonintegral n i values that we will obtain for the Fenton-Wilkinson approximation."}, {"id": 93, "string": "13 The distribution of i j is the same for every j."}, {"id": 94, "string": "It no longer has mean 0, but it depends only on n i ."}, {"id": 95, "string": "after it is scaled by exp(d j ) for each language j, will assign high probability to the observed y i j ."}, {"id": 96, "string": "Notice that in Model 2, the scale of n i becomes meaningful: fitting the model will choose the size of the abstract informational units so as to predict how rapidly σ i falls off with n i ."}, {"id": 97, "string": "This contrasts with Model 1, where doubling all the n i values could be compensated for by halving all the exp(d j ) values."}, {"id": 98, "string": "Model 2L: An Outlier-Resistant Variant One way to make Model 2 more outlier-resistant is to use a Laplace distribution 14 instead of a Gaussian in (6) as an approximation to the distribution of i j ."}, {"id": 99, "string": "The Laplace distribution is heavy-tailed, so it is more tolerant of large residuals."}, {"id": 100, "string": "We choose its mean and variance just as in (6) ."}, {"id": 101, "string": "This heavy-tailed i j distribution can be viewed as approximating a version of Model 2 in which the i jk themselves follow some heavy-tailed distribution."}, {"id": 102, "string": "Estimating model parameters We fit each regression model's parameters by L-BFGS."}, {"id": 103, "string": "We then evaluate the model's fitness by measuring its held-out data likelihood-that is, the probability it assigns to the y i j values for held-out intents i."}, {"id": 104, "string": "Here we use the previously fitted d j and σ parameters, but we must newly fit n i values for the new i using MAP estimates or posterior means."}, {"id": 105, "string": "A full comparison of our models under various conditions can be found in Appendix C. The primary findings are as follows."}, {"id": 106, "string": "On Europarl data (which has fewer languages), Model 2 performs best."}, {"id": 107, "string": "On the Bible corpora, all models are relatively close to one another, though the robust Model 2L gets more consistent results than Model 2 across data subsets."}, {"id": 108, "string": "We use MAP estimates under Model 2 for all remaining experiments for speed and simplicity."}, {"id": 109, "string": "15 A Note on Bayesian Inference As our model of y i j values is fully generative, one could place priors on our parameters and do full inference of the posterior rather than performing MAP inference."}, {"id": 110, "string": "We did experiment with priors but found them so quickly overruled by the data that it did not make much sense to spend time on them."}, {"id": 111, "string": "Specifically, for full inference, we implemented all models in STAN (Carpenter et al., 2017) , a 14 One could also use a Cauchy distribution instead of the Laplace distribution to get even heavier tails, but we saw little difference between the two in practice."}, {"id": 112, "string": "15 Further enhancements are possible: we discuss our \"Model 3\" in Appendix B, but it did not seem to fit better."}, {"id": 113, "string": "toolkit for fast, state-of-the-art inference using Hamiltonian Monte Carlo (HMC) estimation."}, {"id": 114, "string": "Running HMC unfortunately scales sublinearly with the number of sentences (and thus results in very long sampling times), and the posteriors we obtained were unimodal with relatively small variances (see also Appendix C)."}, {"id": 115, "string": "We therefore work with the MAP estimates in the rest of this paper."}, {"id": 116, "string": "The Difficulties of 69 languages Having outlined our method for estimating language difficulty scores d j , we now seek data to do so for all our languages."}, {"id": 117, "string": "If we wanted to cover the most languages possible with parallel text, we should surely look at the Universal Declaration of Human Rights, which has been translated into over 500 languages."}, {"id": 118, "string": "Yet this short document is far too small to train state-of-the-art language models."}, {"id": 119, "string": "In this paper, we will therefore follow previous work in using the Europarl corpus (Koehn, 2005) , but also for the first time make use of 106 Bibles from Mayer and Cysouw (2014)'s corpus."}, {"id": 120, "string": "Although our regression models of the surprisals y i j can be estimated from incomplete multitext, the surprisals themselves are derived from the language models we are comparing."}, {"id": 121, "string": "To ensure that the language models are comparable, we want to train them on completely parallel data in the various languages."}, {"id": 122, "string": "For this, we seek complete multitext."}, {"id": 123, "string": "Europarl: 21 Languages The Europarl corpus (Koehn, 2005) contains decades worth of discussions of the European Parliament, where each intent appears in up to 21 languages."}, {"id": 124, "string": "It was previously used by Cotterell et al."}, {"id": 125, "string": "(2018) for its size and stability."}, {"id": 126, "string": "In §6, we will also exploit the fact that each intent's original language is known."}, {"id": 127, "string": "To simplify our access to this information, we will use the \"Corrected & Structured Europarl Corpus\" (CoStEP) corpus (Graën et al., 2014) ."}, {"id": 128, "string": "From it, we extract the intents that appear in all 21 languages, as enumerated in footnote 8."}, {"id": 129, "string": "The full extraction process and corpus statistics are detailed in Appendix D. The Bible: 62 Languages The Bible is a religious text that has been used for decades as a dataset for massively multilingual NLP (Resnik et al., 1999; Yarowsky et al., 2001; Agić et al., 2016) tokenized 16 and aligned collection assembled by Mayer and Cysouw (2014) ."}, {"id": 130, "string": "We use the smallest annotated subdivision (a single verse) as a sentence in our difficulty estimation model; see footnote 2."}, {"id": 131, "string": "Some of the Bibles in the dataset are incomplete."}, {"id": 132, "string": "As the Bibles include different sets of verses (intents), we have to select a set of Bibles that overlap strongly, so we can use the verses shared by all these Bibles to comparably train all our language models (and fairly test them: see Appendix A)."}, {"id": 133, "string": "We cast this selection problem as an integer linear program (ILP), which we solve exactly in a few hours using the Gurobi solver (more details on this selection in Appendix E)."}, {"id": 134, "string": "This optimal solution keeps 25996 verses, each of which appears across 106 Bibles in 62 languages, 17 spanning 13 language families."}, {"id": 135, "string": "18 We allow j to range over the 106 Bibles, so when a language has multiple Bibles, we estimate a separate difficulty d j for each one."}, {"id": 136, "string": "Results The estimated difficulties are visualized in Figure 4 ."}, {"id": 137, "string": "We can see that general trends are preserved between datasets: German and Hungarian are hardest, English and Lithuanian easiest."}, {"id": 138, "string": "As we can see in Figure 3 for Europarl, the difficulty estimates are 16 The fact that the resource is tokenized is (yet) another possible confound for this study: we are not comparing performance on languages, but on languages/Bibles with some specific translator and tokenization."}, {"id": 139, "string": "It is possible that our y i j values for each language j depend to a small degree on the tokenizer that was chosen for that language."}, {"id": 140, "string": "17 afr, aln, arb, arz, ayr, bba, ben, bqc, bul, cac, cak, ceb, ces, cmn, cnh, cym, dan, deu, ell, eng, epo, fin, fra, guj, gur, hat, hrv, hun, ind, ita, kek, kjb, lat, lit, mah, mam, mri, mya, nld, nor, plt, poh, por, qub, quh, quy, quz, ron, rus, som, tbz, tcw, tgl, tlh, tpi, tpm, ukr, vie, wal, wbm, xho, zom 18 22 Indo-European, 6 Niger-Congo, 6 Mayan, 6 Austronesian, 4 Sino-Tibetan, 4 Quechuan, 4 Afro-Asiatic, 2 Uralic, 2 Creoles, 2 Constructed languages, 2 Austro-Asiatic, 1 Totonacan, 1 Aymaran."}, {"id": 141, "string": "For each language, we are reporting here the first family listed by Ethnologue (Paul et al., 2009) , manually fixing tlh → Constructed language."}, {"id": 142, "string": "It is unfortunate not to have more families or more languages per family."}, {"id": 143, "string": "A broader sample could be obtained by taking only the New Testament-but unfortunately that has < 8000 verses, a meager third of our dataset that is already smaller that the usually considered tiny PTB dataset (see details in Appendix E)."}, {"id": 144, "string": "hardly affected when tuning the number of BPE merges per-language instead of globally, validating our approach of using the BPE model for our experiments."}, {"id": 145, "string": "A bigger difference seems to be the choice of char-RNNLM vs. BPE-RNNLM, which changes the ranking of languages both on Europarl data and on Bibles."}, {"id": 146, "string": "We still see German as the hardest language, but almost all other languages switch places."}, {"id": 147, "string": "Specifically, we can see that the variance of the char-RNNLM is much higher."}, {"id": 148, "string": "Are All Translations the Same?"}, {"id": 149, "string": "Texts like the Bible are justly infamous for their sometimes archaic or unrepresentative use of language."}, {"id": 150, "string": "The fact that we sometimes have multiple Bible translations in the same language lets us observe variation by translation style."}, {"id": 151, "string": "The sample standard deviation of d j among the 106 Bibles j is 0.076/0.063 for BPE/char-RNNLM."}, {"id": 152, "string": "Within the 11 German, 11 French, and 4 English Bibles, the sample standard deviations were roughly 0.05/0.04, 0.05/0.04, and 0.02/0.04 respectively: so style accounts for less than half the variance."}, {"id": 153, "string": "We also consider another parallel corpus, created from the NIST OpenMT competitions on machine translation, in which each sentence has 4 English translations (NIST Multimodal Information Group, 2010a ,b,c,d,e,f,g, 2013b ."}, {"id": 154, "string": "We get a sample standard deviation of 0.01/0.03 among the 4 resulting English corpora, suggesting that language difficulty estimates (particularly the BPE estimate) depend less on the translator, to the extent that these corpora represent individual translators."}, {"id": 155, "string": "What Correlates with Difficulty?"}, {"id": 156, "string": "Making use of our results on these languages, we can now answer the question: what features of a language correlate with the difference in language complexity?"}, {"id": 157, "string": "Sadly, we cannot conduct all analyses on all data: the Europarl languages are well-served by existing tools like UDPipe (Straka et al., 2016) , but the languages of our Bibles are often not."}, {"id": 158, "string": "We therefore conduct analyses that rely on automatically extracted features only on the Europarl corpora."}, {"id": 159, "string": "Note that to ensure a false discovery rate of at most α = .05, all reported p-values have to be corrected using Benjamini and Hochberg (1995) 's procedure: only p ≤ .05· 5 /28 ≈ 0.009 is significant."}, {"id": 160, "string": "Highlighted on the right are deu and fra, for which we have many Bibles, and eng, which has often been prioritized even over these two in research."}, {"id": 161, "string": "In the middle we see the difficulties of the 14 languages that are shared between the Bibles and Europarl aligned to each other (averaging all estimates), indicating that the general trends we see are not tied to either corpus."}, {"id": 162, "string": "choose among forms like \"talk,\" \"talks,\" \"talking\") was mainly responsible for difficulty in modeling."}, {"id": 163, "string": "They found a language's Morphological Counting Complexity (Sagot, 2013) to correlate positively with its difficulty."}, {"id": 164, "string": "We use the reported MCC values from that paper for our 21 Europarl languages, but to our surprise, find no statistically significant correlation with the newly estimated difficulties of our new language models."}, {"id": 165, "string": "Comparing the scatterplot for both languages in Figure 5 Figure 1 , we see that the high-MCC outlier Finnish has become much easier in our (presumably) better-tuned models."}, {"id": 166, "string": "We suspect that the reported correlation in that paper was mainly driven by such outliers and conclude that MCC is not a good predictor of modeling difficulty."}, {"id": 167, "string": "Perhaps finer measures of morphological complexity would be more predictive."}, {"id": 168, "string": "(2018) propose an alternative measure of morphosyntactic complexity."}, {"id": 169, "string": "Given a corpus of dependency graphs, they estimate the conditional entropy of the POS tag of a random token's parent, conditioned on the token's type."}, {"id": 170, "string": "In a language where this HPE-mean metric is low, most tokens can predict the POS of their parent even without context."}, {"id": 171, "string": "We compute HPE-mean from dependency parses of the Europarl data, generated using UDPipe 1.2.0 (Straka et al., 2016) and freely-available tokenization, tagging, parsing models trained on the Universal Dependencies 2.0 treebanks (Straka and Strakov, 2017) ."}, {"id": 172, "string": "HPE-mean may be regarded as the mean over all corpus tokens of Head POS Entropy (Dehouck and Denis, 2018) , which is the entropy of the POS tag of a token's parent given that particular token's type."}, {"id": 173, "string": "We also compute HPE-skew, the (positive) skewness of the empirical distribution of HPE on the corpus tokens."}, {"id": 174, "string": "We remark that in each language, HPE is 0 for most tokens."}, {"id": 175, "string": "Morphological Counting Complexity Head-POS Entropy Dehouck and Denis As predictors of language difficulty, HPE-mean has a Spearman's ρ = .004/−.045 (p > .9/.8) and HPE-skew has a Spearman's ρ = .032/.158 (p > .8/.4), so this is not a positive result."}, {"id": 176, "string": "Average dependency length It has been observed that languages tend to minimize the distance between heads and dependents (Liu, 2008) ."}, {"id": 177, "string": "Speakers prefer shorter dependencies in both production and processing, and average dependency lengths tend to be much shorter than would be expected from randomly-generated parses (Futrell et al., 2015; Liu et al., 2017) ."}, {"id": 178, "string": "On the other hand, there is substantial variability between languages, and it has been proposed, for example, that head-final languages and case-marking languages tend to have longer dependencies on average."}, {"id": 179, "string": "Do language models find short dependencies easier?"}, {"id": 180, "string": "We find that average dependency lengths estimated from automated parses are very closely correlated with those estimated from (held-out) manual parse trees."}, {"id": 181, "string": "We again use the automaticallyparsed Europarl data and compute dependency lengths using the Futrell et al."}, {"id": 182, "string": "(2015) procedure, which excludes punctuation and standardizes several other grammatical relationships (e.g., objects of prepositions are made to depend on their prepositions, and verbs to depend on their complementizers)."}, {"id": 183, "string": "Our hypothesis that scrambling makes language harder to model seems confirmed at first: while the non-parametric (and thus more weakly powered) Spearman's ρ = .196/.092 (p = .394/.691), Pearson's r = .486/.522 (p = .032/.015)."}, {"id": 184, "string": "However, after correcting for multiple comparisons, this is also non-significant."}, {"id": 185, "string": "19 WALS features The World Atlas of Language Structures (WALS; Dryer and Haspelmath, 2013) contains nearly 200 binary and integer features for over 2000 languages."}, {"id": 186, "string": "Similarly to the Bible situation, not all features are present for all languages-and for some of our Bibles, no information can be found at all."}, {"id": 187, "string": "We therefore restrict our attention to two well-annotated WALS features that are present in enough of our Bible languages (foregoing Europarl to keep the analysis simple): 26A \"Prefixing vs. Suffixing in Inflectional Morphology\" and 81A \"Order of Subject, Object and Verb.\""}, {"id": 188, "string": "The results are again not quite as striking as we would hope."}, {"id": 189, "string": "In particular, in Mood's median null hypothesis significance test neither 26A (p > .3 / .7 for BPE/char-RNNLM) nor 81A (p > .6 / .2 for BPE/char-RNNLM) show any significant differences between categories (detailed results in Appendix F.1)."}, {"id": 190, "string": "We therefore turn our attention to much simpler, yet strikingly effective heuristics."}, {"id": 191, "string": "Raw character sequence length An interesting correlation emerges between language difficulty 19 We also caution that the significance test for Pearson's assumes that the two variables are bivariate normal."}, {"id": 192, "string": "If not, then even a significant r does not allow us to reject the null hypothesis of zero covariance (Kowalski, 1972, Figs."}, {"id": 193, "string": "1-2,  §5) ."}, {"id": 194, "string": "for the char-RNNLM and the raw length in characters of the test corpus (detailed results in Appendix F.2)."}, {"id": 195, "string": "On both Europarl and the more reliable Bible corpus, we have positive correlation for the char-RNNLM at a significance level of p < .001, passing the multiple-test correction."}, {"id": 196, "string": "The BPE-RNNLM correlation on the Bible corpus is very weak, suggesting that allowing larger units of prediction effectively eliminates this source of difficulty (van Merriënboer et al., 2017) ."}, {"id": 197, "string": "Raw word inventory Our most predictive feature, however, is the size of the word inventory."}, {"id": 198, "string": "To obtain this number, we count the number of distinct types |V | in the (tokenized) training set of a language (detailed results in Appendix F.3)."}, {"id": 199, "string": "20 While again there is little power in the small set of Europarl languages, on the bigger set of Bibles we do see the biggest positive correlation of any of our features-but only on the BPE model (p < 1e−11)."}, {"id": 200, "string": "Recall that the char-RNNLM has no notion of words, whereas the number of BPE units increases with |V | (indeed, many whole words are BPE units, because we do many merges but BPE stops at word boundaries)."}, {"id": 201, "string": "Thus, one interpretation is that the Bible corpora are too small to fit the parameters for all the units needed in large-vocabulary languages."}, {"id": 202, "string": "A similarly predictive feature on Bibleswhose numerator is this word inventory size-is the type/token ratio, where values closer to 1 are a traditional omen of undertraining."}, {"id": 203, "string": "An interesting observation is that on Europarl, the size of the word inventory and the morphological counting complexity of a language correlate quite well with each other (Pearson's ρ = .693 at p = .0005, Spearman's ρ = .666 at p = .0009), so the original claim in Cotterell et al."}, {"id": 204, "string": "(2018) about MCC may very well hold true after all."}, {"id": 205, "string": "Unfortunately, we cannot estimate the MCC for all the Bible languages, or this would be easy to check."}, {"id": 206, "string": "21 Given more nuanced linguistic measures (or more languages), our methods may permit discovery of specific linguistic correlates of modeling difficulty, beyond these simply suggestive results."}, {"id": 207, "string": "20 A more sophisticated version of this feature might consider not just the existence of certain forms but also their rates of appearance."}, {"id": 208, "string": "We did calculate the entropy of the unigram distribution over words in a language, but we found that is strongly correlated with the size of the word inventory and not any more predictive."}, {"id": 209, "string": "21 Perhaps in a future where more data has been annotated by the UniMorph project (Kirov et al., 2018) , a yet more comprehensive study can be performed, and the null hypothesis for the MCC can be ruled out after all."}, {"id": 210, "string": "Evaluating Translationese Our previous experiments treat translated sentences just like natively generated sentences."}, {"id": 211, "string": "But since Europarl contains information about which language an intent was originally expressed in, 22 here we have the opportunity to ask another question: is translationese harder, easier, indistinguishable, or impossible to tell?"}, {"id": 212, "string": "We tackle this question by splitting each language j into two sub-languages, \"native\" j and \"translated\" j, resulting in 42 sublanguages with 42 difficulties."}, {"id": 213, "string": "23 Each intent is expressed in at most 21 sub-languages, so this approach requires a regresssion method that can handle missing data, such as the probabilistic approach we proposed in §3."}, {"id": 214, "string": "Our mixed-effects modeling ensures that our estimation focuses on the differences between languages, controlling for content by automatically fitting the n i factors."}, {"id": 215, "string": "Thus, we are not in danger of calling native German more complicated than translated German just because German speakers in Parliament may like to talk about complicated things in complicated ways."}, {"id": 216, "string": "In a first attempt, we simply use our alreadytrained BPE-best models (as they perform the best and are thus most likely to support claims about the language itself rather than the shortcomings of any singular model), limit ourselves to only splitting the eight languages that have at least 500 native sentences 24 (to ensure stable results)."}, {"id": 217, "string": "Indeed we seem to find that native sentences are slightly more difficult: their d j is 0.027 larger (± 0.023, averaged over our selected 8 languages)."}, {"id": 218, "string": "But are they?"}, {"id": 219, "string": "This result is confounded by the fact that our RNN language models were trained mostly on translationese text (even the English data is mostly translationese)."}, {"id": 220, "string": "Thus, translationese might merely be different (Rabinovich and Wintner, 2015) -not necessarily easier to model, but overrepresented when training the model, making the translationese test sentences more predictable."}, {"id": 221, "string": "To remove this confound, we must train our language 22 It should be said that using Europarl for translationese studies is not without caveats (Rabinovich et al., 2016) , one of them being the fact that not all language pairs are translated equally: a natively Finnish sentence is translated first into English, French, or German (pivoting) and only from there into any other language like Bulgarian."}, {"id": 222, "string": "23 This method would also allow us to study the effect of source language, yielding d j←j for sentences translated from j into j."}, {"id": 223, "string": "Similarly, we could have included surprisals from both models, jointly estimating d j,char-RNN and d j,BPE values."}, {"id": 224, "string": "24 en (3256), fr (1650), de (1275), pt (1077), it (892), es (685), ro (661), pl (594) models on equal parts translationese and native text."}, {"id": 225, "string": "We cannot do this for multiple languages at once, given our requirement of training all language models on the same intents."}, {"id": 226, "string": "We thus choose to balance only one language-we train all models for all languages, making sure that the training set for one language is balanced-and then perform our regression, reporting the translationese and native difficulties only for the balanced language."}, {"id": 227, "string": "We repeat this process for every language that has enough intents."}, {"id": 228, "string": "We sample equal numbers of native and non-native sentences, such that there are ∼1M words in the corresponding English column (to be comparable to the PTB size)."}, {"id": 229, "string": "To raise the number of languages we can split in this way, we restrict ourselves here to fully-parallel Europarl in only 10 languages 25 instead of 21, thus ensuring that each of these 10 languages has enough native sentences."}, {"id": 230, "string": "On this level playing field, the previously observed effect practically disappears (-0.0044 ± 0.022), leading us to question the widespread hypothesis that translationese is \"easier\" to model (Baker, 1993 )."}, {"id": 231, "string": "26 Conclusion There is a real danger in cross-linguistic studies of over-extrapolating from limited data."}, {"id": 232, "string": "We reevaluated the conclusions of Cotterell et al."}, {"id": 233, "string": "(2018) on a larger set of languages, requiring new methods to select fully parallel data ( §4.2) or handle missing data."}, {"id": 234, "string": "We showed how to fit a paired-sample multiplicative mixed-effects model to probabilistically obtain language difficulties from at-least-pairwise parallel corpora."}, {"id": 235, "string": "Our language difficulty estimates were largely stable across datasets and language model architectures, but they were not significantly predicted by linguistic factors."}, {"id": 236, "string": "However, a language's vocabulary size and the length in characters of its sentences were well-correlated with difficulty on our large set of languages."}, {"id": 237, "string": "Our mixed-effects approach could be used to assess other NLP systems via parallel texts, separating out the influences on performance of language, sentence, model architecture, and training procedure."}, {"id": 238, "string": "A A Note on Missing Data We stated that our model can deal with missing data, but this is true only for the case of data missing completely at random (MCAR), the strongest assumption we can make about missing data: the missingness of data is neither influenced by what the value would have been (had it not been missing), nor by any covariates."}, {"id": 239, "string": "Sadly, this assumption is rarely met in real translations, where difficult, useless, or otherwise distinctive sentences may be skipped."}, {"id": 240, "string": "This leads to data missing at random (MAR), where the missingness of a translation is correlated with the original sentence it should have been translated from-or even data missing not at random (MNAR), where the missingness of a translation is correlated with that translation, i.e., the original sentence was translated, but the translation was then deleted for a reason that depends on the translation itself)."}, {"id": 241, "string": "For this reason we use fully parallel data where possible; in fact, we only make use of the ability to deal with missing data in §6."}, {"id": 242, "string": "27 B Regression, Model 3: Handling outliers cleverly Consider the problem of outliers."}, {"id": 243, "string": "In some cases, sloppy translation will yield a y i j that is unusually high or low given the y i j values of other languages j ."}, {"id": 244, "string": "Such a y i j is not good evidence of the quality of the language model for language j since it has been corrupted by the sloppy translation."}, {"id": 245, "string": "However, under Model 1 or 2, we could not simply explain this corrupted y i j with the random residual i j since large | i j | is highly unlikely under the Gaussian assumption of those models."}, {"id": 246, "string": "Rather, y i j would have significant influence on our estimate of the per-language effect d j ."}, {"id": 247, "string": "This is the usual motivation for switching to L1 regression, which replaces the Gaussian prior on the residuals with a Laplace prior."}, {"id": 248, "string": "28 How can we include this idea into our models?"}, {"id": 249, "string": "First let us identify two failure modes: (a) part of a sentence was omitted (or added) during translation, changing the n i additively; thus we should use a noisy n i + ν i j in place of n i in equations (1) and (5) 27 Note that this application counts as data MAR and not MCAR, thus technically violating our requirements, but only in a minor enough way that we are confident it can still be applied."}, {"id": 250, "string": "28 An alternative would be to use a method like RANSAC to discard y i j values that do not appear to fit."}, {"id": 251, "string": "(b) the style of the translation was unusual throughout the sentence; thus we should use a noisy n i · exp ν i j instead of n i in equations (1) and (5) In both cases ν i j ∼ Laplace(0, b), i.e., ν i j specifies sparse additive or multiplicative noise in ν i j (on language j only)."}, {"id": 252, "string": "29 Let us write out version (b), which is a modification of Model 2 (equations (1), (5) and (6) ): y i j = (n i · exp ν i j ) · exp(d j ) · exp( i j ) = n i · exp(d j ) · exp( i j + ν i j ) (7) ν i j ∼ Laplace(0, b) (8) σ 2 i = ln 1 + exp(σ 2 )−1 n i ·exp ν i j (9) i j ∼ N σ 2 −σ 2 i 2 , σ 2 i , (10) Comparing equation (7) to equation (1) , we see that we are now modeling the residual error in log y i j as a sum of two noise terms a i j = ν i j + i j and penalizing it by (some multiple of) the weighted sum of |ν i j | and 2 i j , where large errors can be more cheaply explained using the former summand, and small errors using the latter summand."}, {"id": 253, "string": "30 The weighting of the two terms is a tunable hyperparameter."}, {"id": 254, "string": "We did implement this model and test it on data, but not only was fitting it much harder and slower, it also did not yield particularly encouraging results, leading us to omit it from the main text."}, {"id": 255, "string": "C Goodness of fit of our difficulty estimation models Figure 6 shows the log-probability of held-out data under the regression model, by fixing the estimated difficulties d j (and sometimes also the estimated variance σ 2 ) to their values obtained from training data, and then finding either MAP estimates or posterior means (by running HMC using STAN) of 29 However, version (a) is then deficient since it then incorrectly allocates some probability mass to n i + ν i j < 0 and thus y i j < 0 is possible."}, {"id": 256, "string": "This could be fixed by using a different sparsity-inducing distribution."}, {"id": 257, "string": "30 The cheapest penalty or explanation of the weighted sum δ|ν i j | + 1 2 2 i j for some weighting or threshold δ (which adjusts the relative variances of the two priors) is ν = 0 if |a| ≤ δ, ν = a − δ if a ≥ δ, and ν = −(a − δ) if a < −δ (found by minimizing δ|ν| + 1 2 (a − ν) 2 , a convex function of ν)."}, {"id": 258, "string": "This implies that we incur a quadratic penalty 1 2 a 2 if |a| ≤ δ, and a linear penalty δ(|a| − 1 2 δ) for the other cases; this penalty function is exactly the Huber loss of a, and essentially imposes an L2 penalty on small residuals and an L1 penalty on large residuals (outliers), so our estimate of d j will be something between a mean and a median."}, {"id": 259, "string": "the other parameters, in particular n i for the new sentences i."}, {"id": 260, "string": "The error bars are the standard deviations when running the model over different subsets of data."}, {"id": 261, "string": "The \"simplex\" versions of regression in Figure 6 force all d j to add up to the number of languages (i.e., encouraging each one to stay close to 1)."}, {"id": 262, "string": "This is necessary for Model 1, which otherwise is unidentifiable (hence the enormous standard deviation)."}, {"id": 263, "string": "For other models, it turns out to only have much of an effect on the posterior means, not on the log-probability of held out data under the MAP estimate."}, {"id": 264, "string": "For stability, we in all cases take the best result when initializing the new parameters randomly or \"sensibly,\" i.e., the n i of an intent i is initialized as the average of the corresponding sentences' y i j ."}, {"id": 265, "string": "D Data selection: Europarl In the \"Corrected & Structured Europarl Corpus\" (CoStEP) corpus (Graën et al., 2014) , sessions are grouped into turns, each turn has one speaker (that is marked with clean attributes like native language) and a number of aligned paragraphs for each language, i.e., the actual multitext."}, {"id": 266, "string": "We ignore all paragraphs that are in ill-fitting turns (i.e., turns with an unequal number of paragraphs across languages, a clear sign of an incorrect alignment), losing roughly 27% of intents."}, {"id": 267, "string": "After this cleaning step, only 14% of intents are represented in all 21 languages, see the distribution in Figure 7 (the peak at 11 languages is explained by looking at the raw number of sentences present in each language, shown in Figure 8 )."}, {"id": 268, "string": "Since we want a fair comparison, we use the Finally, it should be said that the text in CoStEP itself contains some markup, marking reports, ellipses, etc., but we strip this additional markup to obtain the raw text."}, {"id": 269, "string": "We tokenize it using the reversible language-agnostic tokenizer of 31 and split the obtained 78169 paragraphs into training set, development set for tuning our language models, and test set for our regression, again by dividing the data into blocks of 30 paragraphs and then taking 5 sentences for the development and test set each, leaving the remainder for the training set."}, {"id": 270, "string": "This way we ensure uniform division over sessions of the parliament and sizes of 2 /3, 1 /6, and 1 /6, respectively."}, {"id": 271, "string": "D.1 How are the source languages distributed?"}, {"id": 272, "string": "An obvious question we should ask is: how many \"native\" sentences can we actually find in Europarl?"}, {"id": 273, "string": "One could assume that there are as many native sentences as there are intents in total, but there are three issues with this: the first is that the president in any Europarl session is never annotated with name or native language (leaving us guessing what the native version of any president-uttered intent is; 12% of all intents in Europarl that can be extracted have this problem), the second is that a number of speakers are labeled with \"unknown\" as native language (10% of sentences), and finally some speakers have their native language annotated, but it is nowhere to be found in the corresponding sentences (7% of sentences)."}, {"id": 274, "string": "Looking only at the native sentences that we could identify, we can see that there are native sentences in every language, but unsurprisingly, some languages are overrepresented."}, {"id": 275, "string": "Dividing the number of native sentences in a language by the number of total sentences, we get an idea of how \"natively spoken\" the language is in Europarl, shown in Figure 9 ."}, {"id": 276, "string": "E Data selection: Bibles The Bible is composed of the Old Testament and the New Testament (the latter of which has been much more widely translated), both consisting of individual books, which, in turn, can be separated into chapters, but we will only work with the smallest subdivision unit: the verse, corresponding roughly to a sentence."}, {"id": 277, "string": "Turning to the collection assembled 31 http://sjmielke.com/papers/tokenize/  by Mayer and Cysouw (2014) , we see that it has over 1000 New Testaments, but far fewer complete Bibles."}, {"id": 278, "string": "Despite being a fairly standardized book, not all Bibles are fully parallel."}, {"id": 279, "string": "Some verses and sometimes entire books are missing in some Biblessome of these discrepancies may be reduced to the question of the legitimacy of certain biblical books, others are simply artifacts of verse numbering and labeling of individual translations."}, {"id": 280, "string": "For us, this means that we can neither simply take all translations that have \"the entire thing\" (in fact, no single Bible in the set covers the union of all others' verses), nor can we take all Bibles and work with the verses that they all share (because, again, no single verse is shared over all given Bibles)."}, {"id": 281, "string": "The whole situation is visualized in Figure 10 ."}, {"id": 282, "string": "We have to find a tradeoff: take as many Bibles as possible that share as many verses as possible."}, {"id": 283, "string": "Specifically, we cast this selection process as an optimization problem: select Bibles such that the number of verses overall (i.e., the number of verses shared times the number of Bibles) is maximal, breaking ties in favor of including more Bibles and ensuring that we have at least 20000 verses overall to ensure applicability of neural language models."}, {"id": 284, "string": "This problem can be cast as an integer linear program and solved using a standard optimization tool (Gurobi) within a few hours."}, {"id": 285, "string": "The optimal solution that we find contains 25996 verses for 106 Bibles in 62 languages, 32 spanning 13 language families."}, {"id": 286, "string": "33 The sizes of the selected Bible subsets are visualized for each Bible in Figure 11 and in relation to other datasets in Table 1 ."}, {"id": 287, "string": "We split them into train/dev/test by dividing the data into blocks of 30 paragraphs and then taking 5 sentences for the development and test set each, leaving the remainder for the training set."}, {"id": 288, "string": "This way we ensure uniform division over books of the Bible and sizes of 2 /3, 1 /6, and 1 /6, respectively."}, {"id": 289, "string": "F Detailed regression results F.1 WALS We report the mean and sample standard deviation of language difficulties for languages that lie in the corresponding categories in Table 2 : 32 afr, aln, arb, arz, ayr, bba, ben, bqc, bul, cac, cak, ceb, ces, cmn, cnh, cym, dan, deu, ell, eng, epo, fin, fra, guj, gur, hat, hrv, hun, ind, ita, kek, kjb, lat, lit, mah, mam, mri, mya, nld, nor, plt, poh, por, qub, quh, quy, quz, ron, rus, som, tbz, tcw, tgl, tlh, tpi, tpm, ukr, vie, wal, wbm, xho, zom 33 22 Indo-European, 6 Niger-Congo, 6 Mayan, 6 Austronesian, 4 Sino-Tibetan, 4 Quechuan, 4 Afro-Asiatic, 2 Uralic, 2 Creoles, 2 Constructed languages, 2 Austro-Asiatic, 1 Totonacan, 1 Aymaran; we are reporting the first category on Ethnologue (Paul et al., 2009) F.2 Raw character sequence length We report correlation measures and significance values when regressing on raw character sequence length in F.3 Raw word inventory We report correlation measures and significance values when regressing on the size of the raw word inventory in Table 4 : Correlations and significances when regressing on the size of the raw word inventory."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 28}, {"section": "The Surprisal of a Sentence", "n": "2", "start": 29, "end": 31}, {"section": "Multitext for a Fair Comparison", "n": "2.1", "start": 32, "end": 39}, {"section": "Comparing Surprisal Across Languages", "n": "2.2", "start": 40, "end": 48}, {"section": "Our Language Models", "n": "2.3", "start": 49, "end": 74}, {"section": "Model 1: Multiplicative Mixed-effects", "n": "3.1", "start": 75, "end": 83}, {"section": "Model 2: Heteroscedasticity", "n": "3.2", "start": 84, "end": 97}, {"section": "Model 2L: An Outlier-Resistant Variant", "n": "3.3", "start": 98, "end": 101}, {"section": "Estimating model parameters", "n": "3.4", "start": 102, "end": 108}, {"section": "A Note on Bayesian Inference", "n": "3.5", "start": 109, "end": 115}, {"section": "The Difficulties of 69 languages", "n": "4", "start": 116, "end": 122}, {"section": "Europarl: 21 Languages", "n": "4.1", "start": 123, "end": 128}, {"section": "The Bible: 62 Languages", "n": "4.2", "start": 129, "end": 135}, {"section": "Results", "n": "4.3", "start": 136, "end": 148}, {"section": "Are All Translations the Same?", "n": "4.4", "start": 149, "end": 155}, {"section": "What Correlates with Difficulty?", "n": "5", "start": 156, "end": 209}, {"section": "Evaluating Translationese", "n": "6", "start": 210, "end": 230}, {"section": "Conclusion", "n": "7", "start": 231, "end": 289}], "figures": [{"filename": "../figure/image/1115-Figure1-1.png", "caption": "Figure 1: Jointly estimating the information ni present in each multi-text intent i and the difficulty d j of each language j. At left, gray text indicates translations of the original (white) sentence in the same row. At right, darker cells indicate higher surprisal/difficulty. Empty cells indicate missing translations. English (en) is missing a hard sentence and Bulgarian (bg) is missing an easy sentence, but this does not mislead our method into estimating English as easier than Bulgarian.", "page": 0, "bbox": {"x1": 309.12, "x2": 525.12, "y1": 201.12, "y2": 343.2}}, {"filename": "../figure/image/1115-Figure3-1.png", "caption": "Figure 3: The Europarl language difficulties appear more similar, and are ordered differently, when the RNN models use BPE units instead of character units. Tuning BPE per-language has a small additional effect.", "page": 5, "bbox": {"x1": 74.88, "x2": 285.12, "y1": 57.599999999999994, "y2": 112.32}}, {"filename": "../figure/image/1115-Table1-1.png", "caption": "Table 1: Sizes of various language modeling datasets, numbers estimated using wc.", "page": 14, "bbox": {"x1": 305.76, "x2": 525.12, "y1": 55.68, "y2": 133.92}}, {"filename": "../figure/image/1115-Table4-1.png", "caption": "Table 4: Correlations and significances when regressing on the size of the raw word inventory.", "page": 14, "bbox": {"x1": 305.76, "x2": 525.12, "y1": 632.64, "y2": 708.9599999999999}}, {"filename": "../figure/image/1115-Table2-1.png", "caption": "Table 2: Average difficulty for languages with certain WALS features (with number of languages).", "page": 14, "bbox": {"x1": 305.76, "x2": 525.12, "y1": 164.64, "y2": 295.2}}, {"filename": "../figure/image/1115-Figure11-1.png", "caption": "Figure 11: Tokens and characters (as reported by wc -w/-m) of the 106 Bibles. Equal languages share a color, all others are shown in faint gray. Most Bibles have around 700k tokens and 3.6M characters; outliers like Mandarin Chinese (cmn) are not surprising.", "page": 14, "bbox": {"x1": 72.96, "x2": 287.03999999999996, "y1": 56.64, "y2": 277.44}}, {"filename": "../figure/image/1115-Table3-1.png", "caption": "Table 3: Correlations and significances when regressing on raw character sequence length. Significant correlations are boldfaced.", "page": 14, "bbox": {"x1": 305.76, "x2": 525.12, "y1": 417.59999999999997, "y2": 498.24}}, {"filename": "../figure/image/1115-Figure4-1.png", "caption": "Figure 4: Difficulties of 21 Europarl languages (left) and 106 Bibles (right), comparing difficulties when estimated from BPE-RNNLMs vs. char-RNNLMs. Highlighted on the right are deu and fra, for which we have many Bibles, and eng, which has often been prioritized even over these two in research. In the middle we see the difficulties of the 14 languages that are shared between the Bibles and Europarl aligned to each other (averaging all estimates), indicating that the general trends we see are not tied to either corpus.", "page": 6, "bbox": {"x1": 76.32, "x2": 521.28, "y1": 58.559999999999995, "y2": 252.48}}, {"filename": "../figure/image/1115-Figure10-1.png", "caption": "Figure 10: Presence (black) of verses (y-axis) in Bibles (x-axis). Both pictures are downsampled, resulting in grayscale values for all packets of N values.", "page": 13, "bbox": {"x1": 307.2, "x2": 524.64, "y1": 55.68, "y2": 304.8}}, {"filename": "../figure/image/1115-Figure8-1.png", "caption": "Figure 8: How many sentences are there per Europarl language?", "page": 12, "bbox": {"x1": 308.64, "x2": 523.1999999999999, "y1": 453.59999999999997, "y2": 559.1999999999999}}, {"filename": "../figure/image/1115-Figure6-1.png", "caption": "Figure 6: Achieved log-likelihoods on held-out data. Top: Europarl (BPE), Bottom: Bibles, Left: MAP inference, Right: HMC inference (posterior mean).", "page": 12, "bbox": {"x1": 76.8, "x2": 519.36, "y1": 62.879999999999995, "y2": 237.12}}, {"filename": "../figure/image/1115-Figure7-1.png", "caption": "Figure 7: In how many languages are the intents in Europarl translated? (intents from ill-fitting turns included in 100%, but not plotted)", "page": 12, "bbox": {"x1": 308.64, "x2": 523.1999999999999, "y1": 285.59999999999997, "y2": 391.2}}, {"filename": "../figure/image/1115-Figure9-1.png", "caption": "Figure 9: How many of the Europarl sentences in one language are “native”?", "page": 12, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 609.6, "y2": 717.12}}, {"filename": "../figure/image/1115-Figure5-1.png", "caption": "Figure 5: MCC does not predict difficulty on Europarl. Spearman’s ρ is .091 / .110 with p > .6 for BPERNNLM (left) / char-RNNLM (right).", "page": 7, "bbox": {"x1": 72.48, "x2": 290.4, "y1": 55.68, "y2": 171.35999999999999}}, {"filename": "../figure/image/1115-Figure2-1.png", "caption": "Figure 2: Top: For each language, total NLL of the dev corpus varies with the number of BPE merges, which is expressed on the x-axis as a fraction of the number of observed word types |V |.8 Bottom: Averaging over all 21 languages motivates a global value of 0.4.", "page": 3, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 56.64, "y2": 167.04}}]}