{"title": "Leveraging distributed representations and lexico-syntactic fixedness for token-level prediction of the idiomaticity of English verb-noun combinations", "abstract": "Verb-noun combinations (VNCs) -e.g., blow the whistle, hit the roof, and see stars -are a common type of English idiom that are ambiguous with literal usages. In this paper we propose and evaluate models for classifying VNC usages as idiomatic or literal, based on a variety of approaches to forming distributed representations. Our results show that a model based on averaging word embeddings performs on par with, or better than, a previously-proposed approach based on skip-thoughts. Idiomatic usages of VNCs are known to exhibit lexico-syntactic fixedness. We further incorporate this information into our models, demonstrating that this rich linguistic knowledge is complementary to the information carried by distributed representations.", "text": [{"id": 0, "string": "Introduction Multiword expressions (MWEs) are combinations of multiple words that exhibit some degree of idiomaticity (Baldwin and Kim, 2010) ."}, {"id": 1, "string": "Verb-noun combinations (VNCs), consisting of a verb with a noun in its direct object position, are a common type of semantically-idiomatic MWE in English and cross-lingually (Fazly et al., 2009) ."}, {"id": 2, "string": "Many VNCs are ambiguous between MWEs and literal combinations, as in the following examples of see stars, in which 1 is an idiomatic usage (i.e., an MWE), while 2 is a literal combination."}, {"id": 3, "string": "1 1."}, {"id": 4, "string": "Hereford United were seeing stars at Gillingham after letting in 2 early goals 2."}, {"id": 5, "string": "Look into the night sky to see the stars MWE identification is the task of automatically determining which word combinations at the token-level form MWEs (Baldwin and Kim, 2010) , and must be able to make such distinctions."}, {"id": 6, "string": "This is particularly important for applications such as machine translation (Sag et al., 2002) , where the appropriate meaning of word combinations in context must be preserved for accurate translation."}, {"id": 7, "string": "In this paper, following prior work (e.g., Salton et al., 2016) , we frame token-level identification of VNCs as a supervised binary classification problem, i.e., idiomatic vs. literal."}, {"id": 8, "string": "We consider a range of approaches to forming distributed representations of the context in which a VNC occurs, including word embeddings (Mikolov et al., 2013) , word embeddings tailored to representing sentences (Kenter et al., 2016) , and skip-thoughts sentence embeddings (Kiros et al., 2015) ."}, {"id": 9, "string": "We then train a support vector machine (SVM) on these representations to classify unseen VNC instances."}, {"id": 10, "string": "Surprisingly, we find that an approach based on representing sentences as the average of their word embeddings performs comparably to, or better than, the skip-thoughts based approach previously proposed by Salton et al."}, {"id": 11, "string": "(2016) ."}, {"id": 12, "string": "VNCs exhibit lexico-syntactic fixedness."}, {"id": 13, "string": "For example, the idiomatic interpretation in example 1 above is typically only accessible when the verb see has active voice, the determiner is null, and the noun star is in plural form, as in see stars or seeing stars."}, {"id": 14, "string": "Usages with a determiner (as in example 2), a singular noun (e.g., see a star), or passive voice (e.g., stars were seen) typically only have the literal interpretation."}, {"id": 15, "string": "In this paper we further incorporate knowledge of the lexico-syntactic fixedness of VNCs -automatically acquired from corpora using the method of Fazly et al."}, {"id": 16, "string": "(2009) -into our various embedding-based approaches."}, {"id": 17, "string": "Our experimental results show that this leads to substantial improve-ments, indicating that this rich linguistic knowledge is complementary to that available in distributed representations."}, {"id": 18, "string": "Related work Much research on MWE identification has focused on specific kinds of MWEs (e.g., Patrick and Fletcher, 2005; Uchiyama et al., 2005) , including English VNCs (e.g., Fazly et al., 2009; Salton et al., 2016) , although some recent work has considered the identification of a broad range of kinds of MWEs (e.g., Schneider et al., 2014; Brooke et al., 2014; Savary et al., 2017) ."}, {"id": 19, "string": "Work on MWE identification has leveraged rich linguistic knowledge of the constructions under consideration (e.g., Fazly et al., 2009; Fothergill and Baldwin, 2012) , treated literal and idiomatic as two senses of an expression and applied approaches similar to word-sense disambiguation (e.g., Birke and Sarkar, 2006; Hashimoto and Kawahara, 2008) , incorporated topic models (e.g., Li et al., 2010) , and made use of distributed representations of words (Gharbieh et al., 2016) ."}, {"id": 20, "string": "In the most closely related work to ours, Salton et al."}, {"id": 21, "string": "(2016) represent token instances of VNCs by embedding the sentence that they occur in using skip-thoughts (Kiros et al., 2015) -an encoderdecoder model that can be viewed as a sentencelevel counterpart to the word2vec (Mikolov et al., 2013 ) skip-gram model."}, {"id": 22, "string": "During training the target sentence is encoded using a recurrent neural network, and is used to predict the previous and next sentences."}, {"id": 23, "string": "Salton et al."}, {"id": 24, "string": "then use these sentence embeddings, representing VNC token instances, as features in a supervised classifier."}, {"id": 25, "string": "We treat this skip-thoughts based approach as a strong baseline to compare against."}, {"id": 26, "string": "Fazly et al."}, {"id": 27, "string": "(2009) formed a set of eleven lexicosyntactic patterns for VNC instances capturing the voice of the verb (active or passive), determiner (e.g., a, the), and number of the noun (singular or plural)."}, {"id": 28, "string": "They then determine the canonical form, C(v, n), for a given VNC as follows: 2 C(v, n) = {pt k ∈ P |z(v, n, pt k ) > T z } (1) where P is the set of patterns, T z is a predetermined threshold, which is set to 1, and z(v, n, pt k ) is calculated as follows: z(v, n, pt k ) = f (v, n, pt k ) − f s (2) where f (·) is the frequency of a VNC occurring in a given pattern in a corpus, 3 and f and s are the mean and standard deviations for all patterns for the given VNC, respectively."}, {"id": 29, "string": "Fazly et al."}, {"id": 30, "string": "(2009) showed that idiomatic usages of a VNC tend to occur in that expression's canonical form, while literal usages do not."}, {"id": 31, "string": "This approach provides a strong, linguistically-informed, unsupervised baseline, referred to as CForm, for predicting whether VNC instances are idiomatic or literal."}, {"id": 32, "string": "In this paper we incorporate knowledge of canonical forms into embedding-based approaches to VNC token classification, and show that this linguistic knowledge can be leveraged to improve such approaches."}, {"id": 33, "string": "Models We describe the models used to represent VNC token instances below."}, {"id": 34, "string": "For each model, a linear SVM classifier is trained on these representations."}, {"id": 35, "string": "Word2vec We trained word2vec's skip-gram model (Mikolov et al., 2013 ) on a snapshot of Wikipedia from September 2015, which consists of approximately 2.6 billion tokens."}, {"id": 36, "string": "We used a window size of ±8 and 300 dimensions."}, {"id": 37, "string": "We ignore all words that occur less than fifteen times in the training corpus, and did not set a maximum vocabulary size."}, {"id": 38, "string": "We perform negative sampling and set the number of training epochs to five."}, {"id": 39, "string": "We used batch processing with approximately 10k words in each batch."}, {"id": 40, "string": "To embed a given a sentence containing a VNC token instance, we average the word embeddings for each word in the sentence, including stopwords."}, {"id": 41, "string": "4 Prior to averaging, we normalize each embedding to have unit length."}, {"id": 42, "string": "Siamese CBOW The Siamese CBOW model (Kenter et al., 2016) learns word embeddings that are better able to represent a sentence through averaging than conventional word embeddings such as skip-gram or CBOW."}, {"id": 43, "string": "We use a Siamese CBOW model that was pretrained on a snapshot of Wikipedia from November 2012 using randomly initialized word embeddings."}, {"id": 44, "string": "5 Similarly to the word2vec model, to embed a given sentence containing a VNC instance, we average the word embeddings for each word in the sentence."}, {"id": 45, "string": "Skip-thoughts We use a publicly-available skip-thoughts model, that was pre-trained on a corpus of books."}, {"id": 46, "string": "6 We represent a given sentence containing a VNC instance using the skip-thoughts encoder."}, {"id": 47, "string": "Note that this approach is our re-implementation of the skipthoughts based method of Salton et al."}, {"id": 48, "string": "(2016) , and we use it as a strong baseline for comparison."}, {"id": 49, "string": "Data and evaluation In this section, we discuss the dataset used in our experiments, and the evaluation of our models."}, {"id": 50, "string": "Dataset We use the VNC-Tokens dataset (Cook et al., 2008) -the same dataset used by Fazly et al."}, {"id": 51, "string": "(2009) and Salton et al."}, {"id": 52, "string": "(2016) -to train and evaluate our models."}, {"id": 53, "string": "This dataset consists of sentences containing VNC usages drawn from the British National Corpus (Burnard, 2000) , 7 along with a label indicating whether the VNC is an idiomatic or literal usage (or whether this cannot be determined, in which case it is labelled \"unknown\")."}, {"id": 54, "string": "VNC-Tokens is divided into DEV and TEST sets that each include fourteen VNC types and a total of roughly six hundred instances of these types annotated as literal or idiomatic."}, {"id": 55, "string": "Following Salton et al."}, {"id": 56, "string": "(2016) , we use DEV and TEST, and ignore all token instances annotated as \"unknown\"."}, {"id": 57, "string": "Fazly et al."}, {"id": 58, "string": "(2009) We then divide each of these into training and testing sets, using the same ratios of idiomatic to literal usages for each expression as Salton et al."}, {"id": 59, "string": "(2016) ."}, {"id": 60, "string": "This allows us to develop and tune a model on DEV, and then determine whether, when retrained on instances of unseen VNCs in (the training portion of) TEST, that model is able to generalize to new VNCs without further tuning to the specific expressions in TEST."}, {"id": 61, "string": "Evaluation The proportion of idiomatic usages in the testing portions of both DEV and TEST is 63%."}, {"id": 62, "string": "We therefore use accuracy to evaluate our models following Fazly et al."}, {"id": 63, "string": "(2009) because the classes are roughly balanced."}, {"id": 64, "string": "We randomly divide both DEV and TEST into training and testing portions ten times, following Salton et al."}, {"id": 65, "string": "(2016) ."}, {"id": 66, "string": "For each of the ten runs, we compute the accuracy for each expression, and then compute the average accuracy over the expressions."}, {"id": 67, "string": "We then report the average accuracy over the ten runs."}, {"id": 68, "string": "Experimental results In this section we first consider the effect of tuning the cost parameter of the SVM for each model on DEV, and then report results on DEV and TEST using the tuned models."}, {"id": 69, "string": "Parameter tuning We tune the SVM for each model on DEV by carrying out a linear search for the penalty cost from 0.01-100, increasing by a factor of ten each time."}, {"id": 70, "string": "Results for this parameter tuning are shown in Table 1 ."}, {"id": 71, "string": "These results highlight the importance of choosing an appropriate setting for the penalty cost."}, {"id": 72, "string": "For example, the accuracy of the word2vec model ranges from 0.619-0.830 depending on the cost setting."}, {"id": 73, "string": "In subsequent experiments, for each  model, we use the penalty cost that achieves the highest accuracy in Table 1 ."}, {"id": 74, "string": "DEV and TEST results In Table 2 we report results on DEV and TEST for each model, as well as the unsupervised CForm model of Fazly et al."}, {"id": 75, "string": "(2009) , which simply labels a VNC as idiomatic if it occurs in its canonical form, and as literal otherwise."}, {"id": 76, "string": "We further consider each model (other than CForm) in two setups."}, {"id": 77, "string": "−CF corresponds to the models as described in Section 3."}, {"id": 78, "string": "+CF further incorporates lexico-syntactic knowledge of canonical forms into each model by concatenating the embedding representing each VNC token instance with a one-dimensional vector which is one if the VNC occurs in its canonical form, and zero otherwise."}, {"id": 79, "string": "We first consider results for the −CF setup."}, {"id": 80, "string": "On both DEV and TEST, the accuracy achieved by each supervised model is higher than that of the unsupervised CForm approach, except for Siamese CBOW on TEST."}, {"id": 81, "string": "The word2vec model achieves the highest accuracy on DEV and TEST of 0.830 and 0.804, respectively."}, {"id": 82, "string": "The difference between the word2vec model and the next-best model, skip-thoughts, is significant using a bootstrap test (Berg-Kirkpatrick et al., 2012) with 10k repetitions for DEV (p = 0.006), but not for TEST (p = 0.051)."}, {"id": 83, "string": "Nevertheless, it is remarkable that the relatively simple approach to averaging word embeddings used by word2vec performs as well as, or better than, the much more complex skipthoughts model used by Salton et al."}, {"id": 84, "string": "(2016) ."}, {"id": 85, "string": "8 8 The word2vec and skip-thoughts models were trained on different corpora, which could contribute to the differences in results for these models."}, {"id": 86, "string": "We therefore carried out an additional experiment in which we trained word2vec on Book-Corpus, the corpus on which skip-thoughts was trained."}, {"id": 87, "string": "This new word2vec model achieved accuracies of 0.825 and 0.809, on DEV and TEST, respectively, which are also higher accu-Turning to the +CF setup, we observe that, for both DEV and TEST, each model achieves higher accuracy than in the −CF setup."}, {"id": 88, "string": "9 All of these differences are significant using a bootstrap test (p < 0.002 in each case)."}, {"id": 89, "string": "In addition, each method outperforms the unsupervised CForm approach on both DEV and TEST."}, {"id": 90, "string": "These findings demonstrate that the linguistically-motivated, lexico-syntactic knowledge encoded by the canonical form feature is complementary to the information from a wide range of types of distributed representations."}, {"id": 91, "string": "In the +CF setup, the word2vec model again achieves the highest accuracy on both DEV and TEST of 0.854 and 0.852, respectively."}, {"id": 92, "string": "10 The difference between the word2vec model and the next-best model, again skip-thoughts, is significant for both DEV and TEST using a bootstrap test (p < 0.05 in each case)."}, {"id": 93, "string": "To better understand the impact of the canonical form feature when combined with the word2vec model, we compute the average precision, recall, and F1 score for each MWE for both the positive (idiomatic) and negative (literal) classes, for each run on TEST."}, {"id": 94, "string": "11 For a given run, we then compute the average precision, recall, and F1 score across all MWEs, and then the average over all ten runs."}, {"id": 95, "string": "We do this using CForm, and the word2vec model with and without the canonical form feature."}, {"id": 96, "string": "Results are shown in Table 3 ."}, {"id": 97, "string": "In line with the findings of Fazly et al."}, {"id": 98, "string": "(2009) , CForm achieves higher precision and recall on idiomatic usages than literal ones."}, {"id": 99, "string": "In particular, the relatively low recall for the literal class indicates that many literal usages occur in a canonical form."}, {"id": 100, "string": "Comparing the word2vec model with and without the canonical form feature, we see that, when this feature is used, there is a relatively larger increase in precision and recall (and F1 score) for the literal class, than for the idiomatic class."}, {"id": 101, "string": "This indicates that, although the racies than those obtained by the skip-thoughts model."}, {"id": 102, "string": "9 In order to determine that this improvement is due to the information about canonical forms carried by the additional feature in the +CF setup, and not due to the increase in number of dimensions, we performed additional experiments in which we concatenated the embedding representations with a random binary feature, and with a randomly chosen value between 0 and 1."}, {"id": 103, "string": "For each model, neither of these approaches outperformed that model using the +CF setup."}, {"id": 104, "string": "10 In the +CF setup, the word2vec model using embeddings that were trained on the same corpus as skip-thoughts achieved accuracies of 0.846 and 0.851, on DEV and TEST, respectively."}, {"id": 105, "string": "These are again higher accuracies than the corresponding setup for the skip-thoughts model."}, {"id": 106, "string": "11 We carried out the same analysis on DEV."}, {"id": 107, "string": "The findings were similar."}, {"id": 108, "string": "Conclusions Determining whether a usage of a VNC is idiomatic or literal is important for applications such as machine translation, where it is vital to preserve the meanings of word combinations."}, {"id": 109, "string": "In this paper we proposed two approaches to the task of classifying VNC token instances as idiomatic or literal based on word2vec embeddings and Siamese CBOW."}, {"id": 110, "string": "We compared these approaches against a linguistically-informed unsupervised baseline, and a model based on skip-thoughts previously applied to this task (Salton et al., 2016) ."}, {"id": 111, "string": "Our experimental results show that a comparatively simple approach based on averaging word embeddings performs at least as well as, or better than, the approach based on skip-thoughts."}, {"id": 112, "string": "We further proposed methods to combine linguistic knowledge of the lexico-syntactic fixedness of VNCs -socalled \"canonical forms\", which can be automatically acquired from corpora via statistical methods -with the embedding based approaches."}, {"id": 113, "string": "Our findings indicate that this rich linguistic knowledge is complementary to that available in distributed representations."}, {"id": 114, "string": "Alternative approaches to embedding sentences containing VNC instances could also be considered, for example, FastSent (Hill et al., 2016) ."}, {"id": 115, "string": "However, all of the models we used represent the context of a VNC by the sentence in which it occurs."}, {"id": 116, "string": "In future work we therefore also intend to consider approaches such as context2vec (Melamud et al., 2016) which explicitly encode the context in which a token occurs."}, {"id": 117, "string": "Finally, one known challenge of VNC token classification is to develop models that are able to generalize to VNC types that were not seen during training (Gharbieh et al., 2016) ."}, {"id": 118, "string": "In future work we plan to explore this experimental setup."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 17}, {"section": "Related work", "n": "2", "start": 18, "end": 32}, {"section": "Models", "n": "3", "start": 33, "end": 34}, {"section": "Word2vec", "n": "3.1", "start": 35, "end": 41}, {"section": "Siamese CBOW", "n": "3.2", "start": 42, "end": 44}, {"section": "Skip-thoughts", "n": "3.3", "start": 45, "end": 48}, {"section": "Data and evaluation", "n": "4", "start": 49, "end": 49}, {"section": "Dataset", "n": "4.1", "start": 50, "end": 60}, {"section": "Evaluation", "n": "4.2", "start": 61, "end": 65}, {"section": "Experimental results", "n": "5", "start": 66, "end": 68}, {"section": "Parameter tuning", "n": "5.1", "start": 69, "end": 73}, {"section": "DEV and TEST results", "n": "5.2", "start": 74, "end": 107}, {"section": "Conclusions", "n": "6", "start": 108, "end": 118}], "figures": [{"filename": "../figure/image/1148-Table1-1.png", "caption": "Table 1: Accuracy on DEV while tuning the penalty cost for the SVM for each model. The highest accuracy for each model is shown in boldface.", "page": 2, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 61.44, "y2": 132.0}}, {"filename": "../figure/image/1148-Table3-1.png", "caption": "Table 3: Precision (P), recall (R), and F1 score (F), for the idiomatic and literal classes, as well as average F1 score (Ave. F), for TEST.", "page": 4, "bbox": {"x1": 115.67999999999999, "x2": 482.4, "y1": 64.8, "y2": 127.67999999999999}}, {"filename": "../figure/image/1148-Table2-1.png", "caption": "Table 2: Accuracy on DEV and TEST for each model, without (−CF) and with (+CF) the canonical form feature. The highest accuracy for each setting on each dataset is shown in boldface.", "page": 3, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 61.44, "y2": 144.96}}]}