{"title": "Automatically Identifying Complaints in Social Media", "abstract": "Complaining is a basic speech act regularly used in human and computer mediated communication to express a negative mismatch between reality and expectations in a particular situation. Automatically identifying complaints in social media is of utmost importance for organizations or brands to improve the customer experience or in developing dialogue systems for handling and responding to complaints. In this paper, we introduce the first systematic analysis of complaints in computational linguistics. We collect a new annotated data set of written complaints expressed in English on Twitter. 1  We present an extensive linguistic analysis of complaining as a speech act in social media and train strong feature-based and neural models of complaints across nine domains achieving a predictive performance of up to 79 F1 using distant supervision.", "text": [{"id": 0, "string": "Introduction Complaining is a basic speech act used to express a negative mismatch between reality and expectations towards a state of affairs, product, organization or event (Olshtain and Weinbach, 1987) ."}, {"id": 1, "string": "Understanding the expression of complaints in natural language and automatically identifying them is of utmost importance for: (a) linguists to obtain a better understanding of the context, intent and types of complaints on a large scale; (b) psychologists to identify human traits underpinning complaint behavior and expression; (c) organizations and advisers to improve the customer service by identifying and addressing client concerns and issues effectively in real time, especially on social media; (d) developing downstream natural language processing (NLP) applications, such as 1 Data and code is available here: https: //github.com/danielpreotiuc/ complaints-social-media Tweet C S @FC Help hi, I ordered a necklace over a week ago and it still hasn't arrived (...) @BootsUK I love Boots!"}, {"id": 2, "string": "Shame you're introducing a man tax of 7% in 2018 :( dialogue systems that aim to automatically identify complaints."}, {"id": 3, "string": "You suck However, complaining has yet to be studied using computational approaches."}, {"id": 4, "string": "The speech act of complaining, as previously defined in linguistics research (Olshtain and Weinbach, 1987 ) and adopted in this study, has as its core the concept of violated or breached expectations i.e., the person posting the complaint had their favorable expectations breached by a party, usually the one to which the complaint is addressed."}, {"id": 5, "string": "Complaints have been previously analyzed by linguists (Vásquez, 2011) as distinctly different from expressing negative sentiment towards an entity."}, {"id": 6, "string": "Key to the definition of complaints is the expression of the breach of expectations."}, {"id": 7, "string": "Table 1 shows examples of tweets highlighting the differences between complaints and sentiment."}, {"id": 8, "string": "The first example expresses the writer's breach of expectations about an item that was expected to arrive, but does not express negative sentiment toward the entity, while the second shows mixed sentiment and expresses a complaint about a tax that was introduced."}, {"id": 9, "string": "The third statement is an insult that implies negative sentiment, but there are not enough cues to indicate any breach of expectations; hence, this cannot be categorized as a complaint."}, {"id": 10, "string": "This paper presents the first extensive analysis of complaints in computational linguistics."}, {"id": 11, "string": "Our contributions include: 1."}, {"id": 12, "string": "The first publicly available data set of complaints extracted from Twitter with expert annotations spanning nine domains (e.g., software, transport); 2."}, {"id": 13, "string": "An extensive quantitative analysis of the syntactic, stylistic and semantic linguistic features distinctive of complaints; 3."}, {"id": 14, "string": "Predictive models using a broad range of features and machine learning models, which achieve high predictive performance for identifying complaints in tweets of up to 79 F1; 4."}, {"id": 15, "string": "A distant supervision approach to collect data combined with domain adaptation to boost predictive performance."}, {"id": 16, "string": "Related Work Complaints have to date received significant attention in linguistics and marketing research."}, {"id": 17, "string": "Olshtain and Weinbach (1987) provide one of the early definitions of a complaint as when a speaker expects a favorable event to occur or an unfavorable event to be prevented and these expectations are breached."}, {"id": 18, "string": "Thus, the discrepancy between the expectations of the complainer and the reality is the key component of identifying complaints."}, {"id": 19, "string": "Complaining is considered to be a distinct speech act, as defined by speech act theory (Austin, 1975; Searle, 1969) which is central to the field of pragmatics."}, {"id": 20, "string": "Complaints are either addressed to the party responsible for enabling the breach of expectations (direct complaints) or indirectly mention the party (indirect complaints) (Boxer, 1993b) ."}, {"id": 21, "string": "Complaints are widely considered to be among the face-threatening acts (Brown and Levinson, 1987) -acts that aim to damage the face or self-esteem of the person or entity the act is directed at."}, {"id": 22, "string": "The concept of face (Goffman, 1967) represents the public image specific of each person or entity and has two aspects: positive (i.e., the desire to be liked) and negative face (i.e., the desire to not be imposed upon)."}, {"id": 23, "string": "Complaints can intrinsically threaten both positive and negative face."}, {"id": 24, "string": "Positive face of the responsible party is affected by having enabled the breach of expectations."}, {"id": 25, "string": "Usually, when a direct complaint is made, the illocutionary function of the complaint is to request for a correction or reparation for these events."}, {"id": 26, "string": "Thus, this aims to affect negative face by aiming to impose an action to be undertaken by the responsible party."}, {"id": 27, "string": "Complaints usually co-occur with other speech acts such as warnings, threats, suggestions or advice (Olshtain and Weinbach, 1987; Cohen and Olshtain, 1993) ."}, {"id": 28, "string": "Previous linguistics research has qualitatively examined the types of complaints elicited via discourse completion tests (DCT) (Trosborg, 1995) and in naturally occurring speech (Laforest, 2002) ."}, {"id": 29, "string": "Differences in complaint strategies and expression were studied across cultures (Cohen and Olsh tain, 1993 ) and socio-demographic traits (Boxer, 1993a) ."}, {"id": 30, "string": "In naturally occurring text, the discourse structure of complaints has been studied in letters to editors (Hartford and Mahboob, 2004; Ranosa-Madrunio, 2004) ."}, {"id": 31, "string": "In the area of linguistic studies on computer mediated communication, Vásquez (2011) performed an analysis of 100 negative reviews on TripAdvisor, which showed that complaints in this medium often co-occur with other speech acts including positive and negative remarks, frequently make explicit references to expectations not being met and directly demand a reparation or compensation."}, {"id": 32, "string": "Meinl (2013) studied complaints in eBay reviews by annotating 200 reviews in English and German with the speech act sequence that makes up each complaint e.g., warning, annoyance (the annotations are not available publicly or after contacting the authors)."}, {"id": 33, "string": "Mikolov et al."}, {"id": 34, "string": "(2018) analyze which financial complaints submitted to the Consumer Financial Protection Bureau will receive a timely response."}, {"id": 35, "string": "Most recently, Yang et al."}, {"id": 36, "string": "(2019) studied customer support dialogues and predicted if these complaints will be escalated with a government agency or made public on social media."}, {"id": 37, "string": "To the best of our knowledge, the only previous work that tackles a concept defined as a complaint with computational methods is by Zhou and Ganesan (2016) which studies Yelp reviews."}, {"id": 38, "string": "However, they define a complaint as a 'sentence with negative connotation with supplemental information'."}, {"id": 39, "string": "This definition is not aligned with previous research in linguistics (as presented above) and represents only a minor variation on sentiment analysis."}, {"id": 40, "string": "They introduce a data set of complaints, unavailable at the time of this submission, and only perform a qualitative analysis, without building predictive models for identifying complaints."}, {"id": 41, "string": "Data To date, there is no available data set with annotated complaints as previously defined in linguistics (Olshtain and Weinbach, 1987) ."}, {"id": 42, "string": "Thus, we create a new data set of written utterances annotated with whether they express a complaint."}, {"id": 43, "string": "We use Twitter as the data source because (1) it represents a platform with high levels of self-expression; and (2) users directly interact with other users or corporate brand accounts."}, {"id": 44, "string": "Tweets are openly available and represent a popular option for data selection in other related tasks such as predicting sentiment (Rosenthal et al., 2017) , affect (Mohammad et al., 2018) , emotion analysis (Mohammad and Kiritchenko, 2015) , sarcasm (González-Ibánez et al., 2011; Bamman and Smith, 2015) , stance , text-image relationship (Vempala and Preoţiuc-Pietro, 2019) or irony (Van Hee et al., 2016; Cervone et al., 2017; Van Hee et al., 2018) ."}, {"id": 45, "string": "Collection We choose to manually annotate tweets in order to provide a solid benchmark to foster future research on this task."}, {"id": 46, "string": "Complaints represent a minority of the total written posts on Twitter."}, {"id": 47, "string": "We use a data sampling method that increases the hit rate of complaints, following previous work on labeling infrequent linguistic phenomena such as irony (Mohammad et al., 2018) ."}, {"id": 48, "string": "Numerous companies use Twitter to provide customer service and address user complaints."}, {"id": 49, "string": "We select tweets directed to these accounts as candidates for complaint annotation."}, {"id": 50, "string": "We manually assembled a list of 93 customer service handles."}, {"id": 51, "string": "Using the Twitter API, 2 we collected all the tweets that are available to download (the most recent 3,200)."}, {"id": 52, "string": "We then identified all the original tweets to which the customer support handle responded."}, {"id": 53, "string": "We randomly sample an equal number of tweets addressed to each customer support handle for annotation."}, {"id": 54, "string": "Using this method, we collected 1,971 tweets to which the customer support handles responded."}, {"id": 55, "string": "Further, we have also manually grouped the customer support handles in several high-level domains based on their industry type and area of activity."}, {"id": 56, "string": "We have done this to enable analyzing complaints by domain and assess transferability of classifiers across domains."}, {"id": 57, "string": "In related work on sentiment analysis, reviews for products from four different domains were collected across domains in a similar fashion (Blitzer et al., 2007) ."}, {"id": 58, "string": "All customer support handles grouped by category are presented in Table 2 ."}, {"id": 59, "string": "We add to our data set randomly sampled tweets to ensure that there is a more representative and diverse set of tweets for feature analysis and to ensure that the evaluation does not disproportionally contain complaints."}, {"id": 60, "string": "We thus additionally sampled 1,478 tweets consisting of two groups of 739 tweets: the first group contains random tweets addressed to any other Twitter handle (at-replies) to match the initial sample, while the second group contains tweets not addressed to a Twitter handle."}, {"id": 61, "string": "As preprocessing, we anonymize all usernames present in the tweet and URLs and replace them with placeholder tokens."}, {"id": 62, "string": "To extract the unigrams used as features, we use DLATK, which handles social media content and markup such as emoticons or hashtags (Schwartz et al., 2017) ."}, {"id": 63, "string": "Tweets were filtered for English using langid.py (Lui and Baldwin, 2012) and retweets were excluded."}, {"id": 64, "string": "Annotation We create a binary annotation task for identifying if a tweet contains a complaint or not."}, {"id": 65, "string": "Tweets are short and usually express a single thought."}, {"id": 66, "string": "Therefore, we consider the entire tweet as a complaint if it contains at least one complaint speech act."}, {"id": 67, "string": "For annotation, we adopt as the guideline a complaint definition similar to that from previous linguistic research (Olshtain and Weinbach, 1987; Cohen and Olshtain, 1993) : \"A complaint presents a state of affairs which breaches the writer's favorable expectation\"."}, {"id": 68, "string": "Each tweet was labeled by two independent annotators, authors of the paper, with significant experience in linguistic annotation."}, {"id": 69, "string": "After an initial calibration run of 100 tweets (later discarded from the final data set), each annotator labeled all 1,971 tweets independently."}, {"id": 70, "string": "The two annotators achieved a Cohen's Kappa κ = 0.731, which is in the upper part of the substantial agreement band (Artstein and Poesio, 2008) ."}, {"id": 71, "string": "Disagreements were discussed and resolved between the annotators."}, {"id": 72, "string": "In total, 1,232 tweets (62.4%) are complaints and 739 are not complaints (37.6%)."}, {"id": 73, "string": "The statistics for each category is in Table 3 ."}, {"id": 74, "string": "Features In our analysis and predictive experiments, we use the following groups of features: generic linguistic features proven to perform well in text classification tasks Preoţiuc-Pietro et al., 2017; Volkova and Bell, 2017; Preoţiuc-Pietro and Ungar, 2018 ) (unigrams, LIWC, word clusters), methods for predict-   Unigrams."}, {"id": 75, "string": "We use the bag-of-words approach to represent each tweet as a TF-IDF weighted distribution over the vocabulary consisting of all words present in at least two tweets (2,641 words)."}, {"id": 76, "string": "LIWC."}, {"id": 77, "string": "Traditional psychology studies use dictionary-based approaches to representing text."}, {"id": 78, "string": "The most popular method is based on Linguistic Inquiry and Word Count (LIWC) (Pennebaker et al., 2001) consisting of 73 manually constructed lists of words (Pennebaker et al., 2015) including parts-of-speech, topical or stylistic categories."}, {"id": 79, "string": "Each tweet is thus represented as a distribution over these categories."}, {"id": 80, "string": "Word2Vec Clusters."}, {"id": 81, "string": "An alternative to LIWC for identifying semantic themes in a tweet is to use automatically generated word clusters."}, {"id": 82, "string": "These clusters can be thought of as topics i.e., groups of words that are semantically and/or syntactically similar."}, {"id": 83, "string": "The clusters help reduce the feature space and provide good interpretability (Lampos et al., 2014; Lampos et al., 2016; Aletras and Chamberlain, 2018) ."}, {"id": 84, "string": "We follow  to compute clusters using spectral clustering (Shi and Malik, 2000) applied to a word-word similarity matrix weighted with the cosine similarity of the corresponding word embedding vectors (Mikolov et al., 2013) ."}, {"id": 85, "string": "The clusters help reduce the feature space and provide good interpretability."}, {"id": 86, "string": "3 For brevity and clarity, we present experiments using 200 clusters as in ."}, {"id": 87, "string": "We aggregated all the words in a tweet and represent each tweet as a distribution of the fraction of tokens belonging to each cluster."}, {"id": 88, "string": "Part-of-Speech Tags."}, {"id": 89, "string": "We analyze part-of-speech tag usage to quantify the syntactic patterns associated with complaints and to enhance the representation of unigrams."}, {"id": 90, "string": "We part-of-speech tag all tweets using the Twitter model of the Stanford Tagger (Derczynski et al., 2013) ."}, {"id": 91, "string": "In prediction experiments we supplement each unigram feature with their POS tag (e.g., I PRP, bought VBN)."}, {"id": 92, "string": "For feature analysis, we represent each tweet as a bag-of-words distribution over part-of-speech unigrams and bigrams in order to uncover regular syntactic patterns specific of complaints."}, {"id": 93, "string": "Sentiment & Emotion Models."}, {"id": 94, "string": "We use existing sentiment and emotion analysis models to study their relationship to complaint annotations and to measure their predictive power on our complaint data set."}, {"id": 95, "string": "If the concepts of negative sentiment and complaint were to coincide, standard sentiment prediction models that have access to larger sets of training data should be very competitive on predicting complaints."}, {"id": 96, "string": "We test the following models: • MPQA: We use the MPQA sentiment lexicon (Wiebe et al., 2005) to assign a positive and negative score to each tweet based on the ratio of tokens in a tweet which appear in the positive and negative MPQA lists respectively."}, {"id": 97, "string": "These scores are used as features."}, {"id": 98, "string": "• NRC: We use the word lexicon derived using crowd-sourcing from Turney, 2010, 2013) for assigning to each tweet the proportion of tokens that have positive, negative and neutral sentiment, as well as one of eight emotions that include the six basic emotions of Ekman (Ekman, 1992) (anger, disgust, fear, joy, sadness and surprise) plus trust and anticipation."}, {"id": 99, "string": "All scores are used as features in prediction in order to maximize their predictive power."}, {"id": 100, "string": "• Volkova & Bachrach (V&B): We quantify positive, negative and neutral sentiment as well as the six Ekman emotions for each message using the model made available in (Volkova and Bachrach, 2016) and use them as features in predicting complaints."}, {"id": 101, "string": "The sentiment model is trained on a data set of 19,555 tweets that combine all previously annotated tweets across seven public data sets."}, {"id": 102, "string": "• VADER: We use the outcome of the rule-based sentiment analysis model which has shown very good predictive performance on predicting sentiment in tweets (Gilbert and Hutto, 2014 )."}, {"id": 103, "string": "• Stanford: We quantify sentiment using the Stanford sentiment prediction model as described in (Socher et al., 2013) ."}, {"id": 104, "string": "Complaint Specific Features."}, {"id": 105, "string": "The features in this category are inspired by linguistic aspects specific to complaints (Meinl, 2013): • Request."}, {"id": 106, "string": "The illocutionary function of complaints is often that of requesting for a correction or reparation for the event that caused the breach of expectations (Olshtain and Weinbach, 1987) ."}, {"id": 107, "string": "We explicitly predict if an utterance is a request using the model introduced in (Danescu- Niculescu-Mizil et al., 2013) ."}, {"id": 108, "string": "• Intensifiers."}, {"id": 109, "string": "In order to increase the facethreatening effect a complaint has on the complainee, intensifiers are usually used by the person expressing the complaint (Meinl, 2013)."}, {"id": 110, "string": "We use features derived from: (1) capitalization patterns often used online as an equivalent to shouting (e.g., number/percentage of capitalized words, number/percentage of words starting with capitals, number/percentage of capitalized letters); and (2) repetitions of exclamation marks, question marks or letters within the same token."}, {"id": 111, "string": "• Downgraders and Politeness Markers."}, {"id": 112, "string": "In contrast to intensifiers, downgrading modifiers are used to reduce the face-threat involved when voicing a complaint, usually as part of a strategy to obtain a reparation for the breach of ex-pectation (Meinl, 2013) ."}, {"id": 113, "string": "Downgraders are coded by several dictionaries: play down (e.g., i wondered if ), understaters (e.g., one little), disarmers (e.g., but), downtoners (e.g., just) and hedges (e.g., somewhat)."}, {"id": 114, "string": "Politeness markers have a similar effect to downgraders and include apologies (e.g., sorry), greetings at the start, direct questions, direct start (e.g., so), indicative modals (e.g., can you), subjunctive modals (e.g., could you), politeness markers (e.g., please) (Svarova, 2008) and politeness maxims (e.g., i must say)."}, {"id": 115, "string": "Finally, we directly predict the politeness score of the tweet using the model presented in (Danescu-Niculescu-Mizil et al., 2013) ."}, {"id": 116, "string": "• Temporal References."}, {"id": 117, "string": "Temporal references are often used in complaints to stress how long a complainer has been waiting for a correction or reparation from the addressee or to provide context for their complaint (e.g., mentioning the date in which they have bought an item) (Meinl, 2013) ."}, {"id": 118, "string": "We identify time expressions in tweets using SynTime, which achieved state-of-the-art results across on several benchmark data sets (Zhong et al., 2017) ."}, {"id": 119, "string": "We represent temporal expressions both as days elapsed relative to the day of the post and in buckets of different granularities (one day, week, month, year)."}, {"id": 120, "string": "• Pronoun Types."}, {"id": 121, "string": "Pronouns are used in complaints to reveal the personal involvement or opinion of the complainer and intensify or reduce the face-threat of the complaint based on the person or type of the pronoun (Claridge, 2007; Meinl, 2013) ."}, {"id": 122, "string": "We split pronouns using dictionaries into: first person, second person, third person, demonstrative (e.g., this) and indefinite (e.g., everybody)."}, {"id": 123, "string": "Linguistic Feature Analysis This section presents a quantitative analysis of the linguistic features distinctive of tweets containing complains in order to gain linguistic insight into this task and data."}, {"id": 124, "string": "We perform analysis of all previously described feature sets using univariate Pearson correlation (Schwartz et al., 2013) ."}, {"id": 125, "string": "We compute correlations independently for each feature between its distribution across messages (features are first normalized to sum up to unit for each message) and a variable encoding if the tweet was annotated as a complaint or not."}, {"id": 126, "string": "Top unigrams and part-of-speech features specific of complaints and non-complaints are presented in  categories and Word2Vec topics are presented in Table 5 ."}, {"id": 127, "string": "All correlations shown in these tables are statistically significant at p < .01, with Simes correction for multiple comparisons."}, {"id": 128, "string": "Negations."}, {"id": 129, "string": "Negations are uncovered through unigrams (not, no, won't) and the top LIWC category (NEGATE)."}, {"id": 130, "string": "Central to complaining is the concept of breached expectations."}, {"id": 131, "string": "Hence the complainers use negations to express this discrepancy and to describe their experience with the product or service that caused this."}, {"id": 132, "string": "Issues."}, {"id": 133, "string": "Several unigrams (error, issue, working, fix) and a cluster (Issues) contain words referring to issues or errors."}, {"id": 134, "string": "However, words regularly describing negative sentiment or emotions are not one of the most distinctive features for complaints."}, {"id": 135, "string": "On the other hand, the presence of terms that show positive sentiment or emotions (good, great, win, POSEMO, AFFECT, ASSENT) are among the top most distinctive features for a tweet not being la-beled as a complaint."}, {"id": 136, "string": "In addition, other words and clusters expressing positive states such as gratitude (thank, great, love) or laughter (lol) are also distinctive for tweets that are not complaints."}, {"id": 137, "string": "Linguistics research on complaints in longer documents identified that complaints are likely to co-occur with other speech acts, including with expressions of positive or negative emotions (Vásquez, 2011) ."}, {"id": 138, "string": "In our data set, perhaps due to the particular nature of Twitter communication and the character limit, complainers are much more likely to not express positive sentiment in a complaint and do not regularly post negative sentiment."}, {"id": 139, "string": "Instead, they choose to focus more on describing the issue regarding the service or product in an attempt to have it resolved."}, {"id": 140, "string": "Pronouns."}, {"id": 141, "string": "Across unigrams, part-of-speech patterns and word clusters, we see a distinctive pattern emerging around pronoun usage."}, {"id": 142, "string": "Complaints use more possessive pronouns, indicating that the user is describing personal experiences."}, {"id": 143, "string": "A distinctive part-of-speech pattern common in complaints is possessive pronouns followed by nouns (PRP$ NN) which refer to items of services possessed by the complainer (e.g., my account, my order)."}, {"id": 144, "string": "Complaints tend to not contain personal pronouns (he, she, it, him, you, SHEHE, MALE, FE-MALE), as the focus on expressing the complaint is on the self and the party the complaint is addressed to and not other third parties."}, {"id": 145, "string": "Punctuation."}, {"id": 146, "string": "Question marks are distinctive of complaints, as many complaints are formulated as questions to the responsible party (e.g., why is this not working?, when will I get my response?)."}, {"id": 147, "string": "Complaints are not usually accompanied by exclamation marks."}, {"id": 148, "string": "Although exclamation marks are regularly used for emphasis in the context of complaints, most complainers in our data set prefer not to use them perhaps in an attempt to address them in a less confrontational manner."}, {"id": 149, "string": "Temporal References."}, {"id": 150, "string": "Mentions of time are specific of complaints (been, still, on, days, Temporal References cluster)."}, {"id": 151, "string": "Their presence is usually needed to provide context for the event that caused the breach of expectations."}, {"id": 152, "string": "Another role of temporal references is to express dissatisfaction towards non-responsiveness of the responsible party in addressing their previous requests."}, {"id": 153, "string": "In addition, the presence of verbs in past participle (VBN) is the most distinctive part-of-speech pattern of complaints."}, {"id": 154, "string": "These are used to describe actions com- NEGATE not, no, can't, don't, never, nothing, doesn't, won't .271 POSEMO thanks, love, thank, good, great, support, lol, win .185 RELATIV in, on, when, at, out, still, now, up, back, new .225 AFFECT thanks, love, thank, good, great, support, lol .111 FUNCTION the, i, to, a, my, and, you, for, is, in .204 SHEHE he, his, she, her, him, he's, himself .105 TIME when, still, now, back, new, never, after, then, waiting .186 MALE he, his, man, him, sir, he's, son .086 DIFFER not, but, if, or, can't, really, than, other, haven't .169 FEMALE she, her, girl, mom, ma, lady, mother, Table 5 : Group text features associated with tweets that are complaints and not complaints."}, {"id": 155, "string": "Features are sorted by Pearson correlation (r) between their each feature's normalized frequency and the outcome."}, {"id": 156, "string": "We restrict to only the top six categories for each feature type."}, {"id": 157, "string": "All correlations are significant at p < .01, two-tailed t-test, Simes corrected."}, {"id": 158, "string": "Within each cluster, words are sorted by frequency in our data set."}, {"id": 159, "string": "Labels for Word2Vec clusters are assigned by the authors."}, {"id": 160, "string": "pleted in the past (e.g., i've bought, have come) in order to provide context for the complaint."}, {"id": 161, "string": "Verbs."}, {"id": 162, "string": "Several part-of-speech patterns distinctive of complaints involve present verbs in third person singular (VBZ)."}, {"id": 163, "string": "In general, these verbs are used in complaints to reference an action that the author expects to happen, but his expectations are breached (e.g., nobody is answering)."}, {"id": 164, "string": "Verbs in gerund or present participle are used as a complaint strategy to describe things that just happened to a user (e.g., got an email saying my service will be terminated)."}, {"id": 165, "string": "Topics."}, {"id": 166, "string": "General topics typical of complaint tweets include requiring assistance or customer support."}, {"id": 167, "string": "Several groups of words are much more likely to appear in a complaint, although not used to express complaints per se: about orders or deliveries (in the retail domain), about access (in complaints to service providers) and about parts of tech products (in tech)."}, {"id": 168, "string": "This is natural, as people are more likely to deliberately tweet about an order or tech parts if they want to complain about them."}, {"id": 169, "string": "This is similar to sentiment analysis, where not only emotionally valenced words are predictive of sentiment."}, {"id": 170, "string": "Predicting Complaints In this section, we experiment with different approaches to build predictive models of complaints from text content alone."}, {"id": 171, "string": "We first experiment with feature based approaches including Logistic Regression classification with Elastic Net regularization (LR) (Zou and Hastie, 2005) ."}, {"id": 172, "string": "4 We train the classifiers with all individual feature types."}, {"id": 173, "string": "Neural Methods."}, {"id": 174, "string": "For reference, we experiment with two neural architectures."}, {"id": 175, "string": "In both architectures, tweets are represented as sequences of onehot word vectors which are first mapped into embeddings."}, {"id": 176, "string": "A multi-layer perceptron (MLP) network (Hornik et al., 1989) feeds the embedded representation (E = 200) of the tweet (mean embedding of its constituent words) into a dense hidden layer (D = 100) followed by a ReLU activation function and dropout (0.2)."}, {"id": 177, "string": "The output layer is one dimensional dense layer with a sigmoid activation function."}, {"id": 178, "string": "The second architecture, a Long-Short Term Memory (LSTM) (Hochreiter and Schmidhuber, 1997) network, processes sequentially the tweet by modeling one word (embedding) at each time step followed by the same output layer as in MLP."}, {"id": 179, "string": "The size of the hidden state of the LSTM is L = 50."}, {"id": 180, "string": "We train the networks using the Adam optimizer (Kingma and Ba, 2014) (learning rate is set to 0.01) by minimizing the binary cross-entropy."}, {"id": 181, "string": "Experimental Setup."}, {"id": 182, "string": "We conduct experiments using a nested stratified 10-fold cross-validation, where nine folds are used for training and one for testing (i.e., outer loop)."}, {"id": 183, "string": "In the inner loop, we choose the model parameters 5 using a 3fold cross-validation on the tweets from the nine folds of training data (from the outer loop)."}, {"id": 184, "string": "Train/dev/test splits for each experiment are released together with the data for replicability."}, {"id": 185, "string": "We report predictive performance of the models as the mean accuracy, F1 (macro-averaged) and ROC AUC over the 10 folds (Dietterich, 1998) ."}, {"id": 186, "string": "Results."}, {"id": 187, "string": "Results are presented in Table 6 ."}, {"id": 188, "string": "Most sentiment analysis models show accuracy above chance in predicting complaints."}, {"id": 189, "string": "The best results are obtained by the Volkova & Bachrach model (Sentiment -V&B) which achieves 60 F1."}, {"id": 190, "string": "However, models trained using linguistic features on the training data obtain significantly higher predictive accuracy."}, {"id": 191, "string": "Complaint specific features are predictive of complaints, but to a smaller extent than sentiment, reaching an overall 55.2 F1."}, {"id": 192, "string": "From this group of features, the most predictive groups are intensifiers and downgraders."}, {"id": 193, "string": "Syntactic part-ofspeech features alone obtain higher performance than any sentiment or complaint feature group, showing the syntactic patterns discussed in the previous section hold high predictive accuracy for the task."}, {"id": 194, "string": "The topical features such as the LIWC dictionaries (which combine syntactic and semantic information) and Word2Vec topics perform in the same range as the part of speech tags."}, {"id": 195, "string": "However, best predictive performance is obtained using bag-of-word features, reaching an F1 of up to 77.5 and AUC of 0.866."}, {"id": 196, "string": "Further, combining all features boosts predictive accuracy to 78 F1 and 0.864 AUC."}, {"id": 197, "string": "We notice that neural network approaches are comparable, but do not outperform the best performing feature-based model, likely in part due to the training data size."}, {"id": 198, "string": "Distant Supervision."}, {"id": 199, "string": "We explore the idea of identifying extra complaint data using distant supervision to further boost predictive performance."}, {"id": 200, "string": "Previous work has demonstrated improvements on related tasks relying on weak supervision e.g., in the form of tweets with related hashtags (Bamman and Smith, 2015; Volkova and Bachrach, 2016; Cliche, 2017) ."}, {"id": 201, "string": "Following the same procedure, seven hashtags were identified with the help of the training data to likely correspond to complaints: #appallingcustomercare, #badbusiness, #badcustomerserivice, #badservice, #lostbusiness, #unhappycustomer, #worstbrand."}, {"id": 202, "string": "Tweets were collected to contain these hashtags from a combination of the 1% Twitter archive between 2012-2018 and by filtering tweets with these hashtags in real-time from Twitter REST API for three months."}, {"id": 203, "string": "We collected in total 18,218 tweets (excluding retweets and duplicates) equated to complaints."}, {"id": 204, "string": "As negative complaint examples, the same amount of tweets were sampled randomly from the same time interval."}, {"id": 205, "string": "All hashtags were removed and the data was preprocessed identically as the annotated data set."}, {"id": 206, "string": "We experiment with two techniques for combining distantly supervised data with our annotated data."}, {"id": 207, "string": "First, the tweets obtained through distant supervision are simply added to the annotated training data in each fold (Pooling)."}, {"id": 208, "string": "Secondly, as important signal may be washed out if the features are joined across both domains, we experiment with domain adaptation using the popular EasyAdapt algorithm (Daumé III, 2007) (EasyAdapt)."}, {"id": 209, "string": "Experiments use logistic regression with bag-of-word features enhanced with part-ofspeech tags, because these performed best in the previous experiment."}, {"id": 210, "string": "Table 7 show that the domain adaptation approach further boosts F1 by 1 point to 79 (t-test, p<0.5) and ROC AUC by 0.012."}, {"id": 211, "string": "However, simply pooling the data actually hurts predictive performance leading to a drop of more than 2 points in F1."}, {"id": 212, "string": "Results presented in Domain Experiments We assess the performance of models trained using the best method and features by using in training: (1) using only indomain data (In-Domain); (2) adding out-ofdomain data into the training set (Pooling); and (3) combining in-and out-of-domain data with EasyAdapt domain adaptation (EasyAdapt)."}, {"id": 213, "string": "The experimental setup is identical to the one described in the previous experiments."}, {"id": 214, "string": "Table 8 shows the model performance in macro-averaged F1 using the best performing feature set."}, {"id": 215, "string": "Results show that, in all but one case, adding out-of-domain data helps predictive performance."}, {"id": 216, "string": "The apparel domain is qualitatively very different from the others as a large number of complaints are about returns or the company not stocking items, hence leading to different features being important for prediction."}, {"id": 217, "string": "Domain adaptation is beneficial the majority of domains, lowering performance on a single domain compared to data pooling."}, {"id": 218, "string": "This highlights the differences in expressing complaints across domains."}, {"id": 219, "string": "Overall, predictive performance is high across all domains, with the exception of transport."}, {"id": 220, "string": "Cross Domain Experiments Finally, Table 9 presents the results of models trained on tweets from one domain and tested on all tweets from other domains, with additional models trained on tweets from all domains except the one that the model is tested on."}, {"id": 221, "string": "We observe that predictive performance is relatively consistent across all domains with two exceptions ('Food & Beverage' consistently shows lower performance, while 'Other' achieves higher performance) when using all the data available from the other domains."}, {"id": 222, "string": "Conclusions & Future Work We presented the first computational approach using methods from computational linguistics and machine learning to modeling complaints as de-  fined in prior studies in linguistics and pragmatics (Olshtain and Weinbach, 1987) ."}, {"id": 223, "string": "To this end, we introduced the first data set consisting of English Twitter posts annotated with complaints across nine domains."}, {"id": 224, "string": "We analyzed the syntactic patterns and linguistic markers specific of complaints."}, {"id": 225, "string": "Then, we built predictive models of complaints in tweets using a wide range of features reaching up to 79% Macro F1 (0.885 AUC) and conducted experiments using distant supervision and domain adaptation to boost predictive performance."}, {"id": 226, "string": "We studied performance of complaint prediction models on each individual domain and presented results with a domain adaptation approach which overall improves predictive accuracy."}, {"id": 227, "string": "All data and code is available to the research community to foster further research on complaints."}, {"id": 228, "string": "A predictive model for identification of complaints is useful to companies that wish to automatically gather and analyze complaints about a particular event or product."}, {"id": 229, "string": "This would allow them to improve efficiency in customer service or to more cheaply gauge popular opinion in a timely manner in order to identify common issues around a product launch or policy proposal."}, {"id": 230, "string": "In the future, we plan to identify the target of the complaint in a similar way to aspect-based sentiment analysis (Pontiki et al., 2016) ."}, {"id": 231, "string": "We plan to use additional context and conversational structure to improve performance and identify the sociodemographic covariates of expressing and phrasing complaints."}, {"id": 232, "string": "Another research direction is to study the role of complaints in personal conversation or in the political domain, e.g., predicting political stance in elections (Tsakalidis et al., 2018) ."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Related Work", "n": "2", "start": 16, "end": 40}, {"section": "Data", "n": "3", "start": 41, "end": 44}, {"section": "Collection", "n": "3.1", "start": 45, "end": 63}, {"section": "Annotation", "n": "3.2", "start": 64, "end": 73}, {"section": "Features", "n": "4", "start": 74, "end": 122}, {"section": "Linguistic Feature Analysis", "n": "5", "start": 123, "end": 169}, {"section": "Predicting Complaints", "n": "6", "start": 170, "end": 221}, {"section": "Conclusions & Future Work", "n": "7", "start": 222, "end": 232}], "figures": [{"filename": "../figure/image/1152-Table1-1.png", "caption": "Table 1: Examples of tweets annotated for complaint (C) and sentiment (S).", "page": 0, "bbox": {"x1": 309.59999999999997, "x2": 524.16, "y1": 221.76, "y2": 279.36}}, {"filename": "../figure/image/1152-Table4-1.png", "caption": "Table 4: Features associated with complaint and noncomplaint tweets, sorted by Pearson correlation (r) computed between the normalized frequency of each feature and the complaint label across all tweets. All correlations are significant at p < .01, two-tailed t-test, Simes corrected.", "page": 5, "bbox": {"x1": 78.72, "x2": 283.2, "y1": 62.879999999999995, "y2": 412.32}}, {"filename": "../figure/image/1152-Table5-1.png", "caption": "Table 5: Group text features associated with tweets that are complaints and not complaints. Features are sorted by Pearson correlation (r) between their each feature’s normalized frequency and the outcome. We restrict to only the top six categories for each feature type. All correlations are significant at p < .01, two-tailed t-test, Simes corrected. Within each cluster, words are sorted by frequency in our data set. Labels for Word2Vec clusters are assigned by the authors.", "page": 6, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 63.839999999999996, "y2": 179.04}}, {"filename": "../figure/image/1152-Table6-1.png", "caption": "Table 6: Complaint prediction results using logistic regression (with different types of linguistic features), neural network approaches and the most frequent class baseline. Best results are in bold.", "page": 7, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 63.839999999999996, "y2": 308.15999999999997}}, {"filename": "../figure/image/1152-Table7-1.png", "caption": "Table 7: Complaint prediction results using the original data set and distantly supervised data. All models are based on logistic regression with bag-of-word and Partof-Speech tag features.", "page": 7, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 63.839999999999996, "y2": 123.36}}, {"filename": "../figure/image/1152-Table2-1.png", "caption": "Table 2: List of customer support handles by domain. The domain is chosen based on the most frequent product or service the account usually receives complaints about (e.g., NikeSupport receives most complaints about the Nike Fitness Bands).", "page": 3, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 62.879999999999995, "y2": 156.96}}, {"filename": "../figure/image/1152-Table3-1.png", "caption": "Table 3: Number of tweets annotated as complaints across the nine domains.", "page": 3, "bbox": {"x1": 72.96, "x2": 289.44, "y1": 214.56, "y2": 313.92}}, {"filename": "../figure/image/1152-Table8-1.png", "caption": "Table 8: Performance of models in Macro F1 on tweets from each domain.", "page": 8, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 62.879999999999995, "y2": 159.35999999999999}}, {"filename": "../figure/image/1152-Table9-1.png", "caption": "Table 9: Performance of models trained with tweets from one domain and tested on other domains. All results are reported in ROC AUC. The All line displays results on training on all categories except the category in testing.", "page": 8, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 62.879999999999995, "y2": 163.2}}]}