{"title": "Parallelizable Stack Long Short-Term Memory", "abstract": "Stack Long Short-Term Memory (StackL-STM) is useful for various applications such as parsing and string-to-tree neural machine translation, but it is also known to be notoriously difficult to parallelize for GPU training due to the fact that the computations are dependent on discrete operations. In this paper, we tackle this problem by utilizing state access patterns of StackLSTM to homogenize computations with regard to different discrete operations. Our parsing experiments show that the method scales up almost linearly with increasing batch size, and our parallelized PyTorch implementation trains significantly faster compared to the Dynet C++ implementation.", "text": [{"id": 0, "string": "Introduction Tree-structured representation of language has been successfully applied to various applications including dependency parsing (Dyer et al., 2015) , sentiment analysis (Socher et al., 2011) and neural machine translation (Eriguchi et al., 2017) ."}, {"id": 1, "string": "However, most of the neural network architectures used to build tree-structured representations are not able to exploit full parallelism of GPUs by minibatched training, as the computation that happens for each instance is conditioned on the input/output structures, and hence cannot be naïvely grouped together as a batch."}, {"id": 2, "string": "This lack of parallelism is one of the major hurdles that prevent these representations from wider adoption practically (e.g., neural machine translation), as many natural language processing tasks currently require the ability to scale up to very large training corpora in order to reach state-of-theart performance."}, {"id": 3, "string": "We seek to advance the state-of-the-art of this problem by proposing a parallelization scheme for one such network architecture, the Stack Long Short-Term Memory (StackLSTM) proposed in Dyer et al."}, {"id": 4, "string": "(2015) ."}, {"id": 5, "string": "This architecture has been successfully applied to dependency parsing (Dyer et al., 2015 (Dyer et al., , 2016 Ballesteros et al., 2017) and syntax-aware neural machine translation (Eriguchi et al., 2017) in the previous research literature, but none of these research results were produced with minibatched training."}, {"id": 6, "string": "We show that our parallelization scheme is feasible in practice by showing that it scales up near-linearly with increasing batch size, while reproducing a set of results reported in (Ballesteros et al., 2017) ."}, {"id": 7, "string": "StackLSTM StackLSTM (Dyer et al., 2015) is an LSTM architecture (Hochreiter and Schmidhuber, 1997) augmented with a stack H that stores some of the hidden states built in the past."}, {"id": 8, "string": "Unlike traditional LSTMs that always build state h t from h t−1 , the states of StackLSTM are built from the head of the state stack H, maintained by a stack top pointer p(H)."}, {"id": 9, "string": "At each time step, StackLSTM takes a realvalued input vector together with an additional discrete operation on the stack, which determines what computation needs to be conducted and how the stack top pointer should be updated."}, {"id": 10, "string": "Throughout this section, we index the input vector (e.g."}, {"id": 11, "string": "word embeddings) x t using the time step t it is fed into the network, and hidden states in the stack h j using their position j in the stack H, j being defined as the 0-base index starting from the stack bottom."}, {"id": 12, "string": "The set of input discrete actions typically contains at least Push and Pop operations."}, {"id": 13, "string": "When these operations are taken as input, the corresponding computations on the StackLSTM are listed below: 1 (Dyer et al., 2015) ."}, {"id": 14, "string": "S0 and B0 refers to the token-level representation corresponding to the top element of the stack and buffer, while S1 and B1 refers to those that are second to the top."}, {"id": 15, "string": "We use a different notation here to avoid confusion with the states in StackLSTM, which represent non-local information beyond token-level."}, {"id": 16, "string": "Reflecting on the aforementioned discussion on parallelism, one should notice that StackLSTM falls into the category of neural network architectures that is difficult to perform minibatched training."}, {"id": 17, "string": "This is caused by the fact that the computation performed by StackLSTM at each time step is dependent on the discrete input actions."}, {"id": 18, "string": "The following section proposes a solution to this problem."}, {"id": 19, "string": "Parallelizable StackLSTM Continuing the formulation in the previous section, we will start by discussing our proposed solution under the case where the set of discrete actions contains only Push and Pop operations; we then move on to discussion of the applicability of our proposed solution to the transition systems that are used for building representations for dependency trees."}, {"id": 20, "string": "The first modification we perform to the Push and Pop operations above is to unify the pointer update of these operations as p(H) ← p(H) + op, where op is the input discrete operation that could either take the value +1 or -1 for Push and Pop operation."}, {"id": 21, "string": "After this modification, we came to the following observations: Now, what remains to homogenize Push and Pop operations is conducting the extra computations needed for Push operation when Pop is fed in as well, while guaranteeing the correctness of the resulting hidden state both in the current time step and in the future."}, {"id": 22, "string": "The next observation points out a way for this guarantee: Observation 2 In a StackLSTM, given the current stack top pointer position p(H), any hidden state h i where i > p(H) will not be read until it is overwritten by a Push operation."}, {"id": 23, "string": "What follows from this observation is the guarantee that we can always safely overwrite hidden states h i that are indexed higher than the current stack top pointer, because it is known that any read operation on these states will happen after another overwrite."}, {"id": 24, "string": "This allows us to do the extra computation anyway when Pop operation is fed, because the extra computation, especially updating h p(H)+1 , will not harm the validity of the hidden states at any time step."}, {"id": 25, "string": "Algorithm 1 gives the final forward computation for the Parallelizable StackLSTM."}, {"id": 26, "string": "Note that this algorithm does not contain any if-statements that depends on stack operations and hence is homogeneous when grouped into batches that are consisted of multiple operations trajectories."}, {"id": 27, "string": "In transition systems (Nivre, 2008; Kuhlmann et al., 2011) used in real tasks (e.g., transition-based parsing) as shown in Table 1 , it should be noted that more than push and pop operations are needed for the StackLSTM."}, {"id": 28, "string": "Fortunately, for Arc-Eager and h_prev ← h p(H) ; h ← LSTM(x t , h_prev); h p(H)+1 ← h; p(H) ← p(H) + op; return h p(H) ; Arc-Hybrid transition systems, we can simply add a hold operation, which is denoted by value 0 for the discrete operation input."}, {"id": 29, "string": "For that reason, we will focus on parallelization of these two transition systems for this paper."}, {"id": 30, "string": "It should be noted that both observations discussed above are still valid after adding the hold operation."}, {"id": 31, "string": "Experiments Setup We implemented 2 the architecture described above in PyTorch (Paszke et al., 2017) ."}, {"id": 32, "string": "We implemented the batched stack as a float tensor wrapped in a non-leaf variable, thus enabling in-place operations on that variable."}, {"id": 33, "string": "At each time step, the batched stack is queried/updated with a batch of stack head positions represented by an integer vector, an operation made possible by gather operation and advanced indexing."}, {"id": 34, "string": "Due to this implementation choice, the stack size has to be determined at initialization time and cannot be dynamically grown."}, {"id": 35, "string": "Nonetheless, a fixed stack size of 150 works for all the experiments we conducted."}, {"id": 36, "string": "We use the dependency parsing task to evaluate the correctness and the scalability of our method."}, {"id": 37, "string": "a test set accuracy of 97.47%."}, {"id": 38, "string": "We use exactly the same pre-trained English word embedding as Dyer et al."}, {"id": 39, "string": "(2015) ."}, {"id": 40, "string": "We use Adam (Kingma and Ba, 2014) as the optimization algorithm."}, {"id": 41, "string": "Following Goyal et al."}, {"id": 42, "string": "(2017) , we apply linear warmup to the learning rate with an initial value of τ = 5 × 10 −4 and total epoch number of 5."}, {"id": 43, "string": "The target learning rate is set by τ multiplied by batch size, but capped at 0.02 because we find Adam to be unstable beyond that learning rate."}, {"id": 44, "string": "After warmup, we reduce the learning rate by half every time there is no improvement for loss value on the development set (ReduceLROnPlateau)."}, {"id": 45, "string": "We clip all the gradient norms to 5.0 and apply a L 2 -regularization with weight 1 × 10 −6 ."}, {"id": 46, "string": "We started with the hyper-parameter choices in Dyer et al."}, {"id": 47, "string": "(2015) but made some modifications based on the performance on the development set: we use hidden dimension 200 for all the LSTM units, 200 for the parser state representation before the final softmax layer, and embedding dimension 48 for the action embedding."}, {"id": 48, "string": "We use Tesla K80 for all the experiments, in order to compare with Neubig et al."}, {"id": 49, "string": "(2017b); Dyer et al."}, {"id": 50, "string": "(2015) ."}, {"id": 51, "string": "We also use the same hyper-parameter setting as Dyer et al."}, {"id": 52, "string": "(2015) for speed comparison experiments."}, {"id": 53, "string": "All the speeds are measured by running through one training epoch and averaging."}, {"id": 54, "string": "close to linear, which means there is very little overhead associated with our batching scheme."}, {"id": 55, "string": "Quantitatively, according to Amdahl's Law (Amdahl, 1967) , the proportion of parallelized computations is 99.92% at batch size 64."}, {"id": 56, "string": "We also compared our implementation with the implementation that comes with Dyer et al."}, {"id": 57, "string": "(2015) , which is implemented in C++ with DyNet (Neubig et al., 2017a) ."}, {"id": 58, "string": "DyNet is known to be very optimized for CPU computations and hence their implementation is reasonably fast even without batching and GPU acceleration, as shown in Figure 1 ."}, {"id": 59, "string": "4 But we would like to point out that we focus on the speed-up we are able to obtain rather than the absolute speed, and that our batching scheme is framework-universal and superior speed might be obtained by combining our scheme with alternative frameworks or languages (for example, the torch C++ interface)."}, {"id": 60, "string": "The dependency parsing results are shown in Table 2."}, {"id": 61, "string": "Our implementation is able to yield better test set performance than that reported in Ballesteros et al."}, {"id": 62, "string": "(2017) for all batch size configurations except 256, where we observe a modest performance loss."}, {"id": 63, "string": "Like Goyal et al."}, {"id": 64, "string": "(2017) ; Keskar et al."}, {"id": 65, "string": "(2016) ; Masters and Luschi (2018) , we initially observed more significant test-time performance deterioration (around 1% absolute difference) for models trained without learning rate warmup, and concurring with the findings in Goyal et al."}, {"id": 66, "string": "(2017) , we find warmup very helpful for stabilizing largebatch training."}, {"id": 67, "string": "We did not run experiments with batch size below 8 as they are too slow due to 4 Measured on one core of an Intel Xeon E7-4830 CPU."}, {"id": 68, "string": "Results Python's inherent performance issue."}, {"id": 69, "string": "Related Work DyNet has support for automatic minibatching (Neubig et al., 2017b) , which figures out what computation is able to be batched by traversing the computation graph to find homogeneous computations."}, {"id": 70, "string": "While we cannot directly compare with that framework's automatic batching solution for StackLSTM 5 , we can draw a loose comparison to the results reported in that paper for BiLSTM transition-based parsing (Kiperwasser and Goldberg, 2016) ."}, {"id": 71, "string": "Comparing batch size of 64 to batch size of 1, they obtained a 3.64x speed-up on CPU and 2.73x speed-up on Tesla K80 GPU, while our architecture-specific manual batching scheme obtained 60.8x speed-up."}, {"id": 72, "string": "The main reason for this difference is that their graph-traversing automatic batching scheme carries a much larger overhead compared to our manual batching approach."}, {"id": 73, "string": "Another toolkit that supports automatic minibatching is Matchbox 6 , which operates by analyzing the single-instance model definition and deterministically convert the operations into their minibatched counterparts."}, {"id": 74, "string": "While such mechanism eliminated the need to traverse the whole computation graph, it cannot homogenize the operations in each branch of if."}, {"id": 75, "string": "Instead, it needs to perform each operation separately and apply masking on the result, while our method does not require any masking."}, {"id": 76, "string": "Unfortunately we are also not able to compare with the toolkit at the time of this work as it lacks support for several operations we need."}, {"id": 77, "string": "Similar to the spirit of our work, Bowman et al."}, {"id": 78, "string": "(2016) attempted to parallelize StackLSTM by using Thin-stack, a data structure that reduces the space complexity by storing all the intermediate stack top elements in a tensor and use a queue to control element access."}, {"id": 79, "string": "However, thanks to Py-Torch, our implementation is not directly dependent on the notion of Thin-stack."}, {"id": 80, "string": "Instead, when an element is popped from the stack, we simply shift the stack top pointer and potentially re-write the corresponding sub-tensor later."}, {"id": 81, "string": "In other words, there is no need for us to directly maintain all the intermediate stack top elements, because in PyTorch, when the element in the stack is re-written, its underlying sub-tensor will not be destructed as there are still nodes in the computation graph that point to it."}, {"id": 82, "string": "Hence, when performing back-propagation, the gradient is still able to flow back to the elements that are previously popped from the stack and their respective precedents."}, {"id": 83, "string": "Hence, we are also effectively storing all the intermediate stack top elements only once."}, {"id": 84, "string": "Besides, Bowman et al."}, {"id": 85, "string": "(2016) didn't attempt to eliminate the conditional branches in the StackLSTM algorithm, which is the main algorithmic contribution of this work."}, {"id": 86, "string": "Conclusion We propose a parallelizable version of StackLSTM that is able to fully exploit the GPU parallelism by performing minibatched training."}, {"id": 87, "string": "Empirical results show that our parallelization scheme yields comparable performance to previous work, and our method scales up very linearly with the increasing batch size."}, {"id": 88, "string": "Because our parallelization scheme is based on the observation made in section 1, we cannot incorporate batching for neither Arc-Standard transition system nor the token-level composition function proposed in Dyer et al."}, {"id": 89, "string": "(2015) efficiently yet."}, {"id": 90, "string": "We leave the parallelization of these architectures to future work."}, {"id": 91, "string": "Our parallelization scheme makes it feasible to run large-data experiments for various tasks that requires large training data to perform well, such as RNNG-based syntax-aware neural machine translation (Eriguchi et al., 2017) ."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 6}, {"section": "StackLSTM", "n": "2", "start": 7, "end": 17}, {"section": "Parallelizable StackLSTM", "n": "3", "start": 18, "end": 30}, {"section": "Setup", "n": "4.1", "start": 31, "end": 65}, {"section": "Results", "n": "4.2", "start": 66, "end": 68}, {"section": "Related Work", "n": "5", "start": 69, "end": 85}, {"section": "Conclusion", "n": "6", "start": 86, "end": 91}], "figures": [{"filename": "../figure/image/1160-Figure1-1.png", "caption": "Figure 1: Training speed at different batch size. Note that the x-axis is in log-scale in order to show all the data points properly.", "page": 2, "bbox": {"x1": 310.08, "x2": 509.28, "y1": 65.75999999999999, "y2": 221.76}}, {"filename": "../figure/image/1160-Table1-1.png", "caption": "Table 1: Correspondence between transition operations and stack/buffer operations for StackLSTM, where g denotes the composition function as proposed by (Dyer et al., 2015). S0 and B0 refers to the token-level representation corresponding to the top element of the stack and buffer, while S1 and B1 refers to those that are second to the top. We use a different notation here to avoid confusion with the states in StackLSTM, which represent non-local information beyond token-level.", "page": 1, "bbox": {"x1": 96.96, "x2": 501.12, "y1": 62.4, "y2": 235.2}}, {"filename": "../figure/image/1160-Table2-1.png", "caption": "Table 2: Dependency parsing result with various training batch size b and without composition function. The results marked with asterisks were reported in the Ballesteros et al. (2017).", "page": 3, "bbox": {"x1": 82.56, "x2": 280.32, "y1": 62.4, "y2": 229.92}}]}