{"title": "Perplexity on Reduced Corpora", "abstract": "This paper studies the idea of removing low-frequency words from a corpus, which is a common practice to reduce computational costs, from a theoretical standpoint. Based on the assumption that a corpus follows Zipf's law, we derive tradeoff formulae of the perplexity of k-gram models and topic models with respect to the size of the reduced vocabulary. In addition, we show an approximate behavior of each formula under certain conditions. We verify the correctness of our theory on synthetic corpora and examine the gap between theory and practice on real corpora. * This work was mainly carried out while the author was with Toshiba Corporation.", "text": [{"id": 0, "string": "Introduction Removing low-frequency words from a corpus (often called cutoff) is a common practice to save on the computational costs involved in learning language models and topic models."}, {"id": 1, "string": "In the case of language models, we often have to remove low-frequency words because of a lack of computational resources, since the feature space of kgrams tends to be so large that we sometimes need cutoffs even in a distributed environment (Brants et al., 2007) ."}, {"id": 2, "string": "In the case of topic models, the intuition is that low-frequency words do not make a large contribution to the statistics of the models."}, {"id": 3, "string": "Actually, when we try to roughly analyze a corpus with topic models, a reduced corpus is enough for the purpose (Steyvers and Griffiths, 2007) ."}, {"id": 4, "string": "A natural question arises: How many lowfrequency words can we remove while maintaining sufficient performance?"}, {"id": 5, "string": "Or more generally, by how much can we reduce a corpus/model using a certain strategy and still keep a sufficient level of performance?"}, {"id": 6, "string": "There have been many stud-ies addressing the question as it pertains to different strategies (Stolcke, 1998; Buchsbaum et al., 1998; Goodman and Gao, 2000; Gao and Zhang, 2002; Ha et al., 2006; Hirsimaki, 2007; Church et al., 2007) ."}, {"id": 7, "string": "Each of these studies experimentally discusses trade-off relationships between the size of the reduced corpus/model and its performance measured by perplexity, word error rate, and other factors."}, {"id": 8, "string": "To our knowledge, however, there is no theoretical study on the question and no evidence for such a trade-off relationship, especially for topic models."}, {"id": 9, "string": "In this paper, we first address the question from a theoretical standpoint."}, {"id": 10, "string": "We focus on the cutoff strategy for reducing a corpus, since a cutoff is simple but powerful method that is worth studying; as reported in (Goodman and Gao, 2000; Gao and Zhang, 2002) , a cutoff is competitive with sophisticated strategies such as entropy pruning."}, {"id": 11, "string": "As the basis of our theory, we assume Zipf's law (Zipf, 1935) , which is an empirical rule representing a long-tail property of words in a corpus."}, {"id": 12, "string": "Our approach is essentially the same as those in physics, in the sense of constructing a theory while believing experimentally observed results."}, {"id": 13, "string": "For example, we can derive the distance to the landing point of a ball thrown up in the air with initial speed v 0 and angle θ as v 0 2 sin(2θ)/g by believing in the experimentally observed gravity acceleration g. In a similar fashion, we will try to clarify the trade-off relationship by believing Zipf's law."}, {"id": 14, "string": "The rest of the paper is organized as follows."}, {"id": 15, "string": "In Section 2, we define the notation and briefly explain Zipf's law and perplexity."}, {"id": 16, "string": "In Section 3, we theoretically derive the trade-off formulae of the cutoff for unigram models, k-gram models, and topic models, each of which represents its perplexity with respect to a reduced vocabulary, under the assumption that the corpus follows Zipf's law."}, {"id": 17, "string": "In addition, we show an approximate behavior of each formula under certain conditions."}, {"id": 18, "string": "In Section 4, we verify the correctness of our theory on synthetic corpora and examine the gap between theory and practice on several real corpora."}, {"id": 19, "string": "Section 5 concludes the paper."}, {"id": 20, "string": "Preliminaries Let us consider a corpus w := w 1 · · · w N of corpus size N and vocabulary size W ."}, {"id": 21, "string": "We use an abridged notation {w} := {w ∈ w} to represent the vocabulary of w. Clearly, N = |w| and W = |{w}| hold."}, {"id": 22, "string": "When w has additional notations, N and W inherit them."}, {"id": 23, "string": "For example, we will use N ′ as the size of w ′ without its definition."}, {"id": 24, "string": "Power law and Zipf's law A power law is a mathematical relationship between two quantities x and y, where y is proportional to the c-th power of x, i.e., y ∝ x c , and c is a real number."}, {"id": 25, "string": "Zipf's law (Zipf, 1935) is a power law discovered on real corpora, wherein for any word w ∈ w in a corpus w, its frequency (or word count) f (w) is inversely proportional to its frequency ranking r(w), i.e., f (w) = C r(w) ."}, {"id": 26, "string": "Here, f (w) := |{w ′ ∈ w | w ′ = w}|, and r(w) := |{w ′ ∈ w | f (w ′ ) ≥ f (w)}|."}, {"id": 27, "string": "From the definition, the constant C is the maximum frequency in the corpus."}, {"id": 28, "string": "Taking the natural logarithms ln(·) of both sides of the above equation, we find that its plot becomes linear on a log-log graph of r(w) and f (w)."}, {"id": 29, "string": "In fact, the result based on a statistical test in (Clauset et al., 2009) reports that the frequencies of words in a corpus completely follow a power law, whereas many datasets with long-tail properties, such as networks, actually do not follow power laws."}, {"id": 30, "string": "Perplexity Perplexity is a widely used evaluation measure of k-gram models and topic models."}, {"id": 31, "string": "Let p be a predictive distribution over words, which was learned from a training corpus w based on a certain model."}, {"id": 32, "string": "Formally, perplexity PP is defined as the geometric mean of the inverse of the per-word likelihood on the held-out test corpus w τ , i.e., PP := ( ∏ w∈wτ 1 p(w) ) 1 Nτ ."}, {"id": 33, "string": "Intuitively, PP means how many possibilities one has for estimating the next word in a test corpus."}, {"id": 34, "string": "According to the definition, a lower perplexity means better generalization performance of p. Another well-known evaluation measure is crossentropy."}, {"id": 35, "string": "Since cross-entropy is easily calculated as log 2 PP, we can apply many of the results of this paper to cross-entropy."}, {"id": 36, "string": "Perplexity on Reduced Corpora Now let us consider what a cutoff is."}, {"id": 37, "string": "In our study, we simply define a corpus that has been reduced by removing low-frequency words from the original corpus with a certain threshold."}, {"id": 38, "string": "Formally, we say w ′ is a corpus reduced from the original corpus w, if w ′ is the longest subsequence of w such that max w ′ ∈w ′ r(w ′ ) = W ′ ."}, {"id": 39, "string": "Note that a subsequence can include gaps in contrast to a substring."}, {"id": 40, "string": "For example, supposing we have a corpus w = abcaba with a vocabulary {w} = {a, b, c}, w ′ 1 = ababa is a reduced corpus, while w ′ 2 = aba and w ′ 3 = acaa are not."}, {"id": 41, "string": "After learning a distribution p ′ from a reduced corpus w ′ , we need to infer the distribution p learned from the original corpus w. Here, we use constant restoring (defined below), which assumes the frequencies of the reduced lowfrequency words are a constant."}, {"id": 42, "string": "Definition 1 (Constant Restoring)."}, {"id": 43, "string": "Given a positive constant λ, a distribution p ′ over a reduced corpus w ′ , and a corpus w, we say thatp is a λ-restored distribution of p ′ from w ′ to w, if ∑ w∈{w}p (w) = 1, and for any w ∈ w, p(w) ∝ { p ′ (w) (w ∈ w ′ ) λ (w / ∈ w ′ )."}, {"id": 44, "string": "Constant restoring is similar to the additive smoothing defined byp(w) ∝ p ′ (w) + λ, which is used to solve the zero-frequency problem of language models (Chen and Goodman, 1996) ."}, {"id": 45, "string": "The only difference is the addition of a constant λ only to zero-frequency words."}, {"id": 46, "string": "We think constant restoring is theoretically natural in our setting, since we can derive the above equation by letting each frequency of reduced words be λN ′ and defining a restored frequency function as follows:f (w) = { f (w) (w ∈ w ′ ) λN ′ (w / ∈ w ′ )."}, {"id": 47, "string": "Informally, constant restoring involves padding the vocabulary, while additive smoothing involves padding the corpus."}, {"id": 48, "string": "Smoothing should be carried out after restoring."}, {"id": 49, "string": "Perplexity of Unigram Models Let us consider the perplexity of a unigram model learned from a reduced corpus."}, {"id": 50, "string": "In unigram models, a predictive distribution p ′ on a reduced corpus w ′ can be simply calculated as p ′ (w ′ ) = f (w ′ )/N ′ ."}, {"id": 51, "string": "We shall start with an analysis of training-set perplexity, since we can derive an exact formula for it, which will give us a sufficient idea for making an approximate analysis of testset perplexity."}, {"id": 52, "string": "LetPP 1 := ( ∏ w∈w 1 p(w) ) 1 N be the perplexity of a λ-restored distributionp on a unigram model."}, {"id": 53, "string": "The next lemma gives the optimal restoring constant λ * minimizingPP 1 ."}, {"id": 54, "string": "Lemma 2."}, {"id": 55, "string": "For any λ-restored distributionp of a distribution p ′ from a reduced corpus w ′ to the original corpus w, its perplexity is minimized by λ * = N − N ′ (W − W ′ )N ′ ."}, {"id": 56, "string": "Proof."}, {"id": 57, "string": "Let w R be the longest subsequence such that min w ′ ∈w ′ r(w ′ ) = W ′ + 1."}, {"id": 58, "string": "Since w R is the remainder of w ′ , N R = N − N ′ and W R = W − W ′ hold."}, {"id": 59, "string": "After substituting the normalized form ofp of Definition 1 intoPP 1 , we havê PP 1 = ( ∏ w ′ ∈w ′ 1 p(w ′ ) ∏ w R ∈w R 1 p(w R ) ) 1 N = ( ∏ w ′ ∈w ′ 1 + W R λ p ′ (w ′ ) ∏ w R ∈w R 1 + W R λ λ ) 1 N = 1 + W R λ λ N R N ( ∏ w ′ ∈w ′ 1 p ′ (w ′ ) ) 1 N ."}, {"id": 60, "string": "We obtain the optimal smoothing factor λ * when ∂ ∂λP P 1 ∝ ∂ ∂λ (1 + W R λ)/λ N R N = 0."}, {"id": 61, "string": "By using a similar argument to the one in the above lemma, we can obtain the optimal constant of additive smoothing as λ * ≈ N −N ′ W N ′ , when N is sufficiently large."}, {"id": 62, "string": "The next theorem gives the exact formula of the training-set perplexity of a unigram model learned from a reduced corpus."}, {"id": 63, "string": "Theorem 3."}, {"id": 64, "string": "For any distribution p ′ on a unigram model learned from a corpus w ′ reduced from the original corpus w following Zipf's law, the per- plexityPP 1 of the λ * -restored distributionp of p ′ from w ′ to w is calculated bŷ PP 1 (W ′ ) =H(W ) exp ( B(W ′ ) H(W ) ) ( W − W ′ H(W ) − H(W ′ ) ) 1− H(W ′ ) H(W ) , where H(X) := ∑ X x=1 1 x and B(X) := ∑ X x=1 ln x x ."}, {"id": 65, "string": "Proof."}, {"id": 66, "string": "We expand the first part ofPP 1 in the proof of Lemma 2 using λ * as follows: 1 + W R λ * λ * N R N = ( 1 + N R N ′ ) ( W R N ′ N R ) N R N = ( N N ′ ) ( (W − W ′ )N ′ N − N ′ ) 1− N ′ N ."}, {"id": 67, "string": "The second part ofPP 1 is as follows: ( ∏ w ′ ∈w ′ 1 p ′ (w ′ ) ) 1 N = ∏ w ′ ∈{w ′ } ( 1 p ′ (w ′ ) ) f (w ′ ) N = W ′ ∏ r=1 ( rN ′ C ) C rN = W ′ ∏ r=1 ( N ′ C ) C rN W ′ ∏ r=1 r C rN = ( N ′ C )N ′ N exp ( C N W ′ ∑ r=1 ln r r ) ."}, {"id": 68, "string": "We obtain the objective formula by putting the above two formulae together with N = CH(W ) and N ′ = CH(W ′ ), which are derived from Zipf's law."}, {"id": 69, "string": "The functions H(X) and B(X) are the X-th partial sum of the harmonic series and Bertrand series (special form), respectively."}, {"id": 70, "string": "An approximation by definite integrals yields H(X) ≈ ln X +γ, where γ is the Euler-Mascheroni constant, and B(X) ≈ 1 2 ln 2 X."}, {"id": 71, "string": "We may omit γ from the approximate analysis."}, {"id": 72, "string": "Now let us consider an approximate form of PP 1 (W ′ ) in Theorem 3."}, {"id": 73, "string": "For further discussion, we define the last part ofPP 1 (W ′ ) as follows: F (W, W ′ ) := ( W − W ′ H(W ) − H(W ′ ) ) 1− H(W ′ ) H(W ) ."}, {"id": 74, "string": "Since W ′ = δW holds for an appropriate ratio δ, we have F (W, δW ) = ( W − δW H(W ) − H(δW ) ) 1− H(δW ) H(W ) ≈ ( W − δW ln W − ln (δW ) ) 1− ln (δW ) ln W = ( W (1 − δ) − ln δ ) − ln δ ln W → 1 δ (W → ∞)."}, {"id": 75, "string": "Therefore, when W is sufficiently large, we can use F (W, W ′ ) ≈ W W ′ , since F (W, δW ) ≈ 1 δ holds for any ratio δ : 0 < δ < 1."}, {"id": 76, "string": "Using this fact, we obtain an approximate formulaPP 1 ofPP 1 as follows: PP 1 (W ′ ) = ln W exp ( ln 2 W ′ 2 ln W ) W W ′ = √ W ln W exp (ln W ′ − ln W ) 2 2 ln W ."}, {"id": 77, "string": "The complexity ofPP 1 is quasi-polynomial, i.e.,PP 1 (W ′ ) = O(W ′ ln W ′ ), which behaves as a quadratic function on a log-log graph."}, {"id": 78, "string": "Sincẽ PP 1 (W ′ ) is convex, i.e., ∂ 2 ∂W ′2P P 1 (W ′ ) > 0, and its gradient ∂ ∂W ′P P 1 (W ′ ) is zero when W ′ = W , we infer that low-frequency words may not largely contribute to the statistics."}, {"id": 79, "string": "Considering the special case of W ′ = W , we obtain the perplexity PP 1 of the unigram model learned from the original corpus w as PP 1 = H(W ) exp ( B(W ) H(W ) ) ≈ √ W ln W. Interestingly, PP 1 is approximately expressed as a simple elementary function of vocabulary size W ."}, {"id": 80, "string": "This suggests that models learned from corpora with the same vocabulary size theoretically have the same perplexity."}, {"id": 81, "string": "For the test-set perplexity, we assume that both the training corpus w and test corpus w τ are generated from the same distribution based on Zipf's law."}, {"id": 82, "string": "This assumption is natural, considering the situation of an in-domain test or cross validation test."}, {"id": 83, "string": "Let w τ ′ be the longest subsequence of w τ such that for any w ∈ w τ ′ , w ∈ w ′ holds."}, {"id": 84, "string": "For- mally, we assume p ′ (w) ≈ p τ ′ (w) for any w ∈ w ′ τ when W τ > W ′ , where p τ ′ is the true distribu- tion over w τ ′ ."}, {"id": 85, "string": "Using similar arguments to those of Lemma 2 and Theorem 3 for w τ , we obtain an approximation formula for the test-set perplexity, where we simply substitute W and W ′ in the exact formula for the training-set perplexity with W τ and W τ ′ , respectively."}, {"id": 86, "string": "For simplicity, we will only consider training-set perplexity from now on, since we can make a similar argument for the testset perplexity in the later analysis."}, {"id": 87, "string": "Perplexity of k-gram Models Here, we will consider the perplexity of a k-gram model learned from a reduced corpus as a standard extension of a unigram model."}, {"id": 88, "string": "Our theory only assumes that the corpus is generated on the basis of Zipf's law."}, {"id": 89, "string": "Thus, we can use a simple model where k-grams are calculated from a random word sequence based on Zipf's law."}, {"id": 90, "string": "This model seems to be stupid, since we can easily notice that the bigram \"is is\" is quite frequent, and the two bigrams \"is a\" and \"a is\" have the same frequency."}, {"id": 91, "string": "However, the experiments described later uncovered the fact that the model can roughly capture the behavior of real corpora."}, {"id": 92, "string": "The frequency f k of k-gram word w k ∈ w k in the model is represented by the following formula: f k (w k ) = C k g k (r k (w k )) , where C k is the maximal frequency in k-grams, r k is the frequency ranking of w k over k-grams, and g k expresses the frequency decay in k-grams."}, {"id": 93, "string": "For example, the decay function g 2 of bigrams is as follows: (g 2 (i)) i := (g 2 (1), g 2 (2), g 2 (3), · · · ) = (1 · 1, 1 · 2, 2 · 1, 1 · 3, 3 · 1, · · · ) = (1, 2, 2, 3, 3, 4, 4, 4, 5, 5, 6, · · · )."}, {"id": 94, "string": "This is an inverse of the sum of Piltz's divisor functions d 2 (n) := ∑ i 1 ·i 2 =n 1, which represents the number of divisors of an integer n (cf."}, {"id": 95, "string": "(OEIS, 2001) )."}, {"id": 96, "string": "In general, we formally define g k through its inverse: g −1 k (ℓ) := S k (ℓ), where S k (ℓ) := ∑ ℓ n=1 d k (n) and d k (n) := ∑ i 1 ·i 2 ···i k =n 1."}, {"id": 97, "string": "Since (g k (i)) i is a sorted sequence of the elements of the k-th tensor power of vector (1, · · · , W ), we can calculate the maximum frequency C k as follows."}, {"id": 98, "string": "Lemma 4."}, {"id": 99, "string": "For any corpus w following Zipf's law, the maximum frequency of k-grams in our model is calculated by C k = N − (k − 1)D (H(W )) k , where D denotes the number of documents in w. Proof."}, {"id": 100, "string": "We use ∑ w k f k (w k ) = C k ( ∑ w 1/r(w)) k ."}, {"id": 101, "string": "The sum S k (ℓ) of Piltz's divisor functions can be approximated by ℓP k (ln ℓ), where P k (x) is a polynomial of degree k − 1 with respect to x, and the main term of ℓP k (ln ℓ) is given by the following residue Res s=1 ζ k (s)x s s , where ζ(s) is the Riemann zeta function (Li, 2005) ."}, {"id": 102, "string": "Using this fact, we obtain an approximation ln (g −1 k (ℓ)) ≈ ln ℓ + O(ln (ln ℓ)) ≈ ln ℓ, when ℓ is sufficiently large."}, {"id": 103, "string": "Thus, when the corpus is sufficiently large, we can see that the behavior of f k is roughly linear on a log-log graph, i.e., f k (w k ) ∝ r k (w k ) −1 , since if g −1 k (ℓ) ∝ ℓ c holds, then f k (r) ∝ (g k (r)) −1 ∝ r − 1 c holds."}, {"id": 104, "string": "Unfortunately, however, most corpora in the real world are not so large that the abovementioned relation holds."}, {"id": 105, "string": "Actually, Ha et al."}, {"id": 106, "string": "(Ha et al., 2002; Ha et al., 2006) experimentally found that although a k-gram corpus roughly follows a power law even when k > 1, its exponent is smaller than 1 (for Zipf's law)."}, {"id": 107, "string": "They pointed out that the exponent of bigrams is about 0.66, and that of 5-grams is about 0.59 in the Wall Street Journal corpus (WSJ87)."}, {"id": 108, "string": "Believing their claim that there exists a constant π k such that f k (w k ) ∝ r k (w k ) −π k , we estimated the exponent of k-grams in an actual situation in the form of the following lemma."}, {"id": 109, "string": "Lemma 5."}, {"id": 110, "string": "Assuming that f k (w k ) ∝ r k (w k ) −π k holds for any k-gram word w k ∈ w k in a corpus w following Zipf's law, the optimal exponent in our model based on the least squares criterion is calculated by π k = ln W (k − 1) ln (ln W ) + ln W ."}, {"id": 111, "string": "Proof."}, {"id": 112, "string": "We find the optimal exponent π k by minimizing the sum of squared errors between the gradients of g −1 k (r) and r 1 π k on a log-log graph: ∫ { ∂ ∂y (y + ln P k (y)) − ∂ ∂y ( 1 π k y )} 2 dy, where y = ln r. In the case of unigrams (k = 1), the formula exactly represents Zipf's law."}, {"id": 113, "string": "In the case of kgrams (k > 1), we found that the formula approaches Zipf's law when W approaches infinity, i.e., lim W →∞ π k = 1."}, {"id": 114, "string": "Let us consider the perplexity of a k-gram model learned from a reduced corpus."}, {"id": 115, "string": "We immediately obtain the following corollary using Lemma 5."}, {"id": 116, "string": "Corollary 6."}, {"id": 117, "string": "For any distribution p ′ on a k-gram model learned from a corpus w ′ reduced from the original corpus w following Zipf's law, assuming that f k (w k ) ∝ r k (w k ) −π k holds for any k-gram word w k ∈ w k and the optimal exponent π k in Lemma 5, the perplexityPP k of the λ * -restored distributionp of p ′ from w ′ to w is calculated bŷ PP k (W ′ ) =H π k (W ) exp ( B π k (W ′ ) H π k (W ) ) ( W − W ′ H π k (W ) − H π k (W ′ ) ) 1− Hπ k (W ′ ) Hπ k (W ) , where H a (X) := ∑ X x=1 1 x a and B a (X) := ∑ X x=1 a ln x x a ."}, {"id": 118, "string": "H a (X) is the X-th partial sum of the P-series or hyper-harmonic series, which is a generalization of the harmonic series H(X)."}, {"id": 119, "string": "B a (X) is the X-th partial sum of the Bertrand series (another special form of B(X))."}, {"id": 120, "string": "When 0 < a < 1, we can easily calculatePP k (W ′ ) by using the following approximations: H a (X) ≈ (X + 1) 1−a − 1 1 − a B a (X) ≈ a 1 − a (X + 1) 1−a ln(X + 1) − a (1 − a) 2 (X + 1) 1−a + a (1 − a) 2 ."}, {"id": 121, "string": "By putting the approximations of H a (X) and B a (X) into the formula of Corollary 6, we obtain an approximationPP k (W ′ ) ≈ O(W ′ W ′1−π k )."}, {"id": 122, "string": "This implies thatPP k (W ′ ) is approximately linear on a log-log graph, when π k is close to 1, i.e., k is relatively small and W is sufficiently large."}, {"id": 123, "string": "Note that we must use the approximation of H(X), not H a (X), when a = 1."}, {"id": 124, "string": "The fact that the frequency of k-grams follows a power law leads us to an additional convenient property, since the process of generating a corpus in our theory can be treated as a variant of the coupon collector's problem."}, {"id": 125, "string": "In this problem, we consider how many trials are needed for collecting all coupons whose occurrence probabilities follow some stable distribution."}, {"id": 126, "string": "According to a well-known result about power law distributions (Boneh and Papanicolaou, 1996) , we need a corpus of size kW k 1−π k ln W when π k < 1, and W ln 2 W when π k = 1 for collecting all of the k-grams, the number of which is W k ."}, {"id": 127, "string": "Using results in (Atsonios et al., 2011), we can easily obtain a lower and upper bound of the actual vocabulary sizeW k of k-grams from the corpus size N and vocabulary size W as W k ≥ (π k + 1) ( 1 − e − (1−π k )N W k −1 −ln W k −1 W k ) W k ≤ π k π k − 1 ( N H π k (W k ) ) 1 π k − N W 1−π k (π k − 1)H π k (W k ) ."}, {"id": 128, "string": "This means that we can determine the rough sparseness of k-grams and adjust some of the parameters such as the gram size k in learning statistical language models."}, {"id": 129, "string": "Perplexity of Topic Models In this section, we consider the perplexity of the widely used topic model, Latent Dirichlet Allocation (LDA) (Blei et al., 2003) , by using the notation given in (Griffiths and Steyvers, 2004) ."}, {"id": 130, "string": "LDA is a probabilistic language model that generates a corpus as a mixture of hidden topics, and it allows us to infer two parameters: the document-topic distribution θ that represents the mixture rate of topics in each document, and the topic-word distribution ϕ that represents the occurrence rate of words in each topic."}, {"id": 131, "string": "For a given corpus w, the model is defined as θ d i ∼ Dirichlet(α) z i |θ d i ∼ Multi(θ d i ) ϕ z i ∼ Dirichlet(β) w i |z i , ϕ z i ∼ Multi(ϕ z i ), where d i and z i are respectively the document that includes the i-th word w i and the hidden topic that is assigned to w i ."}, {"id": 132, "string": "In the case of inference by Gibbs sampling presented in (Griffiths and Steyvers, 2004) , we can sample a \"good\" topic assignment z i for each word w i with high probability."}, {"id": 133, "string": "Using the assignments z, we obtain the posterior distributions of two parameters asθ d (z) ∝ n (d) z + α andφ z (w) ∝ n (w) z + β, where n (d) z and n (w) z respectively represent the number of times assigning topic z in document d and the number of times topic z is assigned to word w. Since an exact analysis is very hard, we will place rough assumptions onφ andθ to reduce the complexity."}, {"id": 134, "string": "The assumption placed onφ is that the word distributionφ z of each topic z follows Zipf's law."}, {"id": 135, "string": "We think this is acceptable since we can regard each topic as a corpus that follows Zipf's law."}, {"id": 136, "string": "Sinceφ z is normalized for each topic, we can assume that for any two topics, z and z ′ , and any two words, w and w ′ ,φ z (w) ≈φ z ′ (w ′ ) holds if r z (w) = r z ′ (w ′ ), where r z (w) is the frequency ranking of w with respect to n (w) z ."}, {"id": 137, "string": "Note that the above assumption pertains to a posterior, and we do not discuss the fact that a Pitman-Yor process prior is better suited for a power law (Goldwater et al., 2011) ."}, {"id": 138, "string": "The assumption placed onφ may not be reasonable in the case ofθ, because we can easily think of a document with only one topic, and we usually use a small number T of topics for LDA, e.g., T = 20."}, {"id": 139, "string": "Thus, we consider two extreme cases."}, {"id": 140, "string": "One is where each document evenly has all topics, and the other is where each document only has one topic."}, {"id": 141, "string": "Although these two cases might be unrealistic, the actual (theoretical) perplexity is expected to be between their values."}, {"id": 142, "string": "We believe that analyzing such extreme cases is theoretically important, since it would be useful for bounding the computational complexity and predictive performance."}, {"id": 143, "string": "We can regard the former case as a unigram model, since the marginal predictive distribution ∑ T z=1θ d (z)φ z (w) ∝ ∑ T z=1 n (w) z +β T ∝ ∼ f (w) is independent of d; here we have usedθ d (z) = 1/T from the assumption."}, {"id": 144, "string": "In the latter case, we can obtain an exact formula for the perplexity of LDA when the topic assigned to each document follows a discrete uniform distribution, as shown in the next theorem."}, {"id": 145, "string": "Note that a mixture of corpora following Zipf's law can be approximately regarded as following Zipf's law, when W is sufficiently large."}, {"id": 146, "string": "Theorem 7."}, {"id": 147, "string": "For any distribution p ′ on the LDA model with T topics learned from a corpus w ′ reduced from the original corpus w following Zipf's law, assuming that each document only has one topic which is assigned based on a discrete uniform distribution, the perplexityPP Mix of the λ *restored distributionp of p ′ from w ′ to w is calcu- H(W/T ) ) ( W − W ′ H(W/T ) − H(W ′ /T ) ) 1− H(W ′ /T ) H(W/T ) Proof."}, {"id": 148, "string": "We can prove this by using a similar argument to that of Theorem 3 for each topic."}, {"id": 149, "string": "The formula of the theorem is nearly identical to the one of Theorem 3 for a 1/T corpus."}, {"id": 150, "string": "This implies that the growth rate of the perplexity of LDA models is larger than that of unigram models, whereas the perplexity of LDA models for the original corpus is smaller than that of unigram models."}, {"id": 151, "string": "In fact, a similar argument to the one in the approximate analysis in Section 3.1 leads to an approximate formulaPP Mix ofPP Mix as PP Mix (W ′ ) = √ W T ln W T exp (ln W ′ − ln W ) 2 2 ln (W/T ) , when W is sufficiently large."}, {"id": 152, "string": "That is,PP Mix (W ′ ) also has a quadratic behavior in a log-log graph, i.e.,PP Mix (W ′ ) = O(W ′ ln W ′ )."}, {"id": 153, "string": "Experiments We performed experiments on three real corpora (Reuters, 20news, and Enwiki) and two synthetic corpora (Zipf1 and ZipfMix) to verify the correctness of our theory and to examine the gap between theory and practice."}, {"id": 154, "string": "Reuters and 20news here denote corpora extracted from the Reuters-21578 and 20 Newsgroups data sets, respectively."}, {"id": 155, "string": "Enwiki is a 1/100 corpus of the English Wikipedia."}, {"id": 156, "string": "Zipf1 is a synthetic corpus generated by Zipf's law, whose corpus is the same size as Reuters, and ZipfMix is a mixture of 20 synthetic corpora, sizes are 1/20th of Reuters."}, {"id": 157, "string": "We used ZipfMix only for the experiments on topic models."}, {"id": 158, "string": "Table 1 lists the details of all five corpora."}, {"id": 159, "string": "Fig."}, {"id": 160, "string": "1(a) shows the word frequency of Reuters, 20news, Enwiki, and Zipf1 versus frequency ranking on a log-log graph."}, {"id": 161, "string": "In all corpora, we can regard each curve as linear with a gradient close to 1."}, {"id": 162, "string": "This means that all corpora roughly follow Zipf's law."}, {"id": 163, "string": "Furthermore, since the curve of Zipf1 is similar to that of Reuters, Zipf1 can be regarded as acceptable."}, {"id": 164, "string": "Fig."}, {"id": 165, "string": "1(b) plots the perplexity of unigram models learned from Reuters, 20news, Enwiki, and Zipf1 versus the size of reduced vocabulary on a log-log graph."}, {"id": 166, "string": "Each value is the average over different test sets of five-fold cross validation."}, {"id": 167, "string": "Theory1 is calculated using the formula in Theorem 3."}, {"id": 168, "string": "The graph shows that the curve of Theory1 is nearly identical to that of Zipf1."}, {"id": 169, "string": "Since the vocabulary size W τ of each test set is small in this experiment, some errors appear when W ′ is large, i.e., W τ < W ′ ."}, {"id": 170, "string": "This clearly means that our theory is theoretically correct for an ideal corpus Zipf1."}, {"id": 171, "string": "Comparing Zipf1 with Reuters, however, we find that their perplexities are quite different."}, {"id": 172, "string": "The reason is that the gap between the frequencies of low-ranking (highfrequency) words is considerably large."}, {"id": 173, "string": "For example, the frequency of the 1st-rank word of Reuters is f (w) = 136, 371, while that of Zipf1 is f (w) = 234, 705."}, {"id": 174, "string": "Our theory seems to be suited for inferring the growth rate of perplexity rather than the perplexity value itself."}, {"id": 175, "string": "As for the approximate formulaPP 1 of Theorem 3, we can surely regard the curve of Zipf1 as being roughly quadratic."}, {"id": 176, "string": "The curves of real corpora also have a similar tendency, although their gradients are slightly steeper."}, {"id": 177, "string": "This difference might have been caused by the above-mentioned errors."}, {"id": 178, "string": "However, at least, we can ascertain the important fact that the results for the corpora reduced by 1/100 are not so different from those of the original corpora from the perspective of their perplexity measures."}, {"id": 179, "string": "Fig."}, {"id": 180, "string": "1(c) plots the frequency of k-grams (k ∈ {1, 2, 3}) in Reuters versus frequency ranking on a log-log graph."}, {"id": 181, "string": "TheoryFreq (1-3) are calculated using C k in Lemma 4 and π k in Lemma 5."}, {"id": 182, "string": "A comparison of TheoryFreq and Zipf verifies the correctness of our theory."}, {"id": 183, "string": "However, comparing Zipf and Reuters, we see that C k is poorly estimated when the gram size is large, whereas π k is roughly correct."}, {"id": 184, "string": "This may have happened because we did not put any assumptions on the word se- Test-set Perplexity Reuters Zipf1 Theory1 Reuters2 Zipf2 Theory2 Reuters3 Zipf3 Theory3 (e) Perplexity of k-gram models 10 0 10 1 10 2 10 3 10 4 10 5 10 6 Reduced Vocabulary Size quences in our simple model."}, {"id": 185, "string": "The frequencies of high-order k-grams tend to be lower than in reality."}, {"id": 186, "string": "We might need to place a hierarchical assumption on the a power law, as in done in hierarchical Pitman-Yor processes (Wood et al., 2011) ."}, {"id": 187, "string": "Fig."}, {"id": 188, "string": "1(d) plots the exponent of the power law over k-grams in Reuters versus the gram size on a normal graph."}, {"id": 189, "string": "We estimated each exponent of Reuters by using the least-squares method."}, {"id": 190, "string": "TheoryGrad is calculated using π k in Lemma 5."}, {"id": 191, "string": "Surprisingly, the real exponents of Reuters are almost the same as the theoretical estimate π k based on our \"stupid\" model that does not care about the order of words."}, {"id": 192, "string": "Note that we do not use any information other than the vocabulary size W and the gram size k for estimating π k ."}, {"id": 193, "string": "Fig."}, {"id": 194, "string": "1(e) plots the perplexity of k-gram models (k ∈ {1, 2, 3}) learned from Reuters versus the size of reduced vocabulary on a log-log graph."}, {"id": 195, "string": "Theory2 and Theory3 are calculated using the formula in Corollary 6."}, {"id": 196, "string": "In the case of bigrams, the perplexities of Theory2 are almost the same as that of Zipf2 when the size of reduced vocabulary is large."}, {"id": 197, "string": "However, in the case of trigrams, the perplexities of Theory3 are far from those of Zipf3."}, {"id": 198, "string": "This difference may be due to the sparseness of trigrams in Zipf3."}, {"id": 199, "string": "To verify the correctness of our theory for higher order k-gram models, we need to make assumptions that include backoff and smoothing."}, {"id": 200, "string": "Fig."}, {"id": 201, "string": "1(f) plots the perplexity of LDA models with 20 topics learned from Reuters, 20news, Enwiki, Zipf1, and ZipfMix versus the size of reduced vocabulary on a log-log graph."}, {"id": 202, "string": "We used a collapsed Gibbs sampler with 100 iterations to infer the parameters and set the hyper parameters, α = 0.1 and β = 0.1."}, {"id": 203, "string": "In evaluating the perplexity, we estimated a posterior document-topic distribu- Therefore, we can use TheoryAve as a heuristic function for estimating the perplexity of topic models."}, {"id": 204, "string": "Since we can calculate an inverse of TheoryAve from the bisection or Newton-Raphson method, we can maximize the reduction rate and ensure an acceptable perplexity based on a user-specified deterioration rate."}, {"id": 205, "string": "According to the fact that the three real corpora with different sizes have a similar tendency, it is expected that we can use our theory for a larger corpus."}, {"id": 206, "string": "Finally, let us examine the computational costs for LDA learning."}, {"id": 207, "string": "Table 2 shows computational time and memory size for LDA learning on the original corpus, (1/10)-reduced corpus, and (1/20)-reduced corpus of Reuters."}, {"id": 208, "string": "Comparing the memory used in the learning with the original corpus and with the (1/10)-reduced corpus of Reuters, we find that the learning on the (1/10)reduced corpus used 60% of the memory used by the learning on the original corpus."}, {"id": 209, "string": "While the computational time decreased a little, we believe that reducing the memory size helps to reduce computational time for a larger corpus in the sense that it can relax the constraint for in-memory computing."}, {"id": 210, "string": "Although we did not examine the accuracy of real tasks in this paper, there is an interesting report that the word error rate of language models follows a power law with respect to perplexity (Klakow and Peters, 2002) ."}, {"id": 211, "string": "Thus, we conjecture that the word error rate also has a similar tendency as perplexity with respect to the reduced vocabulary size."}, {"id": 212, "string": "Conclusion We studied the relationship between perplexity and vocabulary size of reduced corpora."}, {"id": 213, "string": "We derived trade-off formulae for the perplexity of kgram models and topic models with respect to the size of reduced vocabulary and showed that each formula approximately has a simple behavior on a log-log graph under certain conditions."}, {"id": 214, "string": "We verified the correctness of our theory on synthetic corpora and examined the gap between theory and practice on real corpora."}, {"id": 215, "string": "We found that the estimation of the perplexity growth rate is reasonable."}, {"id": 216, "string": "This means that we can maximize the reduction rate, thereby ensuring an acceptable perplexity based on a user-specified deterioration rate."}, {"id": 217, "string": "Furthermore, this suggests the possibility that we can theoretically derive empirical parameters, or \"rules of thumb\", for different NLP problems, assuming that a corpus follows Zipf's law."}, {"id": 218, "string": "We believe that our theoretical estimation has the advantages of computational efficiency and scalability especially for very large corpora, although experimental estimations such as cross-validation may be more accurate."}, {"id": 219, "string": "In the future, we want to find out the cause of the gap between theory and practice and extend our theory to bridge the gap, in the same way that we can construct equations of motion with air resistance in the example of the landing point of a ball in Section 1."}, {"id": 220, "string": "For example, promising research directions include using a general law such as the Zipf-Mandelbrot law (Mandelbrot, 1965 ), a sophisticated model that cares the order of words such as hierarchical Pitman-Yor processes (Wood et al., 2011) , and smoothing/backoff methods to handle the sparseness problem."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 19}, {"section": "Preliminaries", "n": "2", "start": 20, "end": 23}, {"section": "Power law and Zipf's law", "n": "2.1", "start": 24, "end": 29}, {"section": "Perplexity", "n": "2.2", "start": 30, "end": 35}, {"section": "Perplexity on Reduced Corpora", "n": "3", "start": 36, "end": 48}, {"section": "Perplexity of Unigram Models", "n": "3.1", "start": 49, "end": 86}, {"section": "Perplexity of k-gram Models", "n": "3.2", "start": 87, "end": 128}, {"section": "Perplexity of Topic Models", "n": "3.3", "start": 129, "end": 152}, {"section": "Experiments", "n": "4", "start": 153, "end": 211}, {"section": "Conclusion", "n": "5", "start": 212, "end": 220}], "figures": [{"filename": "../figure/image/1164-Table2-1.png", "caption": "Table 2: Computational time and memory size for LDA learning on the original corpus, (1/10)- reduced corpus, and (1/20)-reduced corpus of Reuters.", "page": 8, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 121.44, "y2": 177.12}}, {"filename": "../figure/image/1164-Figure1-1.png", "caption": "Figure 1: (a) Word frequency of Reuters, 20news, Enwiki, and Zipf1 versus frequency ranking. (b) Perplexity of unigram models learned from Reuters, 20news, Enwiki, and Zipf1 versus size of reduced vocabulary. Theory1 is calculated using the formula in Theorem 3. (c) Frequency of k-grams (k ∈ {1, 2, 3}) in Reuters and Zipf1 versus frequency ranking. The suffix digit of each label means its gram size. TheoryFreq (1-3) are calculated using Lemma 4 and Lemma 5. (d) Exponent of a power law over k-grams in Reuters versus gram size. TheoryGrad is calculated using πk in Lemma 5. (e) Perplexity of k-gram models learned from Reuters versus size of reduced vocabulary. Theory2 and Theory3 are calculated using the formula in Corollary 6. (f) Perplexity of topic models learned from Reuters, 20news, Enwiki, Zipf1, and ZipfMix versus size of reduced vocabulary. TheoryMix is calculated using the formula in Theorem 7.", "page": 7, "bbox": {"x1": 76.32, "x2": 520.3199999999999, "y1": 62.879999999999995, "y2": 326.88}}, {"filename": "../figure/image/1164-Table1-1.png", "caption": "Table 1: Details of Reuters, 20news, Enwiki, Zipf1, and ZipfMix.", "page": 6, "bbox": {"x1": 72.0, "x2": 299.52, "y1": 95.03999999999999, "y2": 179.04}}]}