{"title": "Evaluating text coherence based on semantic similarity graph", "abstract": "Coherence is a crucial feature of text because it is indispensable for conveying its communication purpose and meaning to its readers. In this paper, we propose an unsupervised text coherence scoring based on graph construction in which edges are established between semantically similar sentences represented by vertices. The sentence similarity is calculated based on the cosine similarity of semantic vectors representing sentences. We provide three graph construction methods establishing an edge from a given vertex to a preceding adjacent vertex, to a single similar vertex, or to multiple similar vertices. We evaluated our methods in the document discrimination task and the insertion task by comparing our proposed methods to the supervised (Entity Grid) and unsupervised (Entity Graph) baselines. In the document discrimination task, our method outperformed the unsupervised baseline but could not do the supervised baseline, while in the insertion task, our method outperformed both baselines.", "text": [{"id": 0, "string": "Introduction Coherence plays an important role in a text because it enables a text to convey its communication purpose and meaning to its readers (Bamberg, 1983; Grosz and Sidner, 1986) ."}, {"id": 1, "string": "Coherence also decreases reading time as a more coherent text is easier to read with less reader's cognitive load (Todirascu et al., 2016) ."}, {"id": 2, "string": "While there is no single agreed definition of coherence, we can compile several definitions of coherence and note its important aspects."}, {"id": 3, "string": "First, a text is coherent if it can convey its communication purpose and meaning to its readers (Wolf and Gibson, 2005; Somasundaran et al., 2014; Feng et al., 2014) ."}, {"id": 4, "string": "Second, a text needs to be integrated as a whole, rather than a series of independent sentences (Bamberg, 1983; Garing, 2014) ."}, {"id": 5, "string": "It means that sentences in the text are centralised around a certain theme or topic, and are arranged in a particular order in terms of logical, spatial, and temporal relations."}, {"id": 6, "string": "Third, every sentence in a coherent text has relation(s) to each other (Halliday and Hasan, 1976; Grosz and Sidner, 1986; Mann and Thompson, 1988; Wolf and Gibson, 2005) ."}, {"id": 7, "string": "It suggests that a text exhibits discourse/rhetorical relation and cohesion."}, {"id": 8, "string": "Fourth, text coherence is greatly influenced by the presence of a certain organisation in the text (Persing et al., 2010; Somasundaran et al., 2014) ."}, {"id": 9, "string": "The organisation helps readers to anticipate the upcoming textual information."}, {"id": 10, "string": "Although a wellorganised text is highly probable to be coherent, only the organisation does not constitute coherence."}, {"id": 11, "string": "Textual organisation concerns the structural formation and logical development of a text, while lexical and semantic continuity is also indispensable for coherent text (Feng et al., 2014) ."}, {"id": 12, "string": "Fifth, it is easier to read a coherent text than its less coherent counterpart (Garing, 2014) ."}, {"id": 13, "string": "Thus when writing a text, it is not enough to only revise the text with careful editing and proofreading from the lexical, or grammatical aspect."}, {"id": 14, "string": "Coherence aspect also should be taken into account in revising the text (Bamberg, 1983; Garing, 2014) ."}, {"id": 15, "string": "There are studies on computational modelling of text coherence based on the supervised learning approach, such as the Entity Grid model (Barzilay and Lapata, 2008) ."}, {"id": 16, "string": "The Entity Grid model has been further extended into the Role Matrix model (Lin et al., 2011; Feng et al., 2014) ."}, {"id": 17, "string": "However, these models have a few drawbacks."}, {"id": 18, "string": "First, department trial Microsoft evidence competitors markets products brands case Netscape software S1 Entity Grid using co-reference resolution has a bias towards the original ordering of text when comparing a text with its permutated counterparts."}, {"id": 19, "string": "The co-reference resolution module is trained on well-formed texts; thus it does not perform very well for ill-organised texts."}, {"id": 20, "string": "The methods utilising a discourse parser for modelling text coherence (Lin et al., 2011; Feng et al., 2014) have the same problem."}, {"id": 21, "string": "Second, the supervised model often suffers from data sparsity, domain dependence, and computational cost for training."}, {"id": 22, "string": "To alleviate these problems in the supervised model, Guinaudeau and Strube (2013) proposed an unsupervised coherence model known as the Entity Graph model."}, {"id": 23, "string": "The Entity Grid, Role Matrix, and Entity Graph model assumed coherence was achieved by local cohesion, i.e."}, {"id": 24, "string": "repeated mentions of the same entities constitute cohesion."}, {"id": 25, "string": "However, they did not capture the contribution of related-yet-notidentical entities (Petersen et al., 2015) ."}, {"id": 26, "string": "To our best knowledge, the closest study addressing this problem was done by Li and Hovy (2014) ."}, {"id": 27, "string": "The key idea of Li and Hovy (2014) is to learn a distributed sentence representation which captures the underlying semantic relations between consecutive sentences."}, {"id": 28, "string": "To tackle these limitations of the past research, we present an unsupervised text coherence model that captures the contribution of related-yet-not-identical entities."}, {"id": 29, "string": "S O S X O − − − − − − S2 − − O − − X S O − − − S3 − − S O − − − − S O O The rest of this paper is organised as follows."}, {"id": 30, "string": "Section 2 describes related work; Section 3 introduces our proposed unsupervised method to measure text coherence from a semantic similarity perspective; Section 4 describes experimental results; then followed by the conclusion in Section 5."}, {"id": 31, "string": "Related work This section provides an overview of existing coherence scoring models, both supervised and unsupervised."}, {"id": 32, "string": "Entity Grid is considered as a supervised baseline in this paper."}, {"id": 33, "string": "On the other hand, Entity Graph is selected as an unsupervised baseline."}, {"id": 34, "string": "Figure 1 : Part of an example text from (Barzilay and Lapata, 2008) Entity Grid The Entity Grid model focused on the evaluation of local cohesion developed on top of the Centering theory (Barzilay and Lapata, 2008) ."}, {"id": 35, "string": "The key idea of the Centering theory is that the distribution of entities in coherent texts exhibits certain regularities (Grosz et al., 1995) ."}, {"id": 36, "string": "The text is said to be less coherent if it exhibits many attention shifts, i.e."}, {"id": 37, "string": "frequent changes in attention (centre) (Grosz et al., 1995) ."}, {"id": 38, "string": "However, if the centre of attention has smooth transitions, it will be more coherent, e.g."}, {"id": 39, "string": "when sentences in a text mentioning the same entity."}, {"id": 40, "string": "Barzilay and Lapata (2008) proposed a computational model by representing text as a matrix called Entity Grid in which the column corresponds to entities, the row corresponds to sentences in the text, and the cell denotes the role of the entity in the sentence."}, {"id": 41, "string": "The role of an entity is defined as one of S(subject), O(object), or X(neither)."}, {"id": 42, "string": "The cell is filled with \"−\" if the entity is not mentioned in the sentence."}, {"id": 43, "string": "If the entity serves multiple roles in the sentence, the priority order would be S, O, and then X."}, {"id": 44, "string": "They consider co-referent noun phrases as an entity."}, {"id": 45, "string": "As an example, the text in Figure 1 is transformed into the Entity Grid as in Table 1 ."}, {"id": 46, "string": "The bracketed words in Figure 1 are recognised as the entities in Table 1 ."}, {"id": 47, "string": "Also, they differentiate salient entities."}, {"id": 48, "string": "An entity is considered salient if it occurs at least t times in the text."}, {"id": 49, "string": "The text is further encoded into a feature vector, denoting the probability of local entity transitions (Barzilay and Lapata, 2008) Lin et al."}, {"id": 50, "string": "(2011) and Feng et al."}, {"id": 51, "string": "(2014) tried to tackle this limitation by filling the cell in the grid with the discourse role of the sentence in which the entity appears."}, {"id": 52, "string": "Entity Graph To tackle the disadvantages of the supervised coherence model, Guinaudeau and Strube (2013) proposed a graph model to measure text coherence."}, {"id": 53, "string": "Graph data structure allows us to relate nonadjacent sentences, spanning globally in the text to reflect global coherence as opposed to the local coherence of the Entity Grid model."}, {"id": 54, "string": "A text is represented as a directed bipartite graph."}, {"id": 55, "string": "The first partition is a sentence partition in which each vertex represents a sentence."}, {"id": 56, "string": "The second partition is a discourse partition in which each vertex represents an entity."}, {"id": 57, "string": "The weighted edge between a sentence vertex and an entity vertex is established if the entity is mentioned in the sentence."}, {"id": 58, "string": "A weight is assigned to each edge based on entity's role in the sentence: 3 for a subject entity, 2 for an object entity, and 1 for others."}, {"id": 59, "string": "Figure 2 shows an example of the bipartite graph transformation from the text in Figure 1 ."}, {"id": 60, "string": "This directed bipartite graph is further transformed into a directed projection graph in which a vertex represents a sentence, and a directed weighted edge is established between vertices if they share same entities."}, {"id": 61, "string": "The direction of the edge corresponds to the surface sequential order of the sentences within the text."}, {"id": 62, "string": "For example, a vertex which represents the second sentence can only have outgoing edges to third, fourth, but not to the first sentence."}, {"id": 63, "string": "There are three projection methods, P U , P W , and P Acc depending on the weighting scheme of edges."}, {"id": 64, "string": "P U assigns a binary weight to S1 S2 S3 1 1 0.5 S1 S2 S3 1 1 1 S1 S2 S3 6 6 5.5 P U P W P Acc Figure 3 : Example of projection graphs each edge: one for the edge connecting two sentences sharing at least one entity in common and zero for others."}, {"id": 65, "string": "P W assigns the number of shared entities between connected sentences to each edge as its weight."}, {"id": 66, "string": "P Acc calculates an edge weight by accumulating the products of the weights of edges sharing an entity in the bipartite graph over the shared entities by the connected two sentences."}, {"id": 67, "string": "The weight of the edge established between sentence s i and s j is calculated by W ij = e∈E ij bw(e, s i ) · bw(e, s j ), (1) where E ij is the set of entities shared by s i and s j and bw(e, s) is a weight of the edge between entity e and sentence s in the bipartite graph."}, {"id": 68, "string": "Furthermore, the edge weight in the projection graph can be normalised with dividing by the distance between the sentences, i.e."}, {"id": 69, "string": "|j − i|."}, {"id": 70, "string": "Figure 3 shows the projection graph transformed from Figure 2 after the normalisation."}, {"id": 71, "string": "To measure text coherence by the projection graph, Guinaudeau and Strube (2013) used the average OutDegree of every vertex in the projection graph."}, {"id": 72, "string": "The OutDegree of a vertex is defined as the summation of the weight of outgoing edges leaving the vertex."}, {"id": 73, "string": "Constructing semantic similarity graphs As mentioned in Section 1, a text is coherent if it can convey its communication purpose to readers, integrated as a whole, cohesive, well organised, and easy to read."}, {"id": 74, "string": "We would like to approach coherence from the cohesion perspective."}, {"id": 75, "string": "We argue that coherence of a text is built by cohesion among its sentences."}, {"id": 76, "string": "We call our method as Semantic Similarity Graph."}, {"id": 77, "string": "Our proposed method employs an unsupervised learning approach."}, {"id": 78, "string": "The unsupervised approach suffers less from data sparsity, domain dependence, and computational cost for training which often arise in the supervised approach."}, {"id": 79, "string": "We encode a text into a graph G(V, E), where V is a set of vertices and E is a set of edges in the graph."}, {"id": 80, "string": "The vertex v i ∈ V represents the i-th sentence s i in the text, and the weighted directed edge e i,j ∈ E represents a semantic relation from the i-th to the j-th sentences."}, {"id": 81, "string": "In what follows, the term \"edge\" refers to the weighted directed edge."}, {"id": 82, "string": "As stated by Halliday and Hasan (1976) , cohesion is a matter of lexicosemantics."}, {"id": 83, "string": "Our method projects a sentence into a vector representation using pre-trained GloVe word vectors 1 by Pennington et al."}, {"id": 84, "string": "(2014) ."}, {"id": 85, "string": "A sentence consists of multiple words {w 1 , w 2 , · · · , w M } where each of them is mapped into a vector space, i.e."}, {"id": 86, "string": "{ w 1 , w 2 , · · · , w M }."}, {"id": 87, "string": "A sentence s can be encoded as a vector s by taking the average of consisting word vectors."}, {"id": 88, "string": "Formally, a sentence vector s is described as s = 1 M M k=1 w k , where M denotes the number of words in the sentence."}, {"id": 89, "string": "We propose three methods for constructing a graph from a text based on semantic similarity between sentence pairs in the text."}, {"id": 90, "string": "Given a certain sentence vertex in the graph, how to decide its counterpart vertices for establishing edges is the crucial point."}, {"id": 91, "string": "The following subsections describe each method to decide a counterpart vertex."}, {"id": 92, "string": "Preceding adjacent vertex (PAV) People read a text from the beginning to the end and understand a particular part of the text based for i ← 2 to N do if sim(si, si−1) > 0 then creates edge ei,i−1 with sim(si, si−1) as the weight else for j ← i − 2 to 1 do if sim(si, sj) > 0 then creates edge ei,j with sim(si, sj) as the weight break Figure 4 : Graph construction algorithm with similarity of PAV on information provided in the preceding part."}, {"id": 93, "string": "When they do not understand a particular part, people look backwards for what they have missed."}, {"id": 94, "string": "We mimic this reading process into graph construction that is reflected in the algorithm in Figure 4, where N is the number of sentences in the text to be processed."}, {"id": 95, "string": "First we define a similarity measure sim(s i , s j ) of a pair of sentences s i and s j as sim(s i , s j ) = α uot(s i , s j ) + (1 − α) cos( s i , s j ), where uot is the number of unique overlapping terms between the sentences s i and s j divided by the number of unique terms in the two sentences; cos( s i , s j ) is a cosine similarity of the sentence vectors; α is a balancing factor ranging over [0, 1] ."}, {"id": 96, "string": "The algorithm constructs a graph by establishing a weighted directed edge from each sentence vertex to the preceding adjacent sentence vertex (PAV) if the sim value between the current and the preceding adjacent vertices exceeds zero; otherwise, the algorithm tries to establish an edge to the next closest preceding vertex with non-zero sim value."}, {"id": 97, "string": "The established edge is assigned the sim value as its weight."}, {"id": 98, "string": "Single similar vertex (SSV) Cohesion between two sentences s i and s j means that we need to know s i in order to understand s j or vice versa (Halliday and Hasan, 1976) ."}, {"id": 99, "string": "In this sense, we interpret cohesion as a semantic dependency among sentences."}, {"id": 100, "string": "We simulate the semantic dependency with the semantic similarity between sentences."}, {"id": 101, "string": "Since the dependency could happen in both direction, we allow edges to the following vertices as well as preceding vertices."}, {"id": 102, "string": "In the previous method, \"precedence\" and \"adjacency\" are the important constraints for establishing the edges in graph construction."}, {"id": 103, "string": "This S1 I S2 S3 PAV SSV MSV Figure 5 : Example of semantic similarity graphs method discards these constraints and establishes edges based on only the semantic similarity between sentences."}, {"id": 104, "string": "However, the edges are still directed and weighted."}, {"id": 105, "string": "Also, only a single outgoing edge is allowed from every vertex in the graph."}, {"id": 106, "string": "We cast semantic dependency task into an information retrieval task."}, {"id": 107, "string": "When establishing an edge from a certain sentence vertex, we search for the most similar sentence in the text."}, {"id": 108, "string": "The similarity measure between two sentences s i and s j is calculated based on the cosine similarity of their semantic vectors."}, {"id": 109, "string": "An edge is established from the sentence vertex in question to the most similar sentence vertex with the weight calculated by weight(e i,j ) = cos( s i , s j ) |i − j| ."}, {"id": 110, "string": "(2) This weight calculation takes into account the distance between two sentences, i.e."}, {"id": 111, "string": "we prefer a closer counterpart."}, {"id": 112, "string": "Multiple similar vertex (MSV) In the previous method, we allowed only a single outgoing edge for every sentence vertex in the graph."}, {"id": 113, "string": "Here we discard the singular condition and allow multiple outgoing edges for every vertex."}, {"id": 114, "string": "Instead of choosing the most similar sentence in the text, we choose multiple sentences that exceed a certain threshold (θ) in terms of cosine similarity with the sentence in question."}, {"id": 115, "string": "Edges are established for all vertex pairs with the edge weight given in Equation (2) ."}, {"id": 116, "string": "Figure 5 shows an example of semantic similarity graphs constructed by three proposed methods for the text shown in Figure 6 ."}, {"id": 117, "string": "The parameters for the PAV and MSV-based methods are the optimal value in the evaluation experiment that is de-scribed in the next section, and the insertion sentence (I) was placed in the correct position (B)."}, {"id": 118, "string": "Text coherence measure From a constructed graph by one of the three methods explained in the preceding subsections, text coherence measure tc is calculated by averaging averaged weight of outgoing edges from every vertex in the graph as tc = 1 N N i=1 1 L i L i k=1 weight(e ik ), where N is the number of sentences in the text and L i is the number of outgoing edges from the vertex v i ."}, {"id": 119, "string": "L i is always one for the PAV and SSV based graph construction, since we allow only a single outgoing edge from every vertex in the graph in these methods."}, {"id": 120, "string": "A larger tc value denotes a more coherent text."}, {"id": 121, "string": "The proposed models have two significant differences from the Entity Graph model, our direct competitor."}, {"id": 122, "string": "First, the Entity Graph model only allows establishing outgoing edges in the following direction, i.e."}, {"id": 123, "string": "from the vertex v i to the vertex v j , where i < j."}, {"id": 124, "string": "On the other hand, the proposed models except for the PAV based graph construction allow edges in both directions."}, {"id": 125, "string": "Second, the Entity Graph model only measures coherence based on shared entities between sentences with respect to their syntactic role."}, {"id": 126, "string": "This is also the case for the Entity Grid model."}, {"id": 127, "string": "The proposed models measure text coherence based on the similarity between semantic vectors of sentences; hence we can take into account related-yet-not-identical entities."}, {"id": 128, "string": "Evaluation and results We evaluate the proposed methods on two experimental tasks: the document discrimination task and insertion task."}, {"id": 129, "string": "All stop words are removed from the texts in this experiment, while lemmatisation is not employed."}, {"id": 130, "string": "The performance of the proposed methods is also compared with our reimplementation of Entity Grid (Barzilay and Lapata, 2008) and Entity Graph (Guinaudeau and Strube, 2013) ."}, {"id": 131, "string": "The experimental settings for each method are described below."}, {"id": 132, "string": "PAV The balancing factor α ranges over [0.0, 0.1, 0.2, · · · , 1.0]."}, {"id": 133, "string": "SSV There is no particular parameter to set."}, {"id": 134, "string": "MSV The cosine similarity threshold θ ranges over [−1.0, 0.1, 0.2, · · · , 0.9]."}, {"id": 135, "string": "Entity Grid The optimal value for transition length three (bigram and trigram) is used."}, {"id": 136, "string": "In document discrimination task, we implement the Entity Grid model with and without saliency."}, {"id": 137, "string": "An entity is judged as salient if it is mentioned in the text at least twice."}, {"id": 138, "string": "Saliency is not employed in the insertion task because the texts in the insertion task are relatively short and an entity is not mentioned many times."}, {"id": 139, "string": "Entity Graph We implemented three projection methods with normalisation: P U , P W , and P Acc ."}, {"id": 140, "string": "Co-reference resolution is not employed to avoid bias as mentioned by Nahnsen (2009) ."}, {"id": 141, "string": "However, we follow the suggestion by Eisner and Charniak (2011) to consider all nouns (including nonhead nouns) as entities in our experiment."}, {"id": 142, "string": "The role of each entity is extracted using the dependency parser in Stanford CoreNLP toolkit ."}, {"id": 143, "string": "4.1 Document discrimination task 4.1.1 Data In the document discrimination task, sentences in a text are randomly permutated to generate another text; the task is to identify the original text given a pair of the original and the randomised one."}, {"id": 144, "string": "The result is considered successful if the original is identified with the strictly higher coherence value."}, {"id": 145, "string": "The performance is measured by accuracy, i.e."}, {"id": 146, "string": "the ratio of successfully identified pairs to all pairs in the test set."}, {"id": 147, "string": "Our data came from a part of the English WSJ text in OntoNotes Release 5.0 (LDC2013T19)."}, {"id": 148, "string": "Half of the data is used for training while another half is used for testing."}, {"id": 149, "string": "For each instance in both training and testing data, at most 20 random permutations were created."}, {"id": 150, "string": "Detail of the data is shown in Table 2 ."}, {"id": 151, "string": "Table 3 shows the result of the document discrimination task of each method with the various experimental settings."}, {"id": 152, "string": "Result and discussion Entity Grid without saliency performed the best (0.845), followed by Entity Grid with saliency (0.837), PAV (0.774, α = 0.4), MSV (0.741, Table 3 : Result of the document discrimination task θ = 0.1), Entity Graph (0.725), then SSV (0.676)."}, {"id": 153, "string": "The performances of PAV and MSV are increasing over changes of parameter until at certain point becomes steadily decreasing."}, {"id": 154, "string": "We performed the McNemar test in R to find out that the difference in accuracy between every pair of methods is statistically significant at p < 0.05."}, {"id": 155, "string": "Contrary to Barzilay and Lapata (2008) , the saliency factor did not work effectively for Entity Grid in our data."}, {"id": 156, "string": "The PAV and MSV based-method performed better than Entity Graph."}, {"id": 157, "string": "This result suggests that coherence is not only the matter of surface overlapping of entities and their syntactic roles, but semantic similarity between sentences also should be taken into account."}, {"id": 158, "string": "This also confirms that Table 4 : Number of the same judgements between two methods in the document discrimination task the semantic relation between adjacent sentences (local coherence) is more important for coherence than semantic relation between long-distance sentences in the document discrimination task."}, {"id": 159, "string": "We also calculated the number of the same judgement between all pairs of methods (questions that are answered correctly and incorrectly by both methods in the pair)."}, {"id": 160, "string": "Table 4 shows the number of the same judgement between every pair of the methods."}, {"id": 161, "string": "We found out the PAV-MSV pair shares the largest number of the same judgement (11,998, 88.3%) ."}, {"id": 162, "string": "The MSV-based method establishes an edge between sentences whenever their similarity exceeds the threshold."}, {"id": 163, "string": "However, it has relatively many same judgements with PAV."}, {"id": 164, "string": "This implies the local coherence is sufficient enough to solve the document discrimination task."}, {"id": 165, "string": "Insertion task Data In the insertion task described in Barzilay and Lapata (2008) , the coherence measure is evaluated based on to what extent the measure can estimate the original sentence position in a text from which one sentence is taken out randomly."}, {"id": 166, "string": "The coherence measure of the text with a taken-out sentence inserted at the original position, i.e."}, {"id": 167, "string": "the original text, is expected to be the highest value among other values of text with the sentence inserted at a wrong position."}, {"id": 168, "string": "We argue, however, adopting the TOEFL R iBT insertion type question is more suitable for this kind of task than using the artificially generated texts by sentence deletion."}, {"id": 169, "string": "The TOEFL R insertion type question aims at measuring test takers' ability to understand the text coherence."}, {"id": 170, "string": "Test takers are given a coherent text with an insert-sentence."}, {"id": 171, "string": "The task is to find the best place to insert the insert-sentence."}, {"id": 172, "string": "To the best of our observation, the texts in the TOEFL R iBT insertion type question are coherent even before the insert-sentence is inserted."}, {"id": 173, "string": "An example of the TOEFL R iBT insertion (A) S1[The raising of livestock is a major economic activity in semiarid lands, where grasses are generally the dominant type of natural vegetation.]"}, {"id": 174, "string": "(B) S2[The consequences of an excessive number of livestock grazing in an area are the reduction of the vegetation cover and trampling and pulverization of the soil.]"}, {"id": 175, "string": "(C) S3[This is usually followed by the drying of the soil and accelerated erosion.]"}, {"id": 176, "string": "(D) Question: Insert the following sentence into one of (A)-(D)."}, {"id": 177, "string": "I[This economic reliance on livestock in certain regions makes large tracts of land susceptible to overgrazing.]"}, {"id": 178, "string": "Figure 6 : Example of the TOEFL R iBT insertion type question (Education Testing Service, 2007) type question is shown in Figure 6 ."}, {"id": 179, "string": "In the following evaluation, a method is judged as a success if it assigns the highest coherence value to the text formed by inserting the insertsentence at the correct insertion position."}, {"id": 180, "string": "We do not allow tie values and judge it as fail even though the correct position has the highest tie value."}, {"id": 181, "string": "We collected 104 insertion type questions from various TOEFL R iBT preparation books."}, {"id": 182, "string": "The average number of sentences in a text is 7.05 (SD: standard deviation=1.85); the average number of tokens in a text is 139.8 (SD=43.7)."}, {"id": 183, "string": "As the data size is relatively small, we adopted the one-heldout cross validation for the Entity Grid model."}, {"id": 184, "string": "The same rank is assigned to incorrect insertion positions when training the Entity Grid model."}, {"id": 185, "string": "We did not adopt the Entity Grid model considering saliency since each text is relatively short in this data thus term frequency (saliency) tends to be low for all terms."}, {"id": 186, "string": "Table 5 shows the result of the insertion task of each method with the various experimental settings."}, {"id": 187, "string": "Our proposed methods showed good performance, particularly the PAV-based graph construction method outperformed both baselines: Entity Grid and Entity Graph."}, {"id": 188, "string": "The PAV method obtained the best performance at α = 0.0, while MSV method performed best at θ = 0.8."}, {"id": 189, "string": "However, the McNemar test revealed that the difference in accuracy between every pair of methods was not statistically significant at p < 0.05."}, {"id": 190, "string": "This is probably due to the limited size of the insertion data compared with the document discrimination task."}, {"id": 191, "string": "Result and discussion There are two questions correctly answered and 31 questions incorrectly answered by all methods."}, {"id": 192, "string": "These two correctly answered questions have Table 5 : Result of the insertion task similar characteristics, having word overlaps and synonyms across adjacent sentences."}, {"id": 193, "string": "These questions also tend to contain more common words."}, {"id": 194, "string": "On the other hand, the failed questions tend to contain more uncommon words, technical terms and named entities."}, {"id": 195, "string": "Although the successful questions also contain named entities, they were mentioned more frequently in the texts as opposed to the failed questions."}, {"id": 196, "string": "Therefore we suspected the limited coverage of our GloVe dictionary and investigated the proportion of the out of vocabulary (OOV) ratio of the texts."}, {"id": 197, "string": "Among all of the questions, there are 32 out of 104 questions including the OOV words; each question contains one to three OOV words in type/in token."}, {"id": 198, "string": "All methods failed in 15 out of these 32 questions but succeeded in the rest 17."}, {"id": 199, "string": "This fact suggests that OOV words are not necessarily the main reason for failures in the insertion task."}, {"id": 200, "string": "Comparing the parameters (α of PAV and θ of MSV) in Table 3 and Table 5 , they are different to achieve the best performance in two different datasets."}, {"id": 201, "string": "In the PAV-based method, there is no significant difference in the average uot value of every pair of adjacent two sentences between the datasets."}, {"id": 202, "string": "We also calculated the cosine similarity of every pair of adjacent two sentences to find more similar adjacent sentences in the insertion task data than in the document discrimination task data; 90% of the adjacent sentence similarities lies in 0.3 ∼ 0.6 in the document discrimination task, while it ranges 0.5 ∼ 0.9 in the insertion task data."}, {"id": 203, "string": "This difference suggests that the uot factor helps relatively more in the document discrimination task for the PAV-based method, while it has less impact in the insertion task."}, {"id": 204, "string": "This explains the difference α values of PAV across the two tasks."}, {"id": 205, "string": "To investigate the difference of the parameter θ in the MSV-based model, we calculated the cosine similarity of every sentence pair in the text."}, {"id": 206, "string": "In both datasets, more than 90% of the sentence similarities lies in 0.5 ∼ 1.0."}, {"id": 207, "string": "When the similarity is transformed into the edge weight by dividing by the sentence distance, the difference becomes apparent; while 86.6% of the edge weights in the document discrimination task lies less than 0.2, the edge weights scatter over 0 ∼ 1.0 in the insertion task."}, {"id": 208, "string": "This happens because the average length of the texts in the document discrimination task is longer than that of the insertion task."}, {"id": 209, "string": "Unless setting a low threshold (θ), the MSV-based model hardly establishes edges between sentence vertices."}, {"id": 210, "string": "In other words, establishing edges between distant sentences would contribute to the performance of these tasks."}, {"id": 211, "string": "Table 6 : Number of the same answers between two methods in the insertion task Table 6 shows the number of the same answers between every pair of the methods."}, {"id": 212, "string": "The SSV-MSV pair shares the most same answers in the insertion task among all pairs (84, 80.8%), followed by the PAV-MSV pair (79, 76.0%), then PAV-SSV pair (75, 72.1%)."}, {"id": 213, "string": "The PAV-based method performs best without considering the overlapping terms between the adjacent sentences (uot) by setting α = 0."}, {"id": 214, "string": "In this case, the PAV-based method is almost similar to the SSV-based method except for allowing only backwards edges."}, {"id": 215, "string": "However, Table 6 shows the PAV-based method answered differently from the SSV-based method in almost 30% questions."}, {"id": 216, "string": "To further investigate the difference, we focused on the questions that were answered incorrectly by the PAV-based method but answered correctly by the SSV-based method."}, {"id": 217, "string": "There are 14 of such questions, in which the SSV-based method tends to establish edges between distant sentences; the average distance between sentence vertices is 2.8 (SD = 0.7)."}, {"id": 218, "string": "This suggests that the SSVbased method could capture distant sentence relations contributing to text coherence more appropriately than the PAV-based method."}, {"id": 219, "string": "We also investigated 11 questions that were answered incorrectly by the PAV-based method but answered correctly by the MSV-based method."}, {"id": 220, "string": "In these questions, the MSV-based method tends to establish more edges than the PAV-based method."}, {"id": 221, "string": "The average number of outgoing edges from a sentence vertex in the graph constructed by the MSVbased method is 2.5 (SD = 1.8)."}, {"id": 222, "string": "In addition, the MSV-based method tends to establish edges between distant sentences as well as the SSV-based method; the average distance between sentence vertices is 2.6 (SD = 0.9)."}, {"id": 223, "string": "This suggests that the MSV-based method also could capture many distant sentence relations contributing to text coherence more appropriately than the PAV-based method."}, {"id": 224, "string": "Although the PAV-based method performs best with the present data, which considers only local cohesion between adjacent sentences, we need to introduce a more refined mechanism for incorporating distant sentence relations than the current SSV and MSV-based methods, as we showed that long-distance relations could contribute in determining text coherence."}, {"id": 225, "string": "The representation of sentences and calculation of similarity between sentences would be direct targets of the refinement."}, {"id": 226, "string": "Conclusion This paper presented three novel unsupervised text coherence scoring methods, in which text coherence is regarded to be realised by cohesion of sentences in the text and the cohesion is represented in a graph structure corresponding to the text."}, {"id": 227, "string": "In the graph structure, a vertex corresponds to a sentence in the text, and an edge represents a semantic relationship between corresponding sentences."}, {"id": 228, "string": "As cohesion is a matter of lexicosemantics, sentences are transformed into semantic vector representa-tions, and their similarity is calculated based on the cosine similarity between the vectors."}, {"id": 229, "string": "Edges between sentence vertices are established based on the similarity and distance between the sentences."}, {"id": 230, "string": "We presented three methods to construct a graph: the PAV, SSV, and MSV-based methods."}, {"id": 231, "string": "We evaluated the proposed methods in the document discrimination task and the insertion task."}, {"id": 232, "string": "Our best performing method (PAV) outperformed the unsupervised baseline (Entity Graph) but not the supervised baseline (Entity Grid) in the document discrimination task."}, {"id": 233, "string": "The difference was statistically significant at p < 0.05."}, {"id": 234, "string": "In the insertion task, our best performing method (PAV) outperformed both supervised and unsupervised baselines, but the difference is not statistically significant at p < 0.05."}, {"id": 235, "string": "We argue that further experiment is necessary with a larger size of data in the insertion task."}, {"id": 236, "string": "Our experimental result showed that our best proposed method (PAV) performed 0.774 in accuracy in the document discrimination task, but only performed 0.356 in the insertion task."}, {"id": 237, "string": "There is a big gap in their performance between two tasks."}, {"id": 238, "string": "The error analysis revealed a possibility to improve the performance by introducing a more refined representation of sentence vectors and calculation in semantic the similarity between sentences for capturing distant relations between sentences."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 30}, {"section": "Related work", "n": "2", "start": 31, "end": 33}, {"section": "Entity Grid", "n": "2.1", "start": 34, "end": 51}, {"section": "Entity Graph", "n": "2.2", "start": 52, "end": 72}, {"section": "Constructing semantic similarity graphs", "n": "3", "start": 73, "end": 91}, {"section": "Preceding adjacent vertex (PAV)", "n": "3.1", "start": 92, "end": 97}, {"section": "Single similar vertex (SSV)", "n": "3.2", "start": 98, "end": 111}, {"section": "Multiple similar vertex (MSV)", "n": "3.3", "start": 112, "end": 117}, {"section": "Text coherence measure", "n": "3.4", "start": 118, "end": 127}, {"section": "Evaluation and results", "n": "4", "start": 128, "end": 151}, {"section": "Result and discussion", "n": "4.1.2", "start": 152, "end": 164}, {"section": "Data", "n": "4.2.1", "start": 165, "end": 190}, {"section": "Result and discussion", "n": "4.2.2", "start": 191, "end": 225}, {"section": "Conclusion", "n": "5", "start": 226, "end": 238}], "figures": [{"filename": "../figure/image/1167-Table2-1.png", "caption": "Table 2: Data for the document discrimination task (The columns “# sent.” and “# token” denote the average number of sentences and tokens in a text respectively.)", "page": 5, "bbox": {"x1": 322.56, "x2": 509.28, "y1": 62.4, "y2": 105.11999999999999}}, {"filename": "../figure/image/1167-Table3-1.png", "caption": "Table 3: Result of the document discrimination task", "page": 5, "bbox": {"x1": 317.76, "x2": 515.04, "y1": 168.48, "y2": 504.96}}, {"filename": "../figure/image/1167-Table1-1.png", "caption": "Table 1: Entity Grid example", "page": 1, "bbox": {"x1": 98.88, "x2": 499.2, "y1": 62.4, "y2": 115.19999999999999}}, {"filename": "../figure/image/1167-Figure1-1.png", "caption": "Figure 1: Part of an example text from (Barzilay and Lapata, 2008)", "page": 1, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 154.56, "y2": 250.07999999999998}}, {"filename": "../figure/image/1167-Table4-1.png", "caption": "Table 4: Number of the same judgements between two methods in the document discrimination task", "page": 6, "bbox": {"x1": 82.56, "x2": 280.32, "y1": 62.4, "y2": 135.35999999999999}}, {"filename": "../figure/image/1167-Figure6-1.png", "caption": "Figure 6: Example of the TOEFL R© iBT insertion type question (Education Testing Service, 2007)", "page": 6, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 62.879999999999995, "y2": 196.32}}, {"filename": "../figure/image/1167-Figure3-1.png", "caption": "Figure 3: Example of projection graphs", "page": 2, "bbox": {"x1": 321.59999999999997, "x2": 513.6, "y1": 186.72, "y2": 298.08}}, {"filename": "../figure/image/1167-Figure2-1.png", "caption": "Figure 2: Example of bipartite graph", "page": 2, "bbox": {"x1": 116.64, "x2": 481.44, "y1": 61.44, "y2": 137.28}}, {"filename": "../figure/image/1167-Table6-1.png", "caption": "Table 6: Number of the same answers between two methods in the insertion task", "page": 7, "bbox": {"x1": 324.96, "x2": 508.32, "y1": 497.76, "y2": 570.24}}, {"filename": "../figure/image/1167-Table5-1.png", "caption": "Table 5: Result of the insertion task", "page": 7, "bbox": {"x1": 82.56, "x2": 280.32, "y1": 62.4, "y2": 389.28}}, {"filename": "../figure/image/1167-Figure4-1.png", "caption": "Figure 4: Graph construction algorithm with similarity of PAV", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 529.4399999999999, "y1": 68.64, "y2": 160.32}}]}