{"title": "MediaMeter: A Global Monitor for Online News Coverage", "abstract": "This paper introduces MediaMeter, an application that works to detect and track emergent topics in the US online news media. What makes MediaMeter unique is its reliance on a labeling algorithm which we call WikiLabel, whose primary goal is to identify what news stories are about by looking up Wikipedia. We discuss some of the major news events that were successfully detected and how it compares to prior work.", "text": [{"id": 0, "string": "Introduction A long term goal of this project is to build a sociologically credible computational platform that enables the user to observe how social agenda evolve and spread across the globe and across the media, as they happen."}, {"id": 1, "string": "To this end, we have built a prototype system we call MediaMeter, which is designed to detect and track trending topics in the online US news media."}, {"id": 2, "string": "One important feature of the system lies in its making use of and building upon a particular approach called WikiLabel (Nomoto, 2011) ."}, {"id": 3, "string": "The idea was to identify topics of a document by mapping it into a conceptual space derived from Wikipedia, which consists of finding a Wikipedia page similar to the document and taking its page title as a possible topic label."}, {"id": 4, "string": "Further, to deal with events not known to Wikipedia, it is equipped with the capability of re-creating a page title so as to make it better fit the content of the document."}, {"id": 5, "string": "In the following, we look at what WikiLabel does and how it works before we discuss MediaMeter."}, {"id": 6, "string": "WikiLabel WikiLabel takes as input a document which one likes to have labeled, and outputs a ranked list of label candidates along with the confidence scores."}, {"id": 7, "string": "The document it takes as input needs to be in the form of a vector space model (VSM)."}, {"id": 8, "string": "Now assume that θ represents a VSM of document d. Let us define l * θ , a likely topic label for d, as follows."}, {"id": 9, "string": "l * θ = arg max l:p[l]∈U Prox(p[l], θ| N ), (1) where p[l] denotes a Wikipedia page with a title l and θ| N a VSM with its elements limited to top N terms in d (as measured by TFIDF)."}, {"id": 10, "string": "Prox (p[l] , θ| N ) is given by: Prox(p[l], θ| N ) = λSr(p[l], θ| N )+(1−λ)Lo(l, θ)."}, {"id": 11, "string": "We let: Sr(r, q) = ( 1 + N ∑ t (q(t) − r(t)) 2 ) −1 and Lo(l, v) = ∑ |l| i I(l[i], v) | l | − 1 where I(w, v) = 1 if w ∈ v and 0 otherwise."}, {"id": 12, "string": "Sr( x, y) represents the distance between x and y, normalized to vary between 0 and 1."}, {"id": 13, "string": "Lo(l, v) measures how many terms l and v have in common, intended to quantify the relevance of l to v. l[i] indicates i-th term in l. Note that Lo works as a penalizing term: if one finds all the terms l has in v, there will be no penalty: if not, there will  be a penalty, the degree of which depends on the number of terms in l that are missing in v. U represents the entire set of pages in Wikipedia whose namespace is 0."}, {"id": 14, "string": "We refer to an approach based on the model in Eqn."}, {"id": 15, "string": "1 as 'WikiLabel.'"}, {"id": 16, "string": "We note that the prior work by Nomoto (2011) which the current approach builds on, is equivalent to the model in Eqn."}, {"id": 17, "string": "1 with λ set to 1."}, {"id": 18, "string": "One important feature of the present version, which is not shared by the previous one, is its ability to go beyond Wikipedia page titles: if it comes across a news story with a topic unknown to Wikipedia, WikiLabel will generalize a relevant page title by removing parts of it that are not warranted by the story, while making sure that its grammar stays intact."}, {"id": 19, "string": "A principal driver of this process is sentence compression, which works to shorten a sentence or phrase, using a trellis created from a corresponding dependency structure (e.g."}, {"id": 20, "string": "Figure 1) ."}, {"id": 21, "string": "Upon receiving possible candidates from sentence compression, WikiLabel turns to the formula in Eqn."}, {"id": 22, "string": "1 and in particular, Lo 1 to determine a compression that best fits the document in question."}, {"id": 23, "string": "3 North-Korean Agenda South-Korea and Japan (the number of stories we covered was 2,230 (US), 2,271 (South-Korea), and 2,815 (Japan))."}, {"id": 24, "string": "Labels in the panels are given as they are generated by WikiLabel, except those for the Japanese media, which are translated from Japanese."}, {"id": 25, "string": "(The horizontal axis in each panel represents the proportion of stories on a given topic.)"}, {"id": 26, "string": "Notice that there are interesting discrepancies among the countries in the way they talk about North Korea: the US tends to see DPRK as a nuclear menace while South Korea focuses on diplomatic and humanitarian issues surrounding North Korea; the Japanese media, on the other hand, depict the country as if it had nothing worth talking about except nuclear issues and its abduction of the Japanese."}, {"id": 27, "string": "Table 2 shows how two human assessors, university graduates, rated on average, the quality of labels generated by WikiLabel for articles discussing North-Korea, on a scale of 1 (poor) to 5 (good), for English and Japanese."}, {"id": 28, "string": "Curiously, a study on news broadcasts in South Korean and Japan (Gwangho, 2006) found that the South Korean media paid more attention to foreign relations and open-door policies of North Korea, while the Japanese media were mostly engrossed with North Korean abductions of Japanese and nuclear issues."}, {"id": 29, "string": "In Figure 2 , which reproduces some of his findings, we recognize a familiar tendency of the Japanese media to play up nuclear issues and dismiss North Korea's external relations, which resonate with things we have found here with WikiLabel."}, {"id": 30, "string": "MediaMeter MediaMeter 2 is a web application that draws on WikiLabel to detect trending topics in the US online news media (which includes CNN, ABC, MSNBC, BBC, Fox, Reuters, Yahoo!"}, {"id": 31, "string": "News, etc)."}, {"id": 32, "string": "It is equipped with a visualization capability based on ThemeRiver (Havre et al., 2002; Byron and Wattenberg, 2008) , enabling a simultaneous tracking of multiple topics over time."}, {"id": 33, "string": "It performs the following routines on a daily basis: (1) collect news stories that appeared during the day; (2) generate topic labels for 600 of them chosen at random; (3) select labels whose score is 1 or above on the burstiness scale (Kleinberg, 2002) ; (4) find for each of the top ranking labels how many stories carry that label; and (5) plot the numbers using the ThemeRiver, together with the associated labels."}, {"id": 34, "string": "Topic labels are placed automatically through integer linear programming (Christensen et al., 1995) ."}, {"id": 35, "string": "Figure 4 gives a ThemeRiver visualization of trending topics for the period from July 10 to 23, 2014."}, {"id": 36, "string": "Figures 5 and 6 show views focusing on particular topics, with the former looking at the World Cup and the latter at Malaysia."}, {"id": 37, "string": "The media's attention to the World Cup mushroomed on July 14th, the day when the final match took place, and fizzled out on the following day."}, {"id": 38, "string": "Meanwhile, in Figure 6 , there is a sudden burst of stories related to Malaysia on July 17th, which coincides with the day when a Malaysian jetliner was shot down over the Ukrainian air space."}, {"id": 39, "string": "While it is hard to tell how accurately MediaMeter reflects the reality, our feeling is that it is doing reasonably well in picking up major trends in the US news media."}, {"id": 40, "string": "Evaluation To find where we stand in comparison to prior work, we have done some experiments, using TDT-PILOT, NYT2013, and Fox News corpora."}, {"id": 41, "string": "TDT-PILOT refers to a corpus containing 15,863 news stories from CNN and Reuters, published between July 1, 1994 and June 30, 1995 ."}, {"id": 42, "string": "The Fox News corpus has the total of 11,014 articles, coming from the online Fox news site, which were published between January, 2015 and April, 2015."}, {"id": 43, "string": "NYT2013 consists of articles we collected from the New York Times online between June and December, 2013, totaling 19,952."}, {"id": 44, "string": "We measured performance in terms of how well machine generated 2 http://www.quantmedia.org/meter/demo.html labels match those by humans, based on the metric known as ROUGE-W (Lin, 2004) ."}, {"id": 45, "string": "3 ROUGE-W gives a score indicating the degree of similarity between two strings in terms of the length of a subsequence shared by both strings."}, {"id": 46, "string": "The score ranges from 0 to 1, with 0 indicating no match and 1 a perfect match."}, {"id": 47, "string": "In the experiment, we ran Text-Rank (TRANK) (Mihalcea and Tarau, 2004 ) -the current state of the art in topic extraction -and different renditions of WikiLabel: RM1 refers to a model in Eqn 1 with λ set to 0.5 and sentence compression turned off; RM1/X is like RM1 except that it makes use of sentence compression; RM0 is a RM1 with λ set to 1, disengaging Lo altogether."}, {"id": 48, "string": "Table 3 gives a summary of what we found."}, {"id": 49, "string": "Numbers in the table denote ROUGE-W scores of relevant systems, averaged over the entire articles in each dataset."}, {"id": 50, "string": "Per-document performance@1 means that we consider labels that ranked the first when measuring performance."}, {"id": 51, "string": "One note about FOX."}, {"id": 52, "string": "FOX has each story labeled with multiple topic descriptors, in contrast to NYT and TDT where we have only one topic label associated with each article."}, {"id": 53, "string": "Since there was no intrinsically correct way of choosing among descriptors that FOX provides, we paired up a label candidate with each descriptor and ran ROUGE-W on each of the pairs, taking the highest score we got as a representative of the overall performance."}, {"id": 54, "string": "Results in Table 3 clearly corroborate the superiority of RM0 through RM1/X over TextRank."}, {"id": 55, "string": "Conclusions In this paper, we looked at a particular approach we call WikiLabel to detecting topics in online news articles, explaining some technical details of how it works, and presented MediaMeter, which showcases WikiLabel in action."}, {"id": 56, "string": "We also demonstrated the empirical effectiveness of the approach through experiments with NYT2013, FOX News and TDT-PILOT."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 5}, {"section": "WikiLabel", "n": "2", "start": 6, "end": 29}, {"section": "MediaMeter", "n": "4", "start": 30, "end": 39}, {"section": "Evaluation", "n": "5", "start": 40, "end": 52}, {"section": "Conclusions", "n": "6", "start": 53, "end": 56}], "figures": [{"filename": "../figure/image/1170-Table1-1.png", "caption": "Table 1: Compressing a Wikipedia title", "page": 1, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 87.84, "y2": 187.2}}, {"filename": "../figure/image/1170-Table2-1.png", "caption": "Table 2: Summary of the quality review by humans. ‘#instances’ refers to the number of labels sent to judges for evaluation.", "page": 1, "bbox": {"x1": 93.6, "x2": 268.32, "y1": 251.51999999999998, "y2": 294.24}}, {"filename": "../figure/image/1170-Figure2-1.png", "caption": "Figure 2: Conflicting media perceptions of NorthKorea (E Gwangho, 2006). ‘News coverage ratio’ indicates the proportion of news articles focusing on a particular topic.", "page": 1, "bbox": {"x1": 319.68, "x2": 489.12, "y1": 69.6, "y2": 191.04}}, {"filename": "../figure/image/1170-Table3-1.png", "caption": "Table 3: Per-document performance@1", "page": 3, "bbox": {"x1": 312.96, "x2": 520.3199999999999, "y1": 87.84, "y2": 144.96}}, {"filename": "../figure/image/1170-Figure1-1.png", "caption": "Figure 1: Trellis for enumerating compressions for “2009 detention of American hikers by Iran”.", "page": 0, "bbox": {"x1": 341.28, "x2": 491.52, "y1": 204.48, "y2": 290.4}}]}