{"title": "Automatic Extraction of Parallel Speech Corpora from Dubbed Movies", "abstract": "This paper presents a methodology to extract parallel speech corpora based on any language pair from dubbed movies, together with an application framework in which some corresponding prosodic parameters are extracted. The obtained parallel corpora are especially suitable for speech-to-speech translation applications when a prosody transfer between source and target languages is desired.", "text": [{"id": 0, "string": "Introduction The availability of large parallel corpora is one of the major challenges in developing translation systems."}, {"id": 1, "string": "Bilingual corpora, which are needed to train statistical translation models, are harder to acquire than monolingual corpora since they presuppose the implication of labour in translation or interpretation."}, {"id": 2, "string": "Working in the speech domain introduces even more difficulties since interpretations are not sufficient to capture the paralinguistic aspects of speech."}, {"id": 3, "string": "Several attempts have been recently made to acquire spoken parallel corpora of considerable size."}, {"id": 4, "string": "However, these corpora either do not reflect the prosodic aspects in the interpreted speech or do not carry the traits of natural speech."}, {"id": 5, "string": "Or they simply do not align well the source and the target language sides."}, {"id": 6, "string": "To account for this deficit, we propose to exploit dubbed movies where expressive speech is readily available in multiple languages and their corresponding aligned scripts are easily accessible through subtitles."}, {"id": 7, "string": "Movies and TV shows have been a good resource for collecting parallel bilingual data because of the availability and open access of subtitles in different languages."}, {"id": 8, "string": "With 1850 bitexts of 65 languages, the OpenSubtitles project (Lison and Tiedemann, 2016) is the largest re-source of translated movie subtitles compiled so far."}, {"id": 9, "string": "The time information in subtitles makes it easy to align sentences of different languages since timing is correlated to the same audio (Itamar and Itai, 2008) ."}, {"id": 10, "string": "In the presence of multiple aligned audio for the same movie, the alignment can be extended to obtain parallel speech corpora."}, {"id": 11, "string": "Popular movies, TV shows and documentaries are released with dubbed audio in many countries."}, {"id": 12, "string": "Dubbing requires the voice acting of the original speech in another language."}, {"id": 13, "string": "Because of this, the dubbed speech carries more or less the same paralinguistic aspects of the original speech."}, {"id": 14, "string": "In what follows, we describe our methodology for the extraction of a speech parallel corpus based on any language pair from dubbed movies."}, {"id": 15, "string": "Unlike Tsiartas et al."}, {"id": 16, "string": "(2011) , who propose a method based on machine learning for automatically extracting bilingual audio-subtitle pairs from movies, we only need raw movie data, and do not require any training."}, {"id": 17, "string": "Moreover, our methodology ensures the fulfilment of the following requirements: (a) it is easily expandable, (b) it supports multiple pairs of languages, (c) it can handle any domain and speech style, and (d) it delivers a parallel spoken language corpus with annotated expressive speech."}, {"id": 18, "string": "\"Expressive speech\" annotation means that the corpus is prosodically rich, which is essential to be able to deal with non-neutral speech emotions, as done in increasingly popular speech-to-speech translation applications that try to cope with prosody transfer between source and target utterances (Agüero et al., 2006; Sridhar et al., 2008; Anumanchipalli et al., 2012) ."}, {"id": 19, "string": "The remainder of the paper is structured as follows."}, {"id": 20, "string": "Section 2 reviews the main multilingual parallel speech corpora available to the research community."}, {"id": 21, "string": "Section 3 presents the methodology used in the current paper, and Section 4 discusses the current state of the obtained parallel corpora so far."}, {"id": 22, "string": "In Section 5, finally, some conclusions are drawn and some aspects of our future work in the context of parallel speech corpora are mentioned."}, {"id": 23, "string": "Available Parallel Speech Corpora As already mentioned above, several attempts have been made to compile large spoken parallel corpora."}, {"id": 24, "string": "Such corpora of considerable size are, e.g., the EPIC corpus (Bendazzoli and Sandrelli, 2005) , the EMIME Bilingual Database (Wester, 2010) , and the Microsoft Speech Language Translation (MSLT) corpus (Federmann and Lewis, 2016) ."}, {"id": 25, "string": "All of them have been manually compiled, and all of them show one or several shortcomings."}, {"id": 26, "string": "The EPIC corpus, which has been compiled from speeches from the European Parliament and their interpretations, falls short in reflecting the prosodic aspects in the interpreted speech."}, {"id": 27, "string": "The EMIME database is a compilation of prompted speeches and does not capture the natural spoken language traits."}, {"id": 28, "string": "The MSLT corpus has been collected in bilingual conversation settings, but there is no one-to-one alignment between sentences in different languages."}, {"id": 29, "string": "A summary of the available bilingual speech corpora is listed in Table 1 ."}, {"id": 30, "string": "Methodology Our multimodal parallel corpus creation consists of three main stages: (1) movie sentence segmentation, (2) prosodic parameter extraction, and (3) parallel sentence alignment."}, {"id": 31, "string": "The first and second stages can be seen as a monolingual data creation, as they take the audio and subtitle pairs as input in one language, and output speech/text/prosodic parameters at the sentence level."}, {"id": 32, "string": "The resulting monolingual data from stages 1 and 2 are fed into stage 3, where corresponding sentences are aligned and reordered to create the corresponding parallel data."}, {"id": 33, "string": "A general overview of the system is presented in Figure 1 ."}, {"id": 34, "string": "Let us discuss each of these stages in turn."}, {"id": 35, "string": "Segmentation of movie audio into sentences This stage involves the extraction of audio and complete sentences from the original audio and the corresponding subtitles of the movie."}, {"id": 36, "string": "For subtitles, the SubRip text file format 1 (SRT) is accepted."}, {"id": 37, "string": "Each subtitle entry contains the following information: (i) start time, (ii) end time, and (iii) text of the speech spoken at that time in the movie."}, {"id": 38, "string": "The subtitle entries do not necessarily correspond to sentences: a subtitle entry may include more than one sentence, and a sentence can spread over many subtitle entries; consider an example portion of a subtitle: The sentence segmentation stage starts with a preprocessing step in which elements that do not correspond to speech are removed."}, {"id": 39, "string": "These include: Speaker name markers (e.g., JAMES: ."}, {"id": 40, "string": "."}, {"id": 41, "string": "."}, {"id": 42, "string": "), text formatting tags, non-verbal information (laughter, horn, etc.)"}, {"id": 43, "string": "and speech dashes."}, {"id": 44, "string": "Audio is initially segmented according to the timestamps in subtitle entries, with extra 0.5 seconds at each end."}, {"id": 45, "string": "Then, each audio segment and its respective subtitle text are sent to the speech aligner software (Vocapia Scribe 2 ) to detect word boundaries."}, {"id": 46, "string": "This pre-segmentation helps to detect the times of the words that end with a sentence-ending punctuation mark ('."}, {"id": 47, "string": "', '?"}, {"id": 48, "string": "', '!"}, {"id": 49, "string": "', ':', '...')."}, {"id": 50, "string": "Average word boundary confidence score of the word alignment is used to determine whether the sentence will be extracted successfully or not."}, {"id": 51, "string": "If the confidence score is above a threshold of 0.5, the initial segment is cut from occurrences of sentence-endings."}, {"id": 52, "string": "In a second pass, cut segments that do not end with a sentenceending punctuation mark are merged with the subsequent segments to form full sentences."}, {"id": 53, "string": "We used Libav 3 library to perform the audio cuts."}, {"id": 54, "string": "Prosodic parameter extraction This stage involves prosodic parameter extraction for each sentence segment detected in stage 1."}, {"id": 55, "string": "The ProsodyPro library (Xu, 2013 ) (a script developed for the Praat software (Boersma and Weenink, 2001) ) is used to extract prosodic features from speech."}, {"id": 56, "string": "As input, ProsodyPro takes the audio of Corpus Languages Speech style EPIC English, Italian, Spanish spontaneous/interpreted MSLT English, French, German constrained conversations EMIME Finnish/English, German/English prompted EMIME Mandarin Mandarin/English prompted MDA (Almeman et al., 2013) Four Arabic dialects prompted Farsi-English (Melvin et al., 2004) Farsi/English read/semi-spontaneous  an utterance and a TextGrid file containing word boundaries and outputs a set of objective measurements suitable for statistical analysis."}, {"id": 57, "string": "We run ProsodyPro for each audio and TextGrid pair of sentences to generate the prosodic analysis files."}, {"id": 58, "string": "See Table 2 for the list of analyses performed by ProsodyPro (Information taken from ProsodyPro webpage 4 )."}, {"id": 59, "string": "The TextGrid file with word boundaries is produced by sending the sentence audio and transcript to the word-aligner software and then converting the alignment information in XML into TextGrid format."}, {"id": 60, "string": "Having word boundaries makes it possible to align continuous prosodic parameters (such as pitch contour) with the words in the sentence."}, {"id": 61, "string": "Parallel sentence alignment This stage involves the creation of the parallel data from two monolingual data obtained from different audio and subtitle pairs of the same movie."}, {"id": 62, "string": "The goal is to find the corresponding sentence s 2 in language 2, given a sentence s 1 in language 1."}, {"id": 63, "string": "For each s 1 with timestamps (s s 1 , e s 1 ), s 2 is searched within a sliding window among sentences that start in the time interval [s s 1 -5, s s 1 + 5]."}, {"id": 64, "string": "Among candidate sentences within the range, the most similar to s 1 is found by first translating s 1 to language 2 and then choosing the {s 1 , s 2 } pair that gives the best translation similarity measure above a certain threshold."}, {"id": 65, "string": "For translation, the Yandex Translate API 5 and for similarity measure the Meteor library (Denkowski and Lavie, 2014) is used."}, {"id": 66, "string": "Obtained Corpus and Discussion We have tested our methodology on three movies, which we retrieved from the University Library: The Man Who Knew Too Much (1956), Slow West (2015) and The Perfect Guy (2015)."}, {"id": 67, "string": "The movies are originally in English, but also have dubbed Spanish audio."}, {"id": 68, "string": "English and Spanish subtitles were ProsodyPro output file Description rawf0 Raw f0 contour in Hz f0 Smoothed f0 with trimming algorithm (Hz) smoothf0 Smoothed f0 with triangular window (Hz) semitonef0 f0 contour in semitones samplef0 f0 values at fixed time intervals (Hz) f0velocity First derivative of f0 means f0, intensity and velocity parameters (mean, max, min) for each word normtimef0 Constant number of f0 values for each word normtimeIntensity Constant number of intensity values for each word Table 2 : Some of the files generated by ProsodyPro."}, {"id": 69, "string": "acquired from the opensubtitles webpage 6 ."}, {"id": 70, "string": "At the time of the submission, we have automatically extracted 2603 sentences in English and 1963 sentences in Spanish summing up to 80 and 49 minutes of audio respectively and annotated with prosodic parameters."}, {"id": 71, "string": "1328 of these sentences were aligned to create our current parallel bilingual corpora."}, {"id": 72, "string": "We are in the process of expanding our dataset."}, {"id": 73, "string": "Due to the copyright on the movies, we are unable to distribute the corpus that we extracted."}, {"id": 74, "string": "However, using our software, it is easy for any researcher to compile a corpus on their own."}, {"id": 75, "string": "For testing purposes, English and Spanish subtitles and audio of a small portion of the movie The Man Who Knew Too Much, as well as the parallel data extracted with this methodology are made available on the github page of the project."}, {"id": 76, "string": "Table 3 lists the number of monolingual and 6 https://www.opensubtitles.org/ parallel sentences obtained from the three movies so far."}, {"id": 77, "string": "We observe that the number of Spanish sentences extracted in stage 2 is sometimes lower than the number of English sentences."}, {"id": 78, "string": "This is mainly because of the translation difference between the Spanish subtitles and the dubbed Spanish audio."}, {"id": 79, "string": "Subtitles in languages other than the original language of the movie do not always correspond with the transcript used in dubbing."}, {"id": 80, "string": "If the audio and the text obtained from the subtitle do not match, the word aligner software performs poorly and that sentence is skipped."}, {"id": 81, "string": "This results in fewer number of extracted sentences in dubbed languages of the movie."}, {"id": 82, "string": "Table 4 shows more in detail the effect of this."}, {"id": 83, "string": "Poor audio-text alignment results in loss of 15.0% of the sentences in original audio, whereas in dubbed audio this loss increases to 49.6%."}, {"id": 84, "string": "Movie Another major effect on detection of sentences is the background noise."}, {"id": 85, "string": "This again interferes with the performance of the word aligner software."}, {"id": 86, "string": "But since samples with less background noise is desired for a speech database, elimination of these samples is not considered as a problem."}, {"id": 87, "string": "Conclusions and Future Work We have presented a methodology for the extraction of multimodal speech, text and prosody parallel corpora from dubbed movies."}, {"id": 88, "string": "Movies contain large samples of conversational speech, which makes the obtained corpus especially useful for speech-to-speech translation applications."}, {"id": 89, "string": "It is also useful for other research fields such as large comparative linguistic and prosodic studies."}, {"id": 90, "string": "As long as we have access to a matching pair of audio and subtitles of movies, the corpora obtained can be extended as a multilingual speech parallel corpora adaptable to any language pair."}, {"id": 91, "string": "Moreover, it is an open-source tool and it can be adapted to any other prosodic feature extraction module in order to obtain a customized prosody parallel corpus for any specific application."}, {"id": 92, "string": "The code to extract multilingual parallel corpora together with a processed sample movie excerpt is open source and available to use 7 under the GNU General Public License 8 ."}, {"id": 93, "string": "As future work, we plan to extend our corpus in size and make the parallel prosodic parameters available online."}, {"id": 94, "string": "We also plan to replace the proprietary word aligner tool we are using with an open source alternative with better precision and speed."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 22}, {"section": "Available Parallel Speech Corpora", "n": "2", "start": 23, "end": 29}, {"section": "Methodology", "n": "3", "start": 30, "end": 34}, {"section": "Segmentation of movie audio into sentences", "n": "3.1", "start": 35, "end": 52}, {"section": "Prosodic parameter extraction", "n": "3.2", "start": 53, "end": 60}, {"section": "Parallel sentence alignment", "n": "3.3", "start": 61, "end": 65}, {"section": "Obtained Corpus and Discussion", "n": "4", "start": 66, "end": 86}, {"section": "Conclusions and Future Work", "n": "5", "start": 87, "end": 94}], "figures": [{"filename": "../figure/image/1171-Table1-1.png", "caption": "Table 1: Some available parallel speech corpora.", "page": 2, "bbox": {"x1": 72.96, "x2": 524.16, "y1": 62.879999999999995, "y2": 159.35999999999999}}, {"filename": "../figure/image/1171-Figure1-1.png", "caption": "Figure 1: Above: Monolingual corpus creation from different audio-subtitle pairs in parallel. Below: Bilingual parallel corpus creation of the example dataset.", "page": 2, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 188.64, "y2": 420.0}}, {"filename": "../figure/image/1171-Table4-1.png", "caption": "Table 4: Sentence extraction statistics in English (original audio) and Spanish (dubbed audio) of the movie The Man Who Knew Too Much.", "page": 3, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 624.48, "y2": 681.12}}, {"filename": "../figure/image/1171-Table2-1.png", "caption": "Table 2: Some of the files generated by ProsodyPro.", "page": 3, "bbox": {"x1": 81.6, "x2": 516.0, "y1": 62.879999999999995, "y2": 200.16}}, {"filename": "../figure/image/1171-Table3-1.png", "caption": "Table 3: Process results for three movies.", "page": 3, "bbox": {"x1": 72.0, "x2": 293.28, "y1": 492.47999999999996, "y2": 589.92}}]}