{"title": "Mimicking Word Embeddings using Subword RNNs", "abstract": "Word embeddings improve generalization over lexical features by placing each word in a lower-dimensional space, using distributional information obtained from unlabeled data. However, the effectiveness of word embeddings for downstream NLP tasks is limited by out-of-vocabulary (OOV) words, for which embeddings do not exist. In this paper, we present MIM-ICK, an approach to generating OOV word embeddings compositionally, by learning a function from spellings to distributional embeddings. Unlike prior work, MIMICK does not require re-training on the original word embedding corpus; instead, learning is performed at the type level. Intrinsic and extrinsic evaluations demonstrate the power of this simple approach. On 23 languages, MIMICK improves performance over a word-based baseline for tagging part-of-speech and morphosyntactic attributes. It is competitive with (and complementary to) a supervised characterbased model in low-resource settings.", "text": [{"id": 0, "string": "Introduction One of the key advantages of word embeddings for natural language processing is that they enable generalization to words that are unseen in labeled training data, by embedding lexical features from large unlabeled datasets into a relatively low-dimensional Euclidean space."}, {"id": 1, "string": "These low-dimensional embeddings are typically trained to capture distributional similarity, so that information can be shared among words that tend to appear in similar contexts."}, {"id": 2, "string": "However, it is not possible to enumerate the entire vocabulary of any language, and even large unlabeled datasets will miss terms that appear in later applications."}, {"id": 3, "string": "The issue of how to handle these out-of-vocabulary (OOV) words poses challenges for embedding-based methods."}, {"id": 4, "string": "These challenges are particularly acute when working with lowresource languages, where even unlabeled data may be difficult to obtain at scale."}, {"id": 5, "string": "A typical solution is to abandon hope, by assigning a single OOV embedding to all terms that do not appear in the unlabeled data."}, {"id": 6, "string": "We approach this challenge from a quasigenerative perspective."}, {"id": 7, "string": "Knowing nothing of a word except for its embedding and its written form, we attempt to learn the former from the latter."}, {"id": 8, "string": "We train a recurrent neural network (RNN) on the character level with the embedding as the target, and use it later to predict vectors for OOV words in any downstream task."}, {"id": 9, "string": "We call this model the MIMICK-RNN, for its ability to read a word's spelling and mimick its distributional embedding."}, {"id": 10, "string": "Through nearest-neighbor analysis, we show that vectors learned via this method capture both word-shape features and lexical features."}, {"id": 11, "string": "As a result, we obtain reasonable near-neighbors for OOV abbreviations, names, novel compounds, and orthographic errors."}, {"id": 12, "string": "Quantitative evaluation on the Stanford RareWord dataset (Luong et al., 2013) provides more evidence that these character-based embeddings capture word similarity for rare and unseen words."}, {"id": 13, "string": "As an extrinsic evaluation, we conduct experiments on joint prediction of part-of-speech tags and morphosyntactic attributes for a diverse set of 23 languages, as provided in the Universal Dependencies dataset (De Marneffe et al., 2014) ."}, {"id": 14, "string": "Our model shows significant improvement across the board against a single UNK-embedding backoff method, and obtains competitive results against a supervised character-embedding model, which is trained end-to-end on the target task."}, {"id": 15, "string": "In low-resource settings, our approach is particularly effective, and is complementary to supervised character embeddings trained from labeled data."}, {"id": 16, "string": "The MIMICK-RNN therefore provides a useful new tool for tagging tasks in settings where there is limited labeled data."}, {"id": 17, "string": "Models and code are available at www.github.com/ yuvalpinter/mimick ."}, {"id": 18, "string": "Related Work Compositional models for embedding rare and unseen words."}, {"id": 19, "string": "Several studies make use of morphological or orthographic information when training word embeddings, enabling the prediction of embeddings for unseen words based on their internal structure."}, {"id": 20, "string": "Botha and Blunsom (2014) compute word embeddings by summing over embeddings of the morphemes; Luong et al."}, {"id": 21, "string": "(2013) construct a recursive neural network over each word's morphological parse; Bhatia et al."}, {"id": 22, "string": "(2016) use morpheme embeddings as a prior distribution over probabilistic word embeddings."}, {"id": 23, "string": "While morphology-based approaches make use of meaningful linguistic substructures, they struggle with names and foreign language words, which include out-of-vocabulary morphemes."}, {"id": 24, "string": "Character-based approaches avoid these problems: for example, Kim et al."}, {"id": 25, "string": "(2016) train a recurrent neural network over words, whose embeddings are constructed by convolution over character embeddings; Wieting et al."}, {"id": 26, "string": "(2016) learn embeddings of character ngrams, and then sum them into word embeddings."}, {"id": 27, "string": "In all of these cases, the model for composing embeddings of subword units into word embeddings is learned by optimizing an objective over a large unlabeled corpus."}, {"id": 28, "string": "In contrast, our approach is a post-processing step that can be applied to any set of word embeddings, regardless of how they were trained."}, {"id": 29, "string": "This is similar to the \"retrofitting\" approach of Faruqui et al."}, {"id": 30, "string": "(2015) , but rather than smoothing embeddings over a graph, we learn a function to build embeddings compositionally."}, {"id": 31, "string": "Supervised subword models."}, {"id": 32, "string": "Another class of methods learn task-specific character-based word embeddings within end-to-end supervised systems."}, {"id": 33, "string": "For example, Santos and Zadrozny (2014) build word embeddings by convolution over char-acters, and then perform part-of-speech (POS) tagging using a local classifier; the tagging objective drives the entire learning process."}, {"id": 34, "string": "Ling et al."}, {"id": 35, "string": "(2015) propose a multi-level long shortterm memory (LSTM; Hochreiter and Schmidhuber, 1997) , in which word embeddings are built compositionally from an LSTM over characters, and then tagging is performed by an LSTM over words."}, {"id": 36, "string": "Plank et al."}, {"id": 37, "string": "(2016) show that concatenating a character-level or bit-level LSTM network to a word representation helps immensely in POS tagging."}, {"id": 38, "string": "Because these methods learn from labeled data, they can cover only as much of the lexicon as appears in their labeled training sets."}, {"id": 39, "string": "As we show, they struggle in several settings: lowresource languages, where labeled training data is scarce; morphologically rich languages, where the number of morphemes is large, or where the mapping from form to meaning is complex; and in Chinese, where the number of characters is orders of magnitude larger than in non-logographic scripts."}, {"id": 40, "string": "Furthermore, supervised subword models can be combined with MIMICK, offering additive improvements."}, {"id": 41, "string": "Morphosyntactic attribute tagging."}, {"id": 42, "string": "We evaluate our method on the task of tagging word tokens for their morphosyntactic attributes, such as gender, number, case, and tense."}, {"id": 43, "string": "The task of morpho-syntactic tagging dates back at least to the mid 1990s (Oflazer and Kuruöz, 1994; Hajič and Hladká, 1998) , and interest has been rejuvenated by the availability of large-scale multilingual morphosyntactic annotations through the Universal Dependencies (UD) corpus (De Marneffe et al., 2014) ."}, {"id": 44, "string": "For example, Faruqui et al."}, {"id": 45, "string": "(2016) propose a graph-based technique for propagating typelevel morphological information across a lexicon, improving token-level morphosyntactic tagging in 11 languages, using an SVM tagger."}, {"id": 46, "string": "In contrast, we apply a neural sequence labeling approach, inspired by the POS tagger of Plank et al."}, {"id": 47, "string": "(2016) ."}, {"id": 48, "string": "MIMICK Word Embeddings We approach the problem of out-of-vocabulary (OOV) embeddings as a generation problem: regardless of how the original embeddings were created, we assume there is a generative wordformbased protocol for creating these embeddings."}, {"id": 49, "string": "By training a model over the existing vocabulary, we can later use that model for predicting the embedding of an unseen word."}, {"id": 50, "string": "Formally: given a language L, a vocabulary V ⊆ L of size V , and a pre-trained embeddings table W ∈ R V ×d where each word {w k } V k=1 is assigned a vector e k of dimension d, our model is trained to find the function f : L → R d such that the projected function f | V approximates the assignments f (w k ) ≈ e k ."}, {"id": 51, "string": "Given such a model, a new word w k * ∈ L \\ V can now be assigned an embedding e k * = f (w k * )."}, {"id": 52, "string": "Our predictive function of choice is a Word Type Character Bi-LSTM."}, {"id": 53, "string": "Given a word with character sequence w = {c i } n 1 , a forward-LSTM and a backward-LSTM are run over the corresponding character embeddings sequence {e (c) i } n 1 ."}, {"id": 54, "string": "Let h n f represent the final hidden vector for the forward-LSTM, and let h 0 b represent the final hidden vector for the backward-LSTM."}, {"id": 55, "string": "The word embedding is computed by a multilayer perceptron: (1) f (w) = O T · g(T h · [h n f ; h 0 b ] + b h ) + b T , where T h , b h and O T , b T are parameters of affine transformations, and g is a nonlinear elementwise function."}, {"id": 56, "string": "The model is presented in Figure 1 ."}, {"id": 57, "string": "The training objective is similar to that of Yin and Schütze (2016) ."}, {"id": 58, "string": "We match the predicted embeddings f (w k ) to the pre-trained word embeddings e w k , by minimizing the squared Euclidean distance, (2) L = f (w k ) − e w k 2 2 ."}, {"id": 59, "string": "By backpropagating from this loss, it is possible to obtain local gradients with respect to the parameters of the LSTMs, the character embeddings, and the output model."}, {"id": 60, "string": "The ultimate output of the training phase is the character embeddings matrix C and the parameters of the neural network: M = {C, F, B, T h , b h , O T , b T }, where F, B are the forward and backward LSTM component parameters, respectively."}, {"id": 61, "string": "MIMICK Polyglot Embeddings The pretrained embeddings we use in our experiments are obtained from Polyglot (Al-Rfou et al., 2013), a multilingual word embedding effort."}, {"id": 62, "string": "Available for dozens of languages, each dataset contains 64-dimension embeddings for the 100,000 most frequent words in a language's training corpus (of variable size), as well as an UNK embedding to be used for OOV words."}, {"id": 63, "string": "Even with this vocabulary size, querying words from respective UD corpora (train + dev + test) yields high OOV rates: in at least half of the 23 languages in our experiments (see Section 5), 29.1% or more of the word types do not appear in the Polyglot vocabulary."}, {"id": 64, "string": "The token-level median rate is 9.2%."}, {"id": 65, "string": "1 Applying our MIMICK algorithm to Polyglot embeddings, we obtain a prediction model for each of the 23 languages."}, {"id": 66, "string": "Based on preliminary testing on randomly selected held-out development sets of 1% from each Polyglot vocabulary (with error calculated as in Equation 2), we set the following hyper-parameters for the remainder of the experiments: character embedding dimension = 20; one LSTM layer with 50 hidden units; 60 training epochs with no dropout; nonlinearity function g = tanh."}, {"id": 67, "string": "2 We initialize character embeddings randomly, and use DyNet to implement the model (Neubig et al., 2017) ."}, {"id": 68, "string": "Nearest-neighbor examination."}, {"id": 69, "string": "As a preliminary sanity check for the validity of our protocol, we examined nearest-neighbor samples in languages for which speakers were available: English, Hebrew, Tamil, and Spanish."}, {"id": 70, "string": "(b) the model shows robustness to typos (e.g., developiong, corssing); (c) part-of-speech is learned across multiple suffixes (pesky -euphoric, ghastly); (d) word compounding is detected (e.g., lawnmower -bookmaker, postman); (e) semantics are not learned well (as is to be expected from the lack of context in training), but there are surprises (e.g., flatfish -slimy, watery)."}, {"id": 71, "string": "word embeddings for all words in the test corpus."}, {"id": 72, "string": "VarEmbed estimates a prior distribution over word embeddings, conditional on the morphological composition."}, {"id": 73, "string": "For in-vocabulary words, a posterior is estimated from unlabeled data; for outof-vocabulary words, the expected embedding can be obtained from the prior alone."}, {"id": 74, "string": "In addition, we compare to FastText (Bojanowski et al., 2016) , a high-vocabulary, high-dimensionality embedding benchmark."}, {"id": 75, "string": "The results, shown in Table 3 , demonstrate that the MIMICK RNN recovers about half of the loss in performance incurred by the original Polyglot training model due to out-of-vocabulary words in the \"All pairs\" condition."}, {"id": 76, "string": "MIMICK also outperforms VarEmbed."}, {"id": 77, "string": "FastText can be considered an upper bound: with a vocabulary that is 25 times larger than the other models, it was missing words from only 44 pairs on this data."}, {"id": 78, "string": "Joint Tagging of Parts-of-Speech and Morphosyntactic Attributes The Universal Dependencies (UD) scheme (De Marneffe et al., 2014) features a minimal set of 17 POS tags (Petrov et al., 2012) and supports tagging further language-specific features using attribute-specific inventories."}, {"id": 79, "string": "For example, a verb in Turkish could be assigned a value for the evidentiality attribute, one which is absent from Danish."}, {"id": 80, "string": "These additional morphosyntactic attributes are marked in the UD dataset as optional per-token attribute-value pairs."}, {"id": 81, "string": "Our approach for tagging morphosyntactic attributes is similar to the part-of-speech tagging model of Ling et al."}, {"id": 82, "string": "(2015) , who attach a projection layer to the output of a sentence-level bidirectional LSTM."}, {"id": 83, "string": "We extend this approach to morphosyntactic tagging by duplicating this projection layer for each attribute type."}, {"id": 84, "string": "The input to our multilayer perceptron (MLP) projection network is the hidden state produced for each token in the sentence by an underlying LSTM, and the output is OOV word Nearest neighbors TTGFM '(s/y) will come true', TPTVR '(s/y) will solve', TBTL '(s/y) will cancel', TSIR '(s/y) will remove' GIAVMTRIIM 'geometric(m-pl)'2 ANTVMIIM 'anatomic(m-pl)', GAVMTRIIM 'geometric(m-pl)'1 BQFTNV 'our request' IVFBIHM 'their(m) residents', XTAIHM 'their(m) sins', IRVFTV 'his inheritance' RIC'RDSVN 'Richardson' AVISTRK 'Eustrach', QMINQA 'Kaminka', GVLDNBRG 'Goldenberg'  attribute-specific probability distributions over the possible values for each attribute on each token in the sequence."}, {"id": 85, "string": "Formally, for a given attribute a with possible values v ∈ V a , the tagging probability for the i'th word in a sentence is given by: Pr(a w i = v) = (Softmax(φ(h i ))) v , (3) with (4) φ(h i ) = O a W · tanh(W a h · h i + b a h ) + b a W , where h i is the i'th hidden state in the underlying LSTM, and φ(h i ) is a two-layer feedforward neural network, with weights W a h and O a W ."}, {"id": 86, "string": "We apply a softmax transformation to the output; the value at position v is then equal to the probability of attribute v applying to token w i ."}, {"id": 87, "string": "The input to the underlying LSTM is a sequence of word embeddings, which are initialized to the Polyglot vectors when possible, and to MIMICK vectors when necessary."}, {"id": 88, "string": "Alternative initializations are considered in the evaluation, as described in Section 5.2."}, {"id": 89, "string": "Each tagged attribute sequence (including POS tags) produces a loss equal to the sum of negative log probabilities of the true tags."}, {"id": 90, "string": "One way to combine these losses is to simply compute the sum loss."}, {"id": 91, "string": "However, many languages have large differences in sparsity across morpho-syntactic attributes, as apparent from Table 4 (rightmost column)."}, {"id": 92, "string": "We therefore also compute a weighted sum loss, in which each attribute is weighted by the proportion of training corpus tokens on which it is assigned a non-NONE value."}, {"id": 93, "string": "Preliminary experiments on development set data were inconclusive across languages and training set sizes, and so we kept the simpler sum loss objective for the remainder of our study."}, {"id": 94, "string": "In all cases, part-of-speech tagging was less accurate when learned jointly with morphosyntactic attributes."}, {"id": 95, "string": "This may be because the attribute loss acts as POS-unrelated \"noise\" affecting the common LSTM layer and the word embeddings."}, {"id": 96, "string": "Experimental Settings The morphological complexity and compositionality of words varies greatly across languages."}, {"id": 97, "string": "While a morphologically-rich agglutinative language such as Hungarian contains words that carry many attributes as fully separable morphemes, a sentence in an analytic language such as Vietnamese may have not a single polymorphemic or inflected word in it."}, {"id": 98, "string": "To see whether this property is influential on our MIMICK model and its performance in the downstream tagging task, we select languages that comprise a sample of multiple morphological patterns."}, {"id": 99, "string": "Language family and script type are other potentially influential factors in an orthography-based approach such as ours, and so we vary along these parameters as well."}, {"id": 100, "string": "We also considered language selection recommendations from de Lhoneux and Nivre (2016) and Schluter and Agić (2017) ."}, {"id": 101, "string": "As stated above, our approach is built on the Polyglot word embeddings."}, {"id": 102, "string": "The intersection of the Polyglot embeddings and the UD dataset (version 1.4) yields 44 languages."}, {"id": 103, "string": "Of these, many are under-annotated for morphosyntactic attributes; we select twenty-three sufficiently-tagged languages, with the exception of Indonesian."}, {"id": 104, "string": "3 Table 4 presents the selected languages and their typological properties."}, {"id": 105, "string": "As an additional proxy for mor- Table 4 : Languages used in tagging evaluation."}, {"id": 106, "string": "Languages on the right are Indo-European."}, {"id": 107, "string": "*In Vietnamese script, whitespace separates syllables rather than words."}, {"id": 108, "string": "phological expressiveness, the rightmost column shows the proportion of UD tokens which are annotated with any morphosyntactic attribute."}, {"id": 109, "string": "Metrics As noted above, we use the UD datasets for testing our MIMICK algorithm on 23 languages 4 with the supplied train/dev/test division."}, {"id": 110, "string": "We measure partof-speech tagging by overall token-level accuracy."}, {"id": 111, "string": "For morphosyntactic attributes, there does not seem to be an agreed-upon metric for reporting performance."}, {"id": 112, "string": "Dzeroski et al."}, {"id": 113, "string": "(2000) report pertag accuracies on a morphosyntactically tagged corpus of Slovene."}, {"id": 114, "string": "Faruqui et al."}, {"id": 115, "string": "(2016) report macro-averages of F1 scores of 11 languages from UD 1.1 for the various attributes (e.g., part-ofspeech, case, gender, tense); recall and precision were calculated for the full set of each attribute's values, pooled together."}, {"id": 116, "string": "5 Agić et al."}, {"id": 117, "string": "(2013) report separately on parts-of-speech and morphosyntactic attribute accuracies in Serbian and Croatian, as well as precision, recall, and F1 scores per tag."}, {"id": 118, "string": "Georgiev et al."}, {"id": 119, "string": "(2012) report token-level accuracy for exact all-attribute tags (e.g."}, {"id": 120, "string": "'Ncmsh' for \"Noun short masculine singular definite\") in Bulgarian, reaching a tagset of size 680."}, {"id": 121, "string": "Müller et al."}, {"id": 122, "string": "(2013) do the same for six other languages."}, {"id": 123, "string": "We report micro F1: each token's value for each attribute is compared separately with the gold labeling, where a correct prediction is a matching non-NONE attribute/value assignment."}, {"id": 124, "string": "Recall and 4 When several datasets are available for a language, we use the unmarked corpus."}, {"id": 125, "string": "5 Details were clarified in personal communication with the authors."}, {"id": 126, "string": "precision are calculated over the entire set, with F1 defined as their harmonic mean."}, {"id": 127, "string": "Models We implement and test the following models: No-Char."}, {"id": 128, "string": "Word embeddings are initialized from Polyglot models, with unseen words assigned the Polyglot-supplied UNK vector."}, {"id": 129, "string": "Following tuning experiments on all languages with cased script, we found it beneficial to first back off to the lowercased form for an OOV word if its embedding exists, and only otherwise assign UNK."}, {"id": 130, "string": "MIMICK."}, {"id": 131, "string": "Word embeddings are initialized from Polyglot, with OOV embeddings inferred from a MIMICK model (Section 3) trained on the Polyglot embeddings."}, {"id": 132, "string": "Unlike the No-Char case, backing off to lowercased embeddings before using the MIMICK output did not yield conclusive benefits and thus we report results for the more straightforward no-backoff implementation."}, {"id": 133, "string": "CHAR→TAG."}, {"id": 134, "string": "Word embeddings are initialized from Polyglot as in the No-Char model (with lowercase backoff), and appended with the output of a character-level LSTM updated during training (Plank et al., 2016) ."}, {"id": 135, "string": "This additional module causes a threefold increase in training time."}, {"id": 136, "string": "Both."}, {"id": 137, "string": "Word embeddings are initialized as in MIMICK, and appended with the CHAR→TAG LSTM."}, {"id": 138, "string": "Other models."}, {"id": 139, "string": "Several non-Polyglot embedding models were examined, all performed substantially worse than Polyglot."}, {"id": 140, "string": "Two of these are notable: a random-initialization baseline, and a model initialized from FastText embeddings (tested on English)."}, {"id": 141, "string": "FastText supplies 300-dimension embeddings for 2.51 million lowercase-only forms, and no UNK vector."}, {"id": 142, "string": "6 Both of these embedding models were attempted with and without CHAR→TAG concatenation."}, {"id": 143, "string": "Another model, initialized from only MIMICK output embeddings, performed well only on the language with smallest Polyglot training corpus (Latvian)."}, {"id": 144, "string": "A Polyglot model where OOVs were initialized using an averaged embedding of all Polyglot vectors, rather than the supplied UNK vector, performed worse than our No-Char baseline on a great majority of the languages."}, {"id": 145, "string": "Last, we do not employ type-based tagset restrictions."}, {"id": 146, "string": "All tag inventories are computed from the training sets and each tag selection is performed over the full set."}, {"id": 147, "string": "Hyperparameters Based on development set experiments, we set the following hyperparameters for all models on all languages: two LSTM layers of hidden size 128, MLP hidden layers of size equal to the number of each attribute's possible values; momentum stochastic gradient descent with 0.01 learning rate; 40 training epochs (80 for 5K settings) with a dropout rate of 0.5."}, {"id": 148, "string": "The CHAR→TAG models use 20-dimension character embeddings and a single hidden layer of size 128."}, {"id": 149, "string": "Results We report performance in both low-resource and full-resource settings."}, {"id": 150, "string": "Low-resource training sets were obtained by randomly sampling training sentences, without replacement, until a predefined token limit was reached."}, {"id": 151, "string": "We report the results on the full sets and on N = 5000 tokens in Table 5 (partof-speech tagging accuracy) and POS and morphosyntactic tagging."}, {"id": 152, "string": "For POS, the largest margins are in the Slavic languages (Russian, Czech, Bulgarian), where word order is relatively free and thus rich word representations are imperative."}, {"id": 153, "string": "Chinese also exhibits impressive improvement across all settings, perhaps due to the large character inventory (> 12,000), for which a model such as MIMICK can learn well-informed embeddings using the large Polyglot vocabulary dataset, overcoming both word-and characterlevel sparsity in the UD corpus."}, {"id": 154, "string": "7 In morphosyntactic tagging, gains are apparent for Slavic languages and Chinese, but also for agglutinative languages -especially Tamil and Turkish -where the stable morpheme representation makes it easy for subword modeling to provide a type-level signal."}, {"id": 155, "string": "8 To examine the effects on Slavic and agglutinative languages in a more fine-grained view, we present results of multiple training-set size experiments for each model, averaged over five repetitions (with different corpus samples), in Figure 2 ."}, {"id": 156, "string": "MIMICK vs. CHAR→TAG."}, {"id": 157, "string": "In several languages, the MIMICK algorithm fares better than the CHAR→TAG model on part-of-speech tagging in low-resource settings."}, {"id": 158, "string": "Table 7 presents the POS tagging improvements that MIMICK achieves over the pre-trained Polyglot models, with and without CHAR→TAG concatenation, with 10,000 tokens of training data."}, {"id": 159, "string": "We obtain statistically significant improvements in most languages, even when CHAR→TAG is included."}, {"id": 160, "string": "These improvements are particularly substantial for test-set tokens outside the UD training set, as shown in the right two columns."}, {"id": 161, "string": "While test set OOVs are a strength of the CHAR→TAG model (Plank et al., 2016) , in many languages there are still considerable improvements to be obtained from the application of MIMICK initialization."}, {"id": 162, "string": "This suggests that with limited training data, the end-to-end CHAR→TAG model is unable to learn a sufficiently accurate representational mapping from orthography."}, {"id": 163, "string": "Conclusion We present a straightforward algorithm to infer OOV word embedding vectors from pre-trained, 7 Character coverage in Chinese Polyglot is surprisingly good: only eight characters from the UD dataset are unseen in Polyglot, across more than 10,000 unseen word types."}, {"id": 164, "string": "8 Persian is officially classified as agglutinative but it is mostly so with respect to derivations."}, {"id": 165, "string": "Its word-level inflections are rare and usually fusional."}, {"id": 166, "string": "limited-vocabulary models, without need to access the originating corpus."}, {"id": 167, "string": "This method is particularly useful for low-resource languages and tasks with little labeled data available, and in fact is task-agnostic."}, {"id": 168, "string": "Our method improves performance over word-based models on annotated sequence-tagging tasks for a large variety of languages across dimensions of family, orthography, and morphology."}, {"id": 169, "string": "In addition, we present a Bi-LSTM approach for tagging morphosyntactic attributes at the token level."}, {"id": 170, "string": "In this paper, the MIM-ICK model was trained using characters as input, but future work may consider the use of other subword units, such as morphemes, phonemes, or even bitmap representations of ideographic characters (Costa-jussà et al., 2017)."}, {"id": 171, "string": "Acknowledgments We thank Umashanthi Pavalanathan, Sandeep Soni, Roi Reichart, and our anonymous reviewers for their valuable input."}, {"id": 172, "string": "We thank Manaal Faruqui and Ryan McDonald for their help in understanding the metrics for morphosyntactic tagging."}, {"id": 173, "string": "The project was supported by project HDTRA1-15-1-0019 from the Defense Threat Reduction Agency."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 17}, {"section": "Related Work", "n": "2", "start": 18, "end": 47}, {"section": "MIMICK Word Embeddings", "n": "3", "start": 48, "end": 60}, {"section": "MIMICK Polyglot Embeddings", "n": "3.1", "start": 61, "end": 77}, {"section": "Joint Tagging of Parts-of-Speech and Morphosyntactic Attributes", "n": "4", "start": 78, "end": 95}, {"section": "Experimental Settings", "n": "5", "start": 96, "end": 108}, {"section": "Metrics", "n": "5.1", "start": 109, "end": 126}, {"section": "Models", "n": "5.2", "start": 127, "end": 146}, {"section": "Hyperparameters", "n": "5.3", "start": 147, "end": 148}, {"section": "Results", "n": "6", "start": 149, "end": 162}, {"section": "Conclusion", "n": "7", "start": 163, "end": 169}, {"section": "Acknowledgments", "n": "8", "start": 170, "end": 173}], "figures": [{"filename": "../figure/image/1217-Table4-1.png", "caption": "Table 4: Languages used in tagging evaluation. Languages on the right are Indo-European. *In Vietnamese script, whitespace separates syllables rather than words.", "page": 5, "bbox": {"x1": 72.0, "x2": 523.1999999999999, "y1": 67.2, "y2": 235.2}}, {"filename": "../figure/image/1217-Figure1-1.png", "caption": "Figure 1: MIMICK model architecture.", "page": 2, "bbox": {"x1": 318.71999999999997, "x2": 511.2, "y1": 62.879999999999995, "y2": 259.2}}, {"filename": "../figure/image/1217-Table6-1.png", "caption": "Table 6: Micro-F1 for morphosyntactic attributes (UD 1.4 Test). Bold (Italic) type indicates significant improvement (degradation) by a bootstrapped Z-test, p < .01, comparing models as in Table 5. Note that the Kazakh (kk) test set has only 78 morphologically tagged tokens.", "page": 7, "bbox": {"x1": 132.96, "x2": 463.2, "y1": 445.44, "y2": 703.1999999999999}}, {"filename": "../figure/image/1217-Table5-1.png", "caption": "Table 5: POS tagging accuracy (UD 1.4 Test). Bold (Italic) indicates significant improvement (degradation) by McNemar’s test, p < .01, comparing MIMICK to “No-Char”, and “Both” to CHAR→TAG. * For reference, we copy the reported results of Plank et al. (2016)’s analog to CHAR→TAG. Note that these were obtained on UD 1.2, and without jointly tagging morphosyntactic attributes.", "page": 7, "bbox": {"x1": 91.67999999999999, "x2": 504.0, "y1": 74.88, "y2": 352.32}}, {"filename": "../figure/image/1217-Table1-1.png", "caption": "Table 1: Nearest-neighbor examples for the English MIMICK model.", "page": 3, "bbox": {"x1": 72.0, "x2": 527.04, "y1": 67.2, "y2": 144.96}}, {"filename": "../figure/image/1217-Table7-1.png", "caption": "Table 7: Absolute gain in POS tagging accuracy from using MIMICK for 10,000-token datasets (all tokens for Tamil and Kazakh). Bold denotes statistical significance (McNemar’s test,p < 0.01).", "page": 8, "bbox": {"x1": 75.84, "x2": 284.15999999999997, "y1": 392.64, "y2": 670.0799999999999}}, {"filename": "../figure/image/1217-Figure2-1.png", "caption": "Figure 2: Results on agglutinative languages (top) and on Slavic languages (bottom). X-axis is number of training tokens, starting at 500. Error bars are the standard deviations over five random training data subsamples.", "page": 8, "bbox": {"x1": 76.8, "x2": 527.04, "y1": 61.44, "y2": 283.2}}, {"filename": "../figure/image/1217-Table2-1.png", "caption": "Table 2: Nearest-neighbor examples for Hebrew (Transcriptions per Sima’an et al. (2001)). ‘s/y’ stands for ‘she/you-m.sg.’; subscripts denote alternative spellings, standard form being ‘X’1.", "page": 4, "bbox": {"x1": 72.0, "x2": 523.1999999999999, "y1": 67.2, "y2": 125.28}}, {"filename": "../figure/image/1217-Table3-1.png", "caption": "Table 3: Similarity results on the RareWord set, measured as Spearman’s ρ× 100. VarEmbed was trained on a 20-million token dataset, Polyglot on a 1.7B-token dataset.", "page": 4, "bbox": {"x1": 72.0, "x2": 288.0, "y1": 178.56, "y2": 281.28}}]}