{"title": "Annotation, Modelling and Analysis of Fine-Grained Emotions on a Stance and Sentiment Detection Corpus", "abstract": "There is a rich variety of data sets for sentiment analysis (viz., polarity and subjectivity classification). For the more challenging task of detecting discrete emotions following the definitions of Ekman and Plutchik, however, there are much fewer data sets, and notably no resources for the social media domain. This paper contributes to closing this gap by extending the SemEval 2016 stance and sentiment dataset with emotion annotation. We (a) analyse annotation reliability and annotation merging; (b) investigate the relation between emotion annotation and the other annotation layers (stance, sentiment); (c) report modelling results as a baseline for future work.", "text": [{"id": 0, "string": "Introduction Emotion recognition is a research area in natural language processing concerned with associating words, phrases or documents with predefined emotions from psychological models."}, {"id": 1, "string": "Discrete emotion recognition assigns categorial emotions (Ekman, 1999; Plutchik, 2001) , namely Anger, Anticipation, Disgust, Fear, Joy, Sadness, Surprise und Trust."}, {"id": 2, "string": "Compared to the very active area of sentiment analysis, whose goal is to recognize the polarity of text (e. g., positive, negative, neutral, mixed), few resources are available for discrete emotion analysis."}, {"id": 3, "string": "Emotion analysis has been applied to several domains, including tales (Alm et al., 2005) , blogs (Aman and Szpakowicz, 2007) and microblogs (Dodds et al., 2011) ."}, {"id": 4, "string": "The latter in particular provides a major data source in the form of user messages from platforms such as Twitter (Costa et al., * We thank Marcus Hepting, Chris Krauter, Jonas Vogelsang, Gisela Kollotzek for annotation and discussion."}, {"id": 5, "string": "2014) which contain semi-structured information (hashtags, emoticons, emojis) that can be used as weak supervision for training classifiers (Suttles and Ide, 2013) ."}, {"id": 6, "string": "The classifier then learns the association of all other words in the message with the \"self-labeled\" emotion (Wang et al., 2012) ."}, {"id": 7, "string": "While this approach provides a practically feasible approximation of emotions, there is no publicly available, manually vetted data set for Twitter emotions that would support accurate and comparable evaluations."}, {"id": 8, "string": "In addition, it has been shown that distant annotation is conceptually different from manual annotation for sentiment and emotion (Purver and Battersby, 2012) ."}, {"id": 9, "string": "With this paper, we contribute manual emotion annotation for a publicly available Twitter data set."}, {"id": 10, "string": "We annotate the SemEval 2016 Stance Data set (Mohammad et al., 2016) which provides sentiment and stance information and is popular in the research community (Augenstein et al., 2016; Wei et al., 2016; Dias and Becker, 2016; Ebrahimi et al., 2016) ."}, {"id": 11, "string": "It therefore enables further research on the relations between sentiment, emotions, and stances."}, {"id": 12, "string": "For instance, if the distribution of subclasses of positive or negative emotions is different for against and in-favor, emotion-based features could contribute to stance detection."}, {"id": 13, "string": "An additional feature of our resource is that we do not only provide a \"majority annotation\" as is usual."}, {"id": 14, "string": "We do define a well-performing aggregated annotation, but additionally provide the individual labels of each of our six annotators."}, {"id": 15, "string": "This enables further research on differences in the perception of emotions."}, {"id": 16, "string": "Background and Related Work For a review of the fundaments of emotion and sentiment and the differences between these concepts, we refer the reader to Munezero et al."}, {"id": 17, "string": "(2014) ."}, {"id": 18, "string": "For sentiment analysis, a large number of annotated data sets exists."}, {"id": 19, "string": "These include review texts from different domains, for instance from Amazon and other shopping sites (Hu and Liu, 2004; Ding et al., 2008; Toprak et al., 2010; Lakkaraju et al., 2011) , restaurants (Ganu et al., 2009) , news articles (Wiebe et al., 2005) , blogs (Kessler et al., 2010) , as well as microposts on Twitter."}, {"id": 20, "string": "For the latter, shown in the upper half of Table 1 , there are general corpora (Nakov et al., 2013; Spina et al., 2012; Thelwall et al., 2012) as well as ones focused on very specific subdomains, for instance on Obama-McCain Debates (Shamma et al., 2009) , Health Care Reforms (Speriosu et al., 2011) ."}, {"id": 21, "string": "A popular example for a manually annotated corpus for sentiment, which includes stance annotation for a set of topics is the SemEval 2016 data set (Mohammad et al., 2016) ."}, {"id": 22, "string": "For emotion analysis, the set of annotated resources is smaller (compare the lower half of Table 1)."}, {"id": 23, "string": "A very early resource is the ISEAR data set (Scherer and Wallbott, 1997) A notable gap is the unavailability of a publicly available set of microposts (e. g., tweets) with emotion labels."}, {"id": 24, "string": "To the best of our knowledge, there are only three previous approaches to labeling tweets with discrete emotion labels."}, {"id": 25, "string": "One is the recent data set on for emotion intensity estimation, a shared task aiming at the development of a regression model."}, {"id": 26, "string": "The goal is not to predict the emotion class, but a distribution over their intensities, and the set of emotions is limited to fear, sadness, anger, and joy (Mohammad and Bravo-Marquez, 2017) ."}, {"id": 27, "string": "Most similar to our work is a study by Roberts et al."}, {"id": 28, "string": "(2012) which annotated 7,000 tweets manually for 7 emotions (anger, disgust, fear, joy, love, sadness and surprise)."}, {"id": 29, "string": "They chose 14 topics which they believe should elicit emotional tweets and collect hashtags to help identify tweets that are on these topics."}, {"id": 30, "string": "After several iterations, the annotators reached κ = 0.67 inter-annotator agreement on 500 tweets."}, {"id": 31, "string": "Unfortunately, the data appear not to be available any more."}, {"id": 32, "string": "An additional limitation of that dataset was that 5,000 of the 7,000 tweets were annotated by one annotator only."}, {"id": 33, "string": "In contrast, we provide several annotations for each tweet."}, {"id": 34, "string": "Mohammad et al."}, {"id": 35, "string": "(2015) annotated electoral tweets for sentiment, intensity, semantic roles, style, purpose and emotions."}, {"id": 36, "string": "This is the only available corpus similar to our work we are aware of."}, {"id": 37, "string": "However, the focus of this work was not emotion annotation in contrast to ours."}, {"id": 38, "string": "In addition, we publish the data of all annotators."}, {"id": 39, "string": "Corpus Annotation and Analysis Annotation Procedure As motivated above, we re-annotate the extended SemEval 2016 Stance Data set (Mohammad et al., 2016) which consists of 4,870 tweets (a subset of which was used in the SemEval competition)."}, {"id": 40, "string": "For a discussion of the differences of these data sets, we refer to ."}, {"id": 41, "string": "We omit two tweets with special characters, which leads to an overall set of 4,868 tweets used in our corpus."}, {"id": 42, "string": "1 We frame annotation as a multi-label classification task at the tweet level."}, {"id": 43, "string": "The tweets were annotated by a group of six independent annotators, with a minimum number of three annotations for each tweet (696 tweets were labeled by 6 annotators, 703 by 5 annotators, 2,776 by 4 annotators and 693 by 3 annotators)."}, {"id": 44, "string": "All annotators were undergraduate students of media computer science and between the age of 20 and 30."}, {"id": 45, "string": "Only one annotator is female."}, {"id": 46, "string": "All students are German native speak-1 Our annotations and original tweets are available at http://www.ims.uni-stuttgart.de/data/ ssec and http://alt.qcri.org/semeval2016/ task6/data/uploads/stancedataset.zip, see also http://alt.qcri.org/semeval2016/task6."}, {"id": 47, "string": "To train the annotators on the task, we performed two training iterations based on 50 randomly selected tweets from the SemEval 2016 Task 4 corpus (Nakov et al., 2016) ."}, {"id": 48, "string": "After each iteration, we discussed annotation differences (informally) in face-to-face meetings."}, {"id": 49, "string": "For the final annotation, tweets were presented to the annotators in a web interface which paired a tweet with a set of binary check boxes, one for each emotion."}, {"id": 50, "string": "Taggers could annotate any set of emotions."}, {"id": 51, "string": "Each annotator was assigned with 5/7 of the corpus with equally-sized overlap of instances based on an offset shift."}, {"id": 52, "string": "Not all annotators finished their task."}, {"id": 53, "string": "2 Emotion Annotation Reliability and Aggregated Annotation Our annotation represents a middle ground between traditional linguistic \"expert\" annotation and crowdsourcing: We assume that intuitions about emotions diverge more than for linguistic structures."}, {"id": 54, "string": "At the same time, we feel that there is information in the individual annotations beyond the simple \"majority vote\" computed by most crowdsourcing studies."}, {"id": 55, "string": "In this section, we analyse the annotations intrinsically; a modelling-based evaluation follows in Section 5."}, {"id": 56, "string": "Our first analysis, shown in Table 2 , compares annotation strata with different agreement."}, {"id": 57, "string": "For example, the column labeled 0.0 lists the frequencies of emotion labels assigned by at least one annotator, a high recall annotation."}, {"id": 58, "string": "In contrast, the column labeled 0.99 lists frequencies for emotion labels that all annotators agreed on."}, {"id": 59, "string": "This represents a high  These numbers confirm that emotion labeling is a somewhat subjective task: only a small subset of the emotions labeled by at least one annotator (t=0.0) is labeled by most (t=0.66) or all of them (t=0.99)."}, {"id": 60, "string": "Interestingly, the exact percentage varies substantially by emotion, between 2 % for sadness and 20 % for anger."}, {"id": 61, "string": "Many of these disagreements stem from tweets that are genuinely difficult to categorize emotionally, like That moment when Canadians realised global warming doesn't equal a tropical vacation for which one annotator chose anger and sadness, while one annotator chose surprise."}, {"id": 62, "string": "Arguably, both annotations capture aspects of the meaning."}, {"id": 63, "string": "Similarly, the tweet 2 pretty sisters are dancing with cancered kid (a reference to an online video) is marked as fear and sadness by one annotator and with joy and sadness by another."}, {"id": 64, "string": "Naturally, not all differences arise from justified annotations."}, {"id": 65, "string": "For instance the tweet #BIBLE = Big Irrelevant Book of Lies and Exaggerations has been labeled by two annotators with the emotion trust, presumably because of the word bible."}, {"id": 66, "string": "This appears to be a classical oversight error, where the tweet is labeled on the basis of the first spotted keyword, without substantially studying its content."}, {"id": 67, "string": "To quantify these observations, we follow general practice and compute a chance-corrected measure of inter-annotator agreement."}, {"id": 68, "string": "Table 3 shows the minimum and maximum Cohen's κ values for pairs of annotators, computed on the intersection of instances annotated by either annotator within each pair."}, {"id": 69, "string": "We obtain relatively high κ values of anger, joy, and trust, but lower values for the other emotions."}, {"id": 70, "string": "These small κ values could be interpreted as indicators of problems with reliability."}, {"id": 71, "string": "However, κ is notoriously difficult to interpret, and a number of studies have pointed out the influence of marginal frequencies (Cicchetti and Feinstein, 1990) : In the presence of skewed marginals (and most of our emotion labels are quite rare, cf."}, {"id": 72, "string": "To avoid these methodological problems, we assess the usefulness of our annotation extrinsically by comparing the performance of computational models for different values of t. In a nutshell, these experiments will show best results t=0.0, i. e., the Table 5 : Tweet Counts (above diagonal) and odds ratio (below diagonal) for cooccurring annotations for all classes in the corpus (emotions based on majority annotation, t=0.5)."}, {"id": 73, "string": "high-recall annotation (see Section 5 for details)."}, {"id": 74, "string": "We therefore define t=0.0 as our aggregated annotation."}, {"id": 75, "string": "For comparison, we also consider t=0.5, which corresponds to the majority annotation as generally adopted in crowdsourcing studies."}, {"id": 76, "string": "Distribution of Emotions As shown in Table 2 , nearly 60 % of the overall tweet set are annotated with anger by at least one annotator."}, {"id": 77, "string": "This is the predominant emotion class, followed by anticipation and sadness."}, {"id": 78, "string": "This distribution is comparably uncommon and originates from the selection of tweets in SemEval as a stance data set."}, {"id": 79, "string": "However, while anger clearly dominates in the aggregated annotation, its predominance weakens for the more precision-oriented data sets."}, {"id": 80, "string": "For t=0.99, joy becomes the second most frequent emotion."}, {"id": 81, "string": "In uniform samples from Twitter, joy typically dominates the distribution of emotions (Klinger, 2017) ."}, {"id": 82, "string": "It remains a question for future work how to reconciliate these observations."}, {"id": 83, "string": "Table 4 shows the number of cooccurring label pairs (above the diagonal) and the odds ratios (below the diagonal) for emotion, stance, and sentiment annotations on the whole corpus for our aggregated annotation (t=0.0)."}, {"id": 84, "string": "Odds ratio is Emotion vs. other Annotation Layers R(A:B) = P (A)(1 − P (B)) P (B)(1 − P (A)) , where P (A) is the probability that both labels (at row and column in the table) hold for a tweet and P (B) is the probability that only one holds."}, {"id": 85, "string": "A ratio of x means that the joint labeling is x times more likely than the independent labeling."}, {"id": 86, "string": "Table 5 shows the same numbers for the majority annotation, t=0.5."}, {"id": 87, "string": "We first analyze the relationship between emotions and sentiment polarity in Table 4 ."}, {"id": 88, "string": "For many emotions, the polarity is as expected: Joy and trust occur predominantly with positive sentiment, and anger, disgust, fear and sadness with negative sentiment."}, {"id": 89, "string": "The emotions anticipation and surprise are, in comparison, most balanced between polarities, however with a majority for positive sentiment in anticipation and a negative sentiment for surprise."}, {"id": 90, "string": "For most emotions there is also a non-negligible number of tweets with the sentiment opposite to a common expectation."}, {"id": 91, "string": "For example, anger occurs 28 times with positive sentiment, mainly tweets which call for (positive) change regarding a controversial topic, for instance Lets take back our country!"}, {"id": 92, "string": "Whos with me?"}, {"id": 93, "string": "No more Democrats!2016 Why criticise religions?"}, {"id": 94, "string": "If a path is not your own."}, {"id": 95, "string": "Don't be pretentious."}, {"id": 96, "string": "And get down from your throne."}, {"id": 97, "string": "Conversely, more than 15 % of the joy tweets carry negative sentiment."}, {"id": 98, "string": "These are often cases in which either the emotion annotator or the sentiment annotator assumed some non-literal meaning to be associated with the text (mainly irony), for instance Global Warming!"}, {"id": 99, "string": "Global Warming!"}, {"id": 100, "string": "Global Warming!"}, {"id": 101, "string": "Oh wait, it's summer."}, {"id": 102, "string": "I love the smell of Hillary in the morning."}, {"id": 103, "string": "It smells like Republican Victory."}, {"id": 104, "string": "Disgust occurs almost exclusively with negative sentiment."}, {"id": 105, "string": "For the majority annotation (Table 5) , the number of annotations is smaller."}, {"id": 106, "string": "However, the average size of the odds ratios increase (from 1.96 for t=0.0 to 5.39 for t=0.5)."}, {"id": 107, "string": "A drastic example is disgust in combination with negative sentiment, the predominant combination."}, {"id": 108, "string": "Disgust is only labeled once with positive sentiment in the t=0.5 annotation: #WeNeedFeminism because #NoMeansNo it doesnt mean yes, it doesnt mean try harder!"}, {"id": 109, "string": "Similarly, the odds ratio for the combination anger and negative sentiment nearly doubles from 20.3 for t=0.0 to 41.47 for t=0.5."}, {"id": 110, "string": "These numbers are an effect of the majority annotation having a higher precision in contrast to more \"noisy\" aggregation of all annotations (t=0.0)."}, {"id": 111, "string": "Regarding the relationship between emotions and stance, most odds ratios are relatively close to 1, indicating the absence of very strong correlations."}, {"id": 112, "string": "Nevertheless, the \"Against\" stance is associated with a number of negative emotions (anger, disgust, sadness, the \"In Favor\" stance with joy, trust, and anticipation, and \"None\" with an absence of all emotions except surprise."}, {"id": 113, "string": "Models We apply six standard models to provide baseline results for our corpus: Maximum Entropy (MAXENT), Support Vector Machines (SVM), a Long-Short Term Memory Network (LSTM), a Bidirectional LSTM (BI-LSTM), and a Convolutional Neural Network (CNN)."}, {"id": 114, "string": "MaxEnt and SVM classify each tweet separately based on a bag-of-words."}, {"id": 115, "string": "For the first, the linear separator is estimated based on log-likelihood optimization with an L2 prior."}, {"id": 116, "string": "For the second, the optimization follows a max-margin strategy."}, {"id": 117, "string": "LSTM (Hochreiter and Schmidhuber, 1997 ) is a recurrent neural network architecture which includes a memory state capable of learning long distance dependencies."}, {"id": 118, "string": "In various forms, they have proven useful for text classification tasks (Tai et al., 2015; Tang et al., 2016) ."}, {"id": 119, "string": "We implement a standard LSTM which has an embedding layer that maps the input (padded when needed) to a 300 dimensional vector."}, {"id": 120, "string": "These vectors then pass to a 175 dimensional LSTM layer."}, {"id": 121, "string": "We feed the final hidden state to a fully-connected 50-dimensional dense layer and use sigmoid to gate our 8 output neurons."}, {"id": 122, "string": "As a regularizer, we use a dropout (Srivastava et al., 2014) of 0.5 before the LSTM layer."}, {"id": 123, "string": "Bi-LSTM has the same architecture as the normal LSTM, but includes an additional layer with a reverse direction."}, {"id": 124, "string": "This approach has produced stateof-the-art results for POS-tagging (Plank et al., 2016) , dependency parsing (Kiperwasser and Goldberg, 2016 ) and text classification (Zhou et al., 2016) , among others."}, {"id": 125, "string": "We use the same parameters as the LSTM, but concatenate the two hidden layers before passing them to the dense layer."}, {"id": 126, "string": "CNN has proven remarkably effective for text classification (Kim, 2014; dos Santos and Gatti, 2014; Flekova and Gurevych, 2016) ."}, {"id": 127, "string": "We train a simple one-layer CNN with one convolutional layer on top of pre-trained word embeddings, following Kim (2014) ."}, {"id": 128, "string": "The first layer is an embeddings layer that maps the input of length n (padded when needed) to an n x 300 dimensional matrix."}, {"id": 129, "string": "The embedding matrix is then convoluted with filter sizes of 2, 3, and 4, followed by a pooling layer of length 2."}, {"id": 130, "string": "This is then fed to a fully connected dense layer with ReLu activations and finally to the 8 output neurons, which are gated with the sigmoid function."}, {"id": 131, "string": "We again use dropout (0.5), this time before and after the convolutional layers."}, {"id": 132, "string": "For all neural models, we initialize our word representations with the skip-gram algorithm with negative sampling (Mikolov et al., 2013) , trained on nearly 8 million tokens taken from tweets collected using various hashtags."}, {"id": 133, "string": "We create 300-dimensional vectors with window size 5, 15 negative samples and run 5 iterations."}, {"id": 134, "string": "For OOV words, we use a vector initialized randomly between -0.25 and 0.25 to approximate the variance of the pretrained vectors."}, {"id": 135, "string": "We train our models using ADAM (Kingma and Ba, 2015) and a minibatch size of 32."}, {"id": 136, "string": "We set 10 % of Table 6 : Results of linear and neural models for labels from the aggregated annotation (t=0.0)."}, {"id": 137, "string": "For the neural models, we report the average of five runs and standard deviation in brackets."}, {"id": 138, "string": "Best F 1 for each emotion shown in boldface."}, {"id": 139, "string": "the training data aside to tune the hyperparameters for each model (hidden dimension size, dropout rate, and number of training epochs)."}, {"id": 140, "string": "Table 6 shows the results for our canonical annotation aggregation with t=0.0 (aggregated annotation) for our models."}, {"id": 141, "string": "The two linear classifiers (trained as MAXENT and SVM) show comparable results, with an overall micro-average F 1 of 58 %."}, {"id": 142, "string": "All neural network approaches show a higher performance of at least 2 percentage points (3 pp for LSTM, 4 pp for BI-LSTM, 2 pp for CNN)."}, {"id": 143, "string": "BI-LSTM also obtains the best F-Score for 5 of the 8 emotions (4 out of 8 for LSTM and CNN)."}, {"id": 144, "string": "We conclude that the BI-LSTM shows the best results of all our models."}, {"id": 145, "string": "Our discussion focuses on this model."}, {"id": 146, "string": "The performance clearly differs between emotion classes."}, {"id": 147, "string": "Recall from Section 3.2 that anger, joy and trust showed much higher agreement numbers than the other annotations."}, {"id": 148, "string": "There is however just a mild correlation between reliability and modeling performance."}, {"id": 149, "string": "Anger is indeed modelled very well: it shows the best prediction performance with a similar precision and recall on all models."}, {"id": 150, "string": "We ascribe this to it being the most frequent emotion class."}, {"id": 151, "string": "In contrast, joy and trust show only middling performance, while we see relatively good results for anticipation and sadness even though there was considerable disagreement between annotators."}, {"id": 152, "string": "We find the overall worst results for surprise."}, {"id": 153, "string": "This is not surprising, surprise being a scarce label with also very low agreement."}, {"id": 154, "string": "This might point towards underlying problems in the definition of surprise as an emotion."}, {"id": 155, "string": "Some authors have split this class into positive and negative surprise in an attempt to avoid this (Alm et al., 2005) ."}, {"id": 156, "string": "Results We finally come to our justification for choosing t=0.0 as our aggregated annotation."}, {"id": 157, "string": "Table 7 shows results for the best model (BI-LSTM) on the datasets for different thresholds."}, {"id": 158, "string": "We see a clear downward monotone trend: The higher the threshold, the lower the F 1 measures."}, {"id": 159, "string": "We obtain the best results, both for individual emotions and at the average level, for t=0.0."}, {"id": 160, "string": "This is at least partially counterintuitive -we would have expected a dataset with \"more consensual\" annotation to yield better models -or at least models with higher precision."}, {"id": 161, "string": "This is not the case."}, {"id": 162, "string": "Our interpretation is that frequency effects outweigh any other considerations: As Table 2 shows, the amount of labeled data points drops sharply with higher thresholds: even between t=0.0 and t=0.33, on average half of the labels are lost."}, {"id": 163, "string": "This interpretation is supported by the behavior of the individual emotions: for emotions where the data sets shrink gradually (anger, joy), performance drops gradually, while it dips sharply for emotions where the data sets shrink fast (disgust, fear)."}, {"id": 164, "string": "Somewhat surprisingly, therefore, we conclude that t=0.0 appears to be the Table 7 : Results of the BiLSTM for different voting thresholds."}, {"id": 165, "string": "We report average results for each emotion over 5 runs (standard deviations are included in parenthesis)."}, {"id": 166, "string": "most useful datasets from a computational modeling perspective."}, {"id": 167, "string": "In terms of how to deal with diverging annotations, we believe that this result bolsters our general approach to pay attention to individual annotators' labels rather than just majority votes: if the individual labels were predominantly noisy, we would not expect to see relatively high F 1 scores."}, {"id": 168, "string": "Conclusion and Future Work With this paper, we publish the first manual emotion annotation for a publicly available micropost corpus."}, {"id": 169, "string": "The resource we chose to annotate already provides stance and sentiment information."}, {"id": 170, "string": "We analyzed the relationships among emotion classes and between emotions and the other annotation layers."}, {"id": 171, "string": "In addition to the data set, we implemented wellknown standard models which are established for sentiment and polarity prediction for emotion classification."}, {"id": 172, "string": "The BI-LSTM model outperforms all other approaches by up to 4 points F 1 on average compared to linear classifiers."}, {"id": 173, "string": "Inter-annotator analysis showed a limited agreement between the annotators -the task is, at least to some degree, driven by subjective opinions."}, {"id": 174, "string": "We found, however, that this is not necessarily a problem: Our models perform best on a high-recall aggregate annotation which includes all labels assigned by at least one annotator."}, {"id": 175, "string": "Thus, we believe that the individual labels have value and are not, like generally assumed in crowdsourcing, noisy inputs suitable only as input for majority voting."}, {"id": 176, "string": "In this vein, we publish all individual annotations."}, {"id": 177, "string": "This enables further research on other methods of defining consensus annotations which may be more appropriate for specific downstream tasks."}, {"id": 178, "string": "More generally, we will make all annotations, resources and model implementations publicly available."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Background and Related Work", "n": "2", "start": 16, "end": 38}, {"section": "Annotation Procedure", "n": "3.1", "start": 39, "end": 52}, {"section": "Emotion Annotation Reliability and Aggregated Annotation", "n": "3.2", "start": 53, "end": 75}, {"section": "Distribution of Emotions", "n": "3.3", "start": 76, "end": 83}, {"section": "Emotion vs. other Annotation Layers", "n": "3.4", "start": 84, "end": 112}, {"section": "Models", "n": "4", "start": 113, "end": 155}, {"section": "Results", "n": "5", "start": 156, "end": 167}, {"section": "Conclusion and Future Work", "n": "6", "start": 168, "end": 178}], "figures": [{"filename": "../figure/image/1219-Table1-1.png", "caption": "Table 1: A selection of resources for sentiment analysis (on Twitter, 1–7) and emotion analysis (in general, 8–12). Annotation refers to the following annotation schemes: [1] positive-negative, [2] positivenegative-neutral, [3] positive-negative-mixed-other, [4] positive-negative-netural-unrelated-can’t tell, [5] positive-negative-neutral-mixed-other, [6] for-against, [7] positive and negative strength (range), [8] joy, fear, anger, sadness, disgust, shame, guilt, [9] angry, disgusted, fearful, happy, sad, positively surprised, negatively surprised, [10] happiness, sadness, anger, disgust, surprise, fear, mixed, [11] anger, disgust, fear, joy, sadness, surprise, [12] anger, fear, joy, sadness, [13] positive, negative, mixed, intensity, trust, fear, surprise, disgust, anger, anticipation, joy, roles, style, purpose (number denotes subset in corpus with emotion annotations)", "page": 1, "bbox": {"x1": 76.8, "x2": 520.3199999999999, "y1": 67.2, "y2": 250.07999999999998}}, {"filename": "../figure/image/1219-Table6-1.png", "caption": "Table 6: Results of linear and neural models for labels from the aggregated annotation (t=0.0). For the neural models, we report the average of five runs and standard deviation in brackets. Best F1 for each emotion shown in boldface.", "page": 6, "bbox": {"x1": 81.6, "x2": 516.0, "y1": 67.2, "y2": 288.0}}, {"filename": "../figure/image/1219-Table2-1.png", "caption": "Table 2: Corpus Statistics. The threshold t measures that a fraction of more than t annotators labeled the respective emotion (e. g., t=0.0: at least one annotator t=0.99: all annotators). Overall number of tweets: 4,868.", "page": 2, "bbox": {"x1": 72.96, "x2": 290.4, "y1": 62.4, "y2": 216.0}}, {"filename": "../figure/image/1219-Table3-1.png", "caption": "Table 3: Kappa Statistics for all pairs of annotators.", "page": 2, "bbox": {"x1": 326.88, "x2": 506.4, "y1": 62.4, "y2": 216.0}}, {"filename": "../figure/image/1219-Table7-1.png", "caption": "Table 7: Results of the BiLSTM for different voting thresholds. We report average results for each emotion over 5 runs (standard deviations are included in parenthesis).", "page": 7, "bbox": {"x1": 72.96, "x2": 524.16, "y1": 67.2, "y2": 268.32}}, {"filename": "../figure/image/1219-Table4-1.png", "caption": "Table 4: Tweet Counts (above diagonal) and odds ratio (below diagonal) for cooccurring annotations for all classes in the corpus (emotions based on aggregated annotation, t=0.0).", "page": 3, "bbox": {"x1": 77.75999999999999, "x2": 520.3199999999999, "y1": 67.2, "y2": 288.0}}, {"filename": "../figure/image/1219-Table5-1.png", "caption": "Table 5: Tweet Counts (above diagonal) and odds ratio (below diagonal) for cooccurring annotations for all classes in the corpus (emotions based on majority annotation, t=0.5).", "page": 4, "bbox": {"x1": 79.67999999999999, "x2": 518.4, "y1": 67.2, "y2": 288.0}}]}