{"title": "Interactive Second Language Learning from News Websites", "abstract": "We propose WordNews, a web browser extension that allows readers to learn a second language vocabulary while reading news online. Injected tooltips allow readers to look up selected vocabulary and take simple interactive tests. *", "text": [{"id": 0, "string": "We discover that two key system components needed improvement, both which stem from the need to model context."}, {"id": 1, "string": "These two issues are real-world word sense disambiguation (WSD) to aid translation quality and constructing interactive tests."}, {"id": 2, "string": "For the first, we start with Microsoft's Bing translation API but employ additional dictionary-based heuristics that significantly improve translation in both coverage and accuracy."}, {"id": 3, "string": "For the second, we propose techniques for generating appropriate distractors for multiple-choice word mastery tests."}, {"id": 4, "string": "Our preliminary user survey confirms the need and viability of such a language learning platform."}, {"id": 5, "string": "Introduction Learning a new language from language learning websites is time consuming."}, {"id": 6, "string": "Research shows that regular practice, guessing, memorization (Rubin, 1975) as well as immersion into real scenarios (Naiman, 1978) hastens the language learning process."}, {"id": 7, "string": "To make second language learning attractive and efficient, we interleave language learning with the daily activity of online news reading."}, {"id": 8, "string": "Most existing language learning software are either instruction-driven or user-driven."}, {"id": 9, "string": "Duolingo 1 is a popular instruction-driven system that teaches through structured lessons."}, {"id": 10, "string": "Instruction driven systems demand dedicated learner time on a daily basis and are limited by learning materials as lesson curation is often labor-intensive."}, {"id": 11, "string": "In contrast, many people informally use Google Translate 2 or Amazon Kindle's Vocabulary Builder 3 to learn vocabulary, making these prominent examples of user-driven systems."}, {"id": 12, "string": "These systems, however, lack the rigor of a learning platform as they omit tests to allow learners to demonstrate mastery."}, {"id": 13, "string": "In our work, we merge learning and assessment within the single activity of news reading."}, {"id": 14, "string": "Our system also adapts to the learner's skill during assessment."}, {"id": 15, "string": "We propose a system to enable online news readers to efficiently learn a new language's vocabulary."}, {"id": 16, "string": "Our prototype targets Chinese language learning while reading English language news."}, {"id": 17, "string": "Learners are provided translations of opendomain words for learning from an English news page."}, {"id": 18, "string": "In the same environment -for words that the system deems mastered by the learner -learners are assessed by replacing the original English text in the article with their Chinese translations and asked to translate them back given a choice of possible translations."}, {"id": 19, "string": "The system, WordNews, deployed as a Chrome web browser extension, is triggered when readers visit a preconfigured list of news websites (e.g., CNN, BBC)."}, {"id": 20, "string": "A key design property of our WordNews web browser extension is that it is only active on certain news websites."}, {"id": 21, "string": "This is important as news articles typically are classified with respect to a news category, such as finance, world news, and sports."}, {"id": 22, "string": "If we know which category of news the learner is viewing, we can leverage this contextual knowledge to improve the learning experience."}, {"id": 23, "string": "In the development of the system, we discovered two key components that can be affected by this context modeling."}, {"id": 24, "string": "We report on these developments here."}, {"id": 25, "string": "In specific, we propose improved algorithms for two components: (i) for translating English words to Chinese from news articles, (ii) for generating distractors for learner assessment."}, {"id": 26, "string": "The WordNews Chrome Extension Our method to directly enhance the web browser is inspired by earlier work in the computer-aided language learning community that also uses the web browser as the delivery vehicle for language learning."}, {"id": 27, "string": "WERTi (Metcalf and Meurers, 2006; Meurers et al., 2010) was a monolingual, userdriven system that modified web pages in the target language to highlight or remove certain words from specific syntactic patterns to teach difficultto-learn English grammar."}, {"id": 28, "string": "Our focus is to help build Chinese vocabulary for second language learners fluent in English."}, {"id": 29, "string": "We give a running scenario to illustrate the use of WordNews."}, {"id": 30, "string": "When a learner browses to an English webpage on a news website, our extension either selectively replaces certain original English words with their Chinese translation or underlines the English words, based on user configuration (Figure 1, middle) ."}, {"id": 31, "string": "While the meaning of the Chinese word is often apparent in context, the learner can choose to learn more about the replaced/underlined word, by mousing over the word to reveal a definition tooltip (Figure 1, left) to aid mastery of the Chinese word."}, {"id": 32, "string": "Once the learner has encountered the target word a few times, WordNews assesses learner's mastery by generating a multiple choice translation test on the target word (Figure 1 , right)."}, {"id": 33, "string": "Our learning platform thus can be viewed as three logical use cases: translating, learning and testing."}, {"id": 34, "string": "Translating."}, {"id": 35, "string": "We pass the main content of the webpage from the extension client to our server for candidate selection and translation."}, {"id": 36, "string": "As certain words are polysemous, the server must select the most appropriate translation among all pos-sible meanings."}, {"id": 37, "string": "Our initial selection method replaces any instance of words stored in our dictionary."}, {"id": 38, "string": "For translation, we check the word's stored meanings against the machine translation of each sentence obtained from the Microsoft Bing Translation API 4 (hereafter, \"Bing\")."}, {"id": 39, "string": "Matches are deemed as correct translations and are pushed back to the Chrome client for rendering."}, {"id": 40, "string": "Learning."}, {"id": 41, "string": "Hovering the mouse over the replacement Chinese word causes a tooltip to appear, which gives the translation, pronunciation, and simplified written form, and a More link that loads additional contextual example sentences (that were previously translated by the backend) for the learner to study."}, {"id": 42, "string": "The More link must be clicked for activation, as we find this two-click architecture helps to minimize latency and the loading of unnecessary data."}, {"id": 43, "string": "The server keeps record of the learning tooltip activations, logging the enclosing webpage URL, the target word and the user identity."}, {"id": 44, "string": "Testing."}, {"id": 45, "string": "After the learner encounters the same word a pre-defined number t = 3 times, Word-News generates a multiple choice question (MCQ) test to assess mastery."}, {"id": 46, "string": "When the learner hovers over the replaced word, the test is shown for the learner to select the correct answer."}, {"id": 47, "string": "When an option is clicked, the server logs the selection and updates the user's test history, and the client reveals the correct answer."}, {"id": 48, "string": "News Categories As our learning platform is active only on certain news websites, we can model the news category (for individual words and whole webpages) as additional evidence to help with tasks."}, {"id": 49, "string": "Of particular importance to WordNews is the association of words to a news category, which is used downstream in both word sense disambiguation (Section 3) and the generation of distractors in the interactive tests (Section 4)."}, {"id": 50, "string": "Here, our goal is to automatically find highly relevant words to a particular news category -e.g., \"what are typical finance words?\""}, {"id": 51, "string": "We first obtain a large sample of categorized English news webpages, by creating custom crawlers for specific news websites (e.g."}, {"id": 52, "string": "CNN)."}, {"id": 53, "string": "We use a seed list of words that are matched  3."}, {"id": 54, "string": "Finance Finance \"investment\", \"财富\" 4."}, {"id": 55, "string": "Sports Sports \"score\", \"比 赛\" Fashion Beauty & Health \"jewelry\", \"时髦\" 6."}, {"id": 56, "string": "Technology Technology \"cyber\", \"互联网\" 7."}, {"id": 57, "string": "Travel \"natural\" against a target webpage's URL."}, {"id": 58, "string": "If any match, the webpage is deemed to be of that category."}, {"id": 59, "string": "For example, a webpage that has the seed word \"football\" in its URL is deemed of category \"Sports\"."}, {"id": 60, "string": "Since the news category is also required for Chinese words for word sense disambiguation, we must perform a similar procedure to crawl Chinese news (e.g., BaiduNews 5 ) However, Chinese news sites follow a different categorization scheme, so we first manually align the categories based on observation (see Table 1 ), creating seven bilingual categories: namely, \"World\", \"Technology\", \"Sports\", \"Entertainment\", \"Finance\", \"Fashion\" and \"Travel\"."}, {"id": 61, "string": "We tokenize and part-of-speech tag the main body text of the categorized articles, discarding punctuation and stopwords."}, {"id": 62, "string": "For Chinese, we segment words using the Stanford Chinese word segmenter (Chang et al., 2008) ."}, {"id": 63, "string": "The remaining words are classified to a news category based on document frequency."}, {"id": 64, "string": "A word w is classified to a category c if it appears more often (a tunable threshold δ 6 ) than its average category document frequency."}, {"id": 65, "string": "Note that a word can be categorized to multiple categories under this scheme."}, {"id": 66, "string": "Word Sense Disambiguation (WSD) Component Our extension needs to show the most appropriate translation sense based on the context."}, {"id": 67, "string": "Such a translation selection task -cross-lingual word sense disambiguation -is a common problem in machine translation."}, {"id": 68, "string": "In this section, we describe how we improved WordNews' WSD capabilities through a series of six approaches."}, {"id": 69, "string": "The context evidence that we leverage for WSD comes in two forms: the news category of the target word and its enclosing sentence."}, {"id": 70, "string": "Bilingual Dictionary and Baseline WordNews's server component includes a bilingual lexicon of English words with possible Chinese senses."}, {"id": 71, "string": "The English words in our dictionary is based on the publicly-available College English Test (CET 4) list, which has a breadth of about 4,000 words."}, {"id": 72, "string": "We augment the list to include the relative frequency among Chinese senses, with their part-of-speech, per English word."}, {"id": 73, "string": "Our baseline translation uses the most frequent sense: for an English word to be translated, it chooses the most frequent relative Chinese translation sense c from the possible set of senses C. 关闭 密切 亲 亲 亲密 密 密 亲 亲 亲密 密 密 亲 亲 亲密 密 密 (2) ... kids can't stop singing ... verb: 停止, 站, 阻止, 停 ... 停 停 停止 止 止 阻止 停 停 停止 止 止 停 停 停止 止 止 停 停 停止 止 止 ( 免费 免费 自 自 自由 由 由 自 自 自由 由 由 自 自 自由 由 由 (4) ... why Obama's trip to my homeland is meaningful ... noun: 旅, 旅程 ... 旅游 ... 旅 旅 旅 旅 旅 旅行 行 行 旅 旅 旅行 行 行 (5) ... winning more points in the match ... noun: 匹 配, 比 赛, 赛, 敌手, 对手, 火柴 ... 匹配 匹配 比 比 比赛 赛 赛 比 比 比赛 赛 赛 比 比 比赛 赛 赛 (6) ... state department spokeswoman Jen Psaki said that the allies ... noun: 态, 国, 州, ... verb: 声明, 陈述, 述, 申 明 ... 发言 ... adj: 国家的 ... 态 态 发言 发言 人 国 国 国家 家 家 This method has complete coverage over the CET 4 list (as the word frequency rule always yields a prospective translation), but as it lacks any context model, it is the least accurate."}, {"id": 74, "string": "Approach 1: News Category Topic information has been shown to be useful in WSD (Boyd-Graber et al., 2007) ."}, {"id": 75, "string": "For example, consider the English word interest."}, {"id": 76, "string": "In finance related articles, \"interest\" is more likely to carry the sense of \"a share, right, or title in the ownership of property\" (\"利息\" in Chinese), over other senses."}, {"id": 77, "string": "Therefore, analysing the topic of the original article and selecting the translation with the same topic label might help disambiguate the word sense."}, {"id": 78, "string": "For a target English word e, for each prospective Chinese sense c ∈ C, choose the first (in terms of relative frequency) sense that has the same news category as the containing webpage."}, {"id": 79, "string": "Approach 2: Part-of-Speech Part-of-Speech (POS) tags are also useful for word sense disambiguation (Wilks and Stevenson, 1998 ) and machine translation (Toutanova et al., 2002; Ueffing and Ney, 2003) ."}, {"id": 80, "string": "For example, the English word \"book\" can function as a verb or a noun, which gives rise to two differ-ent dominant senses: \"reserve\" (\"预定\" in Chinese) and \"printed work\" (\"书\"), respectively."}, {"id": 81, "string": "As senses often correspond cross-lingually, knowledge of the English word's POS can assist disambiguation."}, {"id": 82, "string": "We employ the Standford log-linear Part-of-Speech tagger (Toutanova et al., 2003) to obtain the POS tag for the English word, whereas the POS tag for target Chinese senses are provided in our dictionary."}, {"id": 83, "string": "In cases where multiple candidate Chinese translations fit the same sense, we again break ties using relative frequency of the prospective candidates."}, {"id": 84, "string": "Approaches 3-5: Machine Translation Neighbouring words provide the necessary context to perform WSD in many contexts."}, {"id": 85, "string": "In our work, we consider the sentence in which the target word appears as our context."}, {"id": 86, "string": "We then acquire its translation from Microsoft Bing Translator using its API."}, {"id": 87, "string": "As we access the translation as a third party, the Chinese translation comes as-is, without the needed explicit word to locate the target English word to translate in the original input sentence."}, {"id": 88, "string": "We need to perform alignment of the Chinese and English sentences in order to recover the target word's translation from the sentence translation."}, {"id": 89, "string": "Approach 3 -Substring Match."}, {"id": 90, "string": "As potential Chinese translations are available in our dictionary, a straightforward use of substring matching recovers a Chinese translation; i.e., check whether the candidate Bing translation is a substring of the Chinese translation."}, {"id": 91, "string": "If more than one candidate matches, we use the longest string match heuristic and pick the one with the longest match as the final output."}, {"id": 92, "string": "If none matches, the system does not output a translation for the word."}, {"id": 93, "string": "Approach 4 -Relaxed Match."}, {"id": 94, "string": "The final rule in the substring match method unfortunately fires often, as the coverage of WordNews's lexicon is limited."}, {"id": 95, "string": "As we wish to offer correct translations that are not limited by our lexicon, we relax our substring condition, allowing the Bing translation to be a superset of a candidate translation in our dictionary (see Example 4 in Table 2 , where the Bing translation \"旅行\" is allowed to be relaxed to match the dictionary \"旅\")."}, {"id": 96, "string": "To this end, we must know the extent of the words in the translation."}, {"id": 97, "string": "We first segment the obtained Bing translation with the Stanford Chinese Word Segmenter, and then use string matching to find a Chinese translation c. If more than one candidate matches, we heuristically use the last matched candidate."}, {"id": 98, "string": "This technique significantly augments the translation range of our extension beyond the reach of our lexicon."}, {"id": 99, "string": "Approach 5 -Word Alignment."}, {"id": 100, "string": "The relaxed method runs into difficulties when the target English e's Chinese prospective translations which come from our lexicon generate several possible matches."}, {"id": 101, "string": "Consider Example 6 in Table 2 ."}, {"id": 102, "string": "The target English word \"state\" has corresponding Chinese entries \"发言\" and \"国家的\" in our dictionary."}, {"id": 103, "string": "For this reason, both \"国家\" (\"country\", correct) and \"发言人\" (\"spokeswoman\", incorrect) are relaxed matches."}, {"id": 104, "string": "As relaxed approach always picks up the last candidate, \"发 言人\" is the final output, which is incorrect."}, {"id": 105, "string": "To address this, we use the Bing Word Alignment API 7 to provide a possibly different prospective Chinese sense c. In this example, \"state\" matches \"国家\" (\"country\", correct) from word alignment, and the final algorithm chooses \"国家\" as the output."}, {"id": 106, "string": "7 https://msdn.microsoft.com/enus/library/dn198370.aspx Evaluation To evaluate the effectiveness of our proposed methods, we randomly sampled 707 words and their sentences from recent CNN 8 news articles, manually annotating the ground truth translation for each target English word."}, {"id": 107, "string": "We report both the coverage (i.e., the ability of the system to return a translation) and accuracy (i.e., whether the translation is contextually accurate)."}, {"id": 108, "string": "Table 3 shows the experimental results for the six approaches."}, {"id": 109, "string": "As expected, frequency-based baseline achieves 100% coverage, but a low accuracy (57.3%); POS also performs similarly ."}, {"id": 110, "string": "The category-based approach performs the worst, due to low coverage."}, {"id": 111, "string": "This is because news category only provides a high-level context and many of the Chinese word senses do not have a strong topic tendency."}, {"id": 112, "string": "Of most promise is our use of web based translation related APIs."}, {"id": 113, "string": "The three Bing methods iteratively improve the accuracy and have reasonable coverage."}, {"id": 114, "string": "Among all the methods, the additional step of word alignment is the best in terms of accuracy (97.4%), significantly bettering the others."}, {"id": 115, "string": "This validates previous work that sentence-level context is helpful in WSD."}, {"id": 116, "string": "Distractor Generation Component Assesing mastery over vocabulary is the other key functionality of our prototype learning platform."}, {"id": 117, "string": "The generation of the multiple choice selection test requires the selection of alternative choices aside from the correct answer of the target word."}, {"id": 118, "string": "In this section, we investigate a way to automatically generate such choices (called distractors in the literature) in English, given a target word."}, {"id": 119, "string": "Related Work Multiple choice question (MCQ) is widely used in vocabulary learning."}, {"id": 120, "string": "Semantic and syntactic properties of the target word need to be considered while generating their distractors."}, {"id": 121, "string": "In particular, (Pho et al., 2014) did an analysis on real-life MCQ corpus, and validated there are syntactic and semantic homogeneity among distractors."}, {"id": 122, "string": "Based on this, automatic distractor generation algorithms have been proposed."}, {"id": 123, "string": "For instance, (Lee and Seneff, 2007) generate distractors for English prepositions based on collocations, and idiosyncratic incorrect usage learned from non-native English corpora."}, {"id": 124, "string": "Lärka (Volodina et al., 2014 ) -a Swedish language learning system -generates vocabulary assessment exercises using a corpus."}, {"id": 125, "string": "They also have different modes of exercise generation to allow learning and testing via the same interface."}, {"id": 126, "string": "(Susanti et al., 2015) generate distractors for TOEFL vocabulary test using WordNet and word sense disambiguation given a target word."}, {"id": 127, "string": "While these approaches serve in testing mastery, they do not provide the capability for learning new vocabulary in context."}, {"id": 128, "string": "The most related prior work is WordGap system (Knoop and Wilske, 2013) , a mobile application that generates MCQ tests based on the text selected by users."}, {"id": 129, "string": "WordGap customizes the reading context, however, the generation of distractors -based on syntactic and semantic homogeneityis not contextualized."}, {"id": 130, "string": "Approach WordNews postulates \"a set of suitable distractors\" as: 1) having the same form as the target word, 2) fitting the sentence's context, and 3) having proper difficulty level according to user's level of mastery."}, {"id": 131, "string": "As input to the distractor generation algorithm, we provide the target word, its partof-speech (obtained by tagging the input sentence first) and the enclosing webpage's news category."}, {"id": 132, "string": "We restrict the algorithm to produce distractors matching the input POS, and which match the news category of the page."}, {"id": 133, "string": "We can design the test to be more difficult by choosing distractors that are more similar to the target word."}, {"id": 134, "string": "By varying the semantic distance, we can generate tests at varying difficulty levels."}, {"id": 135, "string": "We quantify similarity by using the Lin distance (Lin, 1998) between two input candidate concepts in WordNet (Miller, 1995) : sim(c1, c2) = 2 * logP (lso(c1, c2)) logP (c1) + logP (c2) (1) where P (c) denotes the probability of encountering concept c, and lso(c1, c2) denotes the lowest common subsumer synset, which is the lowest node in the WordNet hierarchy that is a hypernym of both c1 and c2."}, {"id": 136, "string": "This returns a score from 0 (completely dissimilar) to 1 (semantically equivalent)."}, {"id": 137, "string": "If we use a target word e as the starting point, we can use WordNet to retrieve related words using WordNet relations (hypernyms/hyponyms, synonyms/antonyms) and determine their similarity using Lin distance."}, {"id": 138, "string": "We empirically set 0.1 as the similarity threshold -words that are deemed more similar than 0.1 are returned as possible distractors for our algorithm."}, {"id": 139, "string": "We note that Lin distance often returns a score of 0 for many pairs and the threshold of 0.1 allows us to have a large set of distractors to choose from, while remaining fairly efficient in run-time distractor generation."}, {"id": 140, "string": "We discretize a learner's knowledge of the word based on their prior exposure to it."}, {"id": 141, "string": "We then adopt a strategy to generate distractors for the input word based learners' knowledge level: Easy: The learner has been exposed to the word at least t = 3 times."}, {"id": 142, "string": "Two distractors are randomly selected from words that share the same news category as the target word e. The third distractor is generated using our algorithm."}, {"id": 143, "string": "Hard: The learner has passed the Easy level test x = 6 times."}, {"id": 144, "string": "All three distractors are generated from the same news category, using our algorithm."}, {"id": 145, "string": "Evaluation The WordGap system (Knoop and Wilske, 2013) represents the most related prior work on automated distractor generation, and forms our baseline."}, {"id": 146, "string": "WordGap adopts a knowledge-based approach: selecting the synonyms of synonyms (also computed by WordNet) as distractors."}, {"id": 147, "string": "They first select the most frequently used word, w1, from the target word's synonym set, and then select the synonyms of w1, called s1."}, {"id": 148, "string": "Finally, WordGap selects the three most frequently-used words from s1 as distractors."}, {"id": 149, "string": "We conducted a human subject evaluation of distractor generation to assess its fitness for use."}, {"id": 150, "string": "The subjects were asked to rank the feasibility of a distractor (inclusive of the actual answer) from a given sentential context."}, {"id": 151, "string": "The contexts were sentences retrieved from actual news webpages, identical to WordNews's use case."}, {"id": 152, "string": "We randomly selected 50 sentences from recent news articles, choosing a noun or adjective from the sentence as the target word."}, {"id": 153, "string": "We show the original sentence (leaving the target word as blank) as the context, and display distractors as choices (see Figure 2 )."}, {"id": 154, "string": "Subjects were required to read the sentence and rank the distractors by plausibility: 1 (the original answer), 2 (most plausible alternative) to 7 (least plausible alternative)."}, {"id": 155, "string": "We recruited 15 subjects from within our institution for the survey."}, {"id": 156, "string": "All of them are fluent English speakers, and half are native speakers."}, {"id": 157, "string": "We evaluated two scenarios, for two different purposes."}, {"id": 158, "string": "In both evaluations, we generate three distractors using each of the two systems, and add the original target word for validation (7 options in total, conforming to our ranking options of 1-7)."}, {"id": 159, "string": "Since we have news category information, we wanted to check whether that information alone could improve distractor generation."}, {"id": 160, "string": "Evaluation 1 tests the WordGap baseline system versus a Random News system that uses random word selection."}, {"id": 161, "string": "It just uses the constraint that chosen distractors must conform to the news category (be classified to the news category of the target word)."}, {"id": 162, "string": "In our Evaluation 2, we tested our Hard setup where our algorithm is used to generate all distractors against WordGap."}, {"id": 163, "string": "This evaluation aims to assess the efficacy of our algorithm over the baseline."}, {"id": 164, "string": "Results and Analysis Each question was answered by five different users."}, {"id": 165, "string": "We compute the average ranking for each choice."}, {"id": 166, "string": "A lower rating means a more plausible (harder) distractor."}, {"id": 167, "string": "The rating for all the target words is low (1.1 on average) validating their truth and implying that the subjects answered the survey seriously, assuring the validity of the evaluation."}, {"id": 168, "string": "For each question, we deem an algorithm to be the winner if its three distractors as a whole (the sum of three average ratings) are assessed to be more plausible than the distractors by its competitor."}, {"id": 169, "string": "We calculate the number of wins for each algorithm over the 50 questions in each evaluation."}, {"id": 170, "string": "We display the results of both evaluations in Table 4 and Table 5 ."}, {"id": 171, "string": "We see that the WordGap baseline outperforms the random selection, constrained solely by news category, by 4 wins and a 0.26 lower average score."}, {"id": 172, "string": "This shows that word news category alone is insufficient for generating good distractors."}, {"id": 173, "string": "When a target word does not have a strong category tendency, e.g., \"venue\" and \"week\", the random news method cannot select highly plausible distractors."}, {"id": 174, "string": "In the second table, our distractor algorithm significantly betters the baseline in both number of wins (8 more) and average score (0.67 lower)."}, {"id": 175, "string": "This further confirms that context and semantic information are complementary for distractor generation."}, {"id": 176, "string": "As we mentioned before, a good distractor should fit the reading context and have a certain level of difficulty."}, {"id": 177, "string": "Finally, in Table 6 we show the distractors generated for the target word \"lark\" in the example survey question (Figure 2 )."}, {"id": 178, "string": "Platform Viability and Usability Survey We have thus far described and evaluated two critical components that can benefit from capturing the learner's news article context."}, {"id": 179, "string": "In the larger context, we also need to check the viability of second language learning intertwined with news reading."}, {"id": 180, "string": "In a requirements survey prior to the prototype development, two-thirds of the respondents indicated that although they have interest in learning a second language, they only have only used language learning software infrequently (less than once per week) yet frequently read news, giving us motivation for our development."}, {"id": 181, "string": "Post-prototype, we conducted a summative survey to assess whether our prototype product satisfied the target niche, in terms of interest, usability and possible interference with normal reading activities."}, {"id": 182, "string": "We gathered 16 respondents, 15 of which were between the ages of 18-24."}, {"id": 183, "string": "11 (the majority) also claimed native Chinese language proficiency."}, {"id": 184, "string": "The respondents felt that the extension platform was a viable language learning platform (3.4 of 5; on a scale of 1 \"disagreement\" to 5 \"agreement\") and that they would like to try it when available for their language pair (3 of 5)."}, {"id": 185, "string": "In our original prototype, we replaced the orig-inal English word with the Chinese translation."}, {"id": 186, "string": "While most felt that replacing the original English with the Chinese translation would not hamper their reading, they still felt a bit uncomfortable (3.7 of 5)."}, {"id": 187, "string": "This finding prompted us to change the default learning tooltip behavior to underlining to hint at the tooltip presence."}, {"id": 188, "string": "Conclusion We described WordNews, a client extension and server backend that transforms the web browser into a second language learning platform."}, {"id": 189, "string": "Leveraging web-based machine translation APIs and a static dictionary, it offers a viable user-driven language learning experience by pairing an improved, context-sensitive tooltip definition service with the generation of context-sensitive multiple choice questions."}, {"id": 190, "string": "WordNews is potentially not confined to use in news websites; one respondent noted that they would like to use it on arbitrary websites, but currently we feel usable word sense disambiguation is difficult enough even in the restricted news domain."}, {"id": 191, "string": "We also note that respondents are more willing to use a mobile client for news reading, such that our future development work may be geared towards an independent mobile application, rather than a browser extension."}, {"id": 192, "string": "We also plan to conduct a longitudinal study with a cohort of second language learners to better evaluate Word-News' real-world effectiveness."}], "headers": [{"section": "Introduction", "n": "1", "start": 5, "end": 25}, {"section": "The WordNews Chrome Extension", "n": "2", "start": 26, "end": 47}, {"section": "News Categories", "n": "2.1", "start": 48, "end": 54}, {"section": "Fashion", "n": "5.", "start": 55, "end": 65}, {"section": "Word Sense Disambiguation (WSD) Component", "n": "3", "start": 66, "end": 69}, {"section": "Bilingual Dictionary and Baseline", "n": "3.1", "start": 70, "end": 73}, {"section": "Approach 1: News Category", "n": "3.2", "start": 74, "end": 78}, {"section": "Approach 2: Part-of-Speech", "n": "3.3", "start": 79, "end": 83}, {"section": "Approaches 3-5: Machine Translation", "n": "3.4", "start": 84, "end": 105}, {"section": "Evaluation", "n": "3.5", "start": 106, "end": 115}, {"section": "Distractor Generation Component", "n": "4", "start": 116, "end": 118}, {"section": "Related Work", "n": "4.1", "start": 119, "end": 129}, {"section": "Approach", "n": "4.2", "start": 130, "end": 144}, {"section": "Evaluation", "n": "4.3", "start": 145, "end": 163}, {"section": "Results and Analysis", "n": "4.3.1", "start": 164, "end": 177}, {"section": "Platform Viability and Usability Survey", "n": "5", "start": 178, "end": 187}, {"section": "Conclusion", "n": "6", "start": 188, "end": 192}], "figures": [{"filename": "../figure/image/1230-Table4-1.png", "caption": "Table 4: WordGap vs. Random News. Lower scores are better.", "page": 6, "bbox": {"x1": 313.92, "x2": 515.04, "y1": 407.52, "y2": 451.2}}, {"filename": "../figure/image/1230-Table5-1.png", "caption": "Table 5: WordGap vs. WordNews Hard. Lower scores are better.", "page": 6, "bbox": {"x1": 312.96, "x2": 517.4399999999999, "y1": 520.8, "y2": 563.04}}, {"filename": "../figure/image/1230-Figure2-1.png", "caption": "Figure 2: Sample distractor ranking question.", "page": 6, "bbox": {"x1": 312.96, "x2": 517.4399999999999, "y1": 71.52, "y2": 190.07999999999998}}, {"filename": "../figure/image/1230-Table1-1.png", "caption": "Table 1: News category alignment between English and Chinese.", "page": 2, "bbox": {"x1": 72.0, "x2": 293.28, "y1": 259.68, "y2": 480.96}}, {"filename": "../figure/image/1230-Figure1-1.png", "caption": "Figure 1: Merged screenshots of our Chrome extension on the CNN English article Spotify wants to be the soundtrack of your life. Underlined components are clickable to yield tooltips of two different forms: (left) a definition for learning, (right) a multiple-choice interactive test.", "page": 2, "bbox": {"x1": 73.92, "x2": 522.24, "y1": 71.52, "y2": 153.12}}, {"filename": "../figure/image/1230-Table6-1.png", "caption": "Table 6: Distractors generated by WordGap and WordNews Hard for example question in Figure 2. The identified news category for the enclosing webpage was Entertainment.", "page": 7, "bbox": {"x1": 78.72, "x2": 282.24, "y1": 135.84, "y2": 222.23999999999998}}, {"filename": "../figure/image/1230-Table2-1.png", "caption": "Table 2: Example translations from our approaches to WSD. Target words are italicized and correct translations are bolded.", "page": 3, "bbox": {"x1": 76.8, "x2": 518.4, "y1": 113.75999999999999, "y2": 348.0}}, {"filename": "../figure/image/1230-Table3-1.png", "caption": "Table 3: WSD performance over our test set.", "page": 4, "bbox": {"x1": 305.76, "x2": 520.3199999999999, "y1": 94.56, "y2": 226.56}}]}