{"title": "How do practitioners, PhD students and postdocs in the social sciences assess topic-specific recommendations?", "abstract": "In this paper we describe a case study where researchers in the social sciences (n=19) assess topical relevance for controlled search terms, journal names and author names which have been compiled by recommender services. We call these services Search Term Recommender (STR), Journal Name Recommender (JNR) and Author Name Recommender (ANR) in this paper. The researchers in our study (practitioners, PhD students and postdocs) were asked to assess the top n preprocessed recommendations from each recommender for specific research topics which have been named by them in an interview before the experiment. Our results show clearly that the presented search term, journal name and author name recommendations are highly relevant to the researchers topic and can easily be integrated for search in Digital Libraries. The average precision for top ranked recommendations is 0.749 for author names, 0.743 for search terms and 0.728 for journal names. The relevance distribution di↵ers largely across topics and researcher types. Practitioners seem to favor author name recommendations while postdocs have rated author name recommendations the lowest. In the experiment the small postdoc group favors journal name recommendations.", "text": [{"id": 0, "string": "Introduction In metadata-driven Digital Libraries (DL) typically three major information retrieval (IR) related di culties arise: (1) the vagueness between search and indexing terms, (2) the information overload by the amount of result records obtained by the information retrieval systems, and (3) the problem that pure term frequency based rankings, such as term frequency -inverse document frequency (tf-idf), provide results that often do not meet user needs [10] ."}, {"id": 1, "string": "Search term suggestion or other domain-specific recommendation modules can help users -e.g."}, {"id": 2, "string": "in the social sciences [7] and humanities [4] -to formulate their queries by mapping the personal vocabularies of the users onto the often highly specialized vocabulary of a digital library."}, {"id": 3, "string": "A recent overview of recommender systems in DL can be found in [2] ."}, {"id": 4, "string": "This strongly suggests the introduction of models in IR systems that rely more on the real research process and have therefore a greater potential for closing the gap between information needs of scholarly users and IR systems than conventional system-oriented approaches."}, {"id": 5, "string": "In this paper 1 we will present an approach to utilize specific information retrieval services [10] as enhanced search stratagems [1, 17, 5] and recommendation services within a scholarly IR environment."}, {"id": 6, "string": "In a typical search scenario a user first formulates his query, which can then be enriched by a Search Term Recommender that adds controlled descriptors from the corresponding document language to the query."}, {"id": 7, "string": "With this new query a search in a database can be triggered."}, {"id": 8, "string": "The search returns a result set which can be re-ranked."}, {"id": 9, "string": "Since search is an iterative procedure this workflow can be repeated many times till the expected result set is retrieved."}, {"id": 10, "string": "These iterative search steps are typically stored in a search sessions log."}, {"id": 11, "string": "The idea of this paper is to assess if topic-specific recommendation services which provide search related thesaurus term, journal name and author name suggestions are accepted by researchers."}, {"id": 12, "string": "In section 2 we will shortly introduce three di↵erent recommendation services: (1) co-word analysis and the derived concept of Search Term Recommendation (STR), (2) coreness of journals and the derived Journal Name Recommender (JNR) and (3) centrality of authors and the derived Author Name Recommender (ANR)."}, {"id": 13, "string": "The basic concepts and an evaluation of the top-ranked recommendations are presented in the following sections."}, {"id": 14, "string": "We can show that the proposed recommendation services can easily be implemented within scholarly DLs."}, {"id": 15, "string": "In the conclusion we assume that a users search should improve by using the proposed recommendation services when interacting with a scientific information system, but the relevance of these recommendations in a real interactive search task is still an open question (compare the experiences with the Okapi system [13] )."}, {"id": 16, "string": "Models for information retrieval enhancement The standard model of IR in current DLs is the tf-idf model which proposes a text-based relevance ranking."}, {"id": 17, "string": "As tf-idf is text-based, it assigns a weight to term t in document d which is influenced by di↵erent occurrences of t and d. Variations of the basis term weighing process have been proposed, like normalization of document length or by scaling the tf values but the basic assumption stays the same."}, {"id": 18, "string": "We hypothesize that recommendation services which are situated in the search process can improve the search experience of users in a DL."}, {"id": 19, "string": "The recommendation services are outlined very shortly in the following section."}, {"id": 20, "string": "More details on these services can be found in [10] ."}, {"id": 21, "string": "Search Term Recommendation Search Term Recommenders (STRs) are an approach to compensate the long known language problem in IR [3, 12, 7] : When searching an information system, a user has to come up with the \"appropriate\" query terms so that they best match the document language to get qualitative results."}, {"id": 22, "string": "STRs in this paper are based on statistical co-word analysis and build associations between free terms (i.e."}, {"id": 23, "string": "from title or abstract) and controlled terms (i.e."}, {"id": 24, "string": "from a thesaurus) which are used during a professional indexation of the documents (see \"Alternative Keywords\" in Figure 1 )."}, {"id": 25, "string": "The co-word analysis implies a semantic association between the free and the controlled terms."}, {"id": 26, "string": "The more often terms co-occur in the text the more likely it is that they share a semantic relation."}, {"id": 27, "string": "In our setup we use STR for search term recommendation where the original topical query of the researcher is expanded with semantically \"near\" terms 2 from the controlled vocabulary Thesaurus for the Social Sciences (TheSoz)."}, {"id": 28, "string": "Recommending Journal Names Journals play an important role in the scientific communication process."}, {"id": 29, "string": "They appear periodically, they are topically focused, they have established standards of quality control and often they are involved in the academic gratification system."}, {"id": 30, "string": "Metrics like the famous impact factor are aggregated on the journal level."}, {"id": 31, "string": "In some disciplines journals are the main place for a scientific community to communicate and discuss new research results [11, 15] ."}, {"id": 32, "string": "In addition, journals or better journal names play an important role in the search process (see e.g."}, {"id": 33, "string": "the famous search stratagem \"journal run\") [1, 8, 5] ."}, {"id": 34, "string": "The underlying mechanism for recommending journal names (JNR) in this paper is called Bradfordizing [16] ."}, {"id": 35, "string": "Bradfordizing is an alternative mechanism to re-rank journal articles according to core journals to bypass the problem of very large and unstructured result sets."}, {"id": 36, "string": "The approach of Bradfordizing is to use characteristic concentration e↵ects (Bradfords law of scattering) that appear typically in journal literature."}, {"id": 37, "string": "Bradfordizing defines di↵erent zones of documents which are based on the frequency counts in a given document set."}, {"id": 38, "string": "Documents in core journals -journals which publish frequently on a topic -are ranked higher than documents which were published in journals from the following Bradford zones 3 ."}, {"id": 39, "string": "In IR a positive e↵ect on the search result can be assumed in favor of documents from core journals [8, 9] ."}, {"id": 40, "string": "Bradfordizing is implemented as one re-ranking feature called \"Journal productivity\" in the digital library sowiport 4 [6] ."}, {"id": 41, "string": "In our setup of the assessment we evaluated the journal name recommendations, namely the top-ranked 5 core journals after Bradfordizing."}, {"id": 42, "string": "Recommending Author Names Collaboration in science is mainly represented by co-authorships between two or more authors who write a publication together."}, {"id": 43, "string": "Transferred to a whole community, co-authorships form a co-authorship network reflecting the overall collaboration structure of a community."}, {"id": 44, "string": "The underlying mechanism for recommending author names (ANR) in this paper is the author centrality measure betweenness."}, {"id": 45, "string": "Author centrality is another way of re-ranking result sets (see Figure 2 )."}, {"id": 46, "string": "Here the concept of centrality in a network of authors is an additional approach for the problem of large and unstructured result sets."}, {"id": 47, "string": "The intention behind this ranking model is to make use of knowledge about the interaction and cooperation behavior in special fields of research."}, {"id": 48, "string": "The (social) status and strategic position of a person in a scientific community is used too."}, {"id": 49, "string": "The model is based on a network analytical view on a field of research and di↵ers greatly from conventional text-oriented ranking methods like tf-idf."}, {"id": 50, "string": "A concrete criterion of relevance in this model is the centrality of authors from retrieved publications in a co-authorship network."}, {"id": 51, "string": "The model calculates a co-authorship network based on the result set to a specific query."}, {"id": 52, "string": "Centrality of each single author in this network is calculated by applying the betweenness measure and the documents in the result set are ranked according to the betweenness of their authors so that publications with very central authors are ranked higher in the result list [10, 9] ."}, {"id": 53, "string": "From a recent study we know that many users are searching DL with author names [5] ."}, {"id": 54, "string": "In addition, author name recommendations basing on author centrality can be successfully be used as query expansion mechanism [14] ."}, {"id": 55, "string": "Implementation All proposed services are implemented in a live information system using (1) the Solr search engine, (2) Grails Web framework to demonstrate the general feasibility of the approaches."}, {"id": 56, "string": "Both Bradfordizing and author centrality as rerank mechanism are implemented as plugins to the open source web framework Grails."}, {"id": 57, "string": "Grails is the glue to combine the di↵erent modules and to o↵er an interactive web-based prototype."}, {"id": 58, "string": "In general these retrieval services can be applied in di↵erent query phases."}, {"id": 59, "string": "In the following section we will describe a small case study with researchers using the recommendation services STR, JNR and ANR to find search terms, journal names and author names relevant to their research topics."}, {"id": 60, "string": "Assessment Study The assessment study involved 19 researchers in the social sciences who agreed to name one or two of their research topics and take part in a short online assessment exercise."}, {"id": 61, "string": "We have recruited the researchers (practitioners 5 , PhD students and PostDocs) via email and telephone and they were asked to qualify their primary research topic in the form of 1-3 typical search terms they would enter in a search box."}, {"id": 62, "string": "These search terms have been operationalized into a valid query for our prototype by us together with an individualized login for the single researcher."}, {"id": 63, "string": "Individualized assessment accounts were sent to the researchers via email for each topic and contained a link to the online assessment tool and a short description how to evaluate the recommendations."}, {"id": 64, "string": "All researchers were asked to assess the topical relevance of each recommendation in relationship to their research topic into relevant or not relevant (binary assessments)."}, {"id": 65, "string": "All researchers got three di↵erent assessment screens, always in the same order with a maximum of 5 recommendations for each recommender on one screen: first all search term recommendations, second all author name recommendations and last all journal name recommendations."}, {"id": 66, "string": "For each query, researchers got a set of max."}, {"id": 67, "string": "15 recommendations."}, {"id": 68, "string": "This is the list of all 23 evaluated researcher topics: [east Europe; urban sociology; equal treatment; data quality; interviewer error; higher education research; evaluation research; information science; political sociology; party democracy; data quality (2) 6 , party system; factor structure; nonresponse; ecology; industrial sociology; sociology of culture; theory of action; atypical employment; lifestyle; Europeanization; survey design; societal change in the newly-formed German states]."}, {"id": 69, "string": "Evaluation In the following section we describe the evaluation of the recorded assessments."}, {"id": 70, "string": "We calculated average precision AP for each recommender service."}, {"id": 71, "string": "The precision P of each service was calculated by P = r r + nr (1) for each topic, where r is the number of all relevant assessed recommendations and r+nr is the number of all assessed recommendations (relevant and not relevant)."}, {"id": 72, "string": "We wanted to keep the assessment exercise for the researchers very short and hence we limited the list of recommendations of each service to a maximum of 5 controlled terms, journal names and author names."}, {"id": 73, "string": "According to this restriction we decided to calculate AP@1, AP@2, AP@4 for each service."}, {"id": 74, "string": "In very rare case one recommendation service generated just one or two recommendations."}, {"id": 75, "string": "Results In sum 19 researchers assessed 23 topics in the online assessment study."}, {"id": 76, "string": "This resulted in total 95 STR, 111 JNR and 107 ANR assessments (see Table 1 )."}, {"id": 77, "string": "In average the researchers assessed 4.1 search term, 4.8 journal name and 4.6 author name recommendations per topic."}, {"id": 78, "string": "Table 2 shows the evaluation results of all STR, JNR and ANR assessments."}, {"id": 79, "string": "For this case study we did no statistically testing like t-test or Wilcoxon because 6 Data quality is mentioned by two researchers and assessed two times."}, {"id": 80, "string": "of our very small sample."}, {"id": 81, "string": "The following results should be read as plausibility tests without any statistical significance."}, {"id": 82, "string": "We just want to demonstrate here the indicative relevance of this kind of recommender systems for scholarly search systems."}, {"id": 83, "string": "Table 2 ."}, {"id": 84, "string": "Evaluation of the assessments."}, {"id": 85, "string": "AP, AP@1, AP@2 and AP@4 for recommendation from STR, JNR and ANR STR JNR ANR AP 0.743 0.728 0.749 AP@1 0.957 0.826 0.957 AP@2 0.826 0.848 0.864 AP@4 0.750 0.726 0.750 We can see that the average precision AP of ANR (0.749) and STR (0.743) is slightly better than JNR (0.728)."}, {"id": 86, "string": "Consulting the AP@1 measures ANR and STR are clearly better the JNR."}, {"id": 87, "string": "That means that the first recommended author name or search term is rated more often relevant than the first journal name in a list of 4 or 5 recommendations."}, {"id": 88, "string": "Surprisingly JNR (0.848) is slightly better than STR (0.826) in AP@2."}, {"id": 89, "string": "If we look at the last row (AP@4 ) in Table 2 we can see that all three recommendation services move closer together when more recommendation are assessed."}, {"id": 90, "string": "Table 3 shows the average precision AP of STR, JNR and ANR for our three di↵erent researcher types (practitioners, PhD students and postdocs)."}, {"id": 91, "string": "From the 19 researchers in our user study we group 8 researchers into the practitioners group (mostly information professionals without PhD), 8 PhD students which had 1-4 years research experience and a small group of 3 postdocs with 4 and more years research experience."}, {"id": 92, "string": "We can see clearly that the author name recommendations are rated highest by the practitioners (see AP of ANR = 0.836)."}, {"id": 93, "string": "Surprisingly the postdocs have evaluated ANR much lower than the other two groups (see AP of ANR = 0.467)."}, {"id": 94, "string": "In the experiment postdocs favor journal name recommendations."}, {"id": 95, "string": "PhD students rate all three recommenders more or less the same."}, {"id": 96, "string": "Conclusion In this small case study typical researchers in the social sciences are confronted with specific recommendations which were calculated on the basis of researchers research topics."}, {"id": 97, "string": "Looking at the precision values two important insights can be noted: (1) precision values of recommendations from STR, JNR and ANR are close together on a very high level -AP is close to 0.75 -and (2) each service retrieved a disjoint set of relevant recommendations."}, {"id": 98, "string": "The di↵erent services each favor quite other -but still relevant -recommendations and relevance distribution di↵ers largely across topics and researchers."}, {"id": 99, "string": "A distinction between researcher types shows that practitioners are favoring author name recommendations (ANR) while postdocs are favoring journal name recommendations precompiled by our recommender services."}, {"id": 100, "string": "This can be an artifact due to the small size of the postdoc group but this is also plausible."}, {"id": 101, "string": "In terms of research topics author names typically are more distinctive than journal names."}, {"id": 102, "string": "An experienced researcher (e.g."}, {"id": 103, "string": "postdoc) who is familiar with an authors work can quickly rate an authors name relevance for a specific topic."}, {"id": 104, "string": "In this context journal names are not that problematic because they published widely on di↵erent topics."}, {"id": 105, "string": "This seems to be the case in our small sample (see third row in Table 3 )."}, {"id": 106, "string": "PhD students who typically are unexperienced find all recommendations (terms, author names, journal names) helpful (see second row in Table 3 )."}, {"id": 107, "string": "The proposed models and derived recommendation services open up new viewpoints on the scientific knowledge space and also provide an alternative framework to structure and search domain-specific retrieval systems [10] ."}, {"id": 108, "string": "In sum, this case study presents limited results but show clearly that bibliometricenhanced recommender services can support the retrieval process."}, {"id": 109, "string": "In a next step we plan to evaluate the proposed recommendation services in a larger document assessment task where the services are utilized as query expansion mechanisms [14] and interactive services [17] ."}, {"id": 110, "string": "However, a lot of research e↵ort needs to be done to make more progress in coupling bibliometric-enhanced recommendation services with IR."}, {"id": 111, "string": "The major challenge that we see here is to consider also the dynamic mechanisms which form the structures and activities in question and their relationships to dynamic features in scholarly information retrieval."}, {"id": 112, "string": "Acknowledgment Our thanks go to all researchers in the study."}, {"id": 113, "string": "The work presented here was funded by DFG, grant no."}, {"id": 114, "string": "INST 658/6-1 and grant no."}, {"id": 115, "string": "SU 647/5-2."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Models for information retrieval enhancement", "n": "2", "start": 16, "end": 20}, {"section": "Search Term Recommendation", "n": "2.1", "start": 21, "end": 27}, {"section": "Recommending Journal Names", "n": "2.2", "start": 28, "end": 41}, {"section": "Recommending Author Names", "n": "2.3", "start": 42, "end": 54}, {"section": "Implementation", "n": "2.4", "start": 55, "end": 59}, {"section": "Assessment Study", "n": "3", "start": 60, "end": 68}, {"section": "Evaluation", "n": "4", "start": 69, "end": 74}, {"section": "Results", "n": "5", "start": 75, "end": 95}, {"section": "Conclusion", "n": "6", "start": 96, "end": 111}, {"section": "Acknowledgment", "n": "7", "start": 112, "end": 115}], "figures": [{"filename": "../figure/image/1232-Figure1-1.png", "caption": "Fig. 1. Example search term ”social” and search term recommendations", "page": 2, "bbox": {"x1": 185.76, "x2": 429.12, "y1": 316.8, "y2": 430.08}}, {"filename": "../figure/image/1232-Table1-1.png", "caption": "Table 1. Statistics of the assessment study", "page": 5, "bbox": {"x1": 176.64, "x2": 439.2, "y1": 575.52, "y2": 601.92}}, {"filename": "../figure/image/1232-Figure2-1.png", "caption": "Fig. 2. Recommending author names in our retrieval prototype. Example search term ”luhmann” and highly associated author names ”central authors” in the right panel", "page": 3, "bbox": {"x1": 133.92, "x2": 481.44, "y1": 283.68, "y2": 414.24}}, {"filename": "../figure/image/1232-Table2-1.png", "caption": "Table 2. Evaluation of the assessments. AP, AP@1, AP@2 and AP@4 for recommendation from STR, JNR and ANR", "page": 6, "bbox": {"x1": 257.76, "x2": 358.08, "y1": 220.79999999999998, "y2": 281.28}}, {"filename": "../figure/image/1232-Table3-1.png", "caption": "Table 3. Evaluation of di↵erent researcher types. Average precision for recommendation from STR, JNR and ANR", "page": 6, "bbox": {"x1": 219.84, "x2": 395.03999999999996, "y1": 590.88, "y2": 640.3199999999999}}]}