{"title": "Using Word Embedding for Cross-Language Plagiarism Detection", "abstract": "This paper proposes to use distributed representation of words (word embeddings) in cross-language textual similarity detection. The main contributions of this paper are the following: (a) we introduce new cross-language similarity detection methods based on distributed representation of words; (b) we combine the different methods proposed to verify their complementarity and finally obtain an overall F 1 score of 89.15% for English-French similarity detection at chunk level (88.5% at sentence level) on a very challenging corpus.", "text": [{"id": 0, "string": "Introduction Plagiarism is a very significant problem nowadays, specifically in higher education institutions."}, {"id": 1, "string": "In monolingual context, this problem is rather well treated by several recent researches (Potthast et al., 2014) ."}, {"id": 2, "string": "Nevertheless, the expansion of the Internet, which facilitates access to documents throughout the world and to increasingly efficient (freely available) machine translation tools, helps to spread cross-language plagiarism."}, {"id": 3, "string": "Cross-language plagiarism means plagiarism by translation, i.e."}, {"id": 4, "string": "a text has been plagiarized while being translated (manually or automatically)."}, {"id": 5, "string": "The challenge in detecting this kind of plagiarism is that the suspicious document is no longer in the same language of its source."}, {"id": 6, "string": "We investigate how distributed representations of words can help to propose new cross-lingual similarity measures, helpful for plagiarism detection."}, {"id": 7, "string": "We use word embeddings (Mikolov et al., 2013) that have shown promising performances for all kinds of NLP tasks, as shown in Upadhyay et al."}, {"id": 8, "string": "(2016) , Ammar et al."}, {"id": 9, "string": "(2016) and Ghannay et al."}, {"id": 10, "string": "(2016) , for instance."}, {"id": 11, "string": "Contributions."}, {"id": 12, "string": "The main contributions of this paper are the following: • we augment some state-of-the-art methods with the use of word embeddings instead of lexical resources; • we introduce a syntax weighting in distributed representations of sentences, and prove its usefulness for textual similarity detection; • we combine our methods to verify their complementarity and finally obtain an overall F 1 score of 89.15% for English-French similarity detection at chunk level (88.5% at sentence level) on a very challenging corpus (mix of Wikipedia, conference papers, product reviews, Europarl and JRC) while the best method alone hardly reaches F 1 score higher than 50%."}, {"id": 13, "string": "Evaluation Conditions Dataset The reference dataset used during our study is the new dataset recently introduced by Ferrero et al."}, {"id": 14, "string": "(2016) 1 ."}, {"id": 15, "string": "The dataset was specially designed for a rigorous evaluation of cross-language textual similarity detection."}, {"id": 16, "string": "More precisely, the characteristics of the dataset are the following: • it is multilingual: it contains French, English and Spanish texts; • it proposes cross-language alignment information at different granularities: document level, sentence level and chunk level; • it is based on both parallel and comparable corpora (mix of Wikipedia, conference papers, product reviews, Europarl and JRC); • it contains both human and machine translated texts; • it contains different percentages of named entities; • part of it has been obfuscated (to make the cross-language similarity detection more complicated) while the rest remains without noise; • the documents were written and translated by multiple types of authors (from average to professionals) and cover various fields."}, {"id": 17, "string": "In this paper, we only use the French and English sub-corpora."}, {"id": 18, "string": "Overview of State-of-the-Art Methods Plagiarism is a statement that someone copied text deliberately without attribution, while these methods only detect textual similarities."}, {"id": 19, "string": "However, textual similarity detection can be used to detect plagiarism."}, {"id": 20, "string": "The aim of cross-language textual similarity detection is to estimate if two textual units in different languages express the same or not."}, {"id": 21, "string": "We quickly review below the state-of-the-art methods used in this paper, for more details, see Ferrero et al."}, {"id": 22, "string": "(2016) ."}, {"id": 23, "string": "Cross-Language Character N-Gram (CL-CnG) is based on Mcnamee and Mayfield (2004) model."}, {"id": 24, "string": "We use the Potthast et al."}, {"id": 25, "string": "(2011) implementation which compares two textual units under their 3-grams vectors representation."}, {"id": 26, "string": "Cross-Language Conceptual Thesaurus-based Similarity (CL-CTS) (Pataki, 2012) aims to measure the semantic similarity using abstract con-cepts from words in textual units."}, {"id": 27, "string": "In our implementation, these concepts are given by a linked lexical resource called DBNary (Sérasset, 2015) ."}, {"id": 28, "string": "Cross-Language Alignment-based Similarity Analysis (CL-ASA) aims to determinate how a textual unit is potentially the translation of another textual unit using bilingual unigram dictionary which contains translations pairs (and their probabilities) extracted from a parallel corpus (Barrón-Cedeño et al."}, {"id": 29, "string": "(2008) , Pinto et al."}, {"id": 30, "string": "(2009) )."}, {"id": 31, "string": "Cross-Language Explicit Semantic Analysis (CL-ESA) is based on the explicit semantic analysis model (Gabrilovich and Markovitch, 2007) , which represents the meaning of a document by a vector based on concepts derived from Wikipedia."}, {"id": 32, "string": "It was reused by Potthast et al."}, {"id": 33, "string": "(2008) in the context of cross-language document retrieval."}, {"id": 34, "string": "Translation + Monolingual Analysis (T+MA) consists in translating the two units into the same language, in order to operate a monolingual comparison between them (Barrón-Cedeño, 2012)."}, {"id": 35, "string": "We use the Muhr et al."}, {"id": 36, "string": "(2010) approach using DBNary (Sérasset, 2015) , followed by monolingual matching based on bags of words."}, {"id": 37, "string": "Evaluation Protocol We apply the same evaluation protocol as in Ferrero et al."}, {"id": 38, "string": "(2016)'s paper."}, {"id": 39, "string": "We build a distance matrix of size N x M , with M = 1,000 and N = |S| where S is the evaluated sub-corpus."}, {"id": 40, "string": "Each textual unit of S is compared to itself (to its corresponding unit in the target language, since this is cross-lingual similarity detection) and to M -1 other units randomly selected from S. The same unit may be selected several times."}, {"id": 41, "string": "Then, a matching score for each comparison performed is obtained, leading to the distance matrix."}, {"id": 42, "string": "Thresholding on the matrix is applied to find the threshold giving the best F 1 score."}, {"id": 43, "string": "The F 1 score is the harmonic mean of precision and recall."}, {"id": 44, "string": "Precision is defined as the proportion of relevant matches (similar cross-language units) retrieved among all the matches retrieved."}, {"id": 45, "string": "Recall is the proportion of relevant matches retrieved among all the relevant matches to retrieve."}, {"id": 46, "string": "Each method is applied on each EN-FR sub-corpus for chunk and sentence granularities."}, {"id": 47, "string": "For each configuration (i.e."}, {"id": 48, "string": "a particular method applied on a particular sub-corpus considering a particular granularity), 10 folds are carried out by changing the M selected units."}, {"id": 49, "string": "Proposed Methods The main idea of word embeddings is that their representation is obtained according to the context (the words around it)."}, {"id": 50, "string": "The words are projected on a continuous space and those with similar context should be close in this multi-dimensional space."}, {"id": 51, "string": "A similarity between two word vectors can be measured by cosine similarity."}, {"id": 52, "string": "So using wordembeddings for plagiarism detection is appealing since they can be used to calculate similarity between sentences in the same or in two different languages (they capture intrinsically synonymy and morphological closeness)."}, {"id": 53, "string": "We use the MultiVec (Berard et al., 2016) toolkit for computing and managing the continuous representations of the texts."}, {"id": 54, "string": "It includes word2vec (Mikolov et al., 2013) , paragraph vector (Le and Mikolov, 2014) and bilingual distributed representations (Luong et al., 2015) features."}, {"id": 55, "string": "The corpus used to build the vectors is the News Commentary 2 parallel corpus."}, {"id": 56, "string": "For training our embeddings, we use CBOW model with a vector size of 100, a window size of 5, a negative sampling parameter of 5, and an alpha of 0.02."}, {"id": 57, "string": "Improving Textual Similarity Using Word Embeddings (CL-CTS-WE and CL-WES) We introduce two new methods."}, {"id": 58, "string": "First, we propose to replace the lexical resource used in CL-CTS (i.e."}, {"id": 59, "string": "DBNary) by distributed representation of words."}, {"id": 60, "string": "We call this new implementation CL-CTS-WE."}, {"id": 61, "string": "More precisely, CL-CTS-WE uses the top 10 closest words in the embeddings model to build the BOW of a word."}, {"id": 62, "string": "Secondly, we implement a more straightforward method (CL-WES), which performs a direct comparison between two sentences in different languages, through the use of word embeddings."}, {"id": 63, "string": "It consists in a cosine similarity on distributed representations of the sentences, which are the summation of the embeddings vectors of each word of the sentences."}, {"id": 64, "string": "Let U a textual unit, the n words of the unit are represented by u i as: U = {u 1 , u 2 , u 3 , ..., u n } (1) If U x and U y are two textual units in two different languages, CL-WES builds their (bilingual) common representation vectors V x and V y and applies a cosine similarity between them."}, {"id": 65, "string": "A distributed representation V of a textual unit U is calculated as follows: V = n i=1 (vector(u i )) (2) where u i is the i th word of the textual unit and vector is the function which gives the word embedding vector of a word."}, {"id": 66, "string": "This feature is available in MultiVec 3 (Berard et al., 2016) ."}, {"id": 67, "string": "Cross-Language Word Embedding-based Syntax Similarity (CL-WESS) Our next innovation is the improvement of CL-WES by introducing a syntax flavour in it."}, {"id": 68, "string": "Let U a textual unit, the n words of the unit are represented by u i as expressed in the formula (1)."}, {"id": 69, "string": "First, we syntactically tag U with a part-of-speech tagger (TreeTagger (Schmid, 1994) ) and we normalize the tags with Universal Tagset of Petrov et al."}, {"id": 70, "string": "(2012) ."}, {"id": 71, "string": "Then, we assign a weight to each type of tag: this weight will be used to compute the final vector representation of the unit."}, {"id": 72, "string": "Finally, we optimize the weights with the help of Condor (Berghen and Bersini, 2005) ."}, {"id": 73, "string": "Condor applies a Newton's method with a trust region algorithm to determinate the weights that optimize the F 1 score."}, {"id": 74, "string": "We use the first two folds of each sub-corpus to determinate the optimal weights."}, {"id": 75, "string": "The formula of the syntactic aggregation is: V = n i=1 (weight(pos(u i )).vector(u i )) (3) where u i is the i th word of the textual unit, pos is the function which gives the universal part-ofspeech tag of a word, weight is the function which gives the weight of a part-of-speech, vector is the function which gives the word embedding vector of a word and ."}, {"id": 76, "string": "is the scalar product."}, {"id": 77, "string": "If U x and U y are two textual units in two different languages, we build their representation vectors V x and V y following the formula (3) instead of (2), and apply a cosine similarity between them."}, {"id": 78, "string": "We call this method CL-WESS and we have implemented it in MultiVec (Berard et al., 2016) ."}, {"id": 79, "string": "It is important to note that, contrarily to what is done in other tasks such as neural parsing (Chen and Manning, 2014) , we did not use POS information as an additional vector input because we considered it would be more useful to use it to weight the contribution of each word to the sentence representation, according to its morpho-syntactic category."}, {"id": 80, "string": "Combining multiple methods Weighted Fusion We try to combine our methods to improve crosslanguage similarity detection performance."}, {"id": 81, "string": "During weighted fusion, we assign one weight to the similarity score of each method and we calculate a (weighted) composite score."}, {"id": 82, "string": "We optimize the distribution of the weights with Condor (Berghen and Bersini, 2005) ."}, {"id": 83, "string": "We use the first two folds of each sub-corpus to determinate the optimal weights, while the other eight folds evaluate the fusion."}, {"id": 84, "string": "We also try an average fusion, i.e."}, {"id": 85, "string": "a weighted fusion where all the weights are equal."}, {"id": 86, "string": "Regardless of their capacity to predict a (mis)match, an interesting feature of the methods is their clustering capacity, i.e."}, {"id": 87, "string": "their ability to correctly separate the positives (similar units) and the negatives (different units) in order to minimize the doubts on the classification."}, {"id": 88, "string": "Distribution histograms on Figure 1 highlight the fact that each method has its own fingerprint."}, {"id": 89, "string": "Even if two methods look equivalent in term of final performance, their distribution can be different."}, {"id": 90, "string": "One explanation is that the methods do not process on the same way."}, {"id": 91, "string": "Some methods are lexical-syntax-based, others process by aligning concepts (more semantic) and still others capture context with word vectors."}, {"id": 92, "string": "For instance, CL-C3G has a narrow distribution of negatives and a broad distribution for positives (Figure 1 (a) ), whereas the opposite is true for CL-ASA (Figure 1 (b) )."}, {"id": 93, "string": "We try to exploit this complementarity using decision tree based fusion."}, {"id": 94, "string": "We use the C4.5 algorithm (Quinlan, 1993) implemented in Weka 3.8.0 (Hall et al., 2009 )."}, {"id": 95, "string": "The first two folds of each sub-corpus are used to determinate the optimal decision tree and the other eight folds to evaluate the fusion (same protocol as weighted fusion)."}, {"id": 96, "string": "While analyzing the trained decision tree, we see that CL-C3G, CL-WESS and CL-CTS-WE are the closest to the root."}, {"id": 97, "string": "This confirms their relevance for similarity detection, as well as their complementarity."}, {"id": 98, "string": "Decision Tree Fusion Results and Discussion Use of word embeddings."}, {"id": 99, "string": "We can see in Table 1 that the use of distributed representation of words instead of lexical resources improves CL-CTS (CL-CTS-WE obtains overall performance gain of +3.83% on chunks and +3.19% on sentences)."}, {"id": 100, "string": "Despite this improvement, CL-CTS-WE remains less efficient than CL-C3G."}, {"id": 101, "string": "While the use of bilingual sentence vector (CL-WES) is simple and elegant, its performance is lower than three state-of-the-art methods."}, {"id": 102, "string": "However, its syntactically weighted version (CL-WESS) looks very promising and boosts the CL-WES overall performance by +11.78% on chunks and +14.92% on sentences."}, {"id": 103, "string": "Thanks to this improvement, CL-WESS is significantly better than CL-C3G (+2.97% on chunks and +7.01% on sentences) and is the best single method evaluated so far on our corpus."}, {"id": 104, "string": "Fusion."}, {"id": 105, "string": "Results of the decision tree fusion are reported at both chunk and sentence level in Table 1."}, {"id": 106, "string": "Weighted and average fusion are only re-  ported at chunk level."}, {"id": 107, "string": "In each case, we combine the 8 previously presented methods (the 5 state-of-the-art and the 3 new methods)."}, {"id": 108, "string": "Weighted fusion outperforms the state-of-the-art and the embedding-based methods in any case."}, {"id": 109, "string": "Nevertheless, fusion based on a decision tree looks much more efficient."}, {"id": 110, "string": "At chunk level, decision tree fusion leads to an overall F 1 score of 89.15% while the precedent best weighted fusion obtains 80.01% and the best single method only obtains 53.73%."}, {"id": 111, "string": "The trend is the same at the sentence level where decision tree fusion largely overpasses any other method (88.50% against 56.35% for the best single method)."}, {"id": 112, "string": "In our evaluation, the best decision tree, for an overall higher than 85% of correct classification on both levels, involves at a minimum CL-C3G, CL-WESS and CL-CTS-WE."}, {"id": 113, "string": "These results confirm that different methods proposed complement each other, and that embeddings are useful for cross-language textual similarity detection."}, {"id": 114, "string": "Conclusion and Perspectives We have augmented several baseline approaches using word embeddings."}, {"id": 115, "string": "The most promising approach is a cosine similarity on syntactically weighted distributed representation of sentence (CL-WESS), which beats in overall the precedent best state-of-the-art method."}, {"id": 116, "string": "Finally, we have also demonstrated that all methods are complementary and their fusion significantly helps crosslanguage textual similarity detection performance."}, {"id": 117, "string": "At chunk level, decision tree fusion leads to an overall F 1 score of 89.15% while the precedent best weighted fusion obtains 80.01% and the best single method only obtains 53.73%."}, {"id": 118, "string": "The trend is the same at the sentence level where decision tree fusion largely overpasses any other method."}, {"id": 119, "string": "Our future short term goal is to work on the improvement of CL-WESS by analyzing the syntactic weights or even adapt them according to the plagiarist's stylometry."}, {"id": 120, "string": "We have also made a submission at the SemEval-2017 Task 1, i.e."}, {"id": 121, "string": "the task on Semantic Textual Similarity detection."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 12}, {"section": "Dataset", "n": "2.1", "start": 13, "end": 17}, {"section": "Overview of State-of-the-Art Methods", "n": "2.2", "start": 18, "end": 36}, {"section": "Evaluation Protocol", "n": "2.3", "start": 37, "end": 48}, {"section": "Proposed Methods", "n": "3", "start": 49, "end": 56}, {"section": "Improving Textual Similarity Using", "n": "3.1", "start": 57, "end": 66}, {"section": "Cross-Language Word Embedding-based Syntax Similarity (CL-WESS)", "n": "3.2", "start": 67, "end": 79}, {"section": "Weighted Fusion", "n": "4.1", "start": 80, "end": 97}, {"section": "Results and Discussion", "n": "5", "start": 98, "end": 113}, {"section": "Conclusion and Perspectives", "n": "6", "start": 114, "end": 121}], "figures": [{"filename": "../figure/image/1235-Table1-1.png", "caption": "Table 1: Average F1 scores and confidence intervals of cross-language similarity detection methods applied on EN→FR sub-corpora – 8 folds validation.", "page": 4, "bbox": {"x1": 78.72, "x2": 519.36, "y1": 62.879999999999995, "y2": 309.12}}, {"filename": "../figure/image/1235-Figure1-1.png", "caption": "Figure 1: Distribution histograms of two state-ofthe-art methods for 1000 positives and 1000 negatives (mis)matches.", "page": 3, "bbox": {"x1": 72.96, "x2": 287.03999999999996, "y1": 394.56, "y2": 725.28}}]}