{"title": "Learning Discourse-level Diversity for Neural Dialog Models using Conditional Variational Autoencoders", "abstract": "While recent neural encoder-decoder models have shown great promise in modeling open-domain conversations, they often generate dull and generic responses. Unlike past work that has focused on diversifying the output of the decoder at word-level to alleviate this problem, we present a novel framework based on conditional variational autoencoders that captures the discourse-level diversity in the encoder. Our model uses latent variables to learn a distribution over potential conversational intents and generates diverse responses using only greedy decoders. We have further developed a novel variant that is integrated with linguistic prior knowledge for better performance. Finally, the training procedure is improved by introducing a bag-of-word loss. Our proposed models have been validated to generate significantly more diverse responses than baseline approaches and exhibit competence in discourse-level decision-making.", "text": [{"id": 0, "string": "Introduction The dialog manager is one of the key components of dialog systems, which is responsible for modeling the decision-making process."}, {"id": 1, "string": "Specifically, it typically takes a new utterance and the dialog context as input, and generates discourse-level decisions (Bohus and Rudnicky, 2003; Williams and Young, 2007) ."}, {"id": 2, "string": "Advanced dialog managers usually have a list of potential actions that enable them to have diverse behavior during a conversation, e.g."}, {"id": 3, "string": "different strategies to recover from non-understanding ."}, {"id": 4, "string": "However, the conventional approach of designing a dialog manager (Williams and Young, 2007) does not scale well to open-domain conversation models because of the vast quantity of possible decisions."}, {"id": 5, "string": "Thus, there has been a growing interest in applying encoder-decoder models  for modeling open-domain conversation (Vinyals and Le, 2015; Serban et al., 2016a) ."}, {"id": 6, "string": "The basic approach treats a conversation as a transduction task, in which the dialog history is the source sequence and the next response is the target sequence."}, {"id": 7, "string": "The model is then trained end-to-end on large conversation corpora using the maximum-likelihood estimation (MLE) objective without the need for manual crafting."}, {"id": 8, "string": "However recent research has found that encoder-decoder models tend to generate generic and dull responses (e.g., I don't know), rather than meaningful and specific answers (Li et al., 2015; Serban et al., 2016b) ."}, {"id": 9, "string": "There have been many attempts to explain and solve this limitation, and they can be broadly divided into two categories (see Section 2 for details): (1) the first category argues that the dialog history is only one of the factors that decide the next response."}, {"id": 10, "string": "Other features should be extracted and provided to the models as conditionals in order to generate more specific responses (Xing et al., 2016; Li et al., 2016a) ; (2) the second category aims to improve the encoder-decoder model itself, including decoding with beam search and its variations (Wiseman and Rush, 2016) , encouraging responses that have long-term payoff (Li et al., 2016b) , etc."}, {"id": 11, "string": "Building upon the past work in dialog managers and encoder-decoder models, the key idea of this paper is to model dialogs as a one-to-many problem at the discourse level."}, {"id": 12, "string": "Previous studies indicate that there are many factors in open-domain dialogs that decide the next response, and it is nontrivial to extract all of them."}, {"id": 13, "string": "Intuitively, given a similar dialog history (and other observed inputs), there may exist many valid responses (at the discourse-level), each corresponding to a certain configuration of the latent variables that are not presented in the input."}, {"id": 14, "string": "To uncover the potential responses, we strive to model a probabilistic distribution over the distributed utterance embeddings of the potential responses using a latent variable ( Figure 1 )."}, {"id": 15, "string": "This allows us to generate diverse responses by drawing samples from the learned distribution and reconstruct their words via a decoder neural network."}, {"id": 16, "string": "Specifically, our contributions are three-fold: 1."}, {"id": 17, "string": "We present a novel neural dialog model adapted from conditional variational autoencoders (CVAE) , which introduces a latent variable that can capture discourse-level variations as described above 2."}, {"id": 18, "string": "We propose Knowledge-Guided CVAE (kgC-VAE), which enables easy integration of expert knowledge and results in performance improvement and model interpretability."}, {"id": 19, "string": "3."}, {"id": 20, "string": "We develop a training method in addressing the difficulty of optimizing CVAE for natural language generation (Bowman et al., 2015) ."}, {"id": 21, "string": "We evaluate our models on human-human conversation data and yield promising results in: (a) generating appropriate and discourse-level diverse responses, and (b) showing that the proposed training method is more effective than the previous techniques."}, {"id": 22, "string": "Related Work Our work is related to both recent advancement in encoder-decoder dialog models and generative models based on CVAE."}, {"id": 23, "string": "Encoder-decoder Dialog Models Since the emergence of the neural dialog model, the problem of output diversity has received much attention in the research community."}, {"id": 24, "string": "Ideal output responses should be both coherent and diverse."}, {"id": 25, "string": "However, most models end up with generic and dull responses."}, {"id": 26, "string": "To tackle this problem, one line of research has focused on augmenting the input of encoder-decoder models with richer context information, in order to generate more spe-cific responses."}, {"id": 27, "string": "Li et al., (2016a) captured speakers' characteristics by encoding background information and speaking style into the distributed embeddings, which are used to re-rank the generated response from an encoder-decoder model."}, {"id": 28, "string": "Xing et al., (2016) maintain topic encoding based on Latent Dirichlet Allocation (LDA) (Blei et al., 2003) of the conversation to encourage the model to output more topic coherent responses."}, {"id": 29, "string": "On the other hand, many attempts have also been made to improve the architecture of encoderdecoder models."}, {"id": 30, "string": "Li et al,."}, {"id": 31, "string": "(2015) proposed to optimize the standard encoder-decoder by maximizing the mutual information between input and output, which in turn reduces generic responses."}, {"id": 32, "string": "This approach penalized unconditionally high frequency responses, and favored responses that have high conditional probability given the input."}, {"id": 33, "string": "Wiseman and Rush (2016) focused on improving the decoder network by alleviating the biases between training and testing."}, {"id": 34, "string": "They introduced a searchbased loss that directly optimizes the networks for beam search decoding."}, {"id": 35, "string": "The resulting model achieves better performance on word ordering, parsing and machine translation."}, {"id": 36, "string": "Besides improving beam search, Li et al., (2016b) pointed out that the MLE objective of an encoder-decoder model is unable to approximate the real-world goal of the conversation."}, {"id": 37, "string": "Thus, they initialized a encoderdecoder model with MLE objective and leveraged reinforcement learning to fine tune the model by optimizing three heuristic rewards functions: informativity, coherence, and ease of answering."}, {"id": 38, "string": "Conditional Variational Autoencoder The variational autoencoder (VAE) (Kingma and Welling, 2013; Rezende et al., 2014) is one of the most popular frameworks for image generation."}, {"id": 39, "string": "The basic idea of VAE is to encode the input x into a probability distribution z instead of a point encoding in the autoencoder."}, {"id": 40, "string": "Then VAE applies a decoder network to reconstruct the original input using samples from z."}, {"id": 41, "string": "To generate images, VAE first obtains a sample of z from the prior distribution, e.g."}, {"id": 42, "string": "N (0, I), and then produces an image via the decoder network."}, {"id": 43, "string": "A more advanced model, the conditional VAE (CVAE), is a recent modification of VAE to generate diverse images conditioned on certain attributes, e.g."}, {"id": 44, "string": "generating different human faces given skin color ."}, {"id": 45, "string": "Inspired by CVAE, we view the dialog contexts as the conditional attributes and adapt CVAE to generate diverse responses instead of images."}, {"id": 46, "string": "Although VAE/CVAE has achieved impressive results in image generation, adapting this to natural language generators is non-trivial."}, {"id": 47, "string": "Bowman et al., (2015) have used VAE with Long-Short Term Memory (LSTM)-based recognition and decoder networks to generate sentences from a latent Gaussian variable."}, {"id": 48, "string": "They showed that their model is able to generate diverse sentences with even a greedy LSTM decoder."}, {"id": 49, "string": "They also reported the difficulty of training because the LSTM decoder tends to ignore the latent variable."}, {"id": 50, "string": "We refer to this issue as the vanishing latent variable problem."}, {"id": 51, "string": "Serban et al., (2016b) have applied a latent variable hierarchical encoder-decoder dialog model to introduce utterance-level variations and facilitate longer responses."}, {"id": 52, "string": "To improve upon the past models, we firstly introduce a novel mechanism to leverage linguistic knowledge in training end-to-end neural dialog models, and we also propose a novel training technique that mitigates the vanishing latent variable problem."}, {"id": 53, "string": "Proposed Models Conditional Variational Autoencoder (CVAE) for Dialog Generation Each dyadic conversation can be represented via three random variables: the dialog context c (context window size k − 1), the response utterance x (the k th utterance) and a latent variable z, which is used to capture the latent distribution over the valid responses."}, {"id": 54, "string": "Further, c is composed of the dialog history: the preceding k-1 utterances; conversational floor (1 if the utterance is from the same speaker of x, otherwise 0) and meta features m (e.g."}, {"id": 55, "string": "the topic)."}, {"id": 56, "string": "We then define the conditional distribution p(x, z|c) = p(x|z, c)p(z|c) and our goal is to use deep neural networks (parametrized by θ) to approximate p(z|c) and p(x|z, c)."}, {"id": 57, "string": "We refer to p θ (z|c) as the prior network and p θ (x, |z, c) as the response decoder."}, {"id": 58, "string": "Then the generative process of x is (Figure 2 (a)): 1."}, {"id": 59, "string": "Sample a latent variable z from the prior network p θ (z|c)."}, {"id": 60, "string": "2."}, {"id": 61, "string": "Generate x through the response decoder p θ (x|z, c)."}, {"id": 62, "string": "CVAE is trained to maximize the conditional log likelihood of x given c, which involves an intractable marginalization over the latent variable z."}, {"id": 63, "string": "As proposed in , CVAE can be efficiently trained with the Stochastic Gradient Variational Bayes (SGVB) framework (Kingma and Welling, 2013) by maximizing the variational lower bound of the conditional log likelihood."}, {"id": 64, "string": "We assume the z follows multivariate Gaussian distribution with a diagonal covariance matrix and introduce a recognition network q φ (z|x, c) to approximate the true posterior distribution p(z|x, c)."}, {"id": 65, "string": "have shown that the variational lower bound can be written as: Figure 3 demonstrates an overview of our model."}, {"id": 66, "string": "The utterance encoder is a bidirectional recurrent neural network (BRNN) (Schuster and Paliwal, 1997) with a gated recurrent unit (GRU) (Chung et al., 2014) to encode each utterance into fixedsize vectors by concatenating the last hidden states of the forward and backward RNN u L(θ, φ; x, c) = −KL(q φ (z|x, c) p θ (z|c)) + E q φ (z|c,x) [log p θ (x|z, c)] (1) ≤ log p(x|c) i = [ h i , h i ]."}, {"id": 67, "string": "x is simply u k ."}, {"id": 68, "string": "The context encoder is a 1-layer GRU network that encodes the preceding k-1 utterances by taking u 1:k−1 and the corresponding conversation floor as inputs."}, {"id": 69, "string": "The last hidden state h c of the context encoder is concatenated with meta features and c = [h c , m]."}, {"id": 70, "string": "Since we assume z follows isotropic Gaussian distribution, the recognition network q φ (z|x, c) ∼ N (µ, σ 2 I) and the prior network p θ (z|c) ∼ N (µ , σ 2 I), and then we have: µ log(σ 2 ) = W r x c + b r (2) µ log(σ 2 ) = MLP p (c) (3) We then use the reparametrization trick (Kingma and Welling, 2013) to obtain samples of z either from N (z; µ, σ 2 I) predicted by the recognition network (training) or N (z; µ , σ 2 I) predicted by the prior network (testing)."}, {"id": 71, "string": "Finally, the response decoder is a 1-layer GRU network with initial state s 0 = W i [z, c]+b i ."}, {"id": 72, "string": "The response decoder then predicts the words in x sequentially."}, {"id": 73, "string": "Knowledge-Guided CVAE (kgCVAE) In practice, training CVAE is a challenging optimization problem and often requires large amount of data."}, {"id": 74, "string": "On the other hand, past research in spoken dialog systems and discourse analysis has suggested that many linguistic cues capture crucial features in representing natural conversation."}, {"id": 75, "string": "For example, dialog acts (Poesio and Traum, 1998) have been widely used in the dialog managers (Litman and Allen, 1987; Raux et al., 2005; Zhao and Eskenazi, 2016) to represent the propositional function of the system."}, {"id": 76, "string": "Therefore, we conjecture that it will be beneficial for the model to learn meaningful latent z if it is provided with explicitly extracted discourse features during the training."}, {"id": 77, "string": "In order to incorporate the linguistic features into the basic CVAE model, we first denote the set of linguistic features as y."}, {"id": 78, "string": "Then we assume that the generation of x depends on c, z and y. y relies on z and c as shown in Figure 2 ."}, {"id": 79, "string": "Specifically, during training the initial state of the response decoder is s 0 = W i [z, c, y] + b i and the input at every step is [e t , y] where e t is the word embedding of t th word in x."}, {"id": 80, "string": "In addition, there is an MLP to predict y = MLP y (z, c) based on z and c. In the testing stage, the predicted y is used by the response decoder instead of the oracle decoders."}, {"id": 81, "string": "We denote the modified model as knowledge-guided CVAE (kgCVAE) and developers can add desired discourse features that they wish the latent variable z to capture."}, {"id": 82, "string": "KgCVAE model is trained by maximizing: L(θ, φ; x, c, y) = −KL(q φ (z|x, c, y) P θ (z|c)) + E q φ (z|c,x,y) [log p(x|z, c, y)] + E q φ (z|c,x,y) [log p(y|z, c)] (4) Since now the reconstruction of y is a part of the loss function, kgCVAE can more efficiently encode y-related information into z than discovering it only based on the surface-level x and c. Another advantage of kgCVAE is that it can output a highlevel label (e.g."}, {"id": 83, "string": "dialog act) along with the wordlevel responses, which allows easier interpretation of the model's outputs."}, {"id": 84, "string": "Optimization Challenges A straightforward VAE with RNN decoder fails to encode meaningful information in z due to the vanishing latent variable problem (Bowman et al., 2015) ."}, {"id": 85, "string": "Bowman et al., (2015) proposed two solutions: (1) KL annealing: gradually increasing the weight of the KL term from 0 to 1 during training; (2) word drop decoding: setting a certain percentage of the target words to 0."}, {"id": 86, "string": "We found that CVAE suffers from the same issue when the decoder is an RNN."}, {"id": 87, "string": "Also we did not consider word drop decoding because Bowman et al,."}, {"id": 88, "string": "(2015) have shown that it may hurt the performance when the drop rate is too high."}, {"id": 89, "string": "As a result, we propose a simple yet novel technique to tackle the vanishing latent variable problem: bag-of-word loss."}, {"id": 90, "string": "The idea is to introduce an auxiliary loss that requires the decoder network to predict the bag-of-words in the response x as shown in Figure 3 (b)."}, {"id": 91, "string": "We decompose x into two variables: x o with word order and x bow without order, and assume that x o and x bow are conditionally independent given z and c: p(x, z|c) = p(x o |z, c)p(x bow |z, c)p(z|c)."}, {"id": 92, "string": "Due to the conditional independence assumption, the latent variable is forced to capture global information about the target response."}, {"id": 93, "string": "Let f = MLP b (z, x) ∈ R V where V is vocabulary size, and we have: log p(x bow |z, c) = log |x| t=1 e fx t V j e f j (5) where |x| is the length of x and x t is the word index of t th word in x."}, {"id": 94, "string": "The modified variational lower bound for CVAE with bag-of-word loss is (see Appendix A for kgCVAE): L (θ, φ; x, c) = L(θ, φ; x, c) + E q φ (z|c,x,y) [log p(x bow |z, c)] (6) We will show that the bag-of-word loss in Equation 6 is very effective against the vanishing latent variable and it is also complementary to the KL annealing technique."}, {"id": 95, "string": "Experiment Setup Dataset We chose the Switchboard (SW) 1 Release 2 Corpus (Godfrey and Holliman, 1997) to evaluate the proposed models."}, {"id": 96, "string": "SW has 2400 two-sided telephone conversations with manually transcribed speech and alignment."}, {"id": 97, "string": "In the beginning of the call, a computer operator gave the callers recorded prompts that define the desired topic of discussion."}, {"id": 98, "string": "There are 70 available topics."}, {"id": 99, "string": "We randomly split the data into 2316/60/62 dialogs for train/validate/test."}, {"id": 100, "string": "The pre-processing includes (1) tokenize using the NLTK tokenizer (Bird et al., 2009 ); (2) remove non-verbal symbols and repeated words due to false starts; (3) keep the top 10K frequent word types as the vocabulary."}, {"id": 101, "string": "The final data have 207, 833/5, 225/5, 481 (c, x) pairs for train/validate/test."}, {"id": 102, "string": "Furthermore, a subset of SW was manually labeled with dialog acts (Stolcke et al., 2000) ."}, {"id": 103, "string": "We extracted dialog act labels based on the dialog act recognizer proposed in (Ribeiro et al., 2015) ."}, {"id": 104, "string": "The features include the uni-gram and bi-gram of the utterance, and the contextual features of the last 3 utterances."}, {"id": 105, "string": "We trained a Support Vector Machine (SVM) (Suykens and Vandewalle, 1999) with linear kernel on the subset of SW with human annotations."}, {"id": 106, "string": "There are 42 types of dialog acts and the SVM achieved 77.3% accuracy on held-out data."}, {"id": 107, "string": "Then the rest of SW data are labelled with dialog acts using the trained SVM dialog act recognizer."}, {"id": 108, "string": "Training We trained with the following hyperparameters (according to the loss on the validate dataset): word embedding has size 200 and is shared across everywhere."}, {"id": 109, "string": "We initialize the word embedding from Glove embedding pre-trained on Twitter (Pennington et al., 2014) ."}, {"id": 110, "string": "The utterance encoder has a hidden size of 300 for each direction."}, {"id": 111, "string": "The context encoder has a hidden size of 600 and the response decoder has a hidden size of 400."}, {"id": 112, "string": "The prior network and the MLP for predicting y both have 1 hidden layer of size 400 and tanh non-linearity."}, {"id": 113, "string": "The latent variable z has a size of 200."}, {"id": 114, "string": "The context window k is 10."}, {"id": 115, "string": "All the initial weights are sampled from a uniform distribution [-0.08, 0.08]."}, {"id": 116, "string": "The mini-batch size is 30."}, {"id": 117, "string": "The models are trained end-to-end using the Adam optimizer (Kingma and Ba, 2014) with a learning rate of 0.001 and gradient clipping at 5."}, {"id": 118, "string": "We selected the best models based on the variational lower bound on the validate data."}, {"id": 119, "string": "Finally, we use the BOW loss along with KL annealing of 10,000 batches to achieve the best performance."}, {"id": 120, "string": "Section 5.4 gives a detailed argument for the importance of the BOW loss."}, {"id": 121, "string": "Results Experiments Setup We compared three neural dialog models: a strong baseline model, CVAE, and kgCVAE."}, {"id": 122, "string": "The baseline model is an encoder-decoder neural dialog model without latent variables similar to (Serban et al., 2016a) ."}, {"id": 123, "string": "The baseline model's encoder uses the same context encoder to encode the dialog history and the meta features as shown in Figure 3 ."}, {"id": 124, "string": "The encoded context c is directly fed into the decoder networks as the initial state."}, {"id": 125, "string": "The hyperparameters of the baseline are the same as the ones reported in Section 4.2 and the baseline is trained to minimize the standard cross entropy loss of the decoder RNN model without any auxiliary loss."}, {"id": 126, "string": "Also, to compare the diversity introduced by the stochasticity in the proposed latent variable versus the softmax of RNN at each decoding step, we generate N responses from the baseline by sam-pling from the softmax."}, {"id": 127, "string": "For CVAE/kgCVAE, we sample N times from the latent z and only use greedy decoders so that the randomness comes entirely from the latent variable z. Quantitative Analysis Automatically evaluating an open-domain generative dialog model is an open research challenge ."}, {"id": 128, "string": "Following our one-tomany hypothesis, we propose the following metrics."}, {"id": 129, "string": "We assume that for a given dialog context c, there exist M c reference responses r j , j ∈ [1, M c ]."}, {"id": 130, "string": "Meanwhile a model can generate N hypothesis re- sponses h i , i ∈ [1, N ]."}, {"id": 131, "string": "The generalized responselevel precision/recall for a given dialog context is: precision(c) = N i=1 max j∈[1,Mc] d(r j , h i ) N recall(c) = Mc j=1 max i∈[1,N ] d(r j , h i )) M c where d(r j , h i ) is a distance function which lies between 0 to 1 and measures the similarities between r j and h i ."}, {"id": 132, "string": "The final score is averaged over the entire test dataset and we report the performance with 3 types of distance functions in order to evaluate the systems from various linguistic points of view: Smoothed Sentence-level BLEU (Chen and Cherry, 2014): BLEU is a popular metric that measures the geometric mean of modified ngram precision with a length penalty (Papineni et al., 2002; Li et al., 2015) ."}, {"id": 133, "string": "We use BLEU-1 to 4 as our lexical similarity metric and normalize the score to 0 to 1 scale."}, {"id": 134, "string": "Cosine Distance of Bag-of-word Embedding: a simple method to obtain sentence embeddings is to take the average or extrema of all the word embeddings in the sentences (Forgues et al., 2014; Adi et al., 2016) ."}, {"id": 135, "string": "The d(r j , h i ) is the cosine distance of the two embedding vectors."}, {"id": 136, "string": "We used Glove embedding described in Section 4 and denote the average method as A-bow and extrema method as E-bow."}, {"id": 137, "string": "3."}, {"id": 138, "string": "Dialog Act Match: to measure the similarity at the discourse level, the same dialogact tagger from 4.1 is applied to label all the generated responses of each model."}, {"id": 139, "string": "We set d(r j , h i ) = 1 if r j and h i have the same dialog acts, otherwise d(r j , h i ) = 0."}, {"id": 140, "string": "One challenge of using the above metrics is that there is only one, rather than multiple reference responses/contexts."}, {"id": 141, "string": "This impacts reliability of our measures."}, {"id": 142, "string": "Inspired by (Sordoni et al., 2015) , we utilized information retrieval techniques (see Appendix A) to gather 10 extra candidate reference responses/context from other conversations with the same topics."}, {"id": 143, "string": "Then the 10 candidate references are filtered by two experts, which serve as the ground truth to train the reference response classifier."}, {"id": 144, "string": "The result is 6.69 extra references in average per context."}, {"id": 145, "string": "The average number of distinct reference dialog acts is 4.2."}, {"id": 146, "string": "Table 1 The proposed models outperform the baseline in terms of recall in all the metrics with statistical significance."}, {"id": 147, "string": "This confirms our hypothesis that generating responses with discourse-level diversity can lead to a more comprehensive coverage of the potential responses than promoting only word-level diversity."}, {"id": 148, "string": "As for precision, we observed that the baseline has higher or similar scores than CVAE in all metrics, which is expected since the baseline tends to generate the mostly likely and safe responses repeatedly in the N hypotheses."}, {"id": 149, "string": "However, kgCVAE is able to achieve the highest precision and recall in the 4 metrics at the same time (BLEU1-4, E-BOW)."}, {"id": 150, "string": "One reason for kgCVAE's good performance is that the predicted dialog act label in kgCVAE can regularize the generation process of its RNN decoder by forcing it to generate more coherent and precise words."}, {"id": 151, "string": "We further analyze the precision/recall of BLEU-4 by looking at the average score versus the number of distinct reference dialog acts."}, {"id": 152, "string": "A low number of distinct dialog acts represents the situation where the dialog context has a strong constraint on the range of the next response (low entropy), while a high number indicates the opposite (highentropy)."}, {"id": 153, "string": "Figure 4 shows that CVAE/kgCVAE achieves significantly higher recall than the baseline in higher entropy contexts."}, {"id": 154, "string": "Also it shows that CVAE suffers from lower precision, especially in low entropy contexts."}, {"id": 155, "string": "Finally, kgCVAE gets higher precision than both the baseline and CVAE in the full spectrum of context entropy."}, {"id": 156, "string": "Table 2 shows the outputs generated from the baseline and kgCVAE."}, {"id": 157, "string": "In example 1, caller A begins with an open-ended question."}, {"id": 158, "string": "The kgCVAE model generated highly diverse answers that cover multiple plausible dialog acts."}, {"id": 159, "string": "Further, we notice that the generated text exhibits similar dialog acts compared to the ones predicted separately by the model, implying the consistency of natural language generation based on y."}, {"id": 160, "string": "On the contrary, the responses from the baseline model are limited to local n-gram variations and share a similar prefix, i.e."}, {"id": 161, "string": "\"I'm\"."}, {"id": 162, "string": "Example 2 is a situation where caller A is telling B stories."}, {"id": 163, "string": "The ground truth response is a back-channel and the range of valid answers is more constrained than example 1 since B is playing the role of a listener."}, {"id": 164, "string": "The baseline successfully predicts \"uh-huh\"."}, {"id": 165, "string": "The kgCVAE model is also able to generate various ways of back-channeling."}, {"id": 166, "string": "This implies that the latent z is able to capture context-sensitive variations, i.e."}, {"id": 167, "string": "in low-entropy dialog contexts modeling lexical diversity while in high-entropy ones modeling discourse-level diversity."}, {"id": 168, "string": "Moreover, kgCVAE is occasionally able to generate more sophisticated grounding (sample 4) beyond a simple back-channel, which is also an acceptable response given the dialog context."}, {"id": 169, "string": "Qualitative Analysis In addition, past work (Kingma and Welling, 2013) has shown that the recognition network is able to learn to cluster high-dimension data, so we conjecture that posterior z outputted from the recognition network should cluster the responses into meaningful groups."}, {"id": 170, "string": "Figure 5 visualizes the posterior z of responses in the test dataset in 2D space using t-SNE (Maaten and Hinton, 2008) ."}, {"id": 171, "string": "We found that the learned latent space is highly correlated with the dialog act and length of responses, which confirms our assumption."}, {"id": 172, "string": "Results for Bag-of-Word Loss Finally, we evaluate the effectiveness of bag-ofword (BOW) loss for training VAE/CVAE with the RNN decoder."}, {"id": 173, "string": "To compare with past work (Bowman et al., 2015) , we conducted the same language modelling (LM) task on Penn Treebank using VAE."}, {"id": 174, "string": "The network architecture is same except we use GRU instead of LSTM."}, {"id": 175, "string": "We compared four different training setups: (1) standard VAE without any heuristics; (2) VAE with KL annealing (KLA); (3) VAE with BOW loss; (4) VAE with both BOW loss and KLA."}, {"id": 176, "string": "Intuitively, a well trained model should lead to a low reconstruction loss and small but non-trivial KL cost."}, {"id": 177, "string": "For all models with KLA, the KL weight increases linearly from 0 to 1 in the first 5000 batches."}, {"id": 178, "string": "Table 3 shows the reconstruction perplexity and the KL cost on the test dataset."}, {"id": 179, "string": "The standard VAE fails to learn a meaningful latent variable by hav- Table 2 : Generated responses from the baselines and kgCVAE in two examples."}, {"id": 180, "string": "KgCVAE also provides the predicted dialog act for each response."}, {"id": 181, "string": "The context only shows the last utterance due to space limit (the actual context window size is 10)."}, {"id": 182, "string": "ing a KL cost close to 0 and a reconstruction perplexity similar to a small LSTM LM (Zaremba et al., 2014) ."}, {"id": 183, "string": "KLA helps to improve the reconstruction loss, but it requires early stopping since the models will fall back to the standard VAE after the KL weight becomes 1."}, {"id": 184, "string": "At last, the models with BOW loss achieved significantly lower perplexity and larger KL cost."}, {"id": 185, "string": "Figure 6 visualizes the evolution of the KL cost."}, {"id": 186, "string": "We can see that for the standard model, the KL cost crashes to 0 at the beginning of training and never recovers."}, {"id": 187, "string": "On the contrary, the model with only KLA learns to encode substantial information in latent z when the KL cost weight is small."}, {"id": 188, "string": "However, after the KL weight is increased to 1 (after 5000 batch), the model once again decides to ignore the latent z and falls back to the naive implementation."}, {"id": 189, "string": "The model with BOW loss, however, consistently converges to a non-trivial KL cost even without KLA, which confirms the importance of BOW loss for training latent variable models with the RNN decoder."}, {"id": 190, "string": "Last but not least, our experiments showed that the conclusions drawn from LM using VAE also apply to training CVAE/kgCVAE, so we used BOW loss together with KLA for all previous experiments."}, {"id": 191, "string": "Conclusion and Future Work In conclusion, we identified the one-to-many nature of open-domain conversation and proposed two novel models that show superior performance in generating diverse and appropriate responses at the discourse level."}, {"id": 192, "string": "While the current paper addresses diversifying responses in respect to dialogue acts, this work is part of a larger research direction that targets leveraging both past linguistic findings and the learning power of deep neural networks to learn better representation of the latent factors in dialog."}, {"id": 193, "string": "In turn, the output of this novel neural dialog model will be easier to explain and control by humans."}, {"id": 194, "string": "In addition to dialog acts, we plan to apply our kgCVAE model to capture other different linguistic phenomena including sentiment, named entities,etc."}, {"id": 195, "string": "Last but not least, the recognition network in our model will serve as the foundation for designing a datadriven dialog manager, which automatically discovers useful high-level intents."}, {"id": 196, "string": "All of the above suggest a promising research direction."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 21}, {"section": "Related Work", "n": "2", "start": 22, "end": 22}, {"section": "Encoder-decoder Dialog Models", "n": "2.1", "start": 23, "end": 37}, {"section": "Conditional Variational Autoencoder", "n": "2.2", "start": 38, "end": 52}, {"section": "Conditional Variational Autoencoder (CVAE) for Dialog Generation", "n": "3.1", "start": 53, "end": 72}, {"section": "Knowledge-Guided CVAE (kgCVAE)", "n": "3.2", "start": 73, "end": 83}, {"section": "Optimization Challenges", "n": "3.3", "start": 84, "end": 94}, {"section": "Dataset", "n": "4.1", "start": 95, "end": 107}, {"section": "Training", "n": "4.2", "start": 108, "end": 120}, {"section": "Experiments Setup", "n": "5.1", "start": 121, "end": 126}, {"section": "Quantitative Analysis", "n": "5.2", "start": 127, "end": 131}, {"section": "Smoothed Sentence-level BLEU (Chen and", "n": "1.", "start": 132, "end": 133}, {"section": "Cosine", "n": "2.", "start": 134, "end": 168}, {"section": "Qualitative Analysis", "n": "5.3", "start": 169, "end": 171}, {"section": "Results for Bag-of-Word Loss", "n": "5.4", "start": 172, "end": 190}, {"section": "Conclusion and Future Work", "n": "6", "start": 191, "end": 196}], "figures": [{"filename": "../figure/image/1263-Table1-1.png", "caption": "Table 1: Performance of each model on automatic measures. The highest score in each row is in bold. Note that our BLEU scores are normalized to [0, 1].", "page": 5, "bbox": {"x1": 309.59999999999997, "x2": 523.68, "y1": 262.56, "y2": 498.24}}, {"filename": "../figure/image/1263-Figure1-1.png", "caption": "Figure 1: Given A’s question, there exists many valid responses from B for different assumptions of the latent variables, e.g., B’s hobby.", "page": 1, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 207.84, "y2": 256.32}}, {"filename": "../figure/image/1263-Figure4-1.png", "caption": "Figure 4: BLEU-4 precision/recall vs. the number of distinct reference dialog acts.", "page": 6, "bbox": {"x1": 74.88, "x2": 287.03999999999996, "y1": 318.71999999999997, "y2": 384.96}}, {"filename": "../figure/image/1263-Figure5-1.png", "caption": "Figure 5: t-SNE visualization of the posterior z for test responses with top 8 frequent dialog acts. The size of circle represents the response length.", "page": 6, "bbox": {"x1": 312.0, "x2": 521.28, "y1": 263.52, "y2": 431.03999999999996}}, {"filename": "../figure/image/1263-Figure2-1.png", "caption": "Figure 2: Graphical models of CVAE (a) and kgCVAE (b)", "page": 2, "bbox": {"x1": 78.72, "x2": 284.15999999999997, "y1": 394.56, "y2": 478.08}}, {"filename": "../figure/image/1263-Table2-1.png", "caption": "Table 2: Generated responses from the baselines and kgCVAE in two examples. KgCVAE also provides the predicted dialog act for each response. The context only shows the last utterance due to space limit (the actual context window size is 10).", "page": 7, "bbox": {"x1": 72.96, "x2": 524.64, "y1": 63.839999999999996, "y2": 226.07999999999998}}, {"filename": "../figure/image/1263-Table3-1.png", "caption": "Table 3: The reconstruction perplexity and KL terms on Penn Treebank test set.", "page": 7, "bbox": {"x1": 73.92, "x2": 288.47999999999996, "y1": 412.8, "y2": 483.35999999999996}}, {"filename": "../figure/image/1263-Figure6-1.png", "caption": "Figure 6: The value of the KL divergence during training with different setups on Penn Treebank.", "page": 7, "bbox": {"x1": 313.92, "x2": 519.36, "y1": 291.84, "y2": 403.2}}, {"filename": "../figure/image/1263-Figure3-1.png", "caption": "Figure 3: The neural network architectures for the baseline and the proposed CVAE/kgCVAE models.⊕ denotes the concatenation of the input vectors. The dashed blue connections only appear in kgCVAE.", "page": 3, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 61.44, "y2": 237.12}}]}