{"title": "Tackling the Story Ending Biases in The Story Cloze Test", "abstract": "The Story Cloze Test (SCT) is a recent framework for evaluating story comprehension and script learning. There have been a variety of models tackling the SCT so far. Although the original goal behind the SCT was to require systems to perform deep language understanding and commonsense reasoning for successful narrative understanding, some recent models could perform significantly better than the initial baselines by leveraging human-authorship biases discovered in the SCT dataset. In order to shed some light on this issue, we have performed various data analysis and analyzed a variety of top performing models presented for this task. Given the statistics we have aggregated, we have designed a new crowdsourcing scheme that creates a new SCT dataset, which overcomes some of the biases. We benchmark a few models on the new dataset and show that the topperforming model on the original SCT dataset fails to keep up its performance. Our findings further signify the importance of benchmarking NLP systems on various evolving test sets.", "text": [{"id": 0, "string": "Introduction Story comprehension has been one of the longestrunning ambitions in artificial intelligence (Dijk, 1980; Charniak, 1972) ."}, {"id": 1, "string": "One of the challenges in expanding the field had been the lack of a solid evaluation framework and datasets on which comprehension models can be trained and tested."}, {"id": 2, "string": "Mostafazadeh et al."}, {"id": 3, "string": "(2016) introduced the Story Cloze Test (SCT) evaluation framework to address * This work was performed at University of Rochester."}, {"id": 4, "string": "this issue."}, {"id": 5, "string": "This test evaluates a story comprehension system where the system is given a foursentence short story as the 'context' and two alternative endings and to the story, labeled 'right ending' and 'wrong ending.'"}, {"id": 6, "string": "Then, the system's task is to choose the right ending."}, {"id": 7, "string": "In order to support this task, Mostafazadeh et al."}, {"id": 8, "string": "also provide the ROC Stories dataset, which is a collection of crowd-sourced complete five sentence stories through Amazon Mechanical Turk (MTurk)."}, {"id": 9, "string": "Each story follows a character through a fairly simple series of events to a conclusion."}, {"id": 10, "string": "Several shallow and neural models, including the state-of-the-art script learning approaches, were presented as baselines (Mostafazadeh et al., 2016) for tackling the task, where they show that all their models perform only slightly better than a random baseline suggesting that richer models are required for tackling this task."}, {"id": 11, "string": "A variety of new systems were proposed (Mihaylov and Frank, 2017; Schenk and Chiarcos, 2017; Schwartz et al., 2017b; Roemmele et al., 2017) as a part of the first shared task on SCT at LSDSem'17 workshop (Mostafazadeh et al., 2017) ."}, {"id": 12, "string": "Surprisingly, one of the models made a staggering improvement of 15% to the accuracy, partially due to using stylistic features isolated in the ending choices (Schwartz et al., 2017b) , discarding the narrative context."}, {"id": 13, "string": "Clearly, this success does not seem to reflect the intent of the original task, where the systems should leverage narrative understanding as opposed to the statistical biases in the data."}, {"id": 14, "string": "In this paper, we study the effect of such biases between the ending choices and present a new scheme to reduce such stylistic artifacts."}, {"id": 15, "string": "The contribution of this paper is threefold: (1) we provide an extensive analysis of the SCT dataset to shed some light on the ending data characteristics (Section 3) (2) we develop a new strong classifier for tackling the SCT that uses a variety Context Right Ending Wrong Ending Ramona was very unhappy in her job."}, {"id": 16, "string": "She asked for a raise, but was denied."}, {"id": 17, "string": "The refusal prompted her to aggressively comb the want ads."}, {"id": 18, "string": "She found an interesting new possibility and set up an interview."}, {"id": 19, "string": "She was offered the new job at a higher salary."}, {"id": 20, "string": "Ramona had no reason to want to change jobs anymore."}, {"id": 21, "string": "The teacher was walking with a stack of papers."}, {"id": 22, "string": "Outside started to rain."}, {"id": 23, "string": "When the teacher tried to walk down a few steps, she ended up falling."}, {"id": 24, "string": "The papers flew out of her hands and landed on the ground."}, {"id": 25, "string": "A passer-by helped her up and helped her collect the papers."}, {"id": 26, "string": "The teacher got up and walked home leaving the papers behind."}, {"id": 27, "string": "(Chaturvedi et al., 2017) fails to keep up the performance on our new dataset."}, {"id": 28, "string": "We discuss the implications of this experiment to the greater research community in terms of data collection and benchmarking practices in Section 6."}, {"id": 29, "string": "All the code and datasets for this paper will be released to the public."}, {"id": 30, "string": "We hope that the availability of the new evaluation set can further support the continued research on story understanding."}, {"id": 31, "string": "Related Work This paper mainly extends the work on creating the Story Cloze Test set (Mostafazadeh et al., 2016) , hereinafter SCT-v1.0."}, {"id": 32, "string": "The SCT-v1.0 dataset was created as follows: full five-sentence stories from the ROC Stories corpus were sampled, then, the initial four sentences were shown to a set of MTurk 2 crowd workers who were prompted to author 'right' and 'wrong' endings."}, {"id": 33, "string": "Mostafazadeh et al."}, {"id": 34, "string": "(Mostafazadeh et al., 2016) give special care to make sure there were no boundary cases for 'right' and 'wrong' endings by implementing extra rounds of data filtering."}, {"id": 35, "string": "The resulting SCT-v1.0 dataset had a validation (hereinafter, SCT-v1.0 Val) and a test set (SCT-v1.0 test), each with 1,871 cases."}, {"id": 36, "string": "Furthermore, we conducted an extensive ngram analysis, using word tokens, characters, partof-speech, and token-POS (similar to Schwartz et al."}, {"id": 37, "string": "(Schwartz et al., 2017b) ) as features."}, {"id": 38, "string": "We see char-grams such as \"sn't\" and \"not\" appear more commonly in the 'wrong endings', suggesting heavy negation."}, {"id": 39, "string": "In 'right endings', pronouns are used more frequently versus proper nouns used in 'wrong endings'."}, {"id": 40, "string": "Artifacts such as 'pizza' are common in 'wrong endings,' which could suggest that for a given topic, the authors may replace an object in a right ending with a wrong one and quickly think up a common item such as pizza to create a 'wrong' one."}, {"id": 41, "string": "An extensive analysis of these features, including the n-gram analysis, can be found in the supplementary material."}, {"id": 42, "string": "Model Following the analysis above, we developed a Story Cloze model, hereinafter EndingReg, that only uses the ending features while disregarding the story context for choosing the right ending."}, {"id": 43, "string": "We expanded each Story Cloze Test case's ending options into a set of two single sentences."}, {"id": 44, "string": "Then, for each sentence, we created the following features: 1."}, {"id": 45, "string": "Number of tokens 2."}, {"id": 46, "string": "VADER composite sentiment score 3."}, {"id": 47, "string": "Yngve complexity score 4."}, {"id": 48, "string": "Token-POS n-grams 5."}, {"id": 49, "string": "POS n-grams 6."}, {"id": 50, "string": "Four length character-grams All n-gram features needed to appear at least five times throughout the dataset."}, {"id": 51, "string": "The features were collected for each five-sentence story and then fed into a logistic regression classifier."}, {"id": 52, "string": "As an initial experiment, we trained this model using the SCT-v1.0 validation set and tested on the SCT-v1.0 test set."}, {"id": 53, "string": "An L2 regularization penalty was used to enforce a Gaussian prior on the feature-space, where a grid search was conducted for hyper-parameter tuning."}, {"id": 54, "string": "This model achieves an accuracy of 71.5% on the SCT-v1.0 dataset which is on par with the highest score achieved by any model using only the endings."}, {"id": 55, "string": "Table 3 shows the accuracies ob-tained by models using only those particular features."}, {"id": 56, "string": "We achieve minimal but sometimes important classification using token count, VADER, and Yngve in combination alone, better classification using POS or char-grams alone, and best classification using n-grams alone."}, {"id": 57, "string": "By combining all of them we achieve the overall best results."}, {"id": 58, "string": "Table 3 : Classification results on SCT-v1.0 using each of the feature sets designated in the columns."}, {"id": 59, "string": "Data Collection Based on the findings above, a new test set for the SCT was deemed necessary."}, {"id": 60, "string": "The premise of predicting an ending to a short story, as opposed to predicting say a middle sentence, enables a more systematic evaluation where human can agree on the cases 100%."}, {"id": 61, "string": "Hence, our goal was to come up with a data collection scheme that overcomes the data collection biases, while keeping the original evaluation format."}, {"id": 62, "string": "As the data analysis revealed, the token count, sentiment, and the complexity are not as important features for classification as the ending n-grams are."}, {"id": 63, "string": "We set the following goals for sourcing the new 'right' and 'wrong' endings."}, {"id": 64, "string": "They both should: 1."}, {"id": 65, "string": "Contain a similar number of tokens 2."}, {"id": 66, "string": "Have similar distributions of token n-grams and char-grams 3."}, {"id": 67, "string": "Occur as standalone events with the same likelihood to occur, with topical, sentimental, or emotion consistencies when applicable."}, {"id": 68, "string": "First, we crowdsourced 5,000 new five-sentence stories through Amazon Mechanical Turk."}, {"id": 69, "string": "We prompted the users in the same manner described in Mostafazadeh et al."}, {"id": 70, "string": "(2016) ."}, {"id": 71, "string": "In order to source new 'wrong' endings, we tried two different methods."}, {"id": 72, "string": "In Method #1, we kept the original ending sourcing format of Mostafazadeh et al., but imposed some further restrictions."}, {"id": 73, "string": "This was done by taking the first four sentences of the newly collected stories and asking an MTurker to write a 'right' and 'wrong' ending for each."}, {"id": 74, "string": "The new restrictions were: 'Each sentence should stay within the same subject area of the story,' and 'The number of words in the Right and Wrong sentences should not differ by more than 2 words,' and 'When possible, the Right and Wrong sentences should try to keep a similar tone/sentiment as one another.'"}, {"id": 75, "string": "The motivation behind this technique was to reduce the statistical differences by asking the user to be mindful of considerations."}, {"id": 76, "string": "In Method #2, we took the five sentences stories and prompted a second set of MTurk workers to modify the fifth sentence in order to make a resulting five-sentence story non-sensible."}, {"id": 77, "string": "Here, the prompt instructs the workers to make sure the new 'wrong ending' sentence makes sense standalone, that it does not differ in the number of words from the original sentence by more than three words, and that the changes cannot be as simple as e.g., putting the word 'not' in front of a description or a verb."}, {"id": 78, "string": "As a result, the workers had much less flexibility for changing the underlying linguistic structures which can help tackle the authorship style differences between the 'right' and 'wrong' endings."}, {"id": 79, "string": "The results in Table 4 , which show classification accuracy when using EndingReg on the two new data sources, show that Method #2 is a slightly better data sourcing scheme in reducing the bias, since the EndingReg model's performance is slightly worse."}, {"id": 80, "string": "The set was further filtered through human verification similar to Mostafazadeh et al."}, {"id": 81, "string": "(2016) ."}, {"id": 82, "string": "The filtering was done by splitting each SCT-v1.0's two alternative endings into two independent five-sentence stories and asking three different MTurk users to categorize the story as either: one where the story made complete sense, one where the story made sense until the last sentence and one where the story does not make sense for another reason."}, {"id": 83, "string": "Stories were only selected if all the three MTurk users verified that the story with the 'right ending' and the corresponding story with the 'wrong ending' were verified to be indeed right and wrong respectively."}, {"id": 84, "string": "This ensured a higher quality of data and eliminating boundary cases."}, {"id": 85, "string": "This entire process resulted in creating the Story Cloze Test v1.5 (SCT-v1.5) dataset, consisting of 1,571 stories for each validation and test sets."}, {"id": 86, "string": "Method #1 Method #2 EndingReg 0.709 0.695 cogcomp 0.649 0.641 Table 4 : Comparison of initial data sourcing methods n − gram char − gram P OS SCT-v1.0 13.9 12.4 16.4 SCT-v1.5 7.0 6.3 7.5 Table 5 : Standard deviation of the word and character n-gram counts, as well as the part of speech (POS) counts, between the right and wrong endings."}, {"id": 87, "string": "Results In order to test the decrease in n-gram bias, which was the most salient feature for the classification task using only the endings, we compare the variance between the n-gram counts from SCT-v1.0 to SCT-v1.5."}, {"id": 88, "string": "The results are presented in Table  5 , which indicates the drop in the standard deviations in our new dataset."}, {"id": 89, "string": "Table 6 shows the classification results of various models on SCT-v1.5."}, {"id": 90, "string": "The drop in accuracy of the EndingReg model between the SCT-v1.0 and SCT-v1.5 shows a significant improvement on the statistical weight of the stylistic features generated by the model."}, {"id": 91, "string": "Since the main features used are the token length and the various n-grams, this suggests that the new 'right endings' and 'wrong endings' have much more similar token n-gram, pos n-gram, postoken n-gram and char-gram overlap."}, {"id": 92, "string": "Furthermore, the CogComp model's performance has significantly dropped on SCT-v1.5."}, {"id": 93, "string": "Although this model seems to be using story comprehension features such as event sequencing, since the endings are included in the sequences, the biases within the endings have influenced the predictions and the weak performance of the model in SCT-v1.5 suggest that this model had picked up on the biases of SCT-v1.0 as opposed to really understanding the context."}, {"id": 94, "string": "In particular, the posterior probabilities for each ending choice using their features are quite similar on the SCT-v1.5."}, {"id": 95, "string": "These results place the classification accuracy of this top performing model on par with or worse than the models that did not use the ending features of the old SCT-v1.0 dataset (Mostafazadeh et al., 2017) , which suggest that the gap that once was held by models using the ending biases seems to be corrected for."}, {"id": 96, "string": "Al-   though we did not get to test all the other models published on SCT-v1.0 directly, we predict similar trends."}, {"id": 97, "string": "It is important to point out that the 64.4% performance attained by our EndingReg model is still high for a model which completely discards the context."}, {"id": 98, "string": "This indicates that although we could correct for some of the stylistic biases, there are some other hidden patterns in the new endings that would not have been accounted for without having the EndingReg baseline."}, {"id": 99, "string": "This showcases the importance of maintaining benchmarks that evolve and improve over time, where systems should not be optimized for particular narrow test sets."}, {"id": 100, "string": "We propose the community to report accuracies on both SCT-v1.0 and SCT-v1.5, both of which still have a huge gap between the best system and the human performance."}, {"id": 101, "string": "Conclusion In this paper, we presented a comprehensive analysis of the stylistic features isolated in the endings of the original Story Cloze Test (SCT-v1.0)."}, {"id": 102, "string": "Using that analysis, along with a classifier we developed for testing new data collection schemes, we created a new SCT dataset, SCT-v1.5, which overcomes some of the biases."}, {"id": 103, "string": "Based on the results presented in this paper, we believe that our SCT-v1.5 is a better benchmark for story comprehension."}, {"id": 104, "string": "However, as shown in multiple AI tasks (Ettinger et al., 2017; Antol et al., 2015; Jabri et al., 2016; Poliak et al., 2018) , no collected dataset is entirely without its inherent biases and often the biases in datasets go undiscovered."}, {"id": 105, "string": "We believe that evaluation benchmarks should evolve and improve over time and we are planning to incrementally update the Story Cloze Test benchmark."}, {"id": 106, "string": "All the new versions, along with a leader-board showcasing the stateof-the-art results, will be tracked via CodaLab https://competitions.codalab.org/ competitions/15333."}, {"id": 107, "string": "The success of our modified data collection method shows how extreme care must be given for sourcing new datasets."}, {"id": 108, "string": "We suggest the next SCT challenges to be completely blind, where the participants cannot deliberately leverage any particular data biases."}, {"id": 109, "string": "Along with this paper, we are releasing the datasets and the developed models to the community."}, {"id": 110, "string": "All the announcements, new supplementary material, and datasets can be accessed through http://cs."}, {"id": 111, "string": "rochester.edu/nlp/rocstories/."}, {"id": 112, "string": "We hope that this work ignites further interest in the community for making progress on story understanding."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 30}, {"section": "Related Work", "n": "2", "start": 31, "end": 41}, {"section": "Model", "n": "4", "start": 42, "end": 58}, {"section": "Data Collection", "n": "5", "start": 59, "end": 86}, {"section": "Results", "n": "6", "start": 87, "end": 100}, {"section": "Conclusion", "n": "7", "start": 101, "end": 112}], "figures": [{"filename": "../figure/image/1275-Table2-1.png", "caption": "Table 2: The mean value for the ‘right endings’ and the ‘wrong endings’ for the two sample T-tests conducted for each feature.", "page": 2, "bbox": {"x1": 72.0, "x2": 527.04, "y1": 67.2, "y2": 108.0}}, {"filename": "../figure/image/1275-Table3-1.png", "caption": "Table 3: Classification results on SCT-v1.0 using each of the feature sets designated in the columns.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 529.4399999999999, "y1": 261.59999999999997, "y2": 297.12}}, {"filename": "../figure/image/1275-Table6-1.png", "caption": "Table 6: Classification accuracy for various models on the SCT-v1.0 and SCT-v1.5 datasets.", "page": 4, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 62.4, "y2": 168.0}}, {"filename": "../figure/image/1275-Table1-1.png", "caption": "Table 1: Example Story Cloze Test examples from the SCT-v1.0 corpus.", "page": 1, "bbox": {"x1": 74.88, "x2": 523.1999999999999, "y1": 63.36, "y2": 157.92}}, {"filename": "../figure/image/1275-Table4-1.png", "caption": "Table 4: Comparison of initial data sourcing methods", "page": 3, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 62.4, "y2": 108.96}}, {"filename": "../figure/image/1275-Table5-1.png", "caption": "Table 5: Standard deviation of the word and character n-gram counts, as well as the part of speech (POS) counts, between the right and wrong endings.", "page": 3, "bbox": {"x1": 312.96, "x2": 520.3199999999999, "y1": 152.64, "y2": 188.16}}]}