{"title": "Modeling Naive Psychology of Characters in Simple Commonsense Stories", "abstract": "Understanding a narrative requires reading between the lines and reasoning about the unspoken but obvious implications about events and people's mental states -a capability that is trivial for humans but remarkably hard for machines. To facilitate research addressing this challenge, we introduce a new annotation framework to explain naive psychology of story characters as fully-specified chains of mental states with respect to motivations and emotional reactions. Our work presents a new largescale dataset with rich low-level annotations and establishes baseline performance on several new tasks, suggesting avenues for future research.", "text": [{"id": 0, "string": "Introduction Understanding a story requires reasoning about the causal links between the events in the story and the mental states of the characters, even when those relationships are not explicitly stated."}, {"id": 1, "string": "As shown by the commonsense story cloze shared task (Mostafazadeh et al., 2017) , this reasoning is remarkably hard for both statistical and neural machine readers -despite being trivial for humans."}, {"id": 2, "string": "This stark performance gap between humans and machines is not surprising as most powerful language models have been designed to effectively learn local fluency patterns."}, {"id": 3, "string": "Consequently, they generally lack the ability to abstract away from surface patterns in text to model more complex implied dynamics, such as intuiting characters' mental states or predicting their plausible next actions."}, {"id": 4, "string": "In this paper, we construct a new annotation formalism to densely label commonsense short stories (Mostafazadeh et al., 2016) in terms of the mental states of the characters."}, {"id": 5, "string": "The result-The band instructor told the band to start playing."}, {"id": 6, "string": "He often stopped the music when players were off-tone."}, {"id": 7, "string": "They grew tired and started playing worse after a while."}, {"id": 8, "string": "The instructor was furious and threw his chair."}, {"id": 9, "string": "Figure 1 : A story example with partial annotations for motivations (dashed) and emotional reactions (solid) ."}, {"id": 10, "string": "Open text explanations are in black (e.g., \"frustrated\") and formal theory labels are in blue with brackets (e.g., \"[esteem]\")."}, {"id": 11, "string": "ing dataset offers three unique properties."}, {"id": 12, "string": "First, as highlighted in Figure 1 , the dataset provides a fully-specified chain of motivations and emotional reactions for each story character as preand post-conditions of events."}, {"id": 13, "string": "Second, the annotations include state changes for entities even when they are not mentioned directly in a sentence (e.g., in the fourth sentence in Figure 1 , players would feel afraid as a result of the instructor throwing a chair), thereby capturing implied effects unstated in the story."}, {"id": 14, "string": "Finally, the annotations encompass both formal labels from multiple theories of psychology (Maslow, 1943; Reiss, 2004; Plutchik, 1980) as well as open text descriptions of motivations and emotions, providing a comprehensive mapping between open text explanations and label categories (e.g., \"to spend time with her son\" Reiss) and Emotional Reaction (Plutchik) ."}, {"id": 15, "string": "!"}, {"id": 16, "string": "Maslow's category love)."}, {"id": 17, "string": "Our corpus 1 spans across 15k stories, amounting to 300k low-level annotations for around 150k character-line pairs."}, {"id": 18, "string": "Using our new corpus, we present baseline performance on two new tasks focusing on mental state tracking of story characters: categorizing motivations and emotional reactions using theory labels, as well as describing motivations and emotional reactions using open text."}, {"id": 19, "string": "Empirical results demonstrate that existing neural network models including those with explicit or latent entity representations achieve promising results."}, {"id": 20, "string": "Mental State Representations Understanding people's actions, motivations, and emotions has been a recurring research focus across several disciplines including philosophy and psychology (Schachter and Singer, 1962; Burke, 1969; Lazarus, 1991; Goldman, 2015) ."}, {"id": 21, "string": "We draw from these prior works to derive a set of categorical labels for annotating the step-by-step causal dynamics between the mental states of story characters and the events they experience."}, {"id": 22, "string": "Motivation Theories We use two popular theories of motivation: the \"hierarchy of needs\" of Maslow (1943) and the \"basic motives\" of Reiss (2004) to compile 5 coarse-grained and 19 fine-grained motivation categories, shown in Figure 2 ."}, {"id": 23, "string": "Maslow's \"hierarchy of needs\" are comprised of five categories, ranging from physiological needs to spiritual growth, which we use as coarse-level categories."}, {"id": 24, "string": "Reiss (2004) proposes 19 more fine-grained categories that provide a more informative range of motivations."}, {"id": 25, "string": "For example, even though they both relate to the physiological needs Maslow category, the food and rest motives from Reiss (2004) are very different."}, {"id": 26, "string": "While the Reiss theory allows for finergrained annotations of motivation, the larger set of abstract concepts can be overwhelming for annotators."}, {"id": 27, "string": "Motivated by Straker (2013) , we design a hybrid approach, where Reiss labels are annotated as sub-categories of Maslow categories."}, {"id": 28, "string": "Emotion Theory Among several theories of emotion, we work with the \"wheel of emotions\" of Plutchik (1980) , as it has been a common choice in prior literature on emotion categorization (Mohammad and Turney, 2013; Zhou et al., 2016) ."}, {"id": 29, "string": "We use the eight basic emotional dimensions as illustrated in Figure 2 ."}, {"id": 30, "string": "Mental State Explanations In addition to the motivation and emotion categories derived from psychology theories, we also obtain open text descriptions of character mental states."}, {"id": 31, "string": "These open text descriptions allow learning computational models that can explain the mental states of characters in natural language, which is likely to be more accessible and informative to end users than having theory categories alone."}, {"id": 32, "string": "Collecting both theory categories and open text also allows us to learn the automatic mappings between the two, which generalizes the previous work of Mohammad and Turney (2013) on emotion category mappings."}, {"id": 33, "string": "Annotation Framework In this study, we choose to annotate the simple commonsense stories introduced by Mostafazadeh et al."}, {"id": 34, "string": "(2016) ."}, {"id": 35, "string": "Despite their simplicity, these stories pose a significant challenge to natural language understanding models (Mostafazadeh et al., 2017 In addition, they depict multiple interactions between story characters, presenting rich opportunities to reason about character motivations and reactions."}, {"id": 36, "string": "Furthermore, there are more than 98k such stories currently available covering a wide range of everyday scenarios."}, {"id": 37, "string": "Unique Challenges While there have been a variety of annotated resources developed on the related topics of sentiment analysis (Mohammad and Turney, 2013; Deng and Wiebe, 2015) , entity tracking (Hoffart et al., 2011; Weston et al., 2015) , and story understanding (Goyal et al., 2010; Ouyang and McKeown, 2015; Lukin et al., 2016) , our study is the first to annotate the full chains of mental state effects for story characters."}, {"id": 38, "string": "This poses several unique challenges as annotations require (1) interpreting discourse (2) understanding implicit causal effects, and (3) understanding formal psychology theory categories."}, {"id": 39, "string": "In prior literature, annotations of this complexity have typically been performed by experts (Deng and Wiebe, 2015; Ouyang and McKeown, 2015) ."}, {"id": 40, "string": "While reliable, these annotations are prohibitively expensive to scale up."}, {"id": 41, "string": "Therefore, we introduce a new annotation framework that pipelines a set of smaller isolated tasks as illustrated in Figure 3 ."}, {"id": 42, "string": "All annotations were collected using crowdsourced workers from Amazon Mechanical Turk."}, {"id": 43, "string": "Annotation Pipeline We describe the components and workflow of the full annotation pipeline shown in Figure 3 below."}, {"id": 44, "string": "The example story in the figure is used to illustrate the output of various steps in the pipeline (full annotations for this example are in the appendix)."}, {"id": 45, "string": "(1) Entity Resolution The first task in the pipeline aims to discover (1) the set of characters E i in each story i and (2) the set of sentences S ij in which a specific character j 2 E i is ex-plicitly mentioned."}, {"id": 46, "string": "For example, in the story in Figure 3 , the characters identified by annotators are \"I/me\" and \"My cousin\", whom appear in sentences {1, 4, 5} and {1, 2, 3, 4, 5}, respectively."}, {"id": 47, "string": "We use S ij to control the workflow of later parts of the pipeline by pruning future tasks for sentences that are not tied to characters."}, {"id": 48, "string": "Because S ij is used to prune follow-up tasks, we take a high recall strategy to include all sentences that at least one annotator selected."}, {"id": 49, "string": "(2a) Action Resolution The next task identifies whether a character j appearing in a sentence k is taking any action to which a motivation can be attributed."}, {"id": 50, "string": "We perform action resolution only for sentences k 2 S ij ."}, {"id": 51, "string": "In the running example, we would want to know that the cousin in line 2 is not doing anything intentional, allowing us to omit this line in the next pipeline stage (3a) where a character's motives are annotated."}, {"id": 52, "string": "Description of state (e.g., \"Alex is feeling blue\") or passive event participation (e.g., \"Alex trips\") are not considered volitional acts for which the character may have an underlying motive."}, {"id": 53, "string": "For each line and story character pair, we obtain 4 annotations."}, {"id": 54, "string": "Because pairs can still be filtered out in the next stage of annotation, we select a generous threshold where only 2 annotators must vote that an intentional action took place for the sentence to be used as an input to the motivation annotation task (3a)."}, {"id": 55, "string": "(2b) Affect Resolution This task aims to identify all of the lines where a story character j has an emotional reaction."}, {"id": 56, "string": "Importantly, it is often possible to infer the emotional reaction of a character j even when the character does not explicitly appear in a sentence k. For instance, in Figure 3 , we want to annotate the narrator's reaction to line 2 even though they are not mentioned because their emotional response is inferrable."}, {"id": 57, "string": "We obtain 4 an- Figure 4 : Examples of open-text explanations that annotators provided corresponding with the categories they selected."}, {"id": 58, "string": "The bars on the right of the categories represent the percentage of lines where annotators selected that category (out of those character-line pairs with positive motivation/emotional reaction)."}, {"id": 59, "string": "notations per character per line."}, {"id": 60, "string": "The lines with at least 2 annotators voting are used as input for the next task: (3b) emotional reaction."}, {"id": 61, "string": "(3a) Motivation We use the output from the action resolution stage (2a) to ask workers to annotate character motives in lines where they intentionally initiate an event."}, {"id": 62, "string": "We provide 3 annotators a line from a story, the preceding lines, and a specific character."}, {"id": 63, "string": "They are asked to produce a free response sentence describing what causes the character's behavior in that line and to select the most related Maslow categories and Reiss subcategories."}, {"id": 64, "string": "In Figure 3 , an annotator described the motivation of the narrator in line 1 as wanting \"to have company\" and then selected the love (Maslow) and family (Reiss) as categorical labels."}, {"id": 65, "string": "Because many annotators are not familiar with motivational theories, we require them to complete a tutorial the first time they attempt the task."}, {"id": 66, "string": "(3b) Emotional Reaction Simultaneously, we use the output from the affect resolution stage (2b) to ask workers what the emotional response of a character is immediately following a line in which they are affected."}, {"id": 67, "string": "As with the motives, we give 3 annotators a line from a story, its previous context, and a specific character."}, {"id": 68, "string": "We ask them to describe in open text how the character will feel following the event in the sentence (up to three emotions)."}, {"id": 69, "string": "As a follow-up, we ask workers to compare their free responses against Plutchik categories by using 3-point likert ratings."}, {"id": 70, "string": "In Figure 3 , we include a response for the emotional reaction of the narrator in line 1."}, {"id": 71, "string": "Even though the narrator was not mentioned directly in that line, an annotator recorded that they will react to their cousin being a slob by feeling \"annoyed\" and selected the Plutchik categories for sadness, disgust and anger."}, {"id": 72, "string": "Dataset Statistics and Insights Cost The tasks corresponding to the theory category assignments are the hardest and most expensive in the pipeline (⇠$4 per story)."}, {"id": 73, "string": "Therefore, we obtain theory category labels only for a third of our annotated stories, which we assign to the development and test sets."}, {"id": 74, "string": "The training data is annotated with a shortened pipeline with only open text descriptions of motivations and emotional reactions from two workers (⇠$1 per story)."}, {"id": 75, "string": "Scale Our dataset to date includes a total of 300k low-level annotations for motivation and emotion across 15,000 stories (randomly selected from the ROC story training set)."}, {"id": 76, "string": "It covers over 150,000 character-line pairs, in which 56k character-line pairs have an annotated motivation and 105k have an annotated change in emotion (i.e."}, {"id": 77, "string": "a label other than none)."}, {"id": 78, "string": "Table 1 shows the break down across training, development, and test splits."}, {"id": 79, "string": "Figure 4 shows the frequency of different labels being selected for motivational and emotional categories in cases with positive change."}, {"id": 80, "string": "Agreements For quality control, we removed workers who consistently produced low-quality work, as discussed in the Appendix."}, {"id": 81, "string": "In the categorization sets (Maslow, Reiss and Plutchik), we compare the performance of annotators by treating each individual category as a binary label (1 Serenity 0.01 0.03 0.06 0.27 0.06 0.01 -0.07 -0.07 -0.04 -0.09 -0.07 0.02 -0.07 -0.04 -0.08 -0.10 -0.07 0.01 -0.02 0.07 -0.05 0.02 -0.10 0.15 Curiosity -0.01 -0.02 0.13 0.03 0.40 -0.01 -0.04 -0.05 -0.04 -0.01 -0.08 -0.01 -0.16 -0.06 -0.07 -0.14 -0.01 -0.11 -0.12 -0.04 -0.10 0.08 -0.12 -0.07 Esteem Other -1.00 0.14 0.04 0.02 0.04 0.31 -0.05 0.03 0.10 -0.12 0.05 -1.00 -0.07 0.08 -1.00 -1.00 -1.00 -0.14 -0.05 -0.07 0.03 -1.00 -0.09 -0.04   if they included the category in their set of responses) and averaging the agreement per category."}, {"id": 82, "string": "For Plutchik scores, we count 'moderately associated' ratings as agreeing with 'highly' associated' ratings."}, {"id": 83, "string": "The percent agreement and Krippendorff's alpha are shown in Table 2 ."}, {"id": 84, "string": "We also compute the percent agreement between the individual annotations and the majority labels."}, {"id": 85, "string": "2 These scores are difficult to interpret by themselves, however, as annotator agreement in our categorization system has a number of properties that are not accounted for by these metrics (disagreement preferences -joy and trust are closer than joy and anger -that are difficult to quantify in a principled way, hierarchical categories map-ping Reiss subcategories from Maslow categories, skewed category distributions that inflate PPA and deflate KA scores, and annotators that could select multiple labels for the same examples)."}, {"id": 86, "string": "To provide a clearer understanding of agreement within this dataset, we create aggregated confusion matrices for annotator pairs."}, {"id": 87, "string": "First, we sum the counts of combinations of answers between all paired annotations (excluding none labels)."}, {"id": 88, "string": "If an annotator selected multiple categories, we split the count uniformly among the selected categories."}, {"id": 89, "string": "We compute NPMI over the total confusion matrix."}, {"id": 90, "string": "In Figure 5 , we show the NPMI confusion matrix for motivational categories."}, {"id": 91, "string": "In the motivation annotations, we find the highest scores on the diagonal (i.e., Reiss agreement), with most confusions occurring between Reiss motives in the same Maslow category (outlined black in Figure 5 )."}, {"id": 92, "string": "Other disagreements generally involve Reiss subcategories that are thematically similar, such as serenity (mental relaxation) and rest (physical relaxation)."}, {"id": 93, "string": "We provide this analysis for Plutchik categories in the appendix, finding high scores along the diagonal with disagreements typically occurring between categories in a \"positive emotion\" cluster (joy, trust) or a \"negative emotion\" cluster (anger, disgust,sadness)."}, {"id": 94, "string": "Tasks The multiple modes covered by the annotations in this new dataset allow for multiple new tasks to be explored."}, {"id": 95, "string": "We outline three task types below, covering a total of eight tasks on which to evaluate."}, {"id": 96, "string": "Open-text Explanation Figure 6 : General model architectures for three new task types Differences between task type inputs and outputs are summarized in Figure 6 ."}, {"id": 97, "string": "State Classification The three primary tasks involve categorizing the psychological states of story characters for each of the label sets (Maslow, Reiss, Plutchik) collected for the dev and test splits of our dataset."}, {"id": 98, "string": "In each classification task, a model is given a line of the story (along with optional preceding context lines) and a character and predicts the motivation (or emotional reaction)."}, {"id": 99, "string": "A binary label is predicted for each of the Maslow needs, Reiss motives or Plutchik categories."}, {"id": 100, "string": "Annotation Classification Because the dev and test sets contain paired classification labels and free text explanations, we propose three tasks where a model must predict the correct Maslow/Reiss/Plutchik label given an emotional reaction or motivation explanation."}, {"id": 101, "string": "Explanation Generation Finally, we can use the free text explanations to train models to describe the psychological state of a character in free text (examples in Figure 4 )."}, {"id": 102, "string": "These explanations allow for two conditional generation tasks where the model must generate the words describing the emotional reaction or motivation of the character."}, {"id": 103, "string": "Baseline Models The general model architectures for the three tasks are shown in Figure 6 ."}, {"id": 104, "string": "We describe each model component below."}, {"id": 105, "string": "The state classification and explanation generation models could be trained separately or in a multi-task set-up."}, {"id": 106, "string": "In the state classification and explanation generation tasks, a model is given a line from a story x s containing N words {w s 0 , w s 1 , ."}, {"id": 107, "string": "."}, {"id": 108, "string": "."}, {"id": 109, "string": ", w s N } from vocabulary V , a character in that story e j 2 E where E is the set of characters in the story, and (optionally) the preceding sentences in the story C = {x 0 ."}, {"id": 110, "string": "."}, {"id": 111, "string": "."}, {"id": 112, "string": ", x s 1 } containing words from vocabulary V ."}, {"id": 113, "string": "A representation for a character's psychological state is encoded as: h e = Encoder(x s , C[e j ]) (1) where C[e j ] corresponds to the concatenated subset of sentences in C where e j appears."}, {"id": 114, "string": "Encoders While the end classifier or decoder is different for each task, we use the same set of encoders based on word embeddings, common neural network architectures, or memory networks to formulate a representation of the sentence and character, h e ."}, {"id": 115, "string": "Unless specified, h e is computed by encoding separate vector representations for the sentence (x s !"}, {"id": 116, "string": "h s ) and character-specific context (C[e j ] !"}, {"id": 117, "string": "h c ) and concatenating these encodings (h e = [h c ; h s ]) ."}, {"id": 118, "string": "We describe the encoders below: TF-IDF We learn a TD-IDF model on the full training corpus of Mostafazadeh et al."}, {"id": 119, "string": "(2016) (excluding the stories in our dev/test sets)."}, {"id": 120, "string": "To encode the sentence, we extract TF-IDF features for its words, yielding v s 2 R V ."}, {"id": 121, "string": "A projection and nonlinearity is applied to these features to yield h s : h s = (W s v s + b s ) (2) where W s 2 R d⇥H ."}, {"id": 122, "string": "The character vector h c is encoded in the same way on sentences in the context pertaining to the character."}, {"id": 123, "string": "GloVe We extract pretrained Glove vectors (Pennington et al., 2014) h s = CNN(v s ) (3) where CNN represents the categorization model from (Kim, 2014) ."}, {"id": 124, "string": "The character vector h c is encoded in the same way with a separate CNN."}, {"id": 125, "string": "Implementation details are provided in the appendix."}, {"id": 126, "string": "LSTM A two-layer bi-LSTM encodes the sentence words and concatenates the final time step hidden states from both directions to yield h s ."}, {"id": 127, "string": "The character vector h c is encoded the same way."}, {"id": 128, "string": "REN We use the \"tied\" recurrent entity network from Henaff et al."}, {"id": 129, "string": "(2017) ."}, {"id": 130, "string": "A memory cell m is initialized for each of the J characters in the story, E = {e 0 , ."}, {"id": 131, "string": "."}, {"id": 132, "string": "."}, {"id": 133, "string": ", e J }."}, {"id": 134, "string": "The REN reads documents one sentence at a time and updates m j for e j 2 E after reading each sentence."}, {"id": 135, "string": "Unlike the previous encoders, all sentences of the context C are given to the REN along with the sentence x s ."}, {"id": 136, "string": "The model learns to distribute encoded information to the correct memory cells."}, {"id": 137, "string": "The representation passed to the downstream model is: h e = {m j } s (5) where {m j } s is the memory vector in the cell corresponding to e j after reading x s ."}, {"id": 138, "string": "Implementation details are provided in the appendix."}, {"id": 139, "string": "NPN We also include the neural process network from Bosselut et al."}, {"id": 140, "string": "(2018) with \"tied\" entities, but \"untied\" actions that are not grounded to particular concepts."}, {"id": 141, "string": "The memory is initialized and accessed similarly as the REN."}, {"id": 142, "string": "Exact implementation details are provided in the appendix."}, {"id": 143, "string": "State Classifier Once the sentence-character encoding h e is extracted, the state classifier predicts a binary label y z for every category z 2 Z where Z is the set of category labels for a particular psychological theory (e.g., disgust, surprise, etc."}, {"id": 144, "string": "in the Plutchik wheel)."}, {"id": 145, "string": "We use logistic regression as a classifier: y z = (W z h e + b z ) (6) where W z and b z are a label-specific set of weights and biases for classifying each label z 2 Z."}, {"id": 146, "string": "Explanation Generator The explanation generator is a single-layer LSTM (Hochreiter and Schmidhuber, 1997 ) that receives the encoded sentence-character representation h e and predicts each word y t in the explanation using the same method from ."}, {"id": 147, "string": "Implementation details are provided in the appendix."}, {"id": 148, "string": "Annotation Classifier For annotation classification tasks, words from open-text explanations are encoded with TF-IDF features."}, {"id": 149, "string": "The same classifier architecture from Section 5.2 is used to predict the labels."}, {"id": 150, "string": "6 Experimental Setup Training State Classification The dev set D is split into two portions of 80% (D 1 ) and 20% (D 2 )."}, {"id": 151, "string": "D 1 is used to train the classifier and encoder."}, {"id": 152, "string": "D 2 is used to tune hyperparameters."}, {"id": 153, "string": "The model is trained to minimize the weighted binary cross entropy of predicting a class label y z for each class z: L = Z X z=1 z y z logŷ z +(1 z )(1 y z ) log(1 ŷ z ) (7) where Z is the number of labels in each of the three classifications tasks and z is defined as: z = 1 e p P (yz) (8) where P (y z ) is the marginal class probability of a positive label for z in the training set."}, {"id": 154, "string": "Annotation Classification The dev set is split in the same manner as for state classification."}, {"id": 155, "string": "The TF-IDF features are trained on the set of training annotations D t coupled with those from D 1 ."}, {"id": 156, "string": "The model must minimize the same loss as in Equation 7."}, {"id": 157, "string": "Details are provided in the appendix."}, {"id": 158, "string": "Explanation Generation We use the training set of open annotations to train a model to predict explanations."}, {"id": 159, "string": "The decoder is trained to minimize the negative loglikelihood of predicting each word in the explanation of a character's state: L gen = T X t=1 log P (y t |y 0 , ..., y t 1 , h e ) (9) where h e is the sentence-character representation produced by an encoder from Section 5.1."}, {"id": 160, "string": "Metrics Classification For the state and annotation classification task, we report the micro-averaged precision (P), recall (R), and F1 score of the Plutchik, Maslow, and Reiss prediction tasks."}, {"id": 161, "string": "We report the results of selecting a label at random in the top two rows of Table 3 ."}, {"id": 162, "string": "Note that random is low because the distribution of positive instances for each (Henaff et al., 2017) 26.24 42.14 32.34 16.79 22.20 19.12 26.22 33.26 29.32 + Explanation Training 26.85 44.78 33.57 16.73 26.55 20.53 25.30 37.30 30.15 NPN (Bosselut et al., 2018) 24.27 44.16 31.33 13.13 26.44 17.55 21.98 37.31 27.66 + Explanation Training 26.60 39.17 31.69 15.75 20.34 17.75 24.33 40.10 30.29 Generation Because explanations tend to be short sequences (Figure 4 ) with high levels of synonymy, traditional metrics such as BLEU are inadequate for evaluating generation quality."}, {"id": 163, "string": "We use the vector average and vector extrema metrics from Liu et al."}, {"id": 164, "string": "(2016) computed using the Glove vectors of generated and reference words."}, {"id": 165, "string": "We report results in Table 5 on the dev set and compare to a baseline that randomly samples an example from the dev set as a generated sequence."}, {"id": 166, "string": "Ablations Story Context vs. No Context Our dataset is motivated by the importance of interpreting story context to categorize emotional reactions and motivations of characters."}, {"id": 167, "string": "To test this importance, we ablate h c , the representation of the context sentences pertaining to the character, as an input to the state classifier for each encoder (except the REN and NPN)."}, {"id": 168, "string": "In Table 3 , this ablation is the first row for each encoder presented."}, {"id": 169, "string": "Explanation Pretraining Because the state classification and explanation generation tasks use the same models to encode the story, we explore initializing a classification encoder with parameters trained on the generation task."}, {"id": 170, "string": "For the CNN, LSTM, and REN encoders, we pretrain a generator to produce emotion or motivation explana-tions."}, {"id": 171, "string": "We use the parameters from the emotion or motivation explanation generators to initialize the Plutchik or Maslow/Reiss classifiers respectively."}, {"id": 172, "string": "Experimental Results State Classification We show results on the test set for categorizing Maslow, Reiss, and Plutchik states in Table 3 ."}, {"id": 173, "string": "Despite the difficulty of the task, all models outperform the random baseline."}, {"id": 174, "string": "Interestingly, the performance boost from adding entity-specific contextual information (i.e., not ablating h c ) indicates that the models learn to condition on a character's previous experience to classify its mental state at the current time step."}, {"id": 175, "string": "This effect can be seen in a story about a man whose flight is cancelled."}, {"id": 176, "string": "The model without context predicts the same emotional reactions for the man, his wife and the pilot, but with context correctly predicts that the pilot will not have a reaction while predicting that the man and his wife will feel sad."}, {"id": 177, "string": "For the CNN, LSTM, REN, and NPN models, we also report results from pretraining encoder parameters using the free response annotations from the training set."}, {"id": 178, "string": "This pretraining offers a clear performance boost for all models on all three prediction tasks, showing that the parameters of the encoder can be pretrained on auxiliary tasks providing emotional and motivational state signal."}, {"id": 179, "string": "The best performing models in each task are most effective at predicting Maslow physiological needs, Reiss food motives, and Plutchik reactions of joy."}, {"id": 180, "string": "The relative ease of predicting motivations Table 4 shows that a simple model can learn to map open text responses to categorical labels."}, {"id": 181, "string": "This further supports our hypothesis that pretraining a classification model on the free-response annotations could be helpful in boosting performance on the category prediction."}, {"id": 182, "string": "Explanation Generation Finally, we provide results for the task of generating explanations of motivations and emotions in Table 5 ."}, {"id": 183, "string": "Because the explanations are closely tied to emotional and motivation states, the randomly selected explanation can often be close in embedding space to the reference explanations, making the random baseline fairly competitive."}, {"id": 184, "string": "However, all models outperform the strong baseline on both metrics, indicating that the generated short explanations are closer semantically to the reference annotation."}, {"id": 185, "string": "Related work Mental State Annotations Incorporating emotion theories into NLP tasks has been explored in previous projects."}, {"id": 186, "string": "Ghosh et al."}, {"id": 187, "string": "(2017) modulate language model distributions by increasing the probability of words that express certain affective LIWC (Tausczik and Pennebaker, 2016) categories."}, {"id": 188, "string": "More generally, various projects tackle the problem of generating text from a set of attributes like sentiment or generic-ness (Ficler and Goldberg, 2017; Dong et al., 2017) ."}, {"id": 189, "string": "Similarly, there is also a body of research in reasoning about commonsense stories and discourse (Li and Jurafsky, 2017; Mostafazadeh et al., 2016) or detecting emotional stimuli in stories (Gui et al., 2017) ."}, {"id": 190, "string": "Previous work in plot units (Lehnert, 1981) developed formalisms for affect and mental state in story narratives that included motivations and reactions."}, {"id": 191, "string": "In our work, we collect mental state annotations for stories to used as a new resource in this space."}, {"id": 192, "string": "Modeling Entity State Recently, novel works in language modeling (Ji et al., 2017; Yang et al., 2016) , question answering (Henaff et al., 2017) , and text generation (Kiddon et al., 2016; Bosselut et al., 2018) have shown that modeling entity state explicitly can boost performance while providing a preliminary interface for interpreting a model's prediction."}, {"id": 193, "string": "Entity modeling in these works, however, was limited to tracking entity reference (Kiddon et al., 2016; Yang et al., 2016; Ji et al., 2017) , recognizing entity state similarity (Henaff et al., 2017) or predicting simple attributes from entity states (Bosselut et al., 2018) ."}, {"id": 194, "string": "Our work provides a new dataset for tracking emotional reactions and motivations of characters in stories."}, {"id": 195, "string": "Conclusion We present a large scale dataset as a resource for training and evaluating mental state tracking of characters in short commonsense stories."}, {"id": 196, "string": "This dataset contains over 300k low-level annotations for character motivations and emotional reactions."}, {"id": 197, "string": "We provide benchmark results on this new resource."}, {"id": 198, "string": "Importantly, we show that modeling character-specific context and pretraining on freeresponse data can boost labeling performance."}, {"id": 199, "string": "While our work only use information present in our dataset, we view our dataset as a future testbed for evaluating models trained on any number of resources for learning common sense about emotional reactions and motivations."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 18}, {"section": "Mental State Representations", "n": "2", "start": 19, "end": 21}, {"section": "Motivation Theories", "n": "2.1", "start": 22, "end": 26}, {"section": "Emotion Theory", "n": "2.2", "start": 27, "end": 29}, {"section": "Mental State Explanations", "n": "2.3", "start": 30, "end": 32}, {"section": "Annotation Framework", "n": "3", "start": 33, "end": 42}, {"section": "Annotation Pipeline", "n": "3.1", "start": 43, "end": 71}, {"section": "Dataset Statistics and Insights", "n": "3.2", "start": 72, "end": 93}, {"section": "Tasks", "n": "4", "start": 94, "end": 102}, {"section": "Baseline Models", "n": "5", "start": 103, "end": 113}, {"section": "Encoders", "n": "5.1", "start": 114, "end": 142}, {"section": "State Classifier", "n": "5.2", "start": 143, "end": 145}, {"section": "Explanation Generator", "n": "5.3", "start": 146, "end": 146}, {"section": "Annotation Classifier", "n": "5.4", "start": 147, "end": 149}, {"section": "Training", "n": "6.1", "start": 150, "end": 159}, {"section": "Metrics", "n": "6.2", "start": 160, "end": 165}, {"section": "Ablations", "n": "6.3", "start": 166, "end": 171}, {"section": "Experimental Results", "n": "7", "start": 172, "end": 184}, {"section": "Related work", "n": "8", "start": 185, "end": 194}, {"section": "Conclusion", "n": "9", "start": 195, "end": 199}], "figures": [{"filename": "../figure/image/1279-Figure6-1.png", "caption": "Figure 6: General model architectures for three new task types", "page": 5, "bbox": {"x1": 75.84, "x2": 284.15999999999997, "y1": 64.32, "y2": 217.92}}, {"filename": "../figure/image/1279-Figure2-1.png", "caption": "Figure 2: Theories of Motivation (Maslow and Reiss) and Emotional Reaction (Plutchik).", "page": 1, "bbox": {"x1": 88.8, "x2": 487.68, "y1": 70.56, "y2": 199.2}}, {"filename": "../figure/image/1279-Figure3-1.png", "caption": "Figure 3: The annotation pipeline for the fine-grained annotations with an example story.", "page": 2, "bbox": {"x1": 105.6, "x2": 486.24, "y1": 66.24, "y2": 188.64}}, {"filename": "../figure/image/1279-Table3-1.png", "caption": "Table 3: State Classification Results", "page": 7, "bbox": {"x1": 117.6, "x2": 479.03999999999996, "y1": 62.4, "y2": 288.96}}, {"filename": "../figure/image/1279-Table1-1.png", "caption": "Table 1: Annotated data statistics for each dataset", "page": 3, "bbox": {"x1": 312.96, "x2": 530.4, "y1": 241.92, "y2": 322.56}}, {"filename": "../figure/image/1279-Figure4-1.png", "caption": "Figure 4: Examples of open-text explanations that annotators provided corresponding with the categories they selected. The bars on the right of the categories represent the percentage of lines where annotators selected that category (out of those character-line pairs with positive motivation/emotional reaction).", "page": 3, "bbox": {"x1": 73.92, "x2": 522.24, "y1": 61.44, "y2": 177.12}}, {"filename": "../figure/image/1279-Table4-1.png", "caption": "Table 4: F1 scores of predicting correct category labels from free response annotations", "page": 8, "bbox": {"x1": 91.67999999999999, "x2": 267.36, "y1": 62.4, "y2": 102.24}}, {"filename": "../figure/image/1279-Table5-1.png", "caption": "Table 5: Vector average and extrema scores for generation of annotation explanations", "page": 8, "bbox": {"x1": 81.6, "x2": 278.4, "y1": 148.32, "y2": 261.12}}, {"filename": "../figure/image/1279-Table2-1.png", "caption": "Table 2: Agreement Statistics (PPA = Pairwise percent agreement of worker responses per binary category, KA= Krippendorff’s Alpha)", "page": 4, "bbox": {"x1": 73.92, "x2": 285.12, "y1": 310.56, "y2": 443.03999999999996}}, {"filename": "../figure/image/1279-Figure5-1.png", "caption": "Figure 5: NPMI confusion matrix on motivational categories for all annotator pairs with color scaling for legibility. The highest values are generally along diagonal or within Maslow categories (outlined in black). We highlight a few common points of disagreement between thematically similar categories.", "page": 4, "bbox": {"x1": 88.8, "x2": 511.2, "y1": 63.36, "y2": 241.92}}]}