{"title": "Semi-supervised User Geolocation via Graph Convolutional Networks", "abstract": "Social media user geolocation is vital to many applications such as event detection. In this paper, we propose GCN, a multiview geolocation model based on Graph Convolutional Networks, that uses both text and network context. We compare GCN to the state-of-the-art, and to two baselines we propose, and show that our model achieves or is competitive with the stateof-the-art over three benchmark geolocation datasets when sufficient supervision is available. We also evaluate GCN under a minimal supervision scenario, and show it outperforms baselines. We find that highway network gates are essential for controlling the amount of useful neighbourhood expansion in GCN.", "text": [{"id": 0, "string": "Introduction User geolocation, the task of identifying the \"home\" location of a user, is an integral component of many applications ranging from public health monitoring (Paul and Dredze, 2011; Chon et al., 2015; Yepes et al., 2015) and regional studies of sentiment, to real-time emergency awareness systems (De Longueville et al., 2009; Sakaki et al., 2010) , which use social media as an implicit information resource about people."}, {"id": 1, "string": "Social media services such as Twitter rely on IP addresses, WiFi footprints, and GPS data to geolocate users."}, {"id": 2, "string": "Third-party service providers don't have easy access to such information, and have to rely on public sources of geolocation information such as the profile location field, which is noisy and difficult to map to a location (Hecht et al., 2011) , or geotagged tweets, which are publicly available for only 1% of tweets (Cheng et al., 2010; Morstatter et al., 2013) ."}, {"id": 3, "string": "The scarcity of publicly available location information motivates predictive user geolocation from information such as tweet text and social interaction data."}, {"id": 4, "string": "Most previous work on user geolocation takes the form of either supervised text-based approaches (Wing and Baldridge, 2011; Han et al., 2012) relying on the geographical variation of language use, or graph-based semi-supervised label propagation relying on location homophily in user-user interactions (Davis Jr et al., 2011; Jurgens, 2013) ."}, {"id": 5, "string": "Both text and network views are critical in geolocating users."}, {"id": 6, "string": "Some users post a lot of local content, but their social network is lacking or is not representative of their location; for them, text is the dominant view for geolocation."}, {"id": 7, "string": "Other users have many local social interactions, and mostly use social media to read other people's comments, and for interacting with friends."}, {"id": 8, "string": "Single-view learning would fail to accurately geolocate these users if the more information-rich view is not present."}, {"id": 9, "string": "There has been some work that uses both the text and network views, but it either completely ignores unlabelled data (Li et al., 2012a; Miura et al., 2017) , or just uses unlabelled data in the network view (Rahimi et al., 2015b; Do et al., 2017) ."}, {"id": 10, "string": "Given that the 1% of geotagged tweets is often used for supervision, it is crucial for geolocation models to be able to leverage unlabelled data, and to perform well under a minimal supervision scenario."}, {"id": 11, "string": "In this paper, we propose GCN, an end-to-end user geolocation model based on Graph Convolutional Networks (Kipf and Welling, 2017) that jointly learns from text and network information to classify a user timeline into a location."}, {"id": 12, "string": "Our contributions are: (1) we evaluate our model under a minimal supervision scenario which is close to real world applications and show that GCN outperforms two strong baselines; (2) given sufficient supervision, we show that GCN is competitive, although the much simpler MLP-TXT+NET outper-forms state-of-the-art models; and (3) we show that highway gates play a significant role in controlling the amount of useful neighbourhood smoothing in GCN."}, {"id": 13, "string": "1 Model We propose a transductive multiview geolocation model, GCN, using Graph Convolutional Networks (\"GCN\": Kipf and Welling (2017) )."}, {"id": 14, "string": "We also introduce two multiview baselines: MLP-TXT+NET based on concatenation of text and network, and DCCA based on Deep Canonical Correlation Analysis (Andrew et al., 2013) ."}, {"id": 15, "string": "Multivew Geolocation Let X ∈ R |U |×|V | be the text view, consisting of the bag of words for each user in U using vocabulary V , and A ∈ 1 |U |×|U | be the network view, encoding user-user interactions."}, {"id": 16, "string": "We partition U = U S ∪ U H into a supervised and heldout (unlabelled) set, U S and U H , respectively."}, {"id": 17, "string": "The goal is to infer the location of unlabelled samples Y U , given the location of labelled samples Y S , where each location is encoded as a one-hot classification label, y i ∈ 1 c with c being the number of target regions."}, {"id": 18, "string": "GCN GCN defines a neural network model f (X, A) with each layer:Â =D − 1 2 (A + λI)D − 1 2 H (l+1) = σ Â H (l) W (l) + b , (1) whereD is the degree matrix of A + λI; hyperparameter λ controls the weight of a node against its neighbourhood, which is set to 1 in the original model (Kipf and Welling, 2017) ; H 0 = X and the d in × d out matrix W (l) and d out × 1 matrix b are trainable layer parameters; and σ is an arbitrary nonlinearity."}, {"id": 19, "string": "The first layer takes an average of each sample and its immediate neighbours (labelled and unlabelled) using weights inÂ, and performs a linear transformation using W and b followed by a nonlinear activation function (σ)."}, {"id": 20, "string": "In other words, for user u i , the output of layer l is computed by: h l+1 i = σ j∈nhood(i)Â ij h l j W l + b l , (2) 1 Code and data available at https://github.com/ afshinrahimi/geographconv Highway GCN: Highway GCN: , Output GCN: Figure 1 : The architecture of GCN geolocation model with layer-wise highway gates (W i h , b i h )."}, {"id": 21, "string": "GCN is applied to a BoW model of user content over the @-mention graph to predict user location."}, {"id": 22, "string": "X = BoWtext Â Â A tanh tanh softmax H 0 H 1 H l−1 H l predict location:ŷ W l−1 , b l−1 , W l−1 h , b l−1 h W 1 , b 1 , W 1 h , b 1 h W l , b l where W l and b l are learnable layer parameters, and nhood(i) indicates the neighbours of user u i ."}, {"id": 23, "string": "Each extra layer in GCN extends the neighbourhood over which a sample is smoothed."}, {"id": 24, "string": "For example a GCN with 3 layers smooths each sample with its neighbours up to 3 hops away, which is beneficial if location homophily extends to a neighbourhood of this size."}, {"id": 25, "string": "Highway GCN Expanding the neighbourhood for label propagation by adding multiple GCN layers can improve geolocation by accessing information from friends that are multiple hops away, but it might also lead to propagation of noisy information to users from an exponentially increasing number of expanded neighbourhood members."}, {"id": 26, "string": "To control the required balance of how much neighbourhood information should be passed to a node, we use layer-wise gates similar to highway networks."}, {"id": 27, "string": "In highway networks (Srivastava et al., 2015) , the output of a layer is summed with its input with gating weights T ( h l ): DCCA Given two views X andÂ (from Equation 1) of data samples, CCA (Hotelling, 1936) , and its deep version (DCCA) (Andrew et al., 2013) learn functions f 1 (X) and f 2 (Â) such that the correlation between the output of the two functions is maximised: ρ = corr(f 1 (X), f 2 (Â)) ."}, {"id": 28, "string": "(4) The resulting representations of f 1 (X) and f 2 (Â) are the compressed representations of the two views where the uncorrelated noise between them is reduced."}, {"id": 29, "string": "The new representations ideally represent user communities for the network view, and the language model of that community for the text view, and their concatenation is a multiview representation of data, which can be used as input for other tasks."}, {"id": 30, "string": "In DCCA, the two views are first projected to a lower dimensionality using a separate multilayer perceptron for each view (the f 1 and f 2 functions of Equation 4), the output of which is used to estimate the CCA cost: maximise: tr(W T 1 Σ 12 W 2 ) subject to: W T 1 Σ 11 W 1 = W T 2 Σ 22 W 2 = I (5) where Σ 11 and Σ 22 are the covariances of the two outputs, and Σ 12 is the cross-covariance."}, {"id": 31, "string": "The weights W 1 and W 2 are the linear projections of the MLP outputs, which are used in estimating the CCA cost."}, {"id": 32, "string": "The optimisation problem is solved by SVD, and the error is backpropagated to train the parameters of the two MLPs and the final linear projections."}, {"id": 33, "string": "After training, the two networks are used to predict new projections for unseen data."}, {"id": 34, "string": "The two projections of unseen data -the outputs of the two networks -are then concatenated to form a multiview sample representation, as shown in Figure 2 ."}, {"id": 35, "string": "3 Experiments Data We use three existing Twitter user geolocation datasets: (1) GEOTEXT (Eisenstein et al., 2010) , Figure 2 : The DCCA model architecture: First the two text and network views X andÂ are fed into two neural networks (left), which are unsupervisedly trained to maximise the correlation of their outputs; next the outputs of the networks are concatenated, and fed as input to another neural network (right), which is trained supervisedly to predict locations."}, {"id": 36, "string": "sets."}, {"id": 37, "string": "Each user is represented by the concatenation of their tweets, and labelled with the latitude/longitude of the first collected geotagged tweet in the case of GEOTEXT and TWITTER-US, and the centre of the closest city in the case of TWITTER-WORLD."}, {"id": 38, "string": "GEOTEXT and TWITTER-US cover the continental US, and TWITTER-WORLD covers the whole world, with 9k, 449k and 1.3m users, respectively."}, {"id": 39, "string": "The labels are the discretised geographical coordinates of the training points using a k-d tree following Roller et al."}, {"id": 40, "string": "(2012) , with the number of labels equal to 129, 256, and 930 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively."}, {"id": 41, "string": "Constructing the Views We build matrixÂ as in Equation 1 using the collapsed @-mention graph between users, where two users are connected (A ij = 1) if one mentions the other, or they co-mention another user."}, {"id": 42, "string": "The text view is a BoW model of user content with binary term frequency, inverse document frequency, and l 2 normalisation of samples."}, {"id": 43, "string": "Model Selection For GCN, we use highway layers to control the amount of neighbourhood information passed to a node."}, {"id": 44, "string": "We use 3 layers in GCN with size 300, 600, 900 for GEOTEXT, TWITTER-US and TWITTER-WORLD respectively."}, {"id": 45, "string": "Note that the final softmax layer is also graph convolutional, which sets the radius of the averaging neighbourhood to 4."}, {"id": 46, "string": "The k-d tree bucket size hyperparameter which controls the maximum number of users in each cluster is set to 50, 2400, and 2400 for the respective datasets, based on tuning over the validation set."}, {"id": 47, "string": "The architecture of GCN-LP is similar, with the difference that the text view is set to zero."}, {"id": 48, "string": "In DCCA, for the unsupervised networks we use a single sigmoid hidden layer with size 1000 and a linear output layer with size 500 for the three datasets."}, {"id": 49, "string": "The loss function is CCA loss, which maximises the output correlations."}, {"id": 50, "string": "The supervised multilayer perceptron has one hidden layer with size 300, 600, 1000 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively, which we set by tuning over the development sets."}, {"id": 51, "string": "We evaluate the models using Median error, Mean error, and Acc@161, accuracy of predicting a user within 161km or 100 miles from the known location."}, {"id": 52, "string": "Baselines We also compare DCCA and GCN with two baselines: GCN-LP is based on GCN, but for input, instead of text-based features , we use one-hot encoding of a user's neighbours, which are then convolved with their k-hop neighbours using the GCN."}, {"id": 53, "string": "This approach is similar to label propagation in smoothing the label distribution of a user with that of its neighbours, but uses graph convolutional networks which have extra layer parameters, and also a gating mechanism to control the smoothing neighbourhood radius."}, {"id": 54, "string": "Note that for unlabelled samples, the predicted labels are used for input after training accuracy reaches 0.2."}, {"id": 55, "string": "MLP-TXT+NET is a simple transductive supervised model based on a single layer multilayer perceptron where the input to the network is the concatenation of the text view X, the user content's bag-of-words andÂ (Equation 1), which represents the network view as a vector input."}, {"id": 56, "string": "For the hidden layer we use a ReLU nonlinearity, and sizes 300, 600, and 600 for GEOTEXT, TWITTER-US, and TWITTER-WORLD, respectively."}, {"id": 57, "string": "Results and Analysis Representation Deep CCA and GCN are able to provide an unsupervised data representation in different ways."}, {"id": 58, "string": "Deep CCA takes the two text-based and networkbased views, and finds deep non-linear transformations that result in maximum correlation between the two views (Andrew et al., 2013) ."}, {"id": 59, "string": "The representations can be visualised using t-SNE, where we hope that samples with the same label are clustered together."}, {"id": 60, "string": "GCN, on the other hand, uses graph convolution."}, {"id": 61, "string": "The representations of 50 samples from each of 4 randomly chosen labels of GEOTEXT are shown in Figure 3 ."}, {"id": 62, "string": "As shown, Deep CCA seems to slightly improve the representations from pure concatenation of the two views."}, {"id": 63, "string": "GCN, on the other hand, substantially improves the representations."}, {"id": 64, "string": "Further application of GCN results in more samples clumping together, which might be desirable when there is strong homophily."}, {"id": 65, "string": "Labelled Data Size To achieve good performance in supervised tasks, often large amounts of labelled data are required, which is a big challenge for Twitter geolocation, where only a small fraction of the data is geotagged (about 1%)."}, {"id": 66, "string": "The scarcity of supervision indicates the importance of semi-supervised learning where unlabelled (e.g."}, {"id": 67, "string": "non-geotagged) tweets are used for training."}, {"id": 68, "string": "The three models we propose (MLP-TXT+NET, DCCA, and GCN) are all transductive semi-supervised models that use unlabelled data, however, they are different in terms of how much labelled data they require to achieve acceptable performance."}, {"id": 69, "string": "Given that in a real-world scenario, only a small fraction of data is geotagged, we conduct an experiment to analyse the effect of labelled samples on the performance of the three geolocation models."}, {"id": 70, "string": "We provided the three models with different fractions of samples that are labelled (in terms of % of dataset samples) while using the remainder as unlabelled data, and analysed their Median error performance over the development set of GEOTEXT, TWITTER-US, and TWITTER-WORLD."}, {"id": 71, "string": "Note that the text and network view, and the development set, remain fixed for all the experiments."}, {"id": 72, "string": "As shown in Figure 4 , when the fraction of labelled samples is less than 10% of all the samples, GCN and DCCA outperform MLP-TXT+NET, as a result of having fewer parameters, and therefore, lower supervision requirement to optimise them."}, {"id": 73, "string": "When enough training data is available (e.g."}, {"id": 74, "string": "more than 20% of all the samples), GCN and MLP-TXT+NET clearly outperform DCCA, possibly as a result of directly modelling the interactions between network and text views."}, {"id": 75, "string": "When all the training samples of the two larger datasets (95% and 98% for TWITTER-US and TWITTER-WORLD, respectively) are available to the models, MLP-TXT+NET outperforms GCN."}, {"id": 76, "string": "Note that the number of parameters increases from DCCA to GCN and to MLP-TXT+NET."}, {"id": 77, "string": "In 1% for GEOTEXT, DCCA outperforms GCN as a result of having fewer parameters and just a few labelled samples, insufficient to train the parameters of GCN."}, {"id": 78, "string": "(a) MLP-TXT+NET (b) DCCA (c) 1 GCNÂ · X (d) 2 GCNÂ ·Â · X Highway Gates Adding more layers to GCN expands the graph neighbourhood within which the user features are averaged, and so might introduce noise, and consequently decrease accuracy as shown in Figure 5 when no gates are used."}, {"id": 79, "string": "We see that by adding highway network gates, the performance of GCN slightly improves until three layers are added, but then by adding more layers the performance doesn't change that much as gates are allowing the layer inputs to pass through the network without much change."}, {"id": 80, "string": "The performance peaks at 4 layers which is compatible with the distribution of shortest path lengths shown in Figure 6 ."}, {"id": 81, "string": "Performance The performance of the three proposed models (MLP-TXT+NET, DCCA and GCN) is shown in Table 1."}, {"id": 82, "string": "The models are also compared with supervised text-based methods (Wing and Baldridge, 2014; Cha et al., 2015; Rahimi et al., 2017b) , a network-based method (Rahimi et al., 2015a) and GCN-LP, and also joint text and network models (Rahimi et al., 2017b; Do et al., 2017; Miura et al., 2017) ."}, {"id": 83, "string": "MLP-TXT+NET and GCN outperform all the text-or network-only models, and also the hybrid model of Rahimi et al."}, {"id": 84, "string": "(2017b) , indicating that joint modelling of text and network features is important."}, {"id": 85, "string": "MLP-TXT+NET is competitive with Do et al."}, {"id": 86, "string": "(2017) , outperforming it on larger datasets, and underperforming on GEO- Table 1 : Geolocation results over the three Twitter datasets for the proposed models: joint text+network MLP-TXT+NET, DCCA, and GCN and network-based GCN-LP."}, {"id": 87, "string": "The models are compared with text-only and network-only methods."}, {"id": 88, "string": "The performance of the three joint models is also reported for minimal supervision scenario where only 1% of the total samples are labelled."}, {"id": 89, "string": "\"-\" signifies that no results were reported for the given metric or dataset."}, {"id": 90, "string": "Note that Do et al."}, {"id": 91, "string": "(2017) Rahimi et al."}, {"id": 92, "string": "(2015a) , which is based on location propagation using Modified Adsorption (Talukdar and Crammer, 2009), possibly because the label propagation in GCN is parametrised."}, {"id": 93, "string": "Error Analysis Although the performance of MLP-TXT+NET is better than GCN and DCCA when a large amount of labelled data is available (Table 1) , under a scenario where little labelled data is available (1% of data), DCCA and GCN outperform MLP-TXT+NET, mainly because the number of parameters in MLP-TXT+NET grows with the number of samples, and is much larger than GCN and DCCA."}, {"id": 94, "string": "GCN outperforms DCCA and MLP-TXT+NET using 1% of data, however, the distribution of errors in the development set of TWITTER-US indicates higher error for smaller states such as Rhode Island (RI), Iowa (IA), North Dakota (ND), and Idaho (ID), which is simply because the number of labelled samples in those states is insufficient."}, {"id": 95, "string": "Although we evaluate geolocation models with Median, Mean, and Acc@161, it doesn't mean that the distribution of errors is uniform over all locations."}, {"id": 96, "string": "Big cities often attract more local online discussions, making the geolocation of users in those areas simpler."}, {"id": 97, "string": "For example users in LA are more likely to talk about LA-related issues such as their sport teams, Hollywood or local events than users in the state of Rhode Island (RI), which lacks large sport teams or major events."}, {"id": 98, "string": "It is also possible that people in less densely populated areas are further apart from each other, and therefore, as a result of discretisation fall in different clusters."}, {"id": 99, "string": "The non-uniformity in local discussions results in lower geolocation performance in less densely populated areas like Midwest U.S., and higher performance in densely populated areas such as NYC and LA as shown in Figure 7 ."}, {"id": 100, "string": "The geographical distribution of error for GCN, DCCA and MLP-TXT+NET under the minimal supervision scenario is shown in the supplementary material."}, {"id": 101, "string": "To get a better picture of misclassification between states, we built a confusion matrix based on known state and predicted state for development users of TWITTER-US using GCN using only 1% of labelled data."}, {"id": 102, "string": "There is a tendency for users to be wrongly predicted to be in CA, NY, TX, and surpris-ingly OH."}, {"id": 103, "string": "Particularly users from states such as TX, AZ, CO, and NV, which are located close to CA, are wrongly predicted to be in CA, and users from NJ, PA, and MA are misclassified as being in NY."}, {"id": 104, "string": "The same goes for OH and TX where users from neighbouring smaller states are misclassified to be there."}, {"id": 105, "string": "Users from CA and NY are also misclassified between the two states, which might be the result of business and entertainment connections that exist between NYC and LA/SF."}, {"id": 106, "string": "Interestingly, there are a number of misclassifications to FL for users from CA, NY, and TX, which might be the effect of users vacationing or retiring to FL."}, {"id": 107, "string": "The full confusion matrix between the U.S. states is provided in the supplementary material."}, {"id": 108, "string": "Local Terms In Table 2 , local terms of a few regions detected by GCN under minimal supervision are shown."}, {"id": 109, "string": "The terms that were present in the labelled data are excluded to show how graph convolutions over the social graph have extended the vocabulary."}, {"id": 110, "string": "For example, in case of Seattle, #goseahawks is an important term not present in the 1% labelled data but present in the unlabelled data."}, {"id": 111, "string": "The convolution over the social graph is able to utilise such terms that don't exist in the labelled data."}, {"id": 112, "string": "Related Work Previous work on user geolocation can be broadly divided into text-based, network-based and multiview approaches."}, {"id": 113, "string": "Text-based geolocation uses the geographical bias in language use to infer the location of users."}, {"id": 114, "string": "There are three main text-based approaches to geolocation: (1) gazetteer-based models which map geographical references in text to location, but ignore non-geographical references and vernacular uses of language (Rauch et al., 2003; Amitay et al., 2004; Lieberman et al., 2010) ; (2) geographical topic models that learn region-specific topics, but don't scale to the magnitude of social media (Eisenstein et al., 2010; Hong et al., 2012; Ahmed et al., 2013) ; and (3) supervised models which are often framed as text classification (Serdyukov et al., 2009; Wing and Baldridge, 2011; Roller et al., 2012; Han et al., 2014) or text regression (Iso et al., 2017; Rahimi et al., 2017a) ."}, {"id": 115, "string": "Supervised models scale well and can achieve good performance with sufficient supervision, which is not available in a real world scenario."}, {"id": 116, "string": "We present the terms that were present only in unlabelled data."}, {"id": 117, "string": "The terms include city names, hashtags, food names and internet abbreviations."}, {"id": 118, "string": "Network-based methods leverage the location homophily assumption: nearby users are more likely to befriend and interact with each other."}, {"id": 119, "string": "There are four main network-based geolocation approaches: distance-based, supervised classification, graph-based label propagation, and node embedding methods."}, {"id": 120, "string": "Distance-based methods model the probability of friendship given the distance (Backstrom et al., 2010; McGee et al., 2013; Gu et al., 2012; Kong et al., 2014) , supervised models use neighbourhood features to classify a user into a location (Rout et al., 2013; Malmi et al., 2015) , and graph-based label-propagation models propagate the location information through the user-user graph to estimate unknown labels (Davis Jr et al., 2011; Jurgens, 2013; Compton et al., 2014) ."}, {"id": 121, "string": "Node embedding methods build heterogeneous graphs between user-user, user-location and locationlocation, and learn an embedding space to minimise the distance of connected nodes, and maximise the distance of disconnected nodes."}, {"id": 122, "string": "The embeddings are then used in supervised models for geolocation (Wang et al., 2017) ."}, {"id": 123, "string": "Network-based models fail to geolocate disconnected users: Jurgens et al."}, {"id": 124, "string": "(2015) couldn't geolocation 37% of users as a result of disconnectedness."}, {"id": 125, "string": "Previous work on hybrid text and network methods can be broadly categorised into three main approaches: (1) incorporating text-based information such as toponyms or locations predicted from a textbased model as auxiliary nodes into the user-user graph, which is then used in network-based models (Li et al., 2012a,b; Rahimi et al., 2015b,a) ; (2) ensembling separately trained text-and networkbased models (Gu et al., 2012; Ren et al., 2012; Jayasinghe et al., 2016; Ribeiro and Pappa, 2017) ; and (3) jointly learning geolocation from several information sources such as text and network information (Miura et al., 2017; Do et al., 2017) , which can capture the complementary information in text and network views, and also model the interactions between the two."}, {"id": 126, "string": "None of the previous multiview approaches -with the exception of Li et al."}, {"id": 127, "string": "(2012a) and Li et al."}, {"id": 128, "string": "(2012b) that only use toponyms -effectively uses unlabelled data in the text view, and use only the unlabelled information of the network view via the user-user graph."}, {"id": 129, "string": "There are three main shortcomings in the previous work on user geolocation that we address in this paper: (1) with the exception of few recent works (Miura et al., 2017; Do et al., 2017) , previous models don't jointly exploit both text and network information, and therefore the interaction between text and network views is not modelled; (2) the unlabelled data in both text and network views is not effectively exploited, which is crucial given the small amounts of available supervision; and (3) previous models are rarely evaluated under a minimal supervision scenario, a scenario which reflects real world conditions."}, {"id": 130, "string": "Conclusion We proposed GCN, DCCA and MLP-TXT+NET, three multiview, transductive, semi-supervised geolocation models, which use text and network information to infer user location in a joint setting."}, {"id": 131, "string": "We showed that joint modelling of text and network information outperforms network-only, text-only, and hybrid geolocation models as a result of modelling the interaction between text and network information."}, {"id": 132, "string": "We also showed that GCN and DCCA are able to perform well under a minimal supervision scenario similar to real world applications by effectively using unlabelled data."}, {"id": 133, "string": "We ignored the context in which users interact with each other, and assumed all the connections to hold location homophily."}, {"id": 134, "string": "In future work, we are interested in modelling the extent to which a social interaction is caused by geographical proximity (e.g."}, {"id": 135, "string": "using user-user gates)."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 12}, {"section": "Model", "n": "2", "start": 13, "end": 14}, {"section": "Multivew Geolocation", "n": "2.1", "start": 15, "end": 17}, {"section": "GCN", "n": "2.2", "start": 18, "end": 24}, {"section": "Highway GCN", "n": "2.2.1", "start": 25, "end": 26}, {"section": "DCCA", "n": "2.3", "start": 27, "end": 34}, {"section": "Data", "n": "3.1", "start": 35, "end": 40}, {"section": "Constructing the Views", "n": "3.2", "start": 41, "end": 42}, {"section": "Model Selection", "n": "3.3", "start": 43, "end": 51}, {"section": "Baselines", "n": "3.4", "start": 52, "end": 56}, {"section": "Representation", "n": "4.1", "start": 57, "end": 64}, {"section": "Labelled Data Size", "n": "4.2", "start": 65, "end": 77}, {"section": "Highway Gates", "n": "4.3", "start": 78, "end": 80}, {"section": "Performance", "n": "4.4", "start": 81, "end": 92}, {"section": "Error Analysis", "n": "4.5", "start": 93, "end": 107}, {"section": "Local Terms", "n": "4.6", "start": 108, "end": 111}, {"section": "Related Work", "n": "5", "start": 112, "end": 129}, {"section": "Conclusion", "n": "6", "start": 130, "end": 135}], "figures": [{"filename": "../figure/image/1321-Table1-1.png", "caption": "Table 1: Geolocation results over the three Twitter datasets for the proposed models: joint text+network MLP-TXT+NET, DCCA, and GCN and network-based GCN-LP. The models are compared with text-only and network-only methods. The performance of the three joint models is also reported for minimal supervision scenario where only 1% of the total samples are labelled. “—” signifies that no results were reported for the given metric or dataset. Note that Do et al. (2017) use timezone, and Miura et al. (2017) use the description and location fields in addition to text and network.", "page": 5, "bbox": {"x1": 71.52, "x2": 524.16, "y1": 67.2, "y2": 277.92}}, {"filename": "../figure/image/1321-Figure5-1.png", "caption": "Figure 5: The effect of adding more GCN layers (neighbourhood expansion) to GCN in terms of median error over the development set of GEOTEXT with and without the highway gates, and averaged over 5 runs.", "page": 5, "bbox": {"x1": 82.56, "x2": 283.2, "y1": 391.68, "y2": 549.12}}, {"filename": "../figure/image/1321-Figure6-1.png", "caption": "Figure 6: The distribution of shortest path lengths between all the nodes of the largest connected component of GEOTEXT’s graph that constitute more than 1% of total.", "page": 5, "bbox": {"x1": 332.15999999999997, "x2": 504.0, "y1": 392.15999999999997, "y2": 550.0799999999999}}, {"filename": "../figure/image/1321-Figure2-1.png", "caption": "Figure 2: The DCCA model architecture: First the two text and network views X and Â are fed into two neural networks (left), which are unsupervisedly trained to maximise the correlation of their outputs; next the outputs of the networks are concatenated, and fed as input to another neural network (right), which is trained supervisedly to predict locations.", "page": 2, "bbox": {"x1": 319.68, "x2": 517.92, "y1": 63.36, "y2": 181.92}}, {"filename": "../figure/image/1321-Table2-1.png", "caption": "Table 2: Top terms for selected regions detected by GCN using only 1% of TWITTER-US for supervision. We present the terms that were present only in unlabelled data. The terms include city names, hashtags, food names and internet abbreviations.", "page": 7, "bbox": {"x1": 72.0, "x2": 524.16, "y1": 306.71999999999997, "y2": 406.08}}, {"filename": "../figure/image/1321-Figure7-1.png", "caption": "Figure 7: The geographical distribution of Median error of GCN using 1% of labelled data in each state over the development set of TWITTER-US. The colour indicates error and the size indicates the number of development users within the state.", "page": 7, "bbox": {"x1": 80.64, "x2": 516.0, "y1": 71.03999999999999, "y2": 233.76}}, {"filename": "../figure/image/1321-Figure4-1.png", "caption": "Figure 4: The effect of the amount of labelled data available as a fraction of all samples for GEOTEXT, TWITTER-US, and TWITTER-WORLD on the development performance of GCN, DCCA, and MLP-TXT+NET models in terms of Median error. The dataset sizes are 9k, 440k, and 1.4m for the three datasets, respectively.", "page": 4, "bbox": {"x1": 75.84, "x2": 504.47999999999996, "y1": 265.92, "y2": 383.03999999999996}}, {"filename": "../figure/image/1321-Figure3-1.png", "caption": "Figure 3: Comparing t-SNE visualisations of 50 training samples from each of 4 randomly chosen regions of GEOTEXT using various data representations: (a) concatenation of Â (Equation 1); (b) concatenation of DCCA transformation of text-based and network-based views X and Â; (c) applying graph convolution Â ·X; and (d) applying graph convolution twice Â · Â ·X", "page": 4, "bbox": {"x1": 91.67999999999999, "x2": 539.04, "y1": 76.8, "y2": 186.72}}]}