{"title": "Obtaining Reliable Human Ratings of Valence, Arousal, and Dominance for 20,000 English Words", "abstract": "Words play a central role in language and thought. Factor analysis studies have shown that the primary dimensions of meaning are valence, arousal, and dominance (VAD). We present the NRC VAD Lexicon, which has human ratings of valence, arousal, and dominance for more than 20,000 English words. We use Best-Worst Scaling to obtain fine-grained scores and address issues of annotation consistency that plague traditional rating scale methods of annotation. We show that the ratings obtained are vastly more reliable than those in existing lexicons. We also show that there exist statistically significant differences in the shared understanding of valence, arousal, and dominance across demographic variables such as age, gender, and personality.", "text": [{"id": 0, "string": "Introduction Words are the smallest meaningful utterances in language."}, {"id": 1, "string": "They play a central role in our understanding and descriptions of the world around us."}, {"id": 2, "string": "Some believe that the structure of a language even affects how we think (principle of linguistic relativity aka the SapirWhorf hypothesis)."}, {"id": 3, "string": "Several influential factor analysis studies have shown that the three most important, largely independent, dimensions of word meaning are valence (positiveness-negativeness/pleasuredispleasure), arousal (active-passive), and dominance (dominant-submissive) (Osgood et al., 1957; Russell, 1980 Russell, , 2003 ."}, {"id": 4, "string": "1 Thus, when comparing the meanings of two words, we can compare their degrees of valence, arousal, or domi-nance."}, {"id": 5, "string": "For example, the word banquet indicates more positiveness than the word funeral; nervous indicates more arousal than lazy; and fight indicates more dominance than delicate."}, {"id": 6, "string": "Access to these degrees of valence, arousal, and dominance of words is beneficial for a number of applications, including those in natural language processing (e.g., automatic sentiment and emotion analysis of text), in cognitive science (e.g., for understanding how humans represent and use language), in psychology (e.g., for understanding how people view the world around them), in social sciences (e.g., for understanding relationships between people), and even in evolutionary linguistics (e.g., for understanding how language and behaviour inter-relate to give us an advantage)."}, {"id": 7, "string": "Existing VAD lexicons (Bradley and Lang, 1999; Warriner et al., 2013) were created using rating scales and thus suffer from limitations associated with the method (Presser and Schuman, 1996; Baumgartner and Steenkamp, 2001) ."}, {"id": 8, "string": "These include: inconsistencies in annotations by different annotators, inconsistencies in annotations by the same annotator, scale region bias (annotators often have a bias towards a portion of the scale), and problems associated with a fixed granularity."}, {"id": 9, "string": "In this paper, we describe how we obtained human ratings of valence, arousal, and dominance for more than 20,000 commonly used English words by crowdsourcing."}, {"id": 10, "string": "Notably, we use a comparative annotation technique called Best-Worst Scaling (BWS) that addresses the limitations of traditional rating scales (Louviere, 1991; Cohen, 2003; Louviere et al., 2015) ."}, {"id": 11, "string": "The scores are finegrained real-valued numbers in the interval from 0 (lowest V, A, or D) to 1 (highest V, A, or D)."}, {"id": 12, "string": "We will refer to this new lexicon as the NRC Valence, Arousal, and Dominance (VAD) Lexicon."}, {"id": 13, "string": "2 Correlations (r) between repeated annotations, through metrics such as split-half reliability (SHR), are a common way to evaluate the reliabilities of ordinal and rank annotations."}, {"id": 14, "string": "We show that our annotations have SHR scores of r = 0.95 for valence, r = 0.90 for arousal, and r = 0.91 for dominance."}, {"id": 15, "string": "These scores are well above the SHR scores obtained by Warriner et al."}, {"id": 16, "string": "(2013) , and indicate high reliability."}, {"id": 17, "string": "Respondents who provided valence, arousal, and dominance annotations, were given the option of additionally filling out a brief demographic questionnaire to provide details of their age, gender, and personality traits."}, {"id": 18, "string": "This demographic information along with the VAD annotations allows us to determine whether attributes such as age, gender, and personality impact our understanding of the valence, arousal, and dominance of words."}, {"id": 19, "string": "We show that even though overall the annotations are consistent (as seen from the high SHR scores), people aged over 35 are significantly more consistent in their annotations than people aged 35 or less."}, {"id": 20, "string": "We show for the first time that men have a significantly higher shared understanding of dominance and valence of words, whereas women have a higher shared understanding of the degree of arousal of words."}, {"id": 21, "string": "We find that some personality traits significantly impact a person's annotations of one or more of valence, arousal, and dominance."}, {"id": 22, "string": "We hope that these and other findings described in the paper foster further research into how we use language, how we represent concepts in our minds, and how certain aspects of the world are more important to certain demographic groups leading to higher degrees of shared representations of those concepts within those groups."}, {"id": 23, "string": "All of the annotation tasks described in this paper were approved by our institution's review board, which examined the methods to ensure that they were ethical."}, {"id": 24, "string": "Special attention was paid to obtaining informed consent and protecting participant anonymity."}, {"id": 25, "string": "The NRC VAD Lexicon is made freely available for research and non-commercial use through our project webpage."}, {"id": 26, "string": "3 2 Related Work Primary Dimensions of Meaning: Osgood et al."}, {"id": 27, "string": "(1957) asked human participants to rate words along dimensions of opposites such as heavylight, good-bad, strong-weak, etc."}, {"id": 28, "string": "Factor analysis 3 http://saifmohammad.com/WebPages/nrc-vad.html of these judgments revealed that the three most prominent dimensions of meaning are evaluation (good-bad), potency (strong-weak), and activity (active-passive)."}, {"id": 29, "string": "Russell (1980 Russell ( , 2003 showed through similar analyses of emotion words that the three primary independent dimensions of emotions are valence or pleasure (positivenessnegativeness/pleasure-displeasure), arousal (active-passive), and dominance (dominantsubmissive)."}, {"id": 30, "string": "He argues that individual emotions such as joy, anger, and fear are points in a three-dimensional space of valence, arousal, and dominance."}, {"id": 31, "string": "It is worth noting that even though the names given by Osgood et al."}, {"id": 32, "string": "(1957) and Russell (1980) are different, they describe similar dimensions (Bakker et al., 2014) ."}, {"id": 33, "string": "Existing Affect Lexicons: Bradley and Lang (1999) asked annotators to rate valence, arousal, and dominance-for more than 1,000 words-on a 9-point rating scale."}, {"id": 34, "string": "The ratings from multiple annotators were averaged to obtain a score between 1 (lowest V, A, or D) to 9 (highest V, A, or D)."}, {"id": 35, "string": "Their lexicon, called the Affective Norms of English Words (ANEW), has since been widely used across many different fields of study."}, {"id": 36, "string": "More than a decade later, Warriner et al."}, {"id": 37, "string": "(2013) created a similar lexicon for more than 13,000 words, using a similar annotation method."}, {"id": 38, "string": "There exist a small number of VAD lexicons in non-English languages as well, such as the ones created by Moors et al."}, {"id": 39, "string": "(2013) for Dutch, by Võ et al."}, {"id": 40, "string": "(2009) for German, and by Redondo et al."}, {"id": 41, "string": "(2007) for Spanish."}, {"id": 42, "string": "The NRC VAD lexicon is the largest manually created VAD lexicon (in any language), and the only one that was created via comparative annotations (instead of rating scales)."}, {"id": 43, "string": "Best-Worst Scaling: Best-Worst Scaling (BWS) was developed by (Louviere, 1991) , building on work in the 1960's in mathematical psychology and psychophysics."}, {"id": 44, "string": "Annotators are given n items (an n-tuple, where n > 1 and commonly n = 4)."}, {"id": 45, "string": "4 They are asked which item is the best (highest in terms of the property of interest) and which is the worst (least in terms of the property of interest)."}, {"id": 46, "string": "When working on 4-tuples, best-worst annotations are particularly efficient because each best and worst annotation will reveal the order of five of the six item pairs (e.g., for a 4-tuple with items A, B, C, and D, if A is the best, and D is the worst, then A > B, A > C, A > D, B > D, and C > D)."}, {"id": 47, "string": "Real-valued scores of association between the items and the property of interest can be determined using simple arithmetic on the number of times an item was chosen best and number of times it was chosen worst (as described in Section 3) (Orme, 2009; Flynn and Marley, 2014) ."}, {"id": 48, "string": "It has been empirically shown that three annotations each for 2N 4-tuples is sufficient for obtaining reliable scores (where N is the number of items) (Louviere, 1991; Kiritchenko and Mohammad, 2016) ."}, {"id": 49, "string": "Kiritchenko and Mohammad (2017) showed through empirical experiments that BWS produces more reliable and more discriminating scores than those obtained using rating scales."}, {"id": 50, "string": "(See Mohammad (2016, 2017) for further details on BWS.)"}, {"id": 51, "string": "Within the NLP community, BWS has been used for creating datasets for relational similarity (Jurgens et al., 2012) , word-sense disambiguation (Jurgens, 2013) , word-sentiment intensity (Kiritchenko and Mohammad, 2016), word-emotion intensity (Mohammad, 2018), and tweet-emotion intensity (Mohammad and Bravo-Marquez, 2017; ."}, {"id": 52, "string": "Automatically Creating Affect Lexicons: There is growing work on automatically determining word-sentiment and word-emotion associations (Yang et al., 2007; Mohammad and Kiritchenko, 2015; Yu et al., 2015; Staiano and Guerini, 2014) ."}, {"id": 53, "string": "The VAD Lexicon can be used to evaluate how accurately the automatic methods capture valence, arousal, and dominance."}, {"id": 54, "string": "Obtaining Human Ratings of Valence, Arousal, and Dominance We now describe how we selected the terms to be annotated and how we crowdsourced the annotation of the terms using best-worst scaling."}, {"id": 55, "string": "Term Selection We chose to annotate commonly used English terms."}, {"id": 56, "string": "We especially wanted to include terms that denotate or connotate emotions."}, {"id": 57, "string": "We also include terms common in tweets."}, {"id": 58, "string": "5 Specifically, we include terms from the following sources: • All terms in the NRC Emotion Lexicon (Mohammad and Turney, 2013) ."}, {"id": 59, "string": "It has about 14,000 words with labels indicating whether they are associated with any of the eight basic emotions: anger, anticipation, disgust, fear, joy, sadness, surprise, and trust (Plutchik, 1980) ."}, {"id": 60, "string": "• All 4,206 terms in the positive and negative lists of the General Inquirer (Stone et al., 1966) ."}, {"id": 61, "string": "• All 1,061 terms listed in ANEW (Bradley and Lang, 1999) ."}, {"id": 62, "string": "• All 13,915 terms listed in the Warriner et al."}, {"id": 63, "string": "(2013) lexicon."}, {"id": 64, "string": "• 520 words from the Roget's Thesaurus categories corresponding to the eight basic Plutchik emotions."}, {"id": 65, "string": "6 • About 1000 high-frequency content terms, including emoticons, from the Hashtag Emotion Corpus (HEC) (Mohammad, 2012)."}, {"id": 66, "string": "7 The union of the above sets resulted in 20,007 terms that were then annotated for valence, arousal, and dominance."}, {"id": 67, "string": "Annotating VAD via Best-Worst Scaling We describe below how we annotated words for valence."}, {"id": 68, "string": "The same approach is followed for arousal and dominance."}, {"id": 69, "string": "The annotators were presented with four words at a time (4-tuples) and asked to select the word with the highest valence and the word with the lowest valence."}, {"id": 70, "string": "The questionnaire uses a set of paradigm words that signify the two ends of the valence dimension."}, {"id": 71, "string": "The paradigm words were taken from past literature on VAD (Bradley and Lang, 1999; Osgood et al., 1957; Russell, 1980) ."}, {"id": 72, "string": "The questions used for valence are shown below."}, {"id": 73, "string": "Q1."}, {"id": 74, "string": "Which of the four words below is associated with the MOST happiness / pleasure / positiveness / satisfaction / con-  Questions for arousal and dominance are similar."}, {"id": 75, "string": "8 Detailed directions and example questions (with suitable responses) were provided in advance."}, {"id": 76, "string": "2 × N distinct 4-tuples were randomly generated in such a manner that each word is seen in eight different 4-tuples and no two 4-tuples have more than two items in common (where N is the number of words to be annotated)."}, {"id": 77, "string": "9 Crowdsourcing: We setup three separate crowdsourcing tasks corresponding to valence, arousal, and dominance."}, {"id": 78, "string": "The 4-tuples of words were uploaded for annotation on the crowdsourcing platform, CrowdFlower."}, {"id": 79, "string": "10 We obtained annotations from native speakers of English residing around the world."}, {"id": 80, "string": "Annotators were free to provide responses to as many 4-tuples as they wished."}, {"id": 81, "string": "The annotation tasks were approved by our institution's review board."}, {"id": 82, "string": "About 2% of the data was annotated beforehand by the authors."}, {"id": 83, "string": "These questions are referred to as gold questions."}, {"id": 84, "string": "CrowdFlower interspersed the gold questions with the other questions."}, {"id": 85, "string": "If a crowd worker answered a gold question incorrectly, then they were immediately notified, the annotation was discarded, and an additional annotation was requested from a different annotator."}, {"id": 86, "string": "If an annotator's accuracy on the gold questions fell below 80%, then they were refused further annotation, and all of their annotations were discarded."}, {"id": 87, "string": "This served as a mechanism to avoid malicious and random annotations."}, {"id": 88, "string": "The gold questions also served as examples to guide the annotators."}, {"id": 89, "string": "Table 2 : The terms with the highest (↑) and lowest (↓) valence (V), arousal (A), and dominance (D) scores in the VAD Lexicon."}, {"id": 90, "string": "In the task settings for CrowdFlower, we specified that we needed annotations from six people for each word."}, {"id": 91, "string": "11 However, because of the way the gold questions work in CrowdFlower, they were annotated by more than six people."}, {"id": 92, "string": "Both the minimum and the median number of annotations per item was six."}, {"id": 93, "string": "See Table 1 for summary statistics on the annotations."}, {"id": 94, "string": "12 Annotation Aggregation: The final VAD scores were calculated from the BWS responses using a simple counting procedure (Orme, 2009; Flynn and Marley, 2014) : For each item, the score is the proportion of times the item was chosen as the best (highest V/A/D) minus the proportion of times the item was chosen as the worst (lowest V/A/D)."}, {"id": 95, "string": "The scores were linearly transformed to the interval: 0 (lowest V/A/D) to 1 (the highest V/A/D)."}, {"id": 96, "string": "We refer to the list of words along with their scores for valence, arousal, and dominance as the NRC Valence, Arousal, and Dominance Lexicon, or the NRC VAD Lexicon for short."}, {"id": 97, "string": "Table 2 shows entries from the lexicon with the highest and lowest scores for V, A, and D. Demographic Survey Respondents who annotated our VAD questionnaires were given a special code through which they could then optionally respond to a separate CrowdFlower survey asking for their demographic information: age, gender, country they live in, and personality traits."}, {"id": 98, "string": "For the latter, we asked how they viewed themselves across the big five (Barrick and Mount, 1991) personality traits: • Agreeableness (Ag) -Disagreeableness (Di): friendly and compassionate or careful in whom to trust, argumentative • Conscientiousness (Co) -Easygoing (Ea): efficient and organized (prefer planned and self-disciplined behaviour) or easy-going and carefree (prefer flexibility and spontaneity) • Extrovert (Ex) -Introvert (In): outgoing, energetic, seek the company of others or solitary, reserved, meeting many people causes anxiety • Neurotic (Ne) -Secure (Se): sensitive and nervous (often feel anger, anxiety, depression, and vulnerability) or secure and confident (rarely feel anger, anxiety, depression, and vulnerability) • Open to experiences (Op) -Closed to experiences (Cl): inventive and curious (seek out new experiences) or consistent and cautious (anxious about new experiences) The questionnaire described the two sides of the dimension using only the texts after the colons above."}, {"id": 99, "string": "13 The questionnaire did not ask for identifying information such as name or date of birth."}, {"id": 100, "string": "In total, 991 people (55% of the VAD annotators) chose to provide their demographic information."}, {"id": 101, "string": "Table 3 shows the details."}, {"id": 102, "string": "Table 4 shows the results."}, {"id": 103, "string": "(These numbers were calculated for the 13,915 common terms across the two lexicons.)"}, {"id": 104, "string": "Observe that the especially low correlations for dominance and arousal indicate that our lexicon has substantially different scores and rankings of terms by these dimensions."}, {"id": 105, "string": "Even for valence, a correlation of 0.81 indicates a marked amount of differences in scores."}, {"id": 106, "string": "Independence of Dimensions Russell (1980) found through his factor analysis work that valence, arousal, and dominance are nearly independent dimensions."}, {"id": 107, "string": "However, Warriner et al."}, {"id": 108, "string": "(2013) report that their scores for valence and dominance have substantial correlation (r = 0.717)."}, {"id": 109, "string": "Given that the split-half reliability score for their dominance annotations is only 0.77, the high V-D correlations raises the suspicion whether annotators sufficiently understood the difference between dominance and valence."}, {"id": 110, "string": "Reliability of the Annotations A useful measure of quality is reproducibility of the end result-repeated independent manual annotations from multiple respondents should result in similar scores."}, {"id": 111, "string": "To assess this reproducibility, we calculate average split-half reliability (SHR) over 100 trials."}, {"id": 112, "string": "All annotations for an item (in our case, 4-tuples) are randomly split into two halves."}, {"id": 113, "string": "Two sets of scores are produced independently from the two halves."}, {"id": 114, "string": "Then the correlation between the two sets of scores is calculated."}, {"id": 115, "string": "If the annotations are of good quality, then the correlation between the two halves will be high."}, {"id": 116, "string": "Warriner et al."}, {"id": 117, "string": "(2013) , especially for arousal and dominance."}, {"id": 118, "string": "All differences in SHR scores between rows b and c are statistically significant."}, {"id": 119, "string": "Summary of Main Results: The low correlations between the scores in our lexicon and the Warriner lexicon (especially for D and A) show that the scores in the two lexicons are substantially different."}, {"id": 120, "string": "The scores for correlations across all pairs of dimensions in our lexicon are low (r < 0.5)."}, {"id": 121, "string": "SHR scores of 0.95 for valence, 0.9 for arousal, and 0.9 for dominance show for the first time that highly reliable fine-grained ratings can be obtained for valence, arousal, and dominance."}, {"id": 122, "string": "Shared Understanding of VAD Within and Across Demographic Groups Human cognition and behaviour is impacted by evolutionary and socio-cultural factors."}, {"id": 123, "string": "These factors are known to impact different groups of people differently (men vs. women, young vs. old, etc.)."}, {"id": 124, "string": "Thus it is not surprising that our understanding of the world may be slightly different de-pending on our demographic attributes."}, {"id": 125, "string": "Consider gender-a key demographic attribute."}, {"id": 126, "string": "14 Men, women, and other genders are substantially more alike than they are different."}, {"id": 127, "string": "However, they have encountered different socio-cultural influences for thousands of years."}, {"id": 128, "string": "Often these disparities have been a means to exert unequal status and asymmetric power relations."}, {"id": 129, "string": "Thus a crucial area in gender studies is to examine both the overt and subtle impacts of these socio-cultural influences, as well as ways to mitigate the inequity."}, {"id": 130, "string": "Understanding how different genders perceive and use language is an important component of that research."}, {"id": 131, "string": "Language use is also relevant to the understanding and treatment of neuropsychiatric disorders, such as sleep, mood, and anxiety disorders, which have been shown to occur more frequently in women than men (Bao and Swaab, 2011; Lewinsohn et al., 1998; McLean et al., 2011; Johnson et al., 2006; Chmielewski et al., 1995) ."}, {"id": 132, "string": "In addition to the VAD Lexicon (created by aggregating human judgments), we also make available the demographic information of the annotators."}, {"id": 133, "string": "This demographic information along with the individual judgments on the best-worst tuples forms a significant resource in the study of how demographic attributes are correlated with our understanding of language."}, {"id": 134, "string": "The data can be used to shed light on research questions such as: 'are there significant differences in the shared understanding of word meanings in men and women?"}, {"id": 135, "string": "', 'how is the social construct of gender reflected in language, especially in socio-political interactions?"}, {"id": 136, "string": "', 'does age impact our view of the valence, arousal, and dominance of concepts?"}, {"id": 137, "string": "', 'do people that view themselves as conscientious have slightly different judgments of valence, arousal, and dominance, than people who view themselves as easy going?"}, {"id": 138, "string": "', and so on."}, {"id": 139, "string": "14 Note that the term sex refers to a biological attribute pertaining to the anatomy of one's reproductive system and sex chromosomes, whereas gender refers to a psycho-sociocultural construct based on a person's sex or a person's self identification of levels of masculinity and femininity."}, {"id": 140, "string": "One may identify their gender as female, male, agender, trans, queer, etc."}, {"id": 141, "string": "Table 8 : Gender: Significance of difference in average agreement scores (p = 0.05)."}, {"id": 142, "string": "'y' = yes significant."}, {"id": 143, "string": "'-' = not significant."}, {"id": 144, "string": "Experiments We now describe experiments we conducted to determine whether demographic attributes impact how we judge words for valence, arousal, and dominance."}, {"id": 145, "string": "For each demographic attribute, we partitioned the annotators into two groups: male (m) and female (f), ages 18 to 35 (≤35) and ages over 35 (>35), and so on."}, {"id": 146, "string": "15 For each of the five personality traits, annotators are partitioned into the two groups shown in the bullet list of Section 4."}, {"id": 147, "string": "We then calculated the extent to which people within the same group agreed with each other, and the extent to which people across groups agreed with each other on the VAD annotations (as described in the paragraph below)."}, {"id": 148, "string": "We also determined if the differences in agreement were statistically significant."}, {"id": 149, "string": "For each dimension (V, A, and D), we first collected only those 4-tuples where at least two female and at least two male responses were available."}, {"id": 150, "string": "We will refer to this set as the base set."}, {"id": 151, "string": "For each of the base set 4-tuples, we calculated three agreement percentages: 1. the percentage of all female-female best-worst responses where the two agreed with each other, 2. the percentage of all male-male responses where the two agreed with each other, and 3. the percentage of all female-male responses where the two agreed with each other."}, {"id": 152, "string": "We then calculated the averages of the agreement percentages across all the 4-tuples in the base set."}, {"id": 153, "string": "We conducted similar experiments for age groups and personality traits."}, {"id": 154, "string": "Table 10 : Age: Significance of difference in average agreement scores (p = 0.05)."}, {"id": 155, "string": "Table 7 shows the results for gender."}, {"id": 156, "string": "Note that the average agreement numbers are not expected to be high because often a 4-tuple may include two words that are close to each other in terms of the property of interest (V/A/D)."}, {"id": 157, "string": "16 However, the relative values of the agreement percentages indicate the relative levels of agreements within groups and across groups."}, {"id": 158, "string": "Table 7 numbers indicate that women have a higher shared understanding of the degree of arousal of words (higher f-f average agreement scores on A), whereas men have a higher shared understanding of dominance and valence of words (higher m-m average agreement scores on V and D)."}, {"id": 159, "string": "The table also shows the cross-group (f-m) average agreements are the lowest for valence and arousal, but higher than f-f pairs for dominance."}, {"id": 160, "string": "(Each of these agreements was determined from 1 to 1.5 million judgment pairs.)"}, {"id": 161, "string": "Table 8 shows which of the Table 7 average agreements are statistically significantly different (shown with a 'y')."}, {"id": 162, "string": "Significance values were calculated using the chi-square test for independence and significance level of 0.05."}, {"id": 163, "string": "Observe that all score differences are statistically significant except for between f-f and f-m scores for V and mm and f-m scores for A."}, {"id": 164, "string": "Tables 9 through 12 are similar to Tables 7 and  8 , but for age groups and personality traits."}, {"id": 165, "string": "Tables 9 and 10 show that respondents over the age of 35 obtain significantly higher agreements with each other on valence and arousal and lower agreements on dominance, than respondents aged 35 and under (with each other)."}, {"id": 166, "string": "Tables 11 and 12 show that  some personality traits significantly impact a person's annotations of one or more of V, A, and D. Notably, those who view themselves as conscientious have a particularly higher shared understanding of the dominance of words, as compared to those who view themselves as easy going."}, {"id": 167, "string": "They also have higher in-group agreement for arousal, than those who view themselves as easy going, but the difference for valence is not statistically significant."}, {"id": 168, "string": "Also notable, is that those who view themselves as extroverts have a particularly higher shared understanding of the valence, arousal, and dominance of words, as compared to those who view themselves as introverts."}, {"id": 169, "string": "Finally, as a sanity check, we divided respondents into those whose CrowdFlower worker ids are odd and those whose worker ids are even."}, {"id": 170, "string": "We then determined average agreements for even-even, odd-odd, and even-odd groups just as we did for the demographic variables."}, {"id": 171, "string": "We found that, as expected, there were no significant differences in average agreements."}, {"id": 172, "string": "Results Summary of Main Results: We showed that several demographic attributes such as age, gender, and personality traits impact how we judge words for valence, arousal, and dominance."}, {"id": 173, "string": "Further,  people that share certain demographic attributes show a higher shared understanding of the relative rankings of words by (one or more of) V, A, or D than others."}, {"id": 174, "string": "However, this raises new questions: why do certain demographic attributes impact our judgments of V, A, and D?"}, {"id": 175, "string": "Are there evolutionary forces that caused some groups such as women to develop a higher shared understanding or the arousal, whereas different evolutionary forces caused some groups, such as men, to have a higher shared understanding of dominance?"}, {"id": 176, "string": "We hope that the data collected as part of this project will spur further inquiry into these and other questions."}, {"id": 177, "string": "Applications and Future Work The large number of entries in the VAD Lexicon and the high reliability of the scores make it useful for a number of research projects and applications."}, {"id": 178, "string": "We list a few below: • To provide features for sentiment or emotion detection systems."}, {"id": 179, "string": "They can also be used to obtain sentiment-aware word embeddings and sentiment-aware sentence representations."}, {"id": 180, "string": "• To study the interplay between the basic emotion model and the VAD model of affect."}, {"id": 181, "string": "The VAD lexicon can be used along with lists of words associated with emotions such as joy, sadness, fear, etc."}, {"id": 182, "string": "to study the correlation of V, A, and D, with those emotions."}, {"id": 183, "string": "• To study the role emotion words play in high emotion intensity sentences or tweets."}, {"id": 184, "string": "The Tweet Emotion Intensity Dataset has emotion intensity and valence scores for whole tweets (Mohammad and Bravo-Marquez, 2017)."}, {"id": 185, "string": "We will use the VAD lexicon to determine the extent to which high intensity and high valence tweets consist of high V, A, and D words, and to identify sentences that express high emotional intensity without using high V, A, and D words."}, {"id": 186, "string": "• To identify syllables that tend to occur in words with high VAD scores, which in turn can be used to generate names for literary characters and commercial products that have the desired affectual response."}, {"id": 187, "string": "• To identify high V, A, and D words in books and literature."}, {"id": 188, "string": "To facilitate research in digital humanities."}, {"id": 189, "string": "To facilitate work on literary analysis."}, {"id": 190, "string": "• As a source of gold (reference) scores, the entries in the VAD lexicon can be used in the evaluation of automatic methods of determining V, A, and D. • To analyze V, A, ad D annotations for different groups of words, such as: hashtag words and emojis common in tweets, emotion denotating words, emotion associated words, neutral terms, words belonging to particular parts of speech such as nouns, verbs, and adjectives, etc."}, {"id": 191, "string": "• To analyze interactions between demographic groups and specific groups of words, for example, whether younger annotators have a higher shared understanding of tweet terms, whether a certain gender is associated with a higher shared understanding of adjectives, etc."}, {"id": 192, "string": "• To analyze the shared understanding of V, A, and D within and across geographic and language groups."}, {"id": 193, "string": "We are interested in creating VAD lexicons for other languages."}, {"id": 194, "string": "We can then explore characteristics of valence, arousal, and dominance that are common across cultures."}, {"id": 195, "string": "We can also test whether some of the conclusions reached in this work apply only to English, or more broadly to multiple languages."}, {"id": 196, "string": "• The dataset is of use to psychologists and evolutionary linguists interested in determining how evolution shaped our representation of the world around us, and why certain personality traits are associated with higher or lower shared understanding of V, A, and D. Conclusions We obtained reliable human ratings of valence, arousal, and dominance for more than 20,000 English words."}, {"id": 197, "string": "(It has about 40% more words than the largest existing manually created VAD lexicon)."}, {"id": 198, "string": "We used best-worst scaling to obtain finegrained scores (and word rankings) and addressed issues of annotation consistency that plague traditional rating scale methods of annotation."}, {"id": 199, "string": "We showed that the lexicon has split-half reliability scores of 0.95 for valence, 0.90 for arousal, and 0.90 for dominance."}, {"id": 200, "string": "These scores are markedly higher than that of existing lexicons."}, {"id": 201, "string": "We analyzed demographic information to show that even though the annotations overall lead to consistent scores in repeated annotations, there exist statistically significant differences in agreements across demographic groups such as males and females, those above the age of 35 and those that are 35 or under, and across personality dimensions (extroverts and introverts, neurotic and secure, etc.)."}, {"id": 202, "string": "These results show that certain demographic attributes impact how we view the world around us in terms of the relative valence, arousal, and dominance of the concepts in it."}, {"id": 203, "string": "The NRC Valence, Arousal, and Dominance Lexicon is made available."}, {"id": 204, "string": "17 It can be used in combination with other manually created affect lexicons such as the NRC Word-Emotion Association Lexicon (Mohammad and Turney, 2013) 18 and the NRC Affect Intensity Lexicon ."}, {"id": 205, "string": "19"}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 53}, {"section": "Obtaining Human Ratings of Valence, Arousal, and Dominance", "n": "3", "start": 54, "end": 54}, {"section": "Term Selection", "n": "3.1", "start": 55, "end": 66}, {"section": "Annotating VAD via Best-Worst Scaling", "n": "3.2", "start": 67, "end": 96}, {"section": "Demographic Survey", "n": "4", "start": 97, "end": 105}, {"section": "Independence of Dimensions", "n": "5.2", "start": 106, "end": 109}, {"section": "Reliability of the Annotations", "n": "5.3", "start": 110, "end": 121}, {"section": "Shared Understanding of VAD Within and Across Demographic Groups", "n": "6", "start": 122, "end": 143}, {"section": "Experiments", "n": "6.1", "start": 144, "end": 176}, {"section": "Applications and Future Work", "n": "7", "start": 177, "end": 196}, {"section": "Conclusions", "n": "8", "start": 197, "end": 205}], "figures": [{"filename": "../figure/image/1329-Table6-1.png", "caption": "Table 6: Split-half reliabilities (as measured by Pearson correlation) for valence, arousal, and dominance scores obtained from our annotations and the Warriner et al. annotations.", "page": 5, "bbox": {"x1": 109.92, "x2": 488.15999999999997, "y1": 62.879999999999995, "y2": 104.16}}, {"filename": "../figure/image/1329-Table7-1.png", "caption": "Table 7: Gender: Average agreement % on best– worst responses.", "page": 6, "bbox": {"x1": 106.56, "x2": 255.35999999999999, "y1": 62.879999999999995, "y2": 104.16}}, {"filename": "../figure/image/1329-Table10-1.png", "caption": "Table 10: Age: Significance of difference in average agreement scores (p = 0.05).", "page": 6, "bbox": {"x1": 318.71999999999997, "x2": 514.0799999999999, "y1": 154.56, "y2": 197.28}}, {"filename": "../figure/image/1329-Table8-1.png", "caption": "Table 8: Gender: Significance of difference in average agreement scores (p = 0.05). ‘y’ = yes significant. ‘-’ = not significant.", "page": 6, "bbox": {"x1": 103.67999999999999, "x2": 259.2, "y1": 157.44, "y2": 200.16}}, {"filename": "../figure/image/1329-Table9-1.png", "caption": "Table 9: Age: Average agreement % on best– worst responses.", "page": 6, "bbox": {"x1": 333.59999999999997, "x2": 499.2, "y1": 62.879999999999995, "y2": 104.16}}, {"filename": "../figure/image/1329-Table11-1.png", "caption": "Table 11: Personality Trait: Average agreement % on best–worst responses.", "page": 7, "bbox": {"x1": 97.92, "x2": 264.0, "y1": 62.879999999999995, "y2": 335.03999999999996}}, {"filename": "../figure/image/1329-Table12-1.png", "caption": "Table 12: Personality Trait: Significance of difference in average agreement scores (p = 0.05).", "page": 7, "bbox": {"x1": 342.71999999999997, "x2": 490.08, "y1": 62.879999999999995, "y2": 286.08}}, {"filename": "../figure/image/1329-Table1-1.png", "caption": "Table 1: A summary of the annotations for valence, arousal, and dominance. MAI = minimum number of annotations per item. Q = questions. A total of 778,085 pairs of best–worst responses were obtained.", "page": 3, "bbox": {"x1": 72.96, "x2": 524.16, "y1": 63.839999999999996, "y2": 125.28}}, {"filename": "../figure/image/1329-Table2-1.png", "caption": "Table 2: The terms with the highest (↑) and lowest (↓) valence (V), arousal (A), and dominance (D) scores in the VAD Lexicon.", "page": 3, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 183.84, "y2": 288.96}}, {"filename": "../figure/image/1329-Table4-1.png", "caption": "Table 4: Pearson correlations between our V, A, and D scores and the Warriner scores.", "page": 4, "bbox": {"x1": 334.56, "x2": 498.24, "y1": 62.879999999999995, "y2": 84.0}}, {"filename": "../figure/image/1329-Table3-1.png", "caption": "Table 3: Summary of the demographic information provided by the annotators.", "page": 4, "bbox": {"x1": 99.84, "x2": 262.08, "y1": 62.879999999999995, "y2": 148.32}}, {"filename": "../figure/image/1329-Table5-1.png", "caption": "Table 5: Pearson correlations between various pair-wise combinations of V, A, and D.", "page": 4, "bbox": {"x1": 317.76, "x2": 515.04, "y1": 142.56, "y2": 184.32}}]}