{"title": "Ultra-Fine Entity Typing", "abstract": "We introduce a new entity typing task: given a sentence with an entity mention, the goal is to predict a set of free-form phrases (e.g. skyscraper, songwriter, or criminal) that describe appropriate types for the target entity. This formulation allows us to use a new type of distant supervision at large scale: head words, which indicate the type of the noun phrases they appear in. We show that these ultra-fine types can be crowd-sourced, and introduce new evaluation sets that are much more diverse and fine-grained than existing benchmarks. We present a model that can predict open types, and is trained using a multitask objective that pools our new head-word supervision with prior supervision from entity linking. Experimental results demonstrate that our model is effective in predicting entity types at varying granularity; it achieves state of the art performance on an existing fine-grained entity typing benchmark, and sets baselines for our newly-introduced datasets. 1", "text": [{"id": 0, "string": "Introduction Entities can often be described by very fine grained types."}, {"id": 1, "string": "Consider the sentences \"Bill robbed John."}, {"id": 2, "string": "He was arrested.\""}, {"id": 3, "string": "The noun phrases \"John,\" \"Bill,\" and \"he\" have very specific types that can be inferred from the text."}, {"id": 4, "string": "This includes the facts that \"Bill\" and \"he\" are both likely \"criminal\" due to the \"robbing\" and \"arresting,\" while \"John\" is more likely a \"victim\" because he was \"robbed.\""}, {"id": 5, "string": "Such fine-grained types (victim, criminal) Table 1 : Examples of entity mentions and their annotated types, as annotated in our dataset."}, {"id": 6, "string": "The entity mentions are bold faced and in the curly brackets."}, {"id": 7, "string": "The bold blue types do not appear in existing fine-grained type ontologies."}, {"id": 8, "string": "as coreference resolution and question answering (e.g."}, {"id": 9, "string": "\"Who was the victim?\")."}, {"id": 10, "string": "Inferring such types for each mention (John, he) is not possible given current typing models that only predict relatively coarse types and only consider named entities."}, {"id": 11, "string": "To address this challenge, we present a new task: given a sentence with a target entity mention, predict free-form noun phrases that describe appropriate types for the role the target entity plays in the sentence."}, {"id": 12, "string": "Table 1 shows three examples that exhibit a rich variety of types at different granularities."}, {"id": 13, "string": "Our task effectively subsumes existing finegrained named entity typing formulations due to the use of a very large type vocabulary and the fact that we predict types for all noun phrases, including named entities, nominals, and pronouns."}, {"id": 14, "string": "Incorporating fine-grained entity types has improved entity-focused downstream tasks, such as relation extraction (Yaghoobzadeh et al., 2017a) , question answering (Yavuz et al., 2016) , query analysis (Balog and Neumayer, 2012) , and coreference resolution (Durrett and Klein, 2014) ."}, {"id": 15, "string": "These systems used a relatively coarse type ontology."}, {"id": 16, "string": "However, manually designing the ontology is a challenging task, and it is difficult to cover all pos- Figure 1 : A visualization of all the labels that cover 90% of the data, where a bubble's size is proportional to the label's frequency."}, {"id": 17, "string": "Our dataset is much more diverse and fine grained when compared to existing datasets (OntoNotes and FIGER), in which the top 5 types cover 70-80% of the data."}, {"id": 18, "string": "sible concepts even within a limited domain."}, {"id": 19, "string": "This can be seen empirically in existing datasets, where the label distribution of fine-grained entity typing datasets is heavily skewed toward coarse-grained types."}, {"id": 20, "string": "For instance, annotators of the OntoNotes dataset  marked about half of the mentions as \"other,\" because they could not find a suitable type in their ontology (see Figure 1 for a visualization and Section 2.2 for details)."}, {"id": 21, "string": "Our more open, ultra-fine vocabulary, where types are free-form noun phrases, alleviates the need for hand-crafted ontologies, thereby greatly increasing overall type coverage."}, {"id": 22, "string": "To better understand entity types in an unrestricted setting, we crowdsource a new dataset of 6,000 examples."}, {"id": 23, "string": "Compared to previous fine-grained entity typing datasets, the label distribution in our data is substantially more diverse and fine-grained."}, {"id": 24, "string": "Annotators easily generate a wide range of types and can determine with 85% agreement if a type generated by another annotator is appropriate."}, {"id": 25, "string": "Our evaluation data has over 2,500 unique types, posing a challenging learning problem."}, {"id": 26, "string": "While our types are harder to predict, they also allow for a new form of contextual distant supervision."}, {"id": 27, "string": "We observe that text often contains cues that explicitly match a mention to its type, in the form of the mention's head word."}, {"id": 28, "string": "For example, \"the incumbent chairman of the African Union\" is a type of \"chairman.\""}, {"id": 29, "string": "This signal complements the supervision derived from linking entities to knowledge bases, which is context-oblivious."}, {"id": 30, "string": "For example, \"Clint Eastwood\" can be described with dozens of types, but context-sensitive typing would prefer \"director\" instead of \"mayor\" for the sentence \"Clint Eastwood won 'Best Director' for Million Dollar Baby.\""}, {"id": 31, "string": "We combine head-word supervision, which provides ultra-fine type labels, with traditional signals from entity linking."}, {"id": 32, "string": "Although the problem is more challenging at finer granularity, we find that mixing fine and coarse-grained supervision helps significantly, and that our proposed model with a multitask objective exceeds the performance of existing entity typing models."}, {"id": 33, "string": "Lastly, we show that head-word supervision can be used for previous formulations of entity typing, setting the new state-of-the-art performance on an existing finegrained NER benchmark."}, {"id": 34, "string": "Task and Data Given a sentence and an entity mention e within it, the task is to predict a set of natural-language phrases T that describe the type of e. The selection of T is context sensitive; for example, in \"Bill Gates has donated billions to eradicate malaria,\" Bill Gates should be typed as \"philanthropist\" and not \"inventor.\""}, {"id": 35, "string": "This distinction is important for context-sensitive tasks such as coreference resolution and question answering (e.g."}, {"id": 36, "string": "\"Which philanthropist is trying to prevent malaria?\")."}, {"id": 37, "string": "We annotate a dataset of about 6,000 mentions via crowdsourcing (Section 2.1), and demonstrate that using an large type vocabulary substantially increases annotation coverage and diversity over existing approaches (Section 2.2)."}, {"id": 38, "string": "Crowdsourcing Entity Types To capture multiple domains, we sample sentences from Gigaword (Parker et al., 2011) , OntoNotes (Hovy et al., 2006) , and web articles (Singh et al., 2012) ."}, {"id": 39, "string": "We select entity mentions by taking maximal noun phrases from a constituency parser (Manning et al., 2014) and mentions from a coreference resolution system (Lee et al., 2017) ."}, {"id": 40, "string": "We provide the sentence and the target entity mention to five crowd workers on Mechanical Turk, and ask them to annotate the entity's type."}, {"id": 41, "string": "To encourage annotators to generate fine-grained types, we require at least one general type (e.g."}, {"id": 42, "string": "person, organization, location) and two specific types (e.g."}, {"id": 43, "string": "doctor, fish, religious institute), from a type vocabulary of about 10K frequent noun phrases."}, {"id": 44, "string": "We use WordNet (Miller, 1995) to expand these types automatically by generating all their synonyms and hypernyms based on the most common sense, and ask five different annotators to validate the generated types."}, {"id": 45, "string": "Each pair of annotators agreed on 85% of the binary validation decisions (i.e."}, {"id": 46, "string": "whether a type is suitable or not) and 0.47 in Fleiss's κ."}, {"id": 47, "string": "To further improve consistency, the final type set contained only types selected by at least 3/5 annotators."}, {"id": 48, "string": "Further crowdsourcing details are available in the supplementary material."}, {"id": 49, "string": "Our collection process focuses on precision."}, {"id": 50, "string": "Thus, the final set is diverse but not comprehensive, making evaluation non-trivial (see Section 5)."}, {"id": 51, "string": "Data Analysis We collected about 6,000 examples."}, {"id": 52, "string": "For analysis, we classified each type into three disjoint bins: • 9 general types: person, location, object, organization, place, entity, object, time, event • 121 fine-grained types, mapped to fine-grained entity labels from prior work ) (e.g."}, {"id": 53, "string": "film, athlete) • 10,201 ultra-fine types, encompassing every other label in the type space (e.g."}, {"id": 54, "string": "detective, lawsuit, temple, weapon, composer) On average, each example has 5 labels: 0.9 general, 0.6 fine-grained, and 3.9 ultra-fine types."}, {"id": 55, "string": "Among the 10,000 ultra-fine types, 2,300 unique types were actually found in the 6,000 crowdsourced examples."}, {"id": 56, "string": "Nevertheless, our distant supervision data (Section 3) provides positive training examples for every type in the entire vocabulary, and our model (Section 4) can and does predict from a 10K type vocabulary."}, {"id": 57, "string": "For example, Figure 2 : The label distribution across different evaluation datasets."}, {"id": 58, "string": "In existing datasets, the top 4 or 7 labels cover over 80% of the labels."}, {"id": 59, "string": "In ours, the top 50 labels cover less than 50% of the data."}, {"id": 60, "string": "the model correctly predicts \"television network\" and \"archipelago\" for some mentions, even though that type never appears in the 6,000 crowdsourced examples."}, {"id": 61, "string": "Improving Type Coverage We observe that prior fine-grained entity typing datasets are heavily focused on coarse-grained types."}, {"id": 62, "string": "To quantify our observation, we calculate the distribution of types in FIGER , OntoNotes , and our data."}, {"id": 63, "string": "For examples with multiple types (|T | > 1), we counted each type 1/|T | times."}, {"id": 64, "string": "Figure 2 shows the percentage of labels covered by the top N labels in each dataset."}, {"id": 65, "string": "In previous enitity typing datasets, the distribution of labels is highly skewed towards the top few labels."}, {"id": 66, "string": "To cover 80% of the examples, FIGER requires only the top 7 types, while OntoNotes needs only 4; our dataset requires 429 different types."}, {"id": 67, "string": "Figure 1 takes a deeper look by visualizing the types that cover 90% of the data, demonstrating the diversity of our dataset."}, {"id": 68, "string": "It is also striking that more than half of the examples in OntoNotes are classified as \"other,\" perhaps because of the limitation of its predefined ontology."}, {"id": 69, "string": "Improving Mention Coverage Existing datasets focus mostly on named entity mentions, with the exception of OntoNotes, which contained nominal expressions."}, {"id": 70, "string": "This has implications on the transferability of FIGER/OntoNotes-based models to tasks such as coreference resolution, which need to analyze all types of entity mentions (pronouns, nominal expressions, and named entity Distant Supervision Training data for fine-grained NER systems is typically obtained by linking entity mentions and drawing their types from knowledge bases (KBs)."}, {"id": 71, "string": "This approach has two limitations: recall can suffer due to KB incompleteness (West et al., 2014) , and precision can suffer when the selected types do not fit the context (Ritter et al., 2011) ."}, {"id": 72, "string": "We alleviate the recall problem by mining entity mentions that were linked to Wikipedia in HTML, and extract relevant types from their encyclopedic definitions (Section 3.1)."}, {"id": 73, "string": "To address the precision issue (context-insensitive labeling), we propose a new source of distant supervision: automatically extracted nominal head words from raw text (Section 3.2)."}, {"id": 74, "string": "Using head words as a form of distant supervision provides fine-grained information about named entities and nominal mentions."}, {"id": 75, "string": "While a KB may link \"the 44th president of the United States\" to many types such as author, lawyer, and professor, head words provide only the type \"president\", which is relevant in the context."}, {"id": 76, "string": "We experiment with the new distant supervision sources as well as the traditional KB supervision."}, {"id": 77, "string": "Table 2 shows examples and statistics for each source of supervision."}, {"id": 78, "string": "We annotate 100 examples from each source to estimate the noise and usefulness in each signal (precision in Table 2 )."}, {"id": 79, "string": "Entity Linking For KB supervision, we leveraged training data from prior work  by manually mapping their ontology to our 10,000 noun type vocabulary, which covers 130 of our labels (general and fine-grained)."}, {"id": 80, "string": "2 Section 6 defines this mapping in more detail."}, {"id": 81, "string": "To improve both entity and type coverage of KB supervision, we use definitions from Wikipedia."}, {"id": 82, "string": "We follow Shnarch et al."}, {"id": 83, "string": "() who observed that the first sentence of a Wikipedia article often states the entity's type via an \"is a\" relation; for example, \"Roger Federer is a Swiss professional tennis player.\""}, {"id": 84, "string": "Since we are using a large type vocabulary, we can now mine this typing information."}, {"id": 85, "string": "3 We extracted descriptions for 3.1M entities which contain 4,600 unique type labels such as \"competition,\" \"movement,\" and \"village.\""}, {"id": 86, "string": "We bypass the challenge of automatically linking entities to Wikipedia by exploiting existing hyperlinks in web pages (Singh et al., 2012) , following prior work Yosef et al., 2012) ."}, {"id": 87, "string": "Since our heuristic extraction of types from the definition sentence is somewhat noisy, we use a more conservative entity linking policy 4 that yields a signal with similar overall accuracy to KB-linked data."}, {"id": 88, "string": "2 Data from: https://github.com/ shimaokasonse/NFGEC 3 We extract types by applying a dependency parser (Manning et al., 2014) to the definition sentence, and taking nouns that are dependents of a copular edge or connected to nouns linked to copulars via appositive or conjunctive edges."}, {"id": 89, "string": "4 Only link if the mention contains the Wikipedia entity's name and the entity's name contains the mention's head."}, {"id": 90, "string": "Contextualized Supervision Many nominal entity mentions include detailed type information within the mention itself."}, {"id": 91, "string": "For example, when describing Titan V as \"the newlyreleased graphics card\", the head words and phrases of this mention (\"graphics card\" and \"card\") provide a somewhat noisy, but very easy to gather, context-sensitive type signal."}, {"id": 92, "string": "We extract nominal head words with a dependency parser (Manning et al., 2014) from the Gigaword corpus as well as the Wikilink dataset."}, {"id": 93, "string": "To support multiword expressions, we included nouns that appear next to the head if they form a phrase in our type vocabulary."}, {"id": 94, "string": "Finally, we lowercase all words and convert plural to singular."}, {"id": 95, "string": "Our analysis reveals that this signal has a comparable accuracy to the types extracted from entity linking (around 80%)."}, {"id": 96, "string": "Many errors are from the parser, and some errors stem from idioms and transparent heads (e.g."}, {"id": 97, "string": "\"parts of capital\" labeled as \"part\")."}, {"id": 98, "string": "While the headword is given as an input to the model, with heavy regularization and multitasking with other supervision sources, this supervision helps encode the context."}, {"id": 99, "string": "Model We design a model for predicting sets of types given a mention in context."}, {"id": 100, "string": "The architecture resembles the recent neural AttentiveNER model (Shimaoka et al., 2017) , while improving the sentence and mention representations, and introducing a new multitask objective to handle multiple sources of supervision."}, {"id": 101, "string": "The hyperparameter settings are listed in the supplementary material."}, {"id": 102, "string": "Context Representation Given a sentence x 1 , ."}, {"id": 103, "string": "."}, {"id": 104, "string": "."}, {"id": 105, "string": ", x n , we represent each token x i using a pre-trained word embedding w i ."}, {"id": 106, "string": "We concatenate an additional location embedding l i which indicates whether x i is before, inside, or after the mention."}, {"id": 107, "string": "We then use [x i ; l i ] as an input to a bidirectional LSTM, producing a contextualized representation h i for each token; this is different from the architecture of Shimaoka et al."}, {"id": 108, "string": "2017 , who used two separate bidirectional LSTMs on each side of the mention."}, {"id": 109, "string": "Finally, we represent the context c as a weighted sum of the contextualized token representations using MLP-based attention: a i = SoftMax i (v a · relu(W a h i )) Where W a and v a are the parameters of the attention mechanism's MLP, which allows interaction between the forward and backward directions of the LSTM before computing the weight factors."}, {"id": 110, "string": "Mention Representation We represent the mention m as the concatenation of two items: (a) a character-based representation produced by a CNN on the entire mention span, and (b) a weighted sum of the pre-trained word embeddings in the mention span computed by attention, similar to the mention representation in a recent coreference resolution model (Lee et al., 2017) ."}, {"id": 111, "string": "The final representation is the concatenation of the context and mention representations: r = [c; m]."}, {"id": 112, "string": "Label Prediction We learn a type label embedding matrix W t ∈ R n×d where n is the number of labels in the prediction space and d is the dimension of r. This matrix can be seen as a combination of three sub matrices, W general , W f ine , W ultra , each of which contains the representations of the general, fine, and ultra-fine types respectively."}, {"id": 113, "string": "We predict each type's probability via the sigmoid of its inner product with r: y = σ(W t r)."}, {"id": 114, "string": "We predict every type t for which y t > 0.5, or arg max y t if there is no such type."}, {"id": 115, "string": "Multitask Objective The distant supervision sources provide partial supervision for ultra-fine types; KBs often provide more general types, while head words usually provide only ultra-fine types, without their generalizations."}, {"id": 116, "string": "In other words, the absence of a type at a different level of abstraction does not imply a negative signal; e.g."}, {"id": 117, "string": "when the head word is \"inventor\", the model should not be discouraged to predict \"person\"."}, {"id": 118, "string": "Prior work used a customized hinge loss  or max margin loss  to improve robustness to noisy or incomplete supervision."}, {"id": 119, "string": "We propose a multitask objective that reflects the characteristic of our training dataset."}, {"id": 120, "string": "Instead of updating all labels for each example, we divide labels into three bins (general, fine, and ultra-fine), and update labels only in bin containing at least one positive label."}, {"id": 121, "string": "Specifically, the training objective is to minimize J where t is the target vector at each granularity: J all = J general · 1 general (t) + J fine · 1 fine (t) + J ultra · 1 ultra (t) Where 1 category (t) is an indicator function that checks if t contains a type in the category, and   J category is the category-specific logistic regression objective: J = − i t i · log(y i ) + (1 − t i ) · log(1 − y i ) Evaluation Experiment Setup The crowdsourced dataset (Section 2.1) was randomly split into train, development, and test sets, each with about 2,000 examples."}, {"id": 122, "string": "We use this relatively small manuallyannotated training set (Crowd in Table 4 ) alongside the two distant supervision sources: entity linking (KB and Wikipedia definitions) and head words."}, {"id": 123, "string": "To combine supervision sources of different magnitudes (2K crowdsourced data, 4.7M entity linking data, and 20M head words), we sample a batch of equal size from each source at each iteration."}, {"id": 124, "string": "We reimplement the recent AttentiveNER model (Shimaoka et al., 2017) for reference."}, {"id": 125, "string": "5 We report macro-averaged precision, recall, and F1, and the average mean reciprocal rank (MRR)."}, {"id": 126, "string": "Results Table 3 shows the performance of our model and our reimplementation of Atten-tiveNER."}, {"id": 127, "string": "Our model, which uses a multitask objective to learn finer types without punishing more general types, shows recall gains at the cost of drop in precision."}, {"id": 128, "string": "The MRR score shows that our model is slightly better than the baseline at ranking correct types above incorrect ones."}, {"id": 129, "string": "Table 4 shows the performance breakdown for different type granularity and different supervision."}, {"id": 130, "string": "Overall, as seen in previous work on finegrained NER literature , finer labels were more challenging to predict than coarse grained labels, and this issue is exacerbated when dealing with ultra-fine types."}, {"id": 131, "string": "All sources of supervision appear to be useful, with crowdsourced examples making the biggest impact."}, {"id": 132, "string": "Head word supervision is particularly helpful for predicting ultra-fine labels, while entity linking improves fine label prediction."}, {"id": 133, "string": "The low general type performance is partially because of nominal/pronoun mentions (e.g."}, {"id": 134, "string": "\"it\"), and because of the large type inventory (sometimes \"location\" and \"place\" are annotated interchangeably)."}, {"id": 135, "string": "Analysis We manually analyzed 50 examples from the development set, four of which we present in Table 5 ."}, {"id": 136, "string": "Overall, the model was able to generate accurate general types and a diverse set of type labels."}, {"id": 137, "string": "Despite our efforts to annotate a comprehensive type set, the gold labels still miss many potentially correct labels (example (a): \"man\" is reasonable but counted as incorrect)."}, {"id": 138, "string": "This makes the precision estimates lower than the actual performance level, with about half the precision errors belonging to this category."}, {"id": 139, "string": "Real precision errors include predicting co-hyponyms (example (b): \"accident\" instead of \"attack\"), and types that  may be true, but are not supported by the context."}, {"id": 140, "string": "We found that the model often abstained from predicting any fine-grained types."}, {"id": 141, "string": "Especially in challenging cases as in example (c), the model predicts only general types, explaining the low recall numbers (28% of examples belong to this category)."}, {"id": 142, "string": "Even when the model generated correct fine-grained types as in example (d), the recall was often fairly low since it did not generate a complete set of related fine-grained labels."}, {"id": 143, "string": "Estimating the performance of a model in an incomplete label setting and expanding label coverage are interesting areas for future work."}, {"id": 144, "string": "Our task also poses a potential modeling challenge; sometimes, the model predicts two incongruous types (e.g."}, {"id": 145, "string": "\"location\" and \"person\"), which points towards modeling the task as a joint set prediction task, rather than predicting labels individually."}, {"id": 146, "string": "We provide sample outputs on the project website."}, {"id": 147, "string": "Improving Existing Fine-Grained NER with Better Distant Supervision We show that our model and distant supervision can improve performance on an existing finegrained NER task."}, {"id": 148, "string": "We chose the widely-used OntoNotes  dataset which includes nominal and named entity mentions."}, {"id": 149, "string": "6 6 While we were inspired by FIGER , the dataset presents technical difficulties."}, {"id": 150, "string": "The test set has only 600 examples, and the development set was labeled with distant supervision, not manual annotation."}, {"id": 151, "string": "We therefore focus our evaluation on OntoNotes."}, {"id": 152, "string": "Augmenting the Training Data The original OntoNotes training set (ONTO in Tables 6 and 7) is extracted by linking entities to a KB."}, {"id": 153, "string": "We supplement this dataset with our two new sources of distant supervision: Wikipedia definition sentences (WIKI) and head word supervision (HEAD) (see Section 3)."}, {"id": 154, "string": "To convert the label space, we manually map a single noun from our natural-language vocabulary to each formal-language type in the OntoNotes ontology."}, {"id": 155, "string": "77% of OntoNote's types directly correspond to suitable noun labels (e.g."}, {"id": 156, "string": "\"doctor\" to \"/person/doctor\"), whereas the other cases were mapped with minimal manual effort (e.g."}, {"id": 157, "string": "\"musician\" to \"person/artist/music\", \"politician\" to \"/person/political figure\")."}, {"id": 158, "string": "We then expand these labels according to the ontology to include their hypernyms (\"/person/political figure\" will also generate \"/person\")."}, {"id": 159, "string": "Lastly, we create negative examples by assigning the \"/other\" label to examples that are not mapped to the ontology."}, {"id": 160, "string": "The augmented dataset contains 2.5M/0.6M new positive/negative examples, of which 0.9M/0.1M are from Wikipedia definition sentences and 1.6M/0.5M from head words."}, {"id": 161, "string": "Experiment Setup We compare performance to other published results and to our reimplementation of AttentiveNER (Shimaoka et al., 2017) ."}, {"id": 162, "string": "We also compare models trained with different sources of supervision."}, {"id": 163, "string": "For this dataset, we did not use our multitask objective (Section 4), since expanding types to include their ontological hypernyms largely eliminates the partial supervision as-Acc."}, {"id": 164, "string": "Ma-F1 Mi-F1 AttentiveNER++ 51.7 70.9 64.9 AFET  55."}, {"id": 165, "string": "Table 7 : Ablation study on the OntoNotes finegrained entity typing development."}, {"id": 166, "string": "The second row isolates dataset improvements, while the third row isolates the model."}, {"id": 167, "string": "sumption."}, {"id": 168, "string": "Following prior work, we report macroand micro-averaged F1 score, as well as accuracy (exact set match)."}, {"id": 169, "string": "Results Table 6 shows the overall performance on the test set."}, {"id": 170, "string": "Our combination of model and training data shows a clear improvement from prior work, setting a new state-of-the art result."}, {"id": 171, "string": "7 In Table 7 , we show an ablation study."}, {"id": 172, "string": "Our new supervision sources improve the performance of both the AttentiveNER model and our own."}, {"id": 173, "string": "We observe that every supervision source improves performance in its own right."}, {"id": 174, "string": "Particularly, the naturally-occurring head-word supervision seems to be the prime source of improvement, increasing performance by about 10% across all metrics."}, {"id": 175, "string": "Predicting Miscellaneous Types While analyzing the data, we observed that over half of the mentions in OntoNotes' development set were annotated only with the miscellaneous type (\"/other\")."}, {"id": 176, "string": "For both models in our evaluation, detecting the miscellaneous category is substantially easier than Conclusion Using virtually unrestricted types allows us to expand the standard KB-based training methodology with typing information from Wikipedia definitions and naturally-occurring head-word supervision."}, {"id": 177, "string": "These new forms of distant supervision boost performance on our new dataset as well as on an existing fine-grained entity typing benchmark."}, {"id": 178, "string": "These results set the first performance levels for our evaluation dataset, and suggest that the data will support significant future work."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 33}, {"section": "Task and Data", "n": "2", "start": 34, "end": 37}, {"section": "Crowdsourcing Entity Types", "n": "2.1", "start": 38, "end": 50}, {"section": "Data Analysis", "n": "2.2", "start": 51, "end": 69}, {"section": "Distant Supervision", "n": "3", "start": 70, "end": 78}, {"section": "Entity Linking", "n": "3.1", "start": 79, "end": 89}, {"section": "Contextualized Supervision", "n": "3.2", "start": 90, "end": 98}, {"section": "Model", "n": "4", "start": 99, "end": 121}, {"section": "Evaluation", "n": "5", "start": 122, "end": 146}, {"section": "Improving Existing Fine-Grained NER with Better Distant Supervision", "n": "6", "start": 147, "end": 174}, {"section": "Conclusion", "n": "8", "start": 175, "end": 178}], "figures": [{"filename": "../figure/image/1330-Table1-1.png", "caption": "Table 1: Examples of entity mentions and their annotated types, as annotated in our dataset. The entity mentions are bold faced and in the curly brackets. The bold blue types do not appear in existing fine-grained type ontologies.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 223.2, "y2": 336.0}}, {"filename": "../figure/image/1330-Table4-1.png", "caption": "Table 4: Results on the development set for different type granularity and for different supervision data with our model. In each row, we remove a single source of supervision. Entity linking (EL) includes supervision from both KB and Wikipedia definitions. The numbers in the first row are example counts for each type granularity.", "page": 5, "bbox": {"x1": 84.96, "x2": 512.16, "y1": 165.6, "y2": 238.07999999999998}}, {"filename": "../figure/image/1330-Table3-1.png", "caption": "Table 3: Performance of our model and AttentiveNER (Shimaoka et al., 2017) on the new entity typing benchmark, using same training data. We show results for both development and test sets.", "page": 5, "bbox": {"x1": 150.72, "x2": 446.4, "y1": 62.4, "y2": 115.19999999999999}}, {"filename": "../figure/image/1330-Figure1-1.png", "caption": "Figure 1: A visualization of all the labels that cover 90% of the data, where a bubble’s size is proportional to the label’s frequency. Our dataset is much more diverse and fine grained when compared to existing datasets (OntoNotes and FIGER), in which the top 5 types cover 70-80% of the data.", "page": 1, "bbox": {"x1": 78.24, "x2": 517.4399999999999, "y1": 71.03999999999999, "y2": 258.24}}, {"filename": "../figure/image/1330-Table5-1.png", "caption": "Table 5: Example and predictions from our best model on the development set. Entity mentions are marked with curly brackets, the correct predictions are boldfaced, and the missing labels are italicized and written in red.", "page": 6, "bbox": {"x1": 72.0, "x2": 528.0, "y1": 66.72, "y2": 258.24}}, {"filename": "../figure/image/1330-Figure2-1.png", "caption": "Figure 2: The label distribution across different evaluation datasets. In existing datasets, the top 4 or 7 labels cover over 80% of the labels. In ours, the top 50 labels cover less than 50% of the data.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 535.1999999999999, "y1": 61.44, "y2": 226.07999999999998}}, {"filename": "../figure/image/1330-Table6-1.png", "caption": "Table 6: Results on the OntoNotes fine-grained entity typing test set. The first two models (AttentiveNER++ and AFET) use only KB-based supervision. LNR uses a filtered version of the KBbased training set. Our model uses all our distant supervision sources.", "page": 7, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 62.4, "y2": 129.12}}, {"filename": "../figure/image/1330-Table7-1.png", "caption": "Table 7: Ablation study on the OntoNotes finegrained entity typing development. The second row isolates dataset improvements, while the third row isolates the model.", "page": 7, "bbox": {"x1": 72.96, "x2": 289.44, "y1": 236.64, "y2": 343.2}}, {"filename": "../figure/image/1330-Table2-1.png", "caption": "Table 2: Distant supervision examples and statistics. We extracted the headword and Wikipedia definition supervision from Gigaword and Wikilink corpora. KB-based supervision is mapped from prior work, which used Wikipedia and news corpora.", "page": 3, "bbox": {"x1": 75.84, "x2": 522.24, "y1": 65.75999999999999, "y2": 193.92}}]}