{"title": "Word Embedding and WordNet Based Metaphor Identification and Interpretation", "abstract": "Metaphoric expressions are widespread in natural language, posing a significant challenge for various natural language processing tasks such as Machine Translation. Current word embedding based metaphor identification models cannot identify the exact metaphorical words within a sentence. In this paper, we propose an unsupervised learning method that identifies and interprets metaphors at word-level without any preprocessing, outperforming strong baselines in the metaphor identification task. Our model extends to interpret the identified metaphors, paraphrasing them into their literal counterparts, so that they can be better translated by machines. We evaluated this with two popular translation systems for English to Chinese, showing that our model improved the systems significantly.", "text": [{"id": 0, "string": "Introduction Metaphor enriches language, playing a significant role in communication, cognition, and decision making."}, {"id": 1, "string": "Relevant statistics illustrate that about one third of sentences in typical corpora contain metaphor expressions (Cameron, 2003; Martin, 2006; Steen et al., 2010; Shutova, 2016) ."}, {"id": 2, "string": "Linguistically, metaphor is defined as a language expression that uses one or several words to represent another concept, rather than taking their literal meanings of the given words in the context (Lagerwerf and Meijers, 2008) ."}, {"id": 3, "string": "Computational metaphor processing refers to modelling non-literal expressions (e.g., metaphor, metonymy, and personification) and is useful for improving many NLP tasks such as Machine Translation (MT) and Sentiment Analysis (Rentoumi et al., 2012) ."}, {"id": 4, "string": "For instance, Google Translate failed in translating devour within a sentence, \"She devoured his novels.\""}, {"id": 5, "string": "(Mohammad et al., 2016) , into Chinese."}, {"id": 6, "string": "The term was translated into 吞噬, which takes the literal sense of swallow and is not understandable in Chinese."}, {"id": 7, "string": "Interpreting metaphors allows us to paraphrase them into literal expressions which maintain the intended meaning and are easier to translate."}, {"id": 8, "string": "Metaphor identification approaches based on word embeddings have become popular (Tsvetkov et al., 2014; Rei et al., 2017) as they do not rely on hand-crafted knowledge for training."}, {"id": 9, "string": "These models follow a similar paradigm in which input sentences are first parsed into phrases and then the metaphoricity of the phrases is identified; they do not tackle word-level metaphor."}, {"id": 10, "string": "E.g., given the former sentence \"She devoured his novels."}, {"id": 11, "string": "\", the aforementioned methods will first parse the sentence into a verb-direct object phrase devour novel, and then detect the clash between devour and novel, flagging this phrase as a likely metaphor."}, {"id": 12, "string": "However, which component word is metaphorical cannot be identified, as important contextual words in the sentence were excluded while processing these phrases."}, {"id": 13, "string": "Discarding contextual information also leads to a failure to identify a metaphor when both words in the phrase are metaphorical, but taken out of context they appear literal."}, {"id": 14, "string": "E.g., \"This young man knows how to climb the social ladder.\""}, {"id": 15, "string": "(Mohammad et al., 2016 ) is a metaphorical expression."}, {"id": 16, "string": "However, when the sentence is parsed into a verbdirect object phrase, climb ladder, it appears literal."}, {"id": 17, "string": "In this paper, we propose an unsupervised metaphor processing model which can identify and interpret linguistic metaphors at the wordlevel."}, {"id": 18, "string": "Specifically, our model is built upon word embedding methods (Mikolov et al., 2013) and uses WordNet (Fellbaum, 1998) for lexical re-lation acquisition."}, {"id": 19, "string": "Our model is distinguished from existing methods in two aspects."}, {"id": 20, "string": "First, our model is generic which does not constrain the source domain of metaphor."}, {"id": 21, "string": "Second, the developed model does not rely on any labelled data for model training, but rather captures metaphor in an unsupervised, data-driven manner."}, {"id": 22, "string": "Linguistic metaphors are identified by modelling the distance (in vector space) between the target word's literal and metaphorical senses."}, {"id": 23, "string": "The metaphorical sense within a sentence is identified by its surrounding context within the sentence, using word embedding representations and WordNet."}, {"id": 24, "string": "This novel approach allows our model to operate at the sentence level without any preprocessing, e.g., dependency parsing."}, {"id": 25, "string": "Taking contexts into account also addresses the issue that a two-word phrase appears literal, but it is metaphoric within a sentence (e.g., the climb ladder example)."}, {"id": 26, "string": "We evaluate our model against three strong baselines (Melamud et al., 2016; Rei et al., 2017) on the task of metaphor identification."}, {"id": 27, "string": "Extensive experimentation conducted on a publicly available dataset (Mohammad et al., 2016) shows that our model significantly outperforms the unsupervised learning baselines (Melamud et al., 2016; on both phrase and sentence evaluation, and achieves equivalent performance to the state-ofthe-art deep learning baseline (Rei et al., 2017) on phrase-level evaluation."}, {"id": 28, "string": "In addition, while most of the existing works on metaphor processing solely evaluate the model performance in terms of metaphor classification accuracy, we further conducted another set of experiments to evaluate how metaphor processing can be used for supporting the task of MT."}, {"id": 29, "string": "Human evaluation shows that our model improves the metaphoric translation significantly, by testing on two prominent translation systems, namely, Google Translate 1 and Bing Translator 2 ."}, {"id": 30, "string": "To our best knowledge, this is the first metaphor processing model that is evaluated on MT."}, {"id": 31, "string": "To summarise, the contributions of this paper are two-fold: (1) we proposed a novel framework for metaphor identification which does not require any preprocessing or annotated corpora for training; (2) we conducted, to our knowledge, the first metaphor interpretation study of apply-ing metaphor processing for supporting MT."}, {"id": 32, "string": "We describe related work in §2, followed by our labelling method in §4, experimental design in §5, results in §6 and conclusions in §7."}, {"id": 33, "string": "Related Work A wide range of methods have been applied for computational metaphor processing."}, {"id": 34, "string": "Turney et al."}, {"id": 35, "string": "(2011); ;  and Tsvetkov et al."}, {"id": 36, "string": "(2014) identified metaphors by modelling the abstractness and concreteness of metaphors and non-metaphors, using a machine usable dictionary called MRC Psycholinguistic Database (Coltheart, 1981) ."}, {"id": 37, "string": "They believed that metaphorical words would be more abstract than literal ones."}, {"id": 38, "string": "Some researchers used topic models to identify metaphors."}, {"id": 39, "string": "For instance, Heintz et al."}, {"id": 40, "string": "(2013) used Latent Dirichlet Allocation (LDA) (Blei et al., 2003) to model source and target domains, and assumed that sentences containing words from both domains are metaphorical."}, {"id": 41, "string": "Strzalkowski et al."}, {"id": 42, "string": "(2013) assumed that metaphorical terms occur out of the topic chain, where a topic chain is constructed by topical words that reveal the core discussion of the text."}, {"id": 43, "string": "performed metaphorical concept mappings between the source and target domains in multi-languages using both unsupervised and semi-supervised learning approaches."}, {"id": 44, "string": "The source and target domains are represented by semantic clusters, which are derived through the distribution of the co-occurrences of words."}, {"id": 45, "string": "They also assumed that when contextual vocabularies are from different domains then there is likely to be a metaphor."}, {"id": 46, "string": "There is another line of approaches based on word embeddings."}, {"id": 47, "string": "Generally, these works are not limited by conceptual domains and hand-crafted knowledge."}, {"id": 48, "string": "proposed a model that identified metaphors by employing word and image embeddings."}, {"id": 49, "string": "The model first parses sentences into phrases which contain target words."}, {"id": 50, "string": "In their word embedding based approach, the metaphoricity of a phrase was identified by measuring the cosine similarity of two component words in the phrase, based on their input vectors from Skip-gram word embeddings."}, {"id": 51, "string": "If the cosine similarity is higher than a threshold, the phrase is identified as literal; otherwise metaphorical."}, {"id": 52, "string": "Rei et al."}, {"id": 53, "string": "(2017) identified metaphors by introducing a deep learning architecture."}, {"id": 54, "string": "Instead of using word input vectors directly, they filtered out noisy in- T .. C 1 … C n … C m .."}, {"id": 55, "string": "Input Hidden Output CBOW W i W o C 1 … C n … C m .. T .."}, {"id": 56, "string": "Input Hidden Output Skip-gram formation in the vector of one word in a phrase, projecting the word vector into another space via a sigmoid activation function."}, {"id": 57, "string": "The metaphoricity of the phrases was learnt via training a supervised deep neural network."}, {"id": 58, "string": "The above word embedding based models, while demonstrating some success in metaphor identification, only explored using input vectors, which might hinder their performance."}, {"id": 59, "string": "In addition, metaphor identification is highly dependent on its context."}, {"id": 60, "string": "Therefore, phrase-level models (e.g., Tsvetkov et al."}, {"id": 61, "string": "(2014) ; ; Rei et al."}, {"id": 62, "string": "(2017) ) are likely to fail in the metaphor identification task if important contexts are excluded."}, {"id": 63, "string": "In contrast, our model can operate at the sentence level which takes into account rich context and hence can improve the performance of metaphor identification."}, {"id": 64, "string": "Preliminary: CBOW and Skip-gram Our metaphor identification framework is built upon word embedding, which is based on Continuous Bag of Words (CBOW) and Skip-gram (Mikolov et al., 2013) ."}, {"id": 65, "string": "In CBOW (see Figure 1 ), the input and output layers are context (C) and centre word (T) one-hot encodings, respectively."}, {"id": 66, "string": "The model is trained by maximizing the probability of predicting a centre word, given its context (Rong, 2014) : arg max p(t|c 1 , ..., c n , ..., c m ) (1) where t is a centre word, c n is the nth context word of t within a sentence, totally m context words."}, {"id": 67, "string": "CBOW's hidden layer is defined as: H CBOW = 1 m × W i × m n=1 C n = 1 m × m n=1 v i c,n (2) where C n is the one-hot encoding of the nth context word, v i c,n is the nth context word row vector (input vector) in W i which is a weight matrix between input and hidden layers."}, {"id": 68, "string": "Thus, the hidden layer is the transpose of the average of input vectors of context words."}, {"id": 69, "string": "The probability of predicting a centre word in its context is given by a softmax function below: u t = W o t × H CBOW = v o t × H CBOW (3) p(t|c 1 , ..., c n , ..., c m ) = exp(u t ) V j=1 exp(u j ) (4) where W o t is equivalent to the output vector v o t which is essentially a column vector in a weight matrix W o that is between hidden and output layers, aligning with the centre word t. V is the size of vocabulary in the corpus."}, {"id": 70, "string": "The output is a one-hot encoding of the centre word."}, {"id": 71, "string": "W i and W o are updated via back propagation of errors."}, {"id": 72, "string": "Therefore, only the value of the position that represents the centre word's probability, i.e., p(t|c 1 , ..., c n , ..., c m ), will get close to the value of 1."}, {"id": 73, "string": "In contrast, the probability of the rest of the words in the vocabulary will be close to 0 in every centre word training."}, {"id": 74, "string": "W i embeds context words."}, {"id": 75, "string": "Vectors within W i can be viewed as context word embeddings."}, {"id": 76, "string": "W o embeds centre words, vectors in W o can be viewed as centre word embeddings."}, {"id": 77, "string": "Skip-gram is the reverse of CBOW (see Figure 1) ."}, {"id": 78, "string": "The input and output layers are centre word and context word one-hot encodings, respectively."}, {"id": 79, "string": "The target is to maximize the probability of predicting each context word, given a centre word: arg max p(c 1 , ..., c n , ..., c m |t) Skip-gram's hidden layer is defined as: H SG = W i × T = v i t (6) where T is the one-hot encoding of the centre word t. Skip-gram's hidden layer is equal to the transpose of a centre word's input vector v t , as only the tth row are kept by the operation."}, {"id": 80, "string": "The probability of a context word is:  where c, n is the nth context word, given a centre word."}, {"id": 81, "string": "In Skip-gram, W i aligns to centre words, while W o aligns to context words."}, {"id": 82, "string": "Because the names of centre word and context word embeddings are reversed in CBOW and Skip-gram, we will uniformly call vectors in W i input vectors v i , and vectors in W o output vectors v o in the remaining sections."}, {"id": 83, "string": "Word embeddings represent both input and output vectors."}, {"id": 84, "string": "u c,n = W o c,n × H SG = v o c,n × H SG (7) p(c n |t) = exp(u c,n ) V j=1 exp(u j ) (8) w t s 1 s 2 … h j .. w c1 w c2 w c3 … w cm .. .. cos( w t , context ) cos( s 1 , context ) cos( s 2 , context ) … cos( h j , context ) agrmax w* ∈W Best fit word Methodology In this section, we present the technical details of our metaphor processing framework, built upon two hypotheses."}, {"id": 85, "string": "Our first hypothesis (H1) is that a metaphorical word can be identified, if the sense the word takes within its context and its literal sense come from different domains."}, {"id": 86, "string": "Such a hypothesis is based on the theory of Selectional Preference Violation (Wilks, 1975 (Wilks, , 1978 ) that a metaphorical item can be found in a violation of selectional restrictions, where a word does not satisfy its semantic constrains within a context."}, {"id": 87, "string": "Our second hypothesis (H2) is that the literal senses of words occur more commonly in corpora than their metaphoric senses (Cameron, 2003; Martin, 2006; Steen et al., 2010; Shutova, 2016) ."}, {"id": 88, "string": "Figure 2 depicts an overview of our metaphor identification framework."}, {"id": 89, "string": "The workflow of our framework is as follows."}, {"id": 90, "string": "Step (1) involves training word embeddings based on a Wikipedia dump 3 for obtaining input and output vectors of words."}, {"id": 91, "string": "3 https://dumps.wikimedia.org/enwiki/ 20170920/ She devoured his novels."}, {"id": 92, "string": "Sense 1 • devour • devoured • … HYPERNYMS • destroy • destroyed • … • ruin • ruined • … • … Sense 2 • devour • devoured • … HYPERNYMS • enjoy • enjoyed • … • bask • basked • … • … Sense 3 • devour • devoured • … HYPERNYMS • eat up • … • … SYNONYMS • down • … • … Sense 4 • devour • devoured • … HYPERNYMS • raven • ravened • … • pig • pigged • … • … … She v o devoured , v i context ) = −0.01, cos(v o enjoyed , v i context ) = 0.02."}, {"id": 93, "string": "In Step (2) , given an input sentence, the target word (i.e., the word in the original text whose metaphoricity is to be determined) and its context words (i.e., all other words in the sentence excluding the target word) are separated."}, {"id": 94, "string": "We construct a candidate word set W which represents all the possible senses of the target word."}, {"id": 95, "string": "This is achieved by first extracting the synonyms and direct hypernyms of the target word from WordNet, and then augmenting the set with the inflections of the extracted synonyms and hypernyms, as well as the target word and its inflections."}, {"id": 96, "string": "Auxiliary verbs are excluded from this set, as these words frequently appear in most sentences with little lexical meaning."}, {"id": 97, "string": "In Step (3) , we identify the best fit word, which is defined as the word that represents the literal sense that the target word is most likely taking given its context."}, {"id": 98, "string": "Finally, in Step (4) , we compute the cosine similarity between the target word and the best fit word."}, {"id": 99, "string": "If the similarity is above a threshold, the target word will be identified as literal, otherwise metaphoric (i.e., based on H1)."}, {"id": 100, "string": "We will discuss in detail Step (3) and Step (4) in §4.1."}, {"id": 101, "string": "Metaphor identification Step (3): One of the key steps of our metaphor identification framework is to identify the best fit word for a target word given its surrounding context."}, {"id": 102, "string": "The intuition is that the best fit word will represent the literal sense that the target word is most likely taking."}, {"id": 103, "string": "E.g., for the sentence \"She devoured his novels.\""}, {"id": 104, "string": "and the corresponding target word devoured, the best fit word is enjoyed, as shown in Figure 3 ."}, {"id": 105, "string": "Also note that the best fit word could be the target word itself if the target word is used literally."}, {"id": 106, "string": "Given a sentence s, let w t be the target word of the sentence, w * ∈ W the best fit word for w t , and w context the surrounding context for w t , i.e., all the words in s excluding w t ."}, {"id": 107, "string": "We compute the context embedding v i context by averaging out the input vectors of each context word of w context , based on Eq."}, {"id": 108, "string": "2."}, {"id": 109, "string": "Next, we rank each candidate word k ∈ W by measuring its similarity to the context input vector v i context in the vector space."}, {"id": 110, "string": "The candidate word with the highest similarity to the context is then selected as the best fit word."}, {"id": 111, "string": "w * = arg max k SIM(v k , v context ) (9) where v k is the vector of a candidate word k ∈ W. In contrast to existing word embedding based methods for metaphor identification which only make use of input vectors Rei et al., 2017) , we explore using both input and output vectors of CBOW and Skip-gram embeddings when measuring the similarity between a candidate word and the context."}, {"id": 112, "string": "We expect that using a combination of input and output vectors might work better."}, {"id": 113, "string": "Specifically, we have experimented with four different model variants as shown below."}, {"id": 114, "string": "SIM-CBOW I = cos(v i k,cbow , v i context,cbow ) (10) SIM-CBOW I+O = cos(v o k,cbow , v i context,cbow ) (11) SIM-SG I = cos(v i k,sg , v i context,sg ) (12) SIM-SG I+O = cos(v o k,sg , v i context,sg ) (13) Here, cos(·) is cosine similarity, cbow is CBOW word embeddings, sg is Skip-gram word embeddings."}, {"id": 115, "string": "We have also tried other model variants using output vectors for v context ."}, {"id": 116, "string": "However, we found that the models using output vectors for v context (both CBOW and Skip-gram embeddings) do not improve our framework performance."}, {"id": 117, "string": "Due to the page limit we omitted the results of those models in this paper."}, {"id": 118, "string": "Step (4) : Given a predicted best fit word w * identified in Step (3) , we then compute the cosine similarity between the lemmatizations of w * and the target word w t using their input vectors."}, {"id": 119, "string": "SIM(w * , w t ) = cos(v i w * , v i wt ) (14) We give a detailed discussion in §4.2 of our rationale for using input vectors for Eq."}, {"id": 120, "string": "14."}, {"id": 121, "string": "If the similarity is higher than a threshold (τ ) the target word is considered as literal, otherwise, metaphorical (based on H1)."}, {"id": 122, "string": "One benefit of our approach is that it allows one to paraphrase the identified metaphorical target word into the best fit word, representing its literal sense in the context."}, {"id": 123, "string": "Such a feature is useful for supporting other NLP tasks such as Machine Translation, which we will explore in §6."}, {"id": 124, "string": "In terms of the value of threshold (τ ), it is empirically determined based on a development set."}, {"id": 125, "string": "Please refer to §5 for details."}, {"id": 126, "string": "To better explain the workflow of our framework, we now go through an example as illustrated in Figure 3 ."}, {"id": 127, "string": "The target word of the input sentence, \"She devoured his novels.\""}, {"id": 128, "string": "is devoured, and its the lemmatised form devour has four verbal senses in WordNet, i.e., destroy completely, enjoy avidly, eat up completely with great appetite, and eat greedily."}, {"id": 129, "string": "Each of these senses has a set of corresponding synonyms and hypernyms."}, {"id": 130, "string": "E.g., Sense 3 (eat up completely with great appetite) has synonyms demolish, down, consume, and hypernyms go through, eat up, finish, and polish off."}, {"id": 131, "string": "We then construct a candidate word set W by including the synonyms and direct hypernyms of the target word from WordNet, and then augmenting the set with the inflections of the extracted synonyms and hypernyms, as well as the target word devour and its inflections."}, {"id": 132, "string": "We then identify the best fit word given the context she [ ] his novels based on Eq."}, {"id": 133, "string": "9."}, {"id": 134, "string": "Based on H2, literal expressions are more common than metaphoric ones in corpora."}, {"id": 135, "string": "Therefore, the best fit word is expected to frequently appear within the given context, and thus represents the most likely sense of the target word."}, {"id": 136, "string": "For example, the similarity between enjoy (i.e., the best fit word) and the the context is higher than that of devour (i.e., the target word), as shown in Figure 3 ."}, {"id": 137, "string": "Word embedding: output vectors vs. input vectors Typically, input vectors are used after training CBOW and Skip-gram, with output vectors being abandoned by practical models, e.g., original word2vec model (Mikolov et al., 2013) and Gensim toolkit (Řehůřek and Sojka, 2010), as these models are designed for modelling similarities in semantics."}, {"id": 138, "string": "However, we found that using input vectors to measure cosine similarity between two words with different POS types in a phrase is sub-  optimal, as words with different POS normally have different semantics."}, {"id": 139, "string": "They tend to be distant from each other in the input vector space."}, {"id": 140, "string": "Taking Skip-gram for example, empirically, input vectors of words with the same POS, occurring within the same contexts tend to be close in the vector space (Mikolov et al., 2013) , as they are frequently updated by back propagating the errors from the same context words."}, {"id": 141, "string": "In contrast, input vectors of words with different POS, playing different semantic and syntactic roles tend to be distant from each other, as they seldom occur within the same contexts, resulting in their input vectors rarely being updated equally."}, {"id": 142, "string": "Our observation is also in line with Nalisnick et al."}, {"id": 143, "string": "(2016) , who examine IN-IN, OUT-OUT and IN-OUT vectors to measure similarity between two words."}, {"id": 144, "string": "Nalisnick et al."}, {"id": 145, "string": "discovered that two words which are similar by function or type have higher cosine similarity with IN-IN or OUT-OUT vectors, while using input and output vectors for two words (IN-OUT) that frequently co-occur in the same context (e.g., a sentence) can obtain a higher similarity score."}, {"id": 146, "string": "For illustrative purpose, we visualize the CBOW and Skip-gram updates between 4dimensional input and output vectors by Wevi 4 (Rong, 2014) , using a two-sentence corpus, \"Drink apple juice.\""}, {"id": 147, "string": "and \"Drink orange juice.\"."}, {"id": 148, "string": "We feed these two sentences to CBOW and Skipgram with 500 iterations."}, {"id": 149, "string": "As seen Figure 4 , the input vectors of apple and orange are similar in both CBOW and Skip-gram, which are different from the input vectors of their context words (drink and juice)."}, {"id": 150, "string": "However, the output vectors of apple and orange are similar to the input vectors of drink and juice."}, {"id": 151, "string": "To summarise, using input vectors to compare similarity between the best fit word and the target word is more appropriate (cf."}, {"id": 152, "string": "Eq.14), as they tend to have the same types of POS."}, {"id": 153, "string": "When measuring the similarity between candidate words and the context, using output vectors for the former and input vectors for the latter seems to better predict the best fit word."}, {"id": 154, "string": "Experimental settings Baselines."}, {"id": 155, "string": "We compare the performance of our framework for metaphor identification against three strong baselines, namely, an unsupervised word embedding based model by , a supervised deep learning model by Rei et al."}, {"id": 156, "string": "(2017) , and the Context2Vec model 5 (Melamud et al., 2016) which achieves the best performance on Microsoft Sentence Completion Challenge (Zweig and Burges, 2011) ."}, {"id": 157, "string": "Context2Vec was not designed for processing metaphors, in order to use it for this we plug it into a very similar framework to that described in Figure 2 ."}, {"id": 158, "string": "We use Context2Vec to predict the best fit word from the candidate set, as it similarly uses context to predict the most likely centre word but with bidirectional LSTM based context embedding method."}, {"id": 159, "string": "After locating the best fit word with Context2Vec, we identify the metaphoricity of a target word with the same method (see Step (4) in §4), so that we can also apply it for metaphor interpretation."}, {"id": 160, "string": "Note that while Shutova et al."}, {"id": 161, "string": "and Rei et al."}, {"id": 162, "string": "detect Mohammad et al."}, {"id": 163, "string": "(2016) ."}, {"id": 164, "string": "This dataset 6 , containing 1,230 literal and 409 metaphor sentences, has been widely used for metaphor identification related research Rei et al., 2017) ."}, {"id": 165, "string": "There is a verbal target word annotated by 10 annotators in each sentence."}, {"id": 166, "string": "We use two subsets of the Mohammad et al."}, {"id": 167, "string": "set, one for phrase evaluation and one for sentence evaluation."}, {"id": 168, "string": "The phrase evaluation dataset was kindly provided by Shutova, which consists of 316 metaphorical and 331 literal phrases (subject-verb and verb-direct object word pairs), parsed from Mohammad et al."}, {"id": 169, "string": "'s dataset."}, {"id": 170, "string": "Similar to , we use 40 metaphoric and 40 literal phrases as a development set and the rest as a test set."}, {"id": 171, "string": "For sentence evaluation, we select 212 metaphorical sentences whose target words are annotated with at least 70% agreement."}, {"id": 172, "string": "We also add 212 literal sentences with the highest agreement."}, {"id": 173, "string": "Among the 424 sentences, we form our development set with 12 randomly selected metaphoric and 12 literal instances to identify the threshold for detecting metaphors."}, {"id": 174, "string": "The remaining 400 sentences are our testing set."}, {"id": 175, "string": "Word embedding training."}, {"id": 176, "string": "We train CBOW and Skip-gram models on a Wikipedia dump with the same settings as  and Rei et al."}, {"id": 177, "string": "(2017) ."}, {"id": 178, "string": "That is, CBOW and Skip-gram models are trained iteratively 3 times on Wikipedia with a context window of 5 to learn 100-dimensional word input and output vectors."}, {"id": 179, "string": "We exclude words with total frequency less than 100."}, {"id": 180, "string": "10 negative samples are randomly selected for each centre word training."}, {"id": 181, "string": "The word down-sampling rate is 10 -5 ."}, {"id": 182, "string": "We use Stanford CoreNLP (Manning et al., 2014) lemmatized Wikipedia to train word embeddings for phrase level evaluation, which is in line with ."}, {"id": 183, "string": "In sentence evaluation, we use the original Wikipedia for training word embeddings."}, {"id": 184, "string": "6 Experimental Results Table 1 shows the performance of our model and the baselines on the task of metaphor identification."}, {"id": 185, "string": "All the results for our models are based on a threshold of 0.6, which is empirically determined based on the developing set."}, {"id": 186, "string": "For sentence level metaphor identification, it can be observed that all our models outperform the baseline (Melamud et al., 2016) , with SIM-CBOW I+O giving the highest F1 score of 75% which is a 6% gain over the baseline."}, {"id": 187, "string": "We also see that mod-els based on both input and output vectors (i.e., SIM-CBOW I+O and SIM-SG I+O ) yield better performance than the models based on input vectors only (i.e., SIM-CBOW I and SIM-SG I )."}, {"id": 188, "string": "Such an observation supports our assumption that using input and output vectors can better model similarity between words that have different types of POS, than simply using input vectors."}, {"id": 189, "string": "When comparing CBOW and Skip-gram based models, we see that CBOW based models generally achieve better performance in precision whereas Skip-gram based models perform better in recall."}, {"id": 190, "string": "Metaphor identification In terms of phrase level metaphor identification, we compare our best performing models (i.e., SIM-CBOW I+O and SIM-SG I+O ) against the approaches of  and Rei et al."}, {"id": 191, "string": "(2017) ."}, {"id": 192, "string": "In contrast to the sentence level evaluation in which SIM-CBOW I+O gives the best performance, SIM-SG I+O performs best for the phrase level evaluation."}, {"id": 193, "string": "This is likely due to the fact that Skip-gram is trained by using a centre word to maximise the probability of each context word, whereas CBOW uses the average of context word input vectors to maximise the probability of the centre word."}, {"id": 194, "string": "Thus, Skip-gram performs better in modelling one-word context, while CBOW has better performance in modelling multi-context words."}, {"id": 195, "string": "When comparing to the baselines, our model SIM-SG I+O significantly outperforms the word embedding based approach by , and gives the same performance as the deep supervised method (Rei et al., 2017) which requires a large amount of labelled data for training and cost in training time."}, {"id": 196, "string": "SIM-CBOW I+O and SIM-SG I+O are also evaluated with different thresholds for both phrase and sentence level metaphor identification."}, {"id": 197, "string": "As can be seen from Table 2 , the results are fairly stable when the threshold is set between 0.5 and 0.9 in terms of F1."}, {"id": 198, "string": "Metaphor processing for MT We believe that one of the key purposes of metaphor processing is to support other NLP tasks."}, {"id": 199, "string": "Therefore, we conducted another set of experiments to evaluate how metaphor processing can be used to support English-Chinese machine translation."}, {"id": 200, "string": "The evaluation task was designed as follows."}, {"id": 201, "string": "From the test set for sentence-level metaphor identification which contains 200 metaphoric and   200 literal sentences, we randomly selected 50 metaphoric and 50 literal sentences to construct a set S M for the Machine Translation (MT) evaluation task."}, {"id": 202, "string": "For each sentence in S M , if it is predicted as literal by our model, the sentence is kept unchanged; otherwise, the target word of the sentence is paraphrased with the best fit word (refer to §4.1 for details)."}, {"id": 203, "string": "The metaphor identification step resulted in 42 True Positive (TP) instances where the ground truth label is metaphoric and 19 False Positive (FP) instances where the ground truth label is literal, resulting in a total of 61 instances predicted as metaphorical by our model."}, {"id": 204, "string": "We also run one of our baseline models, Context2Vec, on the 61 sentences to predict the best fit words for comparison."}, {"id": 205, "string": "Our hypothesis is that by paraphrasing the metaphorically used target word with the best fit word which expresses the target word's real meaning, the performance of translation engines can be improved."}, {"id": 206, "string": "We test our hypothesis on two popular English-Chinese MT systems, i.e., the Google and Bing Translators."}, {"id": 207, "string": "We recruited from a UK university 5 Computing Science postgraduate students who are Chinese native speakers to participate the English-Chinese MT evaluation task."}, {"id": 208, "string": "During the evaluation, subjects were presented with a questionnaire The ex-boxer's job is to bounce people who want to enter this private club."}, {"id": 209, "string": "bounce: eject from the premises    An example of the evaluation task is shown in Figure 6 , in which \"The ex-boxer's job is to bounce people who want to enter this private club.\""}, {"id": 210, "string": "is the original sentence, followed by an WordNet explanation of the target word of the sentence (i.e., bounce: eject from the premises)."}, {"id": 211, "string": "There are 6 translations."}, {"id": 212, "string": "No."}, {"id": 213, "string": "1-2 are the original sentence translations, translated by Google Translate (GT) and Bing Translator (BT)."}, {"id": 214, "string": "The target word, bounce, is translated, taking the sense of (1) physically rebounding like a ball (反 弹), (2) jumping (弹跳)."}, {"id": 215, "string": "No."}, {"id": 216, "string": "3-4 are SIM-CBOW I+O paraphrased sentences, translated by GT and BT, respectively, taking the sense of refusing (拒绝)."}, {"id": 217, "string": "No."}, {"id": 218, "string": "5-6 are Context2Vec paraphrased sentences, translated by GT and BT, respectively, taking the sense of hitting (5.打; 6.打击)."}, {"id": 219, "string": "Subjects were instructed to determine if the translation of a target word can correctly represent its sense within the translated sentence, matching its context (cohesion) in Chinese."}, {"id": 220, "string": "Note that we evaluate the translation of the target word, therefore, errors in context word translations are ignored by the subjects."}, {"id": 221, "string": "Finally, a label is taken agreed by more than half annotators."}, {"id": 222, "string": "Noticeably, based on our observation, there is always a Chinese word corresponding to an English target word in MT, as the annotated target word normally represents important information in the sentence in the applied dataset."}, {"id": 223, "string": "We use translation accuracy as a measure to evaluate the improvement on MT systems after metaphor processing."}, {"id": 224, "string": "The accuracy is calculated by dividing the number of correctly translated instances by the total number of instances."}, {"id": 225, "string": "As can be seen in Figure 5 and Table 3 , after paraphrasing the metaphorical sentences with the SIM-CBOW I+O model, the translation improvement for the metaphorical class is dramatic for both MT systems, i.e., 26% improvement for Google Translate and 24% for Bing Translate."}, {"id": 226, "string": "In terms of the literal class, there is some small drop (i.e., 4-6%) in accuracy."}, {"id": 227, "string": "This is due to the fact that some literals were wrongly identified as metaphors and hence error was introduced during paraphrasing."}, {"id": 228, "string": "Nevertheless, with our model, the overall translation performance of both Google and Bing Translate are significantly improved by 11% and 9%, respectively."}, {"id": 229, "string": "Our baseline model Context2Vec also improves the translation accuracy, but is 2-4 % lower than our model in terms of overall accuracy."}, {"id": 230, "string": "In summary, the experimental results show the effectiveness of applying metaphor processing for supporting Machine Translation."}, {"id": 231, "string": "Conclusion We proposed a framework that identifies and interprets metaphors at word-level with an unsupervised learning approach."}, {"id": 232, "string": "Our model outperforms the unsupervised baselines in both sentence and phrase evaluations."}, {"id": 233, "string": "The interpretation of the identified metaphorical words given by our model also contributes to Google and Bing translation systems with 11% and 9% accuracy improvements."}, {"id": 234, "string": "The experiments show that using words' hypernyms and synonyms in WordNet can paraphrase metaphors into their literal counterparts, so that the metaphors can be correctly identified and translated."}, {"id": 235, "string": "To our knowledge, this is the first study that evaluates a metaphor processing method on Machine Translation."}, {"id": 236, "string": "We believe that compared with simply identifying metaphors, metaphor processing applied in practical tasks, can be more valuable in the real world."}, {"id": 237, "string": "Additionally, our experiments demonstrate that using a candidate word output vector instead of its input vector to model the similarity between the candidate word and its context yields better results in the best fit word (the literal counterpart of the metaphor) identification."}, {"id": 238, "string": "CBOW and Skip-gram do not consider the distance between a context word and a centre word in a sentence, i.e., context word contributes to predict the centre word equally."}, {"id": 239, "string": "Future work will introduce weighted CBOW and Skip-gram to learn positional information within sentences."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 32}, {"section": "Related Work", "n": "2", "start": 33, "end": 63}, {"section": "Preliminary: CBOW and Skip-gram", "n": "3", "start": 64, "end": 84}, {"section": "Methodology", "n": "4", "start": 85, "end": 100}, {"section": "Metaphor identification", "n": "4.1", "start": 101, "end": 136}, {"section": "Word embedding: output vectors vs. input vectors", "n": "4.2", "start": 137, "end": 153}, {"section": "Experimental settings", "n": "5", "start": 154, "end": 189}, {"section": "Metaphor identification", "n": "6.1", "start": 190, "end": 197}, {"section": "Metaphor processing for MT", "n": "6.2", "start": 198, "end": 230}, {"section": "Conclusion", "n": "7", "start": 231, "end": 239}], "figures": [{"filename": "../figure/image/1334-Figure4-1.png", "caption": "Figure 4: Input and output vector visualization. The bluer, the more negative. The redder, the more positive.", "page": 5, "bbox": {"x1": 83.03999999999999, "x2": 280.32, "y1": 67.2, "y2": 150.23999999999998}}, {"filename": "../figure/image/1334-Table1-1.png", "caption": "Table 1: Metaphor identification results. NB: * denotes that our model outperforms the baseline significantly, based on two-tailed paired t-test with p < 0.001.", "page": 6, "bbox": {"x1": 72.96, "x2": 289.44, "y1": 62.879999999999995, "y2": 164.16}}, {"filename": "../figure/image/1334-Figure1-1.png", "caption": "Figure 1: CBOW and Skip-gram framework.", "page": 2, "bbox": {"x1": 79.2, "x2": 288.96, "y1": 68.16, "y2": 149.28}}, {"filename": "../figure/image/1334-Table2-1.png", "caption": "Table 2: Model performance vs. different threshold (τ ) settings. NB: the sentence level results are based on SIM-CBOWI+O .", "page": 7, "bbox": {"x1": 72.96, "x2": 290.4, "y1": 62.879999999999995, "y2": 164.16}}, {"filename": "../figure/image/1334-Figure5-1.png", "caption": "Figure 5: Accuracy of metaphor interpretation, evaluated on Google and Bing Translation.", "page": 7, "bbox": {"x1": 74.39999999999999, "x2": 285.12, "y1": 228.48, "y2": 337.91999999999996}}, {"filename": "../figure/image/1334-Table3-1.png", "caption": "Table 3: Accuracy of metaphor interpretation, evaluated on Google and Bing Translation.", "page": 7, "bbox": {"x1": 307.68, "x2": 524.16, "y1": 187.68, "y2": 260.15999999999997}}, {"filename": "../figure/image/1334-Figure6-1.png", "caption": "Figure 6: MT-based metaphor interpretation questionnaire.", "page": 7, "bbox": {"x1": 309.59999999999997, "x2": 523.1999999999999, "y1": 63.839999999999996, "y2": 155.04}}, {"filename": "../figure/image/1334-Figure3-1.png", "caption": "Figure 3: Given CBOW trained input and output vectors, a target word of devoured, and a context of She [ ] his novels, cos(vodevoured, v i context) = −0.01, cos(voenjoyed, v i context) = 0.02.", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 525.12, "y1": 67.67999999999999, "y2": 239.04}}, {"filename": "../figure/image/1334-Figure2-1.png", "caption": "Figure 2: Metaphor identification framework. NB: w∗ = best fit word, wt = target word.", "page": 3, "bbox": {"x1": 74.88, "x2": 292.32, "y1": 63.839999999999996, "y2": 245.28}}]}