{"title": "What makes a good conversation? How controllable attributes affect human judgments", "abstract": "A good conversation requires balance -between simplicity and detail; staying on topic and changing it; asking questions and answering them. Although dialogue agents are commonly evaluated via human judgments of overall quality, the relationship between quality and these individual factors is less well-studied. In this work, we examine two controllable neural text generation methods, conditional training and weighted decoding, in order to control four important attributes for chitchat dialogue: repetition, specificity, response-relatedness and question-asking. We conduct a large-scale human evaluation to measure the effect of these control parameters on multi-turn interactive conversations on the PersonaChat task. We provide a detailed analysis of their relationship to high-level aspects of conversation, and show that by controlling combinations of these variables our models obtain clear improvements in human quality judgments.", "text": [{"id": 0, "string": "Introduction Neural generation models for dialogue, despite their ubiquity in current research, are still poorly understood."}, {"id": 1, "string": "Well known problems, such as the genericness and repetitiveness of responses (Serban et al., 2016a) , remain without a de facto solution."}, {"id": 2, "string": "Strikingly, the factors that determine human judgments of overall conversation quality are almost entirely unexplored."}, {"id": 3, "string": "Most works have been limited to the next utterance prediction problem, whereas a multi-turn evaluation is necessary to evaluate the quality of a full conversation."}, {"id": 4, "string": "In this work we both (i) conduct a large-scale study to identify the fine-grained factors governing human judgments of full conversations, and (ii) develop models that apply our findings in practice, * A.S. completed most of this work at Facebook (FAIR)."}, {"id": 5, "string": "leading to state-of-the-art performance."}, {"id": 6, "string": "Specifically, we identify and study eight aspects of conversation that can be measured by human judgments, while varying four types of low-level attributes that can be algorithmically controlled in neural models; see Figure 1 ."}, {"id": 7, "string": "To control the lowlevel model attributes, we consider two simple but general algorithms: conditional training, in which the neural model is conditioned on additional control features, and weighted decoding, in which control features are added to the decoding scoring function at test time only."}, {"id": 8, "string": "One major result of our findings is that existing work has ignored the importance of conversational flow, as standard models (i) repeat or contradict previous statements, (ii) fail to balance specificity with genericness, and (iii) fail to balance asking questions with other dialogue acts."}, {"id": 9, "string": "Conducting experiments on the PersonaChat task (Zhang et al., 2018b) , we obtain significantly higher engagingness scores than the baseline by optimizing control of repetition, specificity and question-asking over multiple turns."}, {"id": 10, "string": "Using these findings, our best model matches the performance of the winning entry in the recent NeurIPS ConvAI2 competition (Dinan et al., 2019) , which was trained on much more data but had no control (see Section 8.1)."}, {"id": 11, "string": "Our code, pretrained models, and full chatlogs, are available at https://parl.ai/projects/ controllable_dialogue."}, {"id": 12, "string": "Related Work Dialogue Dialogue evaluation is relatively well understood in goal-oriented tasks, where automated approaches can be coded by measuring task completion (Bordes et al., 2017; El Asri et al., 2017; Hastie, 2012; Henderson et al., 2014; Wen et al., 2017) ."}, {"id": 13, "string": "Task success combined with dialogue cost can be linked to human judgments like user satisfaction via the PARADISE framework (Walker et al., 1997) ."}, {"id": 14, "string": "However in chitchat tasks, which we study in this work, automatic metrics and their relation to human ratings are less well-understood."}, {"id": 15, "string": "While word-overlap metrics are effective for questionanswering and machine translation, for dialogue they have little to no correlation with human judgments (Liu et al., 2016; Novikova et al., 2017 )this is due to the open-ended nature of dialogue."}, {"id": 16, "string": "There are more recent attempts to find better automatic approaches, such as adversarial evaluation (Li et al., 2017b) and learning a scoring model (Lowe et al., 2017) , but their value is still unclear."}, {"id": 17, "string": "Nevertheless, a number of studies only use automatic metrics, with no human study at all (Lowe et al., 2015; Parthasarathi and Pineau, 2018; Serban et al., 2016b) ."}, {"id": 18, "string": "Other works do use human evaluations (Dinan et al., 2018; Li et al., 2016a,b; Venkatesh et al., 2017; Vinyals and Le, 2015; Zhang et al., 2018b) , typically reporting just one type of judgment (either quality or appropriateness) via a Likert scale or pairwise comparison."}, {"id": 19, "string": "Most of those works only consider single turn evaluations, often with a shortened dialogue history, rather than full multi-turn dialogue."}, {"id": 20, "string": "A more comprehensive evaluation strategy has been studied within the scope of the Alexa prize (Venkatesh et al., 2017; Guo et al., 2018) by combining multiple automatic metrics designed to capture various conversational aspects (engagement, coherence, domain coverage, conversational depth and topical diversity)."}, {"id": 21, "string": "Though these aspects have some similarity to the aspects studied here, we also focus on lower-level aspects (e.g."}, {"id": 22, "string": "avoiding repetition, fluency), to understand how they correspond to both our controllable attributes, and to overall quality judgments."}, {"id": 23, "string": "Controllable neural text generation Researchers have proposed several approaches to control aspects of RNN-based natural language generation such as sentiment, length, speaker style and tense (Fan et al., 2018; Ficler and Goldberg, 2017; Ghazvininejad et al., 2017; Hu et al., 2017; Kikuchi et al., 2016; Peng et al., 2018; Wang et al., 2017) ."}, {"id": 24, "string": "In particular, several works use control to tackle the same common sequence-to-sequence problems we address here (particularly genericness and unrelated output), in the context of single-turn response generation (Baheti et al., 2018; Li et al., 2016a Li et al., , 2017a Shen et al., 2017; Xing et al., 2017; Zhang et al., 2018a; Zhou et al., 2017) ."}, {"id": 25, "string": "By contrast, we focus on developing controls for, and human evaluation of, multi-turn interactive dialogue -this includes a new method (described in Section 5) to control attributes at the dialogue level rather than the utterance level."}, {"id": 26, "string": "In this work, we require a control method that is both general-purpose (one technique to simultaneously control many attributes) and easily tunable (the control setting is adjustable after training)."}, {"id": 27, "string": "Given these constraints, we study two control methods: conditional training (variants of which have been described by Fan et al."}, {"id": 28, "string": "(2018) ; Kikuchi et al."}, {"id": 29, "string": "(2016) ; Peng et al."}, {"id": 30, "string": "(2018) ) and weighted decoding (described by Ghazvininejad et al."}, {"id": 31, "string": "(2017) as a general technique, and by Baheti et al."}, {"id": 32, "string": "(2018) to control response-relatedness)."}, {"id": 33, "string": "To our knowledge, this work is the first to systematically compare the effectiveness of two general-purpose control methods across several attributes."}, {"id": 34, "string": "3 The PersonaChat dataset PersonaChat (Zhang et al., 2018b ) is a chitchat dialogue task involving two participants (two humans or a human and a bot)."}, {"id": 35, "string": "Each participant is given a persona -a short collection of personal traits such as I'm left handed or My favorite season is spring -and are instructed to get to know each other by chatting naturally using their designated personas, for 6-8 turns."}, {"id": 36, "string": "The training set contains 8939 conversations and 955 personas, collected via crowdworkers, plus 1000 conversations and 100 personas for validation, and a similar number in the hidden test set."}, {"id": 37, "string": "The PersonaChat task was the subject of the NeurIPS 2018 ConvAI2 Challenge (Dinan et al., 2019) , in which competitors were first evaluated with respect to automatic met-rics (perplexity, hits@1 and F1 score), and then with respect to human judgment via the question \"How much did you enjoy talking to this user?\""}, {"id": 38, "string": "on a scale of 1-4."}, {"id": 39, "string": "Baseline model Our baseline model is a 2-layer LSTM sequenceto-sequence model with attention."}, {"id": 40, "string": "On any dialogue turn, the input x to the encoder is the entire dialogue history (separated using unique speakeridentifying tokens), with the model's own persona prepended."}, {"id": 41, "string": "Conditioned on this input sequence x, the decoder generates a response y."}, {"id": 42, "string": "Except when stated otherwise, all our models decode using beam search with beam size 20."}, {"id": 43, "string": "We initialized the word embedding matrix with 300-dimensional GloVe embeddings (Pennington et al., 2014) ."}, {"id": 44, "string": "Using the ParlAI framework (Miller et al., 2017) , we pretrained the model on a dataset of 2.5 million Twitter message-response pairs, 1 then fine-tuned it on PersonaChat."}, {"id": 45, "string": "On the Per-sonaChat validation set, the baseline model has a perplexity of 26.83 and F1 of 17.02, which would have placed us 4th out of 26 models in the Con-vAI2 competition (Dinan et al., 2019) ."}, {"id": 46, "string": "We attempt to improve over this baseline using control."}, {"id": 47, "string": "Controllable text generation methods Suppose we have a sequence-to-sequence model which gives P (y|x) = Π t P (y t |x, y 1 , ."}, {"id": 48, "string": "."}, {"id": 49, "string": "."}, {"id": 50, "string": ", y t−1 ), the conditional probability of a response y (the model's next utterance) given input x (the context, which in our case includes the model's own persona and the dialogue history)."}, {"id": 51, "string": "Contrary to most previous work, which controls at the sentence level, we wish to control attributes of the output y at the dialogue levelmeaning that a single control setting is used for a whole dialogue."}, {"id": 52, "string": "For example, to control questionasking, we provide a control setting at the beginning of each dialogue (e.g."}, {"id": 53, "string": "20% questions or 70% questions) rather than providing a control setting for each utterance (e.g."}, {"id": 54, "string": "is a question or isn't a question)."}, {"id": 55, "string": "With this approach, the sequence-tosequence model is able to choose what value the controlled attribute should take for any particular utterance, but we are able to choose the overall distribution."}, {"id": 56, "string": "We find that this approach works well -for example, the sequence-to-sequence model is generally good at detecting when to ask a question."}, {"id": 57, "string": "In particular, this is easier than the alternative: developing a separate process to decide, for each utterance, whether to ask a question."}, {"id": 58, "string": "In this section, we describe the two methods -which we call Conditional Training (CT) and Weighted Decoding (WD) -that we use to control attributes of the output y at the dialogue level."}, {"id": 59, "string": "Conditional Training (CT) Conditional Training (Fan et al., 2018; Kikuchi et al., 2016; Peng et al., 2018) is a method to learn a sequence-to-sequence model P (y|x, z), where z is a discrete control variable."}, {"id": 60, "string": "If the control attribute is naturally continuous (for example in our work, repetitiveness, specificity and response-relatedness), we use z to represent bucketed ranges."}, {"id": 61, "string": "For a binary attribute like questionasking, z represents an overall probability (as explained in Section 5)."}, {"id": 62, "string": "To train a CT model, we first automatically annotate every (x, y) pair in the training set with the attribute we wish to control (for example, whether y contains a question mark)."}, {"id": 63, "string": "During training, for each example we determine the corresponding z value (for continuous attributes, this simply means sorting into the correct bucket; for question-asking, see Section 6.4)."}, {"id": 64, "string": "Next, the control variable z is represented via an embedding (each of the possible values of z has its own embedding)."}, {"id": 65, "string": "For all our experiments, the embedding is of length 10; this was determined via hyperparameter tuning."}, {"id": 66, "string": "There are several possible ways to condition the sequence-to-sequence model on z -for example, append z to the end of the input sequence, or use z as the START symbol for the decoder."}, {"id": 67, "string": "We find it most effective to concatenate z to the decoder's input on every step."}, {"id": 68, "string": "2 Lastly, the CT model learns to produce y = y 1 , ."}, {"id": 69, "string": "."}, {"id": 70, "string": "."}, {"id": 71, "string": ", y T by optimizing the cross-entropy loss: loss CT = − 1 T T t=1 log P (y t |x, z, y 1 , ."}, {"id": 72, "string": "."}, {"id": 73, "string": "."}, {"id": 74, "string": ", y t−1 ) Our CT models are initialized with the parameters from the baseline sequence-to-sequence model P (y|x) (the new decoder parameters are initialized with small random values), then fine-tuned to optimize loss CT on the PersonaChat training set, until convergence of loss CT on the validation set."}, {"id": 75, "string": "Weighted Decoding (WD) Weighted Decoding (Ghazvininejad et al., 2017) is a decoding method that increases or decreases the probability of words with certain features."}, {"id": 76, "string": "The technique is applied only at test time, requiring no change to the training method."}, {"id": 77, "string": "A limitation of WD is that the controllable attribute must be defined at the word-level; any desired utterance-level attribute must be redefined via word-level features."}, {"id": 78, "string": "In weighted decoding, on the t th step of decoding, a partial hypothesis y <t = y 1 , ."}, {"id": 79, "string": "."}, {"id": 80, "string": "."}, {"id": 81, "string": ", y t−1 is expanded by computing the score for each possible next word w in the vocabulary: score(w, y <t ; x) = score(y <t ; x) + log P RNN (w|y <t , x) + i w i * f i (w; y <t , x)."}, {"id": 82, "string": "Here, log P RNN (w|y <t , x) is the log-probability of the word w calculated by the RNN, score(y <t ; x) is the accumulated score of the already-generated words in the hypothesis y <t , and f i (w; y <t , x) are decoding features with associated weights w i ."}, {"id": 83, "string": "There can be multiple features f i (to control multiple attributes), and the weights w i are hyperparameters to be chosen."}, {"id": 84, "string": "A decoding feature f i (w; y <t , x) assigns a real value to the word w, in the context of the text generated so far y <t and the context x."}, {"id": 85, "string": "The feature can be continuous (e.g."}, {"id": 86, "string": "the unigram probability of w), discrete (e.g."}, {"id": 87, "string": "the length of w in characters), or binary (e.g."}, {"id": 88, "string": "whether w starts with the same letter as the last word in y <t )."}, {"id": 89, "string": "A positive weight w i increases the probability of words w that score highly with respect to f i ; a negative weight decreases their probability."}, {"id": 90, "string": "Note that weighted decoding and conditional training can be applied simultaneously (i.e."}, {"id": 91, "string": "train a CT model then apply WD at test time) -a strategy we use in our experiments."}, {"id": 92, "string": "Controlling conversational attributes In this section, we describe how we use conditional training and weighted decoding to control four attributes: repetition, specificity, responserelatedness and question-asking."}, {"id": 93, "string": "We evaluate the effectiveness of both control methods via automatic metrics (i.e., measuring how well the attribute was controlled), and use our findings to select control methods and control settings to be explored further via human evaluation (Section 8)."}, {"id": 94, "string": "Repetition Our baseline model exhibits three types of repetition, which we call external repetition (selfrepetition across utterances), internal repetition (self-repetition within utterances), and partner repetition (repeating the conversational partner)."}, {"id": 95, "string": "To control repetition with weighted decoding, 3 we define five n-gram based decoding features (see Appendix D)."}, {"id": 96, "string": "Three of these features (extrep bigram, intrep bigram and partnerrep bigram) identify repeating bigrams for the three repetition types."}, {"id": 97, "string": "The other two features (extrep unigram and intrep unigram) identify repeating content words."}, {"id": 98, "string": "By applying a negative weight to these features, we can reduce repetition."}, {"id": 99, "string": "In particular, if the weight is −∞, our method is equivalent to n-gram blocking as described by Kulikov et al."}, {"id": 100, "string": "(2018) ."}, {"id": 101, "string": "We observe that repetition control is very important, thus all further control experiments include repetition control."}, {"id": 102, "string": "Specificity Like many sequence-to-sequence models using beam search decoding, our baseline frequently asks generic questions such as What music do you like?"}, {"id": 103, "string": "and gives dull, unspecific responses, such as I like all kinds of music."}, {"id": 104, "string": "We control specificity using Normalized Inverse Document Frequency (NIDF) as a measure of word rareness."}, {"id": 105, "string": "4 The Inverse Document Frequency of a word w is IDF(w) = log(R/c w ) where R is the number of responses in the dataset, and c w is the number of those responses that contain w. Normalized IDF (which ranges from 0 to 1) is NIDF(w) = IDF(w) − min idf max idf − min idf (1) where min idf and max idf are the minimum and maximum IDFs, taken over all words in the vocabulary."}, {"id": 106, "string": "To control specificity with weighted decoding, we use NIDF as a decoding feature."}, {"id": 107, "string": "As shown in Table 1 , this method produces reasonable outputs when the feature weight is within a certain range, but at the extremes the outputs are  nonsensical."}, {"id": 108, "string": "The boundary for nonsensical output differs from example to example."}, {"id": 109, "string": "To control specificity with conditional training, we define the specificity of an utterance y to be the mean NIDF of the words in y."}, {"id": 110, "string": "Thus our control variable z is mean NIDF (discretized into 10 equal-sized buckets)."}, {"id": 111, "string": "As shown in Table 1 , this method gives outputs with a narrower NIDF range, but overall produces less nonsensical outputs."}, {"id": 112, "string": "Response-relatedness In conversation, it's generally desirable to produce a response that is related to the partner's last utterance; for example if the partner says My grandfather died last month, it is appropriate to say I'm so sorry."}, {"id": 113, "string": "Were you close to your grandfather?"}, {"id": 114, "string": "However, our baseline model frequently responds with unrelated utterances like Do you have any pets?"}, {"id": 115, "string": "To control response-relatedness with weighted decoding, we use the decoding feature resp rel: resp rel(w; y <t , x) = cos sim(word emb(w), sent emb( )) where word emb(w) is the GloVe embedding for the word w, sent emb( ) is the sentence embedding for the partner's last utterance (note is part of the context x), and cos sim is the cosine similarity between the two."}, {"id": 116, "string": "In particular, the sentence embedding sent emb(s) for an utterance s is a  weighted average of the GloVe embeddings of the words in s, with the first principal component projected out; for full details, see Arora et al."}, {"id": 117, "string": "(2017) ."}, {"id": 118, "string": "This method of controlling response-relatedness is similar to that described in (Baheti et al., 2018) ."}, {"id": 119, "string": "We find that weighted decoding is effective to control the semantic relatedness of the model's response to the partner's last utterance (see Table 2 )."}, {"id": 120, "string": "As before, we find that extreme weights lead to nonsensical output."}, {"id": 121, "string": "To control response-relatedness with conditional training, we try defining the control variable z to be cos sim(sent emb(y), sent emb( )), the overall cosine similarity between the partner's last utterance and the model's response y (again, we discretize z)."}, {"id": 122, "string": "However, we find this method ineffective -the CT model learns only a very weak connection between z and the semantic relatedness of the output (see Section 7 for more details)."}, {"id": 123, "string": "Question-asking Considerate chitchat requires a reciprocal asking and answering of questions -asking too few or too many can appear self-centered or nosy."}, {"id": 124, "string": "We control question-asking in order to study these trade-offs."}, {"id": 125, "string": "To control question-asking with weighted decoding, we use the binary decoding feature is qn word(w), which is equal to 1 if and only if the word w is in a pre-defined list of interrogative words (how, what, when, where, which, who, whom, whose, why, ?)"}, {"id": 126, "string": "."}, {"id": 127, "string": "We find this is a somewhat effective method to encourage or discourage questions, but with unintended side-effects: a negative weight can discourage valid non-question utterances that happen to contain interrogative words (such as I'm learning how to knit) and a positive weight can result in degenerate utterances (such as For conditional training, we regard an utterance y as containing a question if and only if y contains a question mark."}, {"id": 128, "string": "We train our CT model on a control variable z with 11 possible values: {0, ."}, {"id": 129, "string": "."}, {"id": 130, "string": "."}, {"id": 131, "string": ", 10}."}, {"id": 132, "string": "As discussed in Section 5, we wish to control question-asking at the distributional, dialogue level, rather than at the binary, utterance level."}, {"id": 133, "string": "Thus the setting z = i means that the model should produce, on average, utterances containing '?'"}, {"id": 134, "string": "with probability i/10."}, {"id": 135, "string": "During training we randomly assign examples to buckets such that each bucket i is trained on examples with the correct proportion of questions (i/10), and all buckets have the same amount of training examples."}, {"id": 136, "string": "We find that conditional training is effective to control question-asking -as shown in Figure 2 , by increasing z from 0 to 10, we obtain a range of question-asking rates from 1.40% to 97.72%."}, {"id": 137, "string": "However, when we introduce repetition control, question-asking is reduced -in particular, the z = 10 setting (which should produce 100% questions) now only produces 79.67% questions."}, {"id": 138, "string": "The primary problem is the weighted decoding feature extrep bigram, which discourages bigrams that have appeared in previous utterances -this prevents the model from producing bigrams that commonly occur in many questions, such as do you and what is."}, {"id": 139, "string": "To fix this, we introduce an extra setting z = 10 (boost), in which we do not use the feature extrep bigram for weighted decoding during beam search, but we do use it to rerank the candidates after beam search."}, {"id": 140, "string": "This setting, which allows the model to produce necessary questionasking bigrams, yields a 99.54% question-asking rate, at the cost of slightly increased external bigram repetition (see Appendix F)."}, {"id": 141, "string": "For controlling question-asking, conditional training is preferable to weighted decoding for two reasons."}, {"id": 142, "string": "Firstly, it allows us to achieve (close to) 0% questions, 100% questions, or anything in between, without introducing the risk of degenerate output."}, {"id": 143, "string": "Secondly, presence-of-a-question-mark captures the true attribute of interest (questionasking) more exactly and directly than presence of interrogative words."}, {"id": 144, "string": "For these reasons, only the CT method is considered in the human evaluation."}, {"id": 145, "string": "Comparison of control methods The previous section shows that conditional training and weighted decoding are both useful techniques, with different strengths and weaknesses."}, {"id": 146, "string": "The primary disadvantage of conditional training is that it sometimes fails to learn the connection between the control variable z and the target output y."}, {"id": 147, "string": "In practice, we find the model can learn simple attributes of the output (such as the presence of '?"}, {"id": 148, "string": "', and overall genericness), but not relationships between the input and output (such as semantic relatedness)."}, {"id": 149, "string": "By contrast, weighted decoding can force the desired feature to appear in the output by raising the weight arbitrarily high (though this may have unintended side-effects)."}, {"id": 150, "string": "The primary disadvantage of weighted decoding is that it risks going off-distribution when the weight is too strong."}, {"id": 151, "string": "By contrast, conditional training produces mostly well-formed, indistribution outputs."}, {"id": 152, "string": "This highlights the importance of learned control -it is safer to learn to produce output that both satisfies the control variable and is appropriate, than to alter the decoding process to satisfy the control variable, potentially trading off appropriateness in the process."}, {"id": 153, "string": "Other considerations include: (1) Convenience: conditional training requires retraining; weighted decoding doesn't, but is slower at test time."}, {"id": 154, "string": "Attribute definition: conditional training can control sentence-level attributes, but they must be discrete."}, {"id": 155, "string": "By contrast, weighted decoding requires word-level features, but they can be continuous."}, {"id": 156, "string": "Human evaluation results In order to study the effect of our controllable attributes, we conduct a large-scale human evalua-tion of 28 model configurations (see Appendix E), plus human-human conversations for comparison."}, {"id": 157, "string": "Approach In our evaluation, a crowdworker chats with a model (or in the human-human case, another crowdworker) for six conversational turns, then answers eight multiple-choice questions which each capture different aspects of conversational quality: avoiding repetition, interestingness, making sense, fluency, listening, inquisitiveness, humanness and engagingness."}, {"id": 158, "string": "The eight questions are Likert questions on a 1-4 scale, where higher is better."}, {"id": 159, "string": "5 To match the ConvAI2 Challenge, we also add a persona retrieval question, in which the crowdworker is asked to select which of two possible personas was the model's persona."}, {"id": 160, "string": "For full details of the evaluation design, see Appendix B."}, {"id": 161, "string": "Our evaluation is the same as the ConvAI2 Challenge evaluation, but more detailed -Con-vAI2 includes only engagingness and persona retrieval."}, {"id": 162, "string": "6 As in the ConvAI2 challenge, each of our 28 model configurations was evaluated by over 100 crowdworkers, and the results were adjusted for annotator variance via a Bayesian calibration (Kulikov et al., 2018) ."}, {"id": 163, "string": "In designing our evaluation, we aimed to capture the four aspects we expected to directly improve via control (avoiding repetition, interestingness, listening, inquisitiveness), two important error classes we thought would be affected by our controls (fluency, making sense), and two overall quality measures (engagingness, humanness)."}, {"id": 164, "string": "Main findings In this section we summarize the main findings of our human evaluation -whose full results can be found in Appendices G and H, with sample conversations in Appendix C. As Figure 3 shows, controlling for repetition, specificity and question-asking all lead to large 5 Exceptions: Avoiding repetition is a 1-3 scale, as we found this gave clearer instructions."}, {"id": 165, "string": "Inquisitiveness has an optimal score of 3; 1 and 2 represent too little questionasking, and 4 represents too much."}, {"id": 166, "string": "6 There are three other minor differences between our evaluation and ConvAI2's: (1) We fix capitalization and spacing before showing the chatbot's utterances to crowdworkers, while ConvAI2 show the raw lowercase tokenized form."}, {"id": 167, "string": "We found the latter interferes with fluency evaluation."}, {"id": 168, "string": "(2) We conduct 6 dialogue turns, while ConvAI2 conducts 4-6."}, {"id": 169, "string": "This was necessary to evaluate repetitiveness."}, {"id": 170, "string": "(3) We use (publicly-available) validation set personas, while ConvAI2 uses (hidden) test set personas."}, {"id": 171, "string": "This enables us to release our evaluation chatlogs."}, {"id": 172, "string": "engagingness improvements over the greedy and beam-search baseline models."}, {"id": 173, "string": "In particular, we find that controlling for multi-turn (self) repetition is important and should be incorporated alongside other attribute control methods."}, {"id": 174, "string": "We found no improvement by controlling response-relatedness."}, {"id": 175, "string": "To better understand these overall engagingness improvements, we consider the full set of human judgments, shown in Figure 4 ."}, {"id": 176, "string": "We find that reducing repetition leads to improvements across all our aspects of conversational quality."}, {"id": 177, "string": "Increasing specificity shows improvements in interestingness and listening ability over the repetition-controlled baseline, while increasing question-asking shows improvements in inquisitiveness and interestingness over the repetition-controlled baseline."}, {"id": 178, "string": "Our most engaging model, which controls both repetition and question-asking -marked 'Question (CT)' in Figure 3 (left) -matches the engagingness of the winning entry in the ConvAI2 competition, as both models achieve a raw score 7 of 3.1 (Dinan et al., 2019) ."}, {"id": 179, "string": "However, the Con-vAI2 winner, Lost in Conversation, was trained on approximately 12× as much data as our model."}, {"id": 180, "string": "Lost in Conversation is based on the OpenAI GPT Language Model (Radford et al., 2018) , which is pretrained on the BookCorpus (Zhu et al., 2015) , which contains approximately 985 million words, whereas our model is pretrained on the Twitter dataset (approximately 79 million words)."}, {"id": 181, "string": "Altogether, our evaluation clearly shows that controlling low-level attributes over multiple turns leads to improved overall quality."}, {"id": 182, "string": "Effect of controlled attributes Repetition (WD) We observe that selfrepetition across utterances (external repetition) is by far the most severe form of repetition in our beam search baseline model."}, {"id": 183, "string": "We evaluate several settings of the extrep bigram weighted decoding feature, and find that an aggressive repetition-reduction setting (reducing bigram repetition rate to below gold data levels) is rated best."}, {"id": 184, "string": "We also find that blocking repeated content words improves the avoiding repetition score."}, {"id": 185, "string": "See Appendices E, F and G for full details."}, {"id": 186, "string": "As shown in Figure 3 Figure 3 : Calibrated human judgments of engagingness for the baselines and best controlled models (left); for different specificity control settings (middle); and for different question-asking control settings (right)."}, {"id": 187, "string": "over the beam search baseline in all metrics, and achieves close-to-human scores on all metrics except humanness."}, {"id": 188, "string": "This striking result demonstrates that repetition is by far the biggest limiting quality factor for naive sequence-to-sequence dialogue agents."}, {"id": 189, "string": "The result also emphasizes the importance of multi-turn dialogue evaluation to detect the problem."}, {"id": 190, "string": "We refer to this model as the repetitioncontrolled baseline, and use it as a basis for all remaining experiments (i.e., we control specificity, response-relatedness and question-asking on top of these repetition-control settings)."}, {"id": 191, "string": "Specificity (WD, CT) For our weighted decoding models, the extreme settings (very generic and very specific) score poorly in engagingness due to the frequent presence of degenerate output -see Figure 3 (middle)."}, {"id": 192, "string": "We find that the weight = 4 setting (which is more specific than the repetitioncontrolled baseline and about as specific as the gold data) maximizes engagingness."}, {"id": 193, "string": "As shown in Figure 3 (left) and Figure 4 , this more-specific model is rated more interesting, engaging, and a better listener than the repetition-controlled baseline, but at the cost of reduced fluency and making sense."}, {"id": 194, "string": "Our CT model with z = 7 (which has a similar NIDF level as WD with weight = 4) shows similar results, but the improvements are smaller."}, {"id": 195, "string": "For further discussion on the interestingness of our specificity models, see Section 8.3."}, {"id": 196, "string": "Response-relatedness (WD) We evaluated several control settings (weight = −10, 5, 10, 13) and found that none scored better than weight = 0 (no response-relatedness control); see Appendix H. This is surprising -prior to running the human evaluation, we annotated 100 examples ourselves to determine the best control settings."}, {"id": 197, "string": "While we identified a more responsive setting (weight = 5) as less likely than the uncontrolled model to ignore the user, crowdworkers rated it as a slightly worse listener than the uncontrolled model."}, {"id": 198, "string": "One explanation for this discrepancy is that the more responsive model takes more risks, using more rare words (0.197 NIDF, up from 0.178), and thus receives a lower makes-sense score (3.41, down from 3.70)."}, {"id": 199, "string": "We hypothesize that, compared to us, the crowdworkers are less tolerant of slightly nonsensical output, and more tolerant of generic unrelated utterances."}, {"id": 200, "string": "Question-asking (CT) As shown in Figure 3 (right), a question-asking rate of 65.7% (z = 7) maximizes engagingness."}, {"id": 201, "string": "This setting, which asks more questions than both the repetition-controlled baseline (50.0%) and the human-produced gold data (28.8%), brings us closest to human-level engagingness -see Figure 3 (left)."}, {"id": 202, "string": "Although we find that a rate of approximately 65.7% questionasking is the most engaging, a lower level (48.9%, or z = 4) is rated the best listener."}, {"id": 203, "string": "Lastly, we find  that although asking too many questions is less engaging, most crowdworkers will not directly criticize a chatbot that asks questions on every turnonly 11.9% of crowdworkers judged the z = 10 (boost) setting, which asks 99.5% questions, as asking too many questions."}, {"id": 204, "string": "8 For full details of these scores, see Appendix F and H. For time and budget reasons, we did not evaluate any models controlling both question-asking and specificity."}, {"id": 205, "string": "However, we expect it is possible to obtain further improvements by doing so."}, {"id": 206, "string": "A/B tests for interestingness Though our more-specific models yielded significant improvements in engagingness, we were surprised that they did not yield clearer improvements in interestingness."}, {"id": 207, "string": "To investigate further, we conducted an A/B interestingness evaluation of three specificity-controlled models, compared to the repetition-controlled baseline."}, {"id": 208, "string": "Crowdworkers were shown two conversations (from the main human evaluation) and asked to choose which model was more interesting (see Figure 7 for details)."}, {"id": 209, "string": "We collected 500 samples per comparison, plus 200 additional human vs repetition-controlled baseline samples, which were used to filter for quality control."}, {"id": 210, "string": "After discarding low-quality crowdworkers, we have roughly 300 evaluations per comparison, with an average Cohen's κ = 0.6."}, {"id": 211, "string": "As shown in Table 3 , all three models were rated significantly more interesting than the repetitioncontrolled baseline."}, {"id": 212, "string": "This convincingly shows that producing utterances with more rare words is a valid strategy to improve interestingness."}, {"id": 213, "string": "We have two explanations for why these interestingness differences did not materialize in our main evaluation."}, {"id": 214, "string": "Firstly, interestingness is a particularly subjective metric (unlike more tangible metrics such as avoiding repetition and making sense) -this makes it hard to calibrate across crowdworkers."}, {"id": 215, "string": "Secondly, we suspect that in our original evaluation, the crowdworkers may have evaluated the interestingness of the task rather than the chatbot."}, {"id": 216, "string": "This could account for why subtle increases in conversational ability did not result in higher interestingness ratings -the PersonaChat task itself has a natural interestingness limit."}, {"id": 217, "string": "Conclusion What makes a good conversation?"}, {"id": 218, "string": "Through our evaluation, we showed that a good conversation is about balance -controlling for the right level of repetition, specificity and question-asking is important for overall quality."}, {"id": 219, "string": "We also found that conversational aspects such as interestingness, listening, and inquisitiveness are all importantthough optimizing these can introduce a trade-off against certain types of errors (such as repetitive, disfluent, or nonsensical output)."}, {"id": 220, "string": "Secondly, multiturn evaluation is essential to study what makes a good conversation -multiple turns are required to reveal issues such as repetition, consistency, and question-asking frequency."}, {"id": 221, "string": "Lastly, what do we mean by 'good'?"}, {"id": 222, "string": "Although humanness and engagingness are both commonly used as overall quality metrics, the two are very different."}, {"id": 223, "string": "While our models achieved close-to-human scores on engagingness, they failed to get close on humannessshowing that a chatbot need not be human-like to be enjoyable."}, {"id": 224, "string": "This striking result also demonstrates the importance of measuring more than one quality metric when evaluating dialogue agents."}, {"id": 225, "string": "Outlook Our work shows that neural generative systems have systemic problems when applied to open-ended dialogue, some of which (e.g."}, {"id": 226, "string": "repetition) are only observable in the multi-turn setting."}, {"id": 227, "string": "Furthermore, control of low-level attributes offers a practical way to correct these problems, yielding large improvements to overall quality -in our case, comparable to systems trained on much more data."}, {"id": 228, "string": "Future work includes optimizing control settings automatically, and building more convincingly human-like chatbots."}, {"id": 229, "string": "Supplementary Material A Screenshots of human evaluation interface B Human evaluation questionnaire design Here are the questions and multiple-choice options used in the human evaluation, in the order presented: [Engagingness] How much did you enjoy talking to this user?"}, {"id": 230, "string": "Adding w to the hypothesis y <t would create a 2-gram that appears in a previous utterance by the model extrep unigram(w, y <t , x) w is a non-stopword and w appears in a previous utterance by the model intrep bigram(w, y <t , x) Adding w to the hypothesis y <t would create a 2-gram that appears earlier in the hypothesis y <t intrep unigram(w, y <t , x) w is a non-stopword and w appears earlier in the hypothesis y <t partnerrep bigram(w, y <t , x) Adding w to the hypothesis y <t would create a 2-gram that appears in a previous utterance by the partner Repetition control (WD) Extrep bigram WD -0.5 wt -0.5 Extrep bigram WD -1.25 wt -1.25 Extrep bigram WD -3.5 wt -3.5 Extrep bigram WD -inf wt -∞ Repetition-controlled baseline wt -3.5 wt -∞ wt -∞ Question control (CT) Question-controlled CT 0 wt -3.5 wt -∞ wt -∞ z = 0 Question-controlled CT 1 wt -3.5 wt -∞ wt -∞ z = 1 Question-controlled CT 4 wt -3.5 wt -∞ wt -∞ z = 4 Question-controlled CT 7 wt -3.5 wt -∞ wt -∞ z = 7 Question-controlled CT 10 wt -3.5 wt -∞ wt -∞ z = 10 Question-controlled CT 10 (boost) wt 0 * wt -∞ wt -∞ z = 10 Specificity control (CT) Specificity-controlled CT 0 wt -3.5 wt -∞ wt -∞ z = 0 Specificity-controlled CT 2 wt -3.5 wt -∞ wt -∞ z = 2 Specificity-controlled CT 4 wt -3.5 wt -∞ wt -∞ z = 4 Specificity-controlled CT 7 wt -3.5 wt -∞ wt -∞ z = 7 Specificity-controlled CT 9 wt -3.5 wt -∞ wt -∞ z = 9 Specificity control (WD) Specificity-controlled WD -10 wt -3.5 wt -∞ wt -∞ wt -10 Specificity-controlled WD -4 wt -3.5 wt -∞ wt -∞ wt -4 Specificity-controlled WD 4 wt -3.5 wt -∞ wt -∞ wt 4 Specificity-controlled WD 6 wt -3.5 wt -∞ wt -∞ wt 6 Specificity-controlled WD 8 wt -3.5 wt -∞ wt -∞ wt 8 Response-related control (WD) ** Response-related controlled WD -10 wt -3.5 wt -∞ wt -∞ wt -∞ wt -∞ wt -10 Response-related controlled WD 0 wt -3.5 wt -∞ wt -∞ wt -∞ wt -∞ wt 0 Response-related controlled WD 5 wt -3.5 wt -∞ wt -∞ wt -∞ wt -∞ wt 5 Response-related controlled WD 10 wt -3.5 wt -∞ wt -∞ wt -∞ wt -∞ wt 10 Response-related controlled WD 13 wt -3.5 wt -∞ wt -∞ wt -∞ wt -∞ wt 13 Table 5 : Control settings for all configurations that were human-evaluated."}, {"id": 231, "string": "'wt' means the weight used for a weighted decoding feature and 'z =' means the setting (i.e."}, {"id": 232, "string": "bucket) for the control variable in conditional training."}, {"id": 233, "string": "* In the setting Question-controlled CT 10 (boost), the feature extrep bigram is not used for weighted decoding during beam search, but it is used to rerank the candidates after beam search."}, {"id": 234, "string": "See Section 6.4 for details."}, {"id": 235, "string": "** Note that the Response-related controlled models additionally introduce repetition controls to block internal bigram repetition and partner bigram repetition."}, {"id": 236, "string": "This was necessary to prevent the model from parroting the partner's last utterance."}, {"id": 237, "string": "In Table 8 , we find that just adding these extra repetition controls (here called Responserelated controlled WD 0, i.e."}, {"id": 238, "string": "increased repetition control but no response-relatedness control) outperforms our canonical Repetition-controlled baseline."}, {"id": 239, "string": "However, given that we discovered this later, our specificity and question controlled models are built on top of the canonical Repetition-controlled baseline."}, {"id": 240, "string": "Table 7 : Raw scores (mean ± std.)"}, {"id": 241, "string": "for all models and human evaluation metrics."}, {"id": 242, "string": "The first eight columns are Likert metrics on a 1-4 scale (except Avoiding Repetition, which is a 1-3 scale), where higher is better (except Inquisitiveness, which has an optimal score of 3)."}, {"id": 243, "string": "The last column, Persona Retrieval, is on a scale from 0 to 1 where higher is better."}, {"id": 244, "string": "The maximum of each column (excluding Human row) is in bold."}, {"id": 245, "string": "Model Avoiding Rep."}, {"id": 246, "string": "Engage Fluency Humanness Inquisitive Interesting Listening Make Sense Human and baselines * Human 2.79 ± 0.12 3.04 ± 0.11 3.36 ± 0.12 3.35 ± 0.11 2.44 ± 0.12 2.92 ± 0.11 3.32 ± 0.13 3.68 ± 0.11 * Greedy Search 2.08 ± 0.10 2.24 ± 0.11 3.03 ± 0.10 1.75 ± 0.12 1.95 ± 0.10 2.29 ± 0.13 2.62 ± 0.10 3.23 ± 0.10 * Beam Search (beam size 20) 2.08 ± 0.11 2.29 ± 0.11 3.09 ± 0.13 1.71 ± 0.13 2.42 ± 0.11 2.29 ± 0.14 2.47 ± 0.12 3.35 ± 0.13 Repetition control (WD) Extrep bigram WD -0.5 2.62 ± 0.10 2.54 ± 0.12 3.35 ± 0.12 2.13 ± 0.11 2.63 ± 0.11 2.56 ± 0.11 2.93 ± 0.11 3.48 ± 0.11 Extrep bigram WD -1.25 2.78 ± 0.09 2.82 ± 0.13 3.40 ± 0.12 2.27 ± 0.12 2.54 ± 0.09 2.76 ± 0.10 3.05 ± 0.11 3.53 ± 0.14 Extrep bigram WD -3.5 2.83 ± 0.11 2.93 ± 0.10 3.56 ± 0.10 2.43 ± 0.11 2.47 ± 0.11 2.83 ± 0.10 3.14 ± 0.10 3.62 ± 0.12 Extrep bigram WD -inf 2.74 ± 0.11 2.87 ± 0.14 3.49 ± 0.12 2.32 ± 0.13 2.56 ± 0.11 2.75 ± 0.12 3.13 ± 0.12 3.59 ± 0.12 * Repetition-controlled baseline 2.86 ± 0.12 2.82 ± 0.12 3.53 ± 0.10 2.40 ± 0.11 2.62 ± 0.13 2.84 ± 0.12 3.10 ± 0.11 3.58 ± 0.14 Question control (CT) Question-controlled CT 0 2.87 ± 0.12 2.84 ± 0.13 3.51 ± 0.10 2.46 ± 0.11 2.36 ± 0.09 2.76 ± 0.09 3.10 ± 0.10 3.49 ± 0.12 Question-controlled CT 1 2.82 ± 0.11 2.88 ± 0.11 3.42 ± 0.10 2.46 ± 0.12 2.47 ± 0.11 2.79 ± 0.13 3.14 ± 0.11 3.55 ± 0.10 Question-controlled CT 4 2.78 ± 0.12 2.88 ± 0.10 3.47 ± 0.11 2.40 ± 0.09 2.53 ± 0.13 2.83 ± 0.13 3.24 ± 0.11 3.59 ± 0.10 * Question-controlled CT 7 2.81 ± 0.10 2.99 ± 0.11 3.54 ± 0.09 2.35 ± 0.11 2.66 ± 0.12 2.92 ± 0.12 3.11 ± 0.10 3.47 ± 0.10 Question-controlled CT 10 2.67 ± 0.13 2.87 ± 0.11 3.52 ± 0.12 2.35 ± 0.12 2.63 ± 0.12 2.66 ± 0.10 2.94 ± 0.11 3.53 ± 0.12 Question-controlled CT 10 (boost) 2.68 ± 0.12 2.74 ± 0.09 3.42 ± 0.12 2.19 ± 0.13 2.79 ± 0.11 2.74 ± 0.11 3.00 ± 0.12 3.45 ± 0.13 Specificity control (CT) Specificity-controlled CT 0 2.79 ± 0.10 2.93 ± 0.09 3.44 ± 0.12 2.38 ± 0.11 2.56 ± 0.12 2.84 ± 0.12 3.12 ± 0.13 3.61 ± 0.11 Specificity-controlled CT 2 2.78 ± 0.12 2.74 ± 0.11 3.39 ± 0.13 2.31 ± 0.13 2.56 ± 0.13 2.74 ± 0.12 2.99 ± 0.11 3.47 ± 0.10 Specificity-controlled CT 4 2.82 ± 0.10 2.80 ± 0.13 3.44 ± 0.14 2.32 ± 0.13 2.51 ± 0.12 2.78 ± 0.15 3.09 ± 0.13 3.46 ± 0.13 Specificity-controlled CT 7 2.81 ± 0.12 2.91 ± 0.13 3.43 ± 0.11 2.45 ± 0.10 2.49 ± 0.11 2.81 ± 0.12 3.15 ± 0.12 3.55 ± 0.11 Specificity-controlled CT 9 2.80 ± 0.13 2.78 ± 0.10 3.41 ± 0.12 2.35 ± 0.13 2.28 ± 0.11 2.79 ± 0.11 2.91 ± 0.11 3.51 ± 0.12 Specificity control (WD) Specificity-controlled WD -10 2.76 ± 0.11 2.41 ± 0.12 3.19 ± 0.12 2.15 ± 0.11 2.28 ± 0.13 2.35 ± 0.12 2.89 ± 0.11 3.28 ± 0.12 Specificity-controlled WD -4 2.83 ± 0.10 2.76 ± 0.12 3.37 ± 0.10 2.36 ± 0.11 2.46 ± 0.11 2.62 ± 0.12 3.14 ± 0.09 3.52 ± 0.11 * Specificity-controlled WD 4 2.84 ± 0.10 2.96 ± 0.12 3.45 ± 0.13 2.44 ± 0.12 2.56 ± 0.09 2.94 ± 0.11 3.20 ± 0.10 3.54 ± 0.11 Specificity-controlled WD 6 2.81 ± 0.09 2.91 ± 0.10 3.34 ± 0.09 2.31 ± 0.11 2.53 ± 0.12 2.93 ± 0.12 3.09 ± 0.10 3.41 ± 0.12 Specificity-controlled WD 8 2.70 ± 0.11 2.39 ± 0.12 2.54 ± 0.12 1.80 ± 0.13 2.00 ± 0.10 2.49 ± 0.12 2.47 ± 0.10 2.87 ± 0.11 Response-related control (WD) Response-related controlled WD -10 2.77 ± 0.12 2.45 ± 0.12 3.26 ± 0.11 1.96 ± 0.10 2.31 ± 0.12 2.47 ± 0.12 2.73 ± 0.11 3.12 ± 0.12 Response-related controlled WD 0 2.87 ± 0.12 2.97 ± 0.11 3.55 ± 0.09 2.62 ± 0.11 2.48 ± 0.10 2.88 ± 0.12 3.21 ± 0.09 3.70 ± 0.10 Response-related controlled WD 5 2.79 ± 0.10 2.83 ± 0.09 3.35 ± 0.12 2.40 ± 0.12 2.51 ± 0.13 2.80 ± 0.13 3.13 ± 0.12 3.41 ± 0.12 Response-related controlled WD 10 2.74 ± 0.11 2.42 ± 0.12 2.93 ± 0.11 1.95 ± 0.12 2.20 ± 0.12 2.56 ± 0.12 2.90 ± 0.12 3.12 ± 0.10 Response-related controlled WD 13 2.63 ± 0.12 2.06 ± 0.11 2.40 ± 0.09 1.74 ± 0.11 2.07 ± 0.11 2.25 ± 0.12 2.49 ± 0.14 2.63 ± 0.10 Table 8 : Calibrated scores (mean ± std.)"}, {"id": 247, "string": "for all models and human evaluation metrics."}, {"id": 248, "string": "The first eight columns are Likert metrics on a 1-4 scale (except Avoiding Repetition, which is a 1-3 scale), where higher is better (except Inquisitiveness, which has an optimal score of 3)."}, {"id": 249, "string": "The last column, Persona Retrieval, is on a scale from 0 to 1 where higher is better."}, {"id": 250, "string": "The maximum of each column (excluding Human row) is in bold."}, {"id": 251, "string": "Rows marked with * are the six models included in Figure 3 Figure 9 : Calibrated human evaluation scores for all models."}, {"id": 252, "string": "This is the same data as in Table 8 ."}, {"id": 253, "string": "Note: 'Repetition-controlled baseline+' in the rightmost column is 'Response-related controlled WD 0' in Table 8 ."}, {"id": 254, "string": "See Table 5 for explanation."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 11}, {"section": "Related Work", "n": "2", "start": 12, "end": 38}, {"section": "Baseline model", "n": "4", "start": 39, "end": 46}, {"section": "Controllable text generation methods", "n": "5", "start": 47, "end": 58}, {"section": "Conditional Training (CT)", "n": "5.1", "start": 59, "end": 74}, {"section": "Weighted Decoding (WD)", "n": "5.2", "start": 75, "end": 90}, {"section": "Controlling conversational attributes", "n": "6", "start": 91, "end": 93}, {"section": "Repetition", "n": "6.1", "start": 94, "end": 101}, {"section": "Specificity", "n": "6.2", "start": 102, "end": 111}, {"section": "Response-relatedness", "n": "6.3", "start": 112, "end": 122}, {"section": "Question-asking", "n": "6.4", "start": 123, "end": 144}, {"section": "Comparison of control methods", "n": "7", "start": 145, "end": 155}, {"section": "Human evaluation results", "n": "8", "start": 156, "end": 163}, {"section": "Main findings", "n": "8.1", "start": 164, "end": 181}, {"section": "Effect of controlled attributes", "n": "8.2", "start": 182, "end": 205}, {"section": "A/B tests for interestingness", "n": "8.3", "start": 206, "end": 216}, {"section": "Conclusion", "n": "9", "start": 217, "end": 254}], "figures": [{"filename": "../figure/image/1358-Figure1-1.png", "caption": "Figure 1: We manipulate four low-level attributes and measure their effect on human judgments of individual conversational aspects, as well as overall quality.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 221.76, "y2": 347.03999999999996}}, {"filename": "../figure/image/1358-Figure2-1.png", "caption": "Figure 2: Controlling question-asking via conditional training. Exact numbers can be found in Appendix F.", "page": 5, "bbox": {"x1": 75.84, "x2": 286.56, "y1": 67.67999999999999, "y2": 201.6}}, {"filename": "../figure/image/1358-Table8-1.png", "caption": "Table 8: Calibrated scores (mean ± std.) for all models and human evaluation metrics.", "page": 20, "bbox": {"x1": 73.92, "x2": 524.16, "y1": 183.84, "y2": 524.16}}, {"filename": "../figure/image/1358-Figure9-1.png", "caption": "Figure 9: Calibrated human evaluation scores for all models. This is the same data as in Table 8.", "page": 21, "bbox": {"x1": 90.72, "x2": 508.32, "y1": 95.03999999999999, "y2": 692.16}}, {"filename": "../figure/image/1358-Figure7-1.png", "caption": "Figure 7: Screenshot of the A/B test UI, comparing a human-human conversation (left) and a Repetition-controlled baseline model (right).", "page": 13, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 168.48, "y2": 623.04}}, {"filename": "../figure/image/1358-Table5-1.png", "caption": "Table 5: Control settings for all configurations that were human-evaluated. ‘wt’ means the weight used for a weighted decoding feature and ‘z =’ means the setting (i.e. bucket) for the control variable in conditional training.", "page": 17, "bbox": {"x1": 74.88, "x2": 522.24, "y1": 95.03999999999999, "y2": 441.12}}, {"filename": "../figure/image/1358-Figure5-1.png", "caption": "Figure 5: Screenshot of the Task Description", "page": 12, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 125.75999999999999, "y2": 366.24}}, {"filename": "../figure/image/1358-Figure6-1.png", "caption": "Figure 6: Screenshot of the chat UI, talking with the beam search baseline model.", "page": 12, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 410.88, "y2": 640.3199999999999}}, {"filename": "../figure/image/1358-Figure4-1.png", "caption": "Figure 4: Calibrated human judgments of conversational aspects for the baselines and best controlled models. Note: In Figure 3 and here, the Specificity and Question controlled models both include Repetition control, but Question control doesn’t include Specificity control, or vice versa.", "page": 7, "bbox": {"x1": 75.36, "x2": 521.28, "y1": 204.48, "y2": 285.12}}, {"filename": "../figure/image/1358-Figure3-1.png", "caption": "Figure 3: Calibrated human judgments of engagingness for the baselines and best controlled models (left); for different specificity control settings (middle); and for different question-asking control settings (right).", "page": 7, "bbox": {"x1": 74.39999999999999, "x2": 521.76, "y1": 64.8, "y2": 162.72}}, {"filename": "../figure/image/1358-Table6-1.png", "caption": "Table 6: Automatic metrics (computed over validation set) for all model configurations that were human-evaluated.", "page": 18, "bbox": {"x1": 75.84, "x2": 522.24, "y1": 95.03999999999999, "y2": 449.28}}, {"filename": "../figure/image/1358-Table4-1.png", "caption": "Table 4: We define five binary features for controlling different types of repetition via weighted decoding (see Section 5.2). Each feature depends on the word w, the partial hypothesis y<t, and the context x (which includes the model’s own persona and the dialogue history). Each of these features is equal to 1 if and only if the condition on the right is true; otherwise 0.", "page": 16, "bbox": {"x1": 97.92, "x2": 499.2, "y1": 95.03999999999999, "y2": 258.24}}, {"filename": "../figure/image/1358-Table3-1.png", "caption": "Table 3: A/B tests comparing various specificity-controlled models to the repetition-controlled baseline on interestingness. We find all comparisons are significant (p < .05; binomial test).", "page": 8, "bbox": {"x1": 98.88, "x2": 498.24, "y1": 62.4, "y2": 115.19999999999999}}, {"filename": "../figure/image/1358-Table7-1.png", "caption": "Table 7: Raw scores (mean ± std.) for all models and human evaluation metrics.", "page": 19, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 94.56, "y2": 408.0}}, {"filename": "../figure/image/1358-Table1-1.png", "caption": "Table 1: Middle: Example of controlling specificity (NIDF) via weighted decoding. At the extremes, the model produces only the most rare or the most common tokens. Bottom: Example of controlling specificity via conditional training. This gives a narrower NIDF range, but all the responses are appropriate.", "page": 4, "bbox": {"x1": 76.8, "x2": 285.12, "y1": 62.4, "y2": 250.07999999999998}}, {"filename": "../figure/image/1358-Table2-1.png", "caption": "Table 2: Example of controlling response-relatedness (cosine similarity to input) via weighted decoding. Positive weights (e.g. 5.0) can yield more on-topic responses, but higher weights (e.g. 11.0) can result in nonsensical lists of topically related words.", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 528.0, "y1": 63.36, "y2": 166.07999999999998}}, {"filename": "../figure/image/1358-Figure8-1.png", "caption": "Figure 8: Example conversation with (a) Baseline (b) Repetition-controlled baseline (c) Question-controlled CT (z = 7), (d) Specificity-controlled WD (weight = 4).", "page": 15, "bbox": {"x1": 76.8, "x2": 535.1999999999999, "y1": 94.56, "y2": 526.0799999999999}}]}