{"title": "Forest-Based Neural Machine Translation", "abstract": "Tree-based neural machine translation (NMT) approaches, although achieved impressive performance, suffer from a major drawback: they only use the 1best parse tree to direct the translation, which potentially introduces translation mistakes due to parsing errors. For statistical machine translation (SMT), forestbased methods have been proven to be effective for solving this problem, while for NMT this kind of approach has not been attempted. This paper proposes a forest-based NMT method that translates a linearized packed forest under a simple sequence-to-sequence framework (i.e., a forest-to-string NMT model). The BLEU score of the proposed method is higher than that of the string-to-string NMT, treebased NMT, and forest-based SMT systems.", "text": [{"id": 0, "string": "Introduction NMT has witnessed promising improvements recently."}, {"id": 1, "string": "Depending on the types of input and output, these efforts can be divided into three categories: string-to-string systems ; tree-to-string systems (Eriguchi et al., 2016 (Eriguchi et al., , 2017 ; and string-totree systems (Aharoni and Goldberg, 2017; Nadejde et al., 2017) ."}, {"id": 2, "string": "Compared with string-to-string systems, tree-to-string and string-to-tree systems (henceforth, tree-based systems) offer some attractive features."}, {"id": 3, "string": "They can use more syntactic information , and can conveniently incorporate prior knowledge ."}, {"id": 4, "string": "* Contribution during internship at National Institute of Information and Communications Technology."}, {"id": 5, "string": "† Corresponding author Because of these advantages, tree-based methods become the focus of many researches of NMT nowadays."}, {"id": 6, "string": "Based on how to represent trees, there are two main categories of tree-based NMT methods: representing trees by a tree-structured neural network (Eriguchi et al., 2016; Zaremoodi and Haffari, 2017) , representing trees by linearization (Vinyals et al., 2015; Dyer et al., 2016; Ma et al., 2017) ."}, {"id": 7, "string": "Compared with the former, the latter method has a relatively simple model structure, so that a larger corpus can be used for training and the model can be trained within reasonable time, hence is preferred from the viewpoint of computation."}, {"id": 8, "string": "Therefore we focus on this kind of methods in this paper."}, {"id": 9, "string": "In spite of impressive performance of tree-based NMT systems, they suffer from a major drawback: they only use the 1-best parse tree to direct the translation, which potentially introduces translation mistakes due to parsing errors (Quirk and Corston-Oliver, 2006) ."}, {"id": 10, "string": "For SMT, forest-based methods have employed a packed forest to address this problem (Huang, 2008) , which represents exponentially many parse trees rather than just the 1-best one ."}, {"id": 11, "string": "But for NMT, (computationally efficient) forestbased methods are still being explored 1 ."}, {"id": 12, "string": "Because of the structural complexity of forests, the inexistence of appropriate topological ordering, and the hyperedge-attachment nature of weights (see Section 3.1 for details), it is not trivial to linearize a forest."}, {"id": 13, "string": "This hinders the development of forest-based NMT to some extent."}, {"id": 14, "string": "Inspired by the tree-based NMT methods based on linearization, we propose an efficient forestbased NMT approach (Section 3), which can en-code the syntactic information of a packed forest on the basis of a novel weighted linearization method for a packed forest (Section 3.1), and can decode the linearized packed forest under the simple sequence-to-sequence framework (Section 3.2) ."}, {"id": 15, "string": "Experiments demonstrate the effectiveness of our method (Section 4)."}, {"id": 16, "string": "Preliminaries We first review the general sequence-to-sequence model (Section 2.1), then describe tree-based NMT systems based on linearization (Section 2.2), and finally introduce the packed forest, through which exponentially many trees can be represented in a compact manner (Section 2.3)."}, {"id": 17, "string": "Sequence-to-sequence model Current NMT systems usually resort to a simple framework, i.e., the sequence-to-sequence model ."}, {"id": 18, "string": "Given a source sequence (x 0 , ."}, {"id": 19, "string": "."}, {"id": 20, "string": "."}, {"id": 21, "string": ", x T ), in order to find a target sequence (y 0 , ."}, {"id": 22, "string": "."}, {"id": 23, "string": "."}, {"id": 24, "string": ", y T ) that maximizes the conditional probability p(y 0 , ."}, {"id": 25, "string": "."}, {"id": 26, "string": "."}, {"id": 27, "string": ", y T | x 0 , ."}, {"id": 28, "string": "."}, {"id": 29, "string": "."}, {"id": 30, "string": ", x T ), the sequence-to-sequence model uses one RNN to encode the source sequence into a fixed-length context vector c and a second RNN to decode this vector and generate the target sequence."}, {"id": 31, "string": "Formally, the probability of the target sequence can be calculated as follows: p(y 0 , ."}, {"id": 32, "string": "."}, {"id": 33, "string": "."}, {"id": 34, "string": ",y T | x 0 , ."}, {"id": 35, "string": "."}, {"id": 36, "string": "."}, {"id": 37, "string": ", x T ) = T t=0 p(y t | c, y 0 , ."}, {"id": 38, "string": "."}, {"id": 39, "string": "."}, {"id": 40, "string": ", y t−1 ), (1) where p(y t | c, y 0 , ."}, {"id": 41, "string": "."}, {"id": 42, "string": "."}, {"id": 43, "string": ", y t−1 ) = g(y t−1 , s t , c), (2) s t = f (s t−1 , y t−1 , c), (3) c = q(h 0 , ."}, {"id": 44, "string": "."}, {"id": 45, "string": "."}, {"id": 46, "string": ", h T ), (4) h t = f (e t , h t−1 )."}, {"id": 47, "string": "(5) Here, g, f , and q are nonlinear functions; h t and s t are the hidden states of the source-side RNN and target-side RNN, respectively, c is the context vector, and e t is the embedding of x t ."}, {"id": 48, "string": "introduced an attention mechanism to deal with the issues related to long sequences ."}, {"id": 49, "string": "Instead of encoding the source sequence into a fixed vector c, the attention model uses different c i -s when calculating the target-side output y i at time step i: c i = T j=0 α ij h j , (6) α ij = exp(a(s i−1 , h j )) T k=0 exp(a(s i−1 , h k )) ."}, {"id": 50, "string": "(7) The function a(s i−1 , h j ) can be regarded as representing the soft alignment between the target-side RNN hidden state s i−1 and the source-side RNN hidden state h j ."}, {"id": 51, "string": "By changing the format of the source/target sequences, this framework can be regarded as a string-to-string NMT system , a tree-to-string NMT system , or a string-to-tree NMT system (Aharoni and Goldberg, 2017) ."}, {"id": 52, "string": "Linear-structured tree-based NMT systems Regarding the linearization adopted for tree-tostring NMT (i.e., linearization of the source side), Sennrich and Haddow (2016) encoded the sequence of dependency labels and the sequence of words simultaneously, partially utilizing the syntax information, while  traversed the constituent tree of the source sentence and combined this with the word sequence, utilizing the syntax information completely."}, {"id": 53, "string": "Regarding the linearization used for string-totree NMT (i.e., linearization of the target side), Nadejde et al."}, {"id": 54, "string": "(2017) used a CCG supertag sequence as the target sequence, while Aharoni and Goldberg (2017) applied a linearization method in a top-down manner, generating a sequence ensemble for the annotated tree in the Penn Treebank (Marcus et al., 1993) ."}, {"id": 55, "string": "Wu et al."}, {"id": 56, "string": "(2017) used transition actions to linearize a dependency tree, and employed the sequence-to-sequence framework for NMT."}, {"id": 57, "string": "It can be seen all current tree-based NMT systems use only one tree for encoding or decoding."}, {"id": 58, "string": "In contrast, we hope to utilize multiple trees (i.e., a forest)."}, {"id": 59, "string": "This is not trivial, on account of the lack of a fixed traversal order and the need for a compact representation."}, {"id": 60, "string": "Packed forest The packed forest gives a representation of exponentially many parsing trees, and can compactly encode many more candidates than the n-best list Figure 1 : An example of (a) a packed forest."}, {"id": 61, "string": "The numbers in the brackets located at the upper-left corner of each node in the packed forest show one correct topological ordering of the nodes."}, {"id": 62, "string": "The packed forest is a compact representation of two trees: (b) the correct constituent tree, and (c) an incorrect constituent tree."}, {"id": 63, "string": "Note that the terminal nodes (i.e., words in the sentence) in the packed forest are shown only for illustration, and they do not belong to the packed forest."}, {"id": 64, "string": "(Huang, 2008) ."}, {"id": 65, "string": "Figure 1a shows a packed forest, which can be unpacked into two constituent trees ( Figure 1b and Figure 1c )."}, {"id": 66, "string": "Formally, a packed forest is a pair V, E , where V is the set of nodes and E is the set of hyperedges."}, {"id": 67, "string": "Each v ∈ V can be represented as X i,j , where X is a constituent label and i, j ∈ [0, n] are indices of words, showing that the node spans the words ranging from i (inclusive) to j (exclusive)."}, {"id": 68, "string": "Here, n is the length of the input sentence."}, {"id": 69, "string": "Each e ∈ E is a three-tuple head(e), tails(e), score(e) , where head(e) ∈ V is similar to the head node in a constituent tree, and tails(e) ∈ V * is similar to the set of child nodes in a constituent tree."}, {"id": 70, "string": "score(e) ∈ R is the logarithm of the probability that tails(e) represents the tails of head(e) calculated by the parser."}, {"id": 71, "string": "Based on score(e), the score of a constituent tree T can be calculated as follows: score(T ) = −λn + e∈E(T ) score(e), (8) where E(T ) is the set of hyperedges appearing in tree T , and λ is a regularization coefficient for the sentence length 2 ."}, {"id": 72, "string": "2 Following the configuration of Charniak and Johnson Forest-based NMT We first propose a linearization method for the packed forest (Section 3.1), then describe how to encode the linearized forest (Section 3.2), which can then be translated by the conventional decoder (see Section 2.1)."}, {"id": 73, "string": "Forest linearization Recently, several studies have focused on the linearization methods of a syntax tree, both in the area of tree-based NMT (Section 2.2) and in the area of parsing (Vinyals et al., 2015; Dyer et al., 2016; Ma et al., 2017) ."}, {"id": 74, "string": "Basically, these methods follow a fixed traversal order (e.g., depthfirst), which does not exist for the packed forest (a directed acyclic graph (DAG))."}, {"id": 75, "string": "Furthermore, the weights are attached to edges of a packed forest instead of the nodes, which further increase the difficulty."}, {"id": 76, "string": "Topological ordering algorithms for DAG (Kahn, 1962; Tarjan, 1976) are not good solutions, because the outputted ordering is not always optimal for machine translation."}, {"id": 77, "string": "In particular, a topo- (2005) , for all the experiments in this paper, we fixed λ to log 2 600."}, {"id": 78, "string": "Algorithm 1 Linearization of a packed forest 1: function LINEARIZEFOREST( V, E , w) 2: v ← FINDROOT(V ) 3: r ← [] 4: EXPANDSEQ(v, r, V, E , w) 5: return r 6: function FINDROOT(V ) 7: for v ∈ V do 8: if v has no parent then 9: return v 10: procedure EXPANDSEQ(v, r, V, E , w) 11: for e ∈ E do 12: if head(e) = v then 13: if tails(e) = ∅ then 14: for t ∈ SORT(tails(e)) do Sort tails(e) by word indices."}, {"id": 79, "string": "15: EXPANDSEQ(t, r, V, E , w) 16: l ← LINEARIZEEDGE(head(e), w) 17: r.append( l, σ(0.0) ) σ is the sigmoid function, i.e., σ(x) = 1 1+e −x , x ∈ R. 18: l ← c LINEARIZEEDGES(tails(e), w) c is a unary operator."}, {"id": 80, "string": "19: r.append( l, σ(score(e)) ) 20: else 21: l ← LINEARIZEEDGE(head(e), w) 22: r.append( l, σ(0.0) ) 23: function LINEARIZEEDGE(Xi,j, w) 24: return X ⊗ ( j−1 k=i w k ) 25: function LINEARIZEEDGES(v, w) 26: return ⊕v∈vLINEARIZEEDGE(v, w) logical ordering could ignore \"word sequential information\" and \"parent-child information\" in the sentences."}, {"id": 81, "string": "For example, for the packed forest in Figure 1a , although \"[10]→[1]→[2]→ · · · →[9]→[11]\" is a valid topological ordering, the word sequential information of the words (e.g., \"John\" should be located ahead of the period), which is fairly crucial for translation of languages with fixed pragmatic word order such as Chinese or English, is lost."}, {"id": 82, "string": "As another example, for the packed forest in Figure 1a , nodes [2], [9], and [10] are all the children of node [11] ."}, {"id": 83, "string": "However, in the topological or- der \"[1]→[2]→ · · · →[9]→[10]→[11],\" node [2] is quite far from node [11], while nodes [9] and [10] are both close to node [11] ."}, {"id": 84, "string": "The parent-child information cannot be reflected in this topological order, which is not what we would expect."}, {"id": 85, "string": "To address the above two problems, we propose a novel linearization algorithm for a packed forest (Algorithm 1)."}, {"id": 86, "string": "The algorithm linearizes the packed forest from the root node (Line 2) to leaf nodes by calling the EXPANDSEQ procedure (Line 15) recursively, while preserving the word order in the sentence (Line 14)."}, {"id": 87, "string": "In this way, word sequential information is preserved."}, {"id": 88, "string": "Within the Figure 1a EXPANDSEQ procedure, once a hyperedge is linearized (Line 16), the tails are also linearized immediately (Line 18)."}, {"id": 89, "string": "In this way, parent-child information is preserved."}, {"id": 90, "string": "Intuitively, different parts of constituent trees should be combined in different ways, therefore we define different operators ( c , ⊗, ⊕, or ) to represent the relationships between different parts, so that the representations of these parts can be combined in different ways (see Section 3.2 for details)."}, {"id": 91, "string": "Words are concatenated by the operator \" \" with each other, a word and a constituent label is concatenated by the operator \"⊗\", the linearization results of child nodes are concatenated by the operator \"⊕\" with each other, while the unary operator \" c \" is used to indicate that the node is the child node of the previous part."}, {"id": 92, "string": "Furthermore, each token in the linearized sequence is related to a score, representing the confidence of the parser."}, {"id": 93, "string": "The linearization result of the packed forest in Figure 1a is shown in Figure 2 ."}, {"id": 94, "string": "Tokens in the linearized sequence are separated by slashes."}, {"id": 95, "string": "Each token in the sequence is composed of different types of symbols and combined by different operators."}, {"id": 96, "string": "We can see that word sequential information is preserved."}, {"id": 97, "string": "For example, \"NNP⊗John\" (linearization result of node [1]) is in front of \"VBZ⊗has\" (linearization result of node [3]), which is in front of \"DT⊗a\" (linearization result of node [4])."}, {"id": 98, "string": "Moreover, parent-child information is also preserved."}, {"id": 99, "string": "For example, \"NP⊗John\" (linearization result of node [2]) is followed by \" c NNP⊗John\" (linearization result of node [1], the child of node [2])."}, {"id": 100, "string": "Note that our linearization method cannot fully recover packed forest."}, {"id": 101, "string": "What we want to do is not to propose a fully recoverable linearization method."}, {"id": 102, "string": "What we actually want to do is to encode syntax information as much as possible, so that we can improve the performance of NMT."}, {"id": 103, "string": "As will be shown in Section 4, this goal is achieved."}, {"id": 104, "string": "Also note that there is one more advantage of our linearization method: the linearized sequence Figure 3 : The framework of the forest-based NMT system."}, {"id": 105, "string": "is a weighted sequence, while all the previous studies ignored the weights during linearization."}, {"id": 106, "string": "As will be shown in Section 4, the weights are actually important not only for the linearization of a packed forest, but also for the linearization of a single tree."}, {"id": 107, "string": "By preserving only the nodes and hyperedges in the 1-best tree and removing all others, our linearization method can be regarded as a treelinearization method."}, {"id": 108, "string": "Compared with other treelinearization methods, our method combines several different kinds of information within one symbol, retaining the parent-child information, and incorporating the confidence of the parser in the sequence."}, {"id": 109, "string": "We examine whether the weights can be useful not only for linear structured tree-based NMT but also for our forest-based NMT."}, {"id": 110, "string": "Furthermore, although our method is nonreversible for packed forests, it is reversible for constituent trees, in that the linearization is processed exactly in the depth-first traversal order and all necessary information in the tree nodes has been encoded."}, {"id": 111, "string": "As far as we know, there is no previous work on linearization of packed forests."}, {"id": 112, "string": "Encoding the linearized forest The linearized packed forest forms the input of the encoder, which has two major differences from the input of a sequence-to-sequence NMT system."}, {"id": 113, "string": "First, the input sequence of the encoder consists of two parts: the symbol sequence and the score sequence."}, {"id": 114, "string": "Second, each symbol in the symbol sequence consists of several parts (words and constituent labels), which are combined by certain operators ( c , ⊗, ⊕, or )."}, {"id": 115, "string": "Based on these observa-tions, we propose two new frameworks, which are illustrated in Figure 3 ."}, {"id": 116, "string": "Formally, the input layer receives the sequence ( l 0 , ξ 0 , ."}, {"id": 117, "string": "."}, {"id": 118, "string": "."}, {"id": 119, "string": ", l T , ξ T ), where l i denotes the i-th symbol and ξ i its score."}, {"id": 120, "string": "Then, the sequence is fed into the score layer and the symbol layer."}, {"id": 121, "string": "The score and symbol layers receive the sequence and output the score sequence ξ = (ξ 0 , ."}, {"id": 122, "string": "."}, {"id": 123, "string": "."}, {"id": 124, "string": ", ξ T ) and symbol sequence l = (l 0 , ."}, {"id": 125, "string": "."}, {"id": 126, "string": "."}, {"id": 127, "string": ", l T ), respectively, from the input."}, {"id": 128, "string": "Any item l ∈ l in the symbol layer has the form l = o 0 x 1 o 1 ."}, {"id": 129, "string": "."}, {"id": 130, "string": "."}, {"id": 131, "string": "x m−1 o m−1 x m , (9) where each x k (k = 1, ."}, {"id": 132, "string": "."}, {"id": 133, "string": "."}, {"id": 134, "string": ", m) is a word or a constituent label, m is the total number of words and constituent labels in a symbol, o 0 is \" c \" or empty, and each o k (k = 1, ."}, {"id": 135, "string": "."}, {"id": 136, "string": "."}, {"id": 137, "string": ", m − 1) is either \"⊗\", \"⊕\", or \" \"."}, {"id": 138, "string": "Then, in the node/operator layer, the x-s and o-s are separated and rearranged as x = (x 1 , ."}, {"id": 139, "string": "."}, {"id": 140, "string": "."}, {"id": 141, "string": ", x m , o 0 , ."}, {"id": 142, "string": "."}, {"id": 143, "string": "."}, {"id": 144, "string": ", o m−1 ), which is fed to the pre-embedding layer."}, {"id": 145, "string": "The pre-embedding layer generates a sequence p = (p 1 , ."}, {"id": 146, "string": "."}, {"id": 147, "string": "."}, {"id": 148, "string": ", p m , ."}, {"id": 149, "string": "."}, {"id": 150, "string": "."}, {"id": 151, "string": ", p 2m ), which is calculated as follows: p = W emb [I(x)]."}, {"id": 152, "string": "(10) Here, the function I(x) returns a list of the indices in the dictionary for all the elements in x, which consist of words, constituent labels, or operators."}, {"id": 153, "string": "In addition, W emb is the embedding matrix of size (|w word | + |w label | + 4) × d word , where |w word | and |w label | are the total number of words and constituent labels, respectively, d word is the dimension of the word embedding, and there are four possible operators: \" c ,\" \"⊗,\" \"⊕,\" and \" .\""}, {"id": 154, "string": "Note that p is a list of 2m vectors, and the dimension of each vector is d word ."}, {"id": 155, "string": "Because the length of the sequence of the input layer is T + 1, there are T + 1 different ps in the pre-embedding layer, which we denote by P = (p 0 , ."}, {"id": 156, "string": "."}, {"id": 157, "string": "."}, {"id": 158, "string": ", p T )."}, {"id": 159, "string": "Depending on where the score layer is incorporated, we propose two frameworks: Score-on-Embedding (SoE) and Score-on-Attention (SoA)."}, {"id": 160, "string": "In SoE, the k-th element of the embedding layer is calculated as follows: e k = ξ k p∈p k p, (11) while in SoA, the k-th element of the embedding layer is calculated as e k = p∈p k p, (12) where k = 0, ."}, {"id": 161, "string": "."}, {"id": 162, "string": "."}, {"id": 163, "string": ", T ."}, {"id": 164, "string": "Note that e k ∈ R d word ."}, {"id": 165, "string": "In this manner, the proposed forest-to-string NMT framework is connected with the conventional sequence-to-sequence NMT framework."}, {"id": 166, "string": "After calculating the embedding vectors in the embedding layer, the hidden vectors are calculated using Equation 5."}, {"id": 167, "string": "When calculating the context vector c i -s, SoE and SoA differ from each other."}, {"id": 168, "string": "For SoE, the c i -s are calculated using Equation 6 and 7, while for SoA, the α ij -s used to calculate the c i -s are determined as follows: α ij = exp(ξ j a(s i−1 , h j )) T k=0 exp(ξ k a(s i−1 , h k )) ."}, {"id": 169, "string": "(13) Then, using the decoder of the sequence-tosequence framework, the sentence of the target language can be generated."}, {"id": 170, "string": "Experiments Setup We evaluate the effectiveness of our forest-based NMT systems on English-to-Chinese and Englishto-Japanese translation tasks 3 ."}, {"id": 171, "string": "The statistics of the corpora used in our experiments are summarized in Table 1 ."}, {"id": 172, "string": "The packed forests of English sentences are obtained by the constituent parser proposed by Huang (2008) 4 ."}, {"id": 173, "string": "We filtered out the sentences for 3 English is commonly chosen as the target language."}, {"id": 174, "string": "We chose English as the source language because a highperformance forest parser is not available for other languages."}, {"id": 175, "string": "For Japanese sentences, we followed the preprocessing steps recommended in WAT 2017 6 ."}, {"id": 176, "string": "We implemented our framework based on nematus 8 (Sennrich et al., 2017) ."}, {"id": 177, "string": "For optimization, we used the Adadelta algorithm (Zeiler, 2012) ."}, {"id": 178, "string": "In order to avoid overfitting, we used dropout (Srivastava et al., 2014) on the embedding layer and hidden layer, with the dropout probability set to 0.2."}, {"id": 179, "string": "We used the gated recurrent unit  as the recurrent unit of RNNs, which are bi-directional, with one hidden layer."}, {"id": 180, "string": "Based on the tuning result, we set the maximum length of the input sequence to 300, the hidden layer size as 512, the dimension of word embedding as 620, and the batch size for training as 40."}, {"id": 181, "string": "We pruned the packed forest using the algorithm of Huang (2008) , with a threshold of 5."}, {"id": 182, "string": "If the linearization of the pruned forest is still longer than 300, then we linearize the 1-best parsing tree instead of the forest."}, {"id": 183, "string": "During decoding, we used beam search, and fixed the beam size to 12."}, {"id": 184, "string": "For the case of Forest (SoA), with 1 core of Tesla K80 GPU and LDC corpus as the training data, training spent about 10 days, and decoding speed is about 10 sentences per second."}, {"id": 185, "string": "Table 2 : English-Chinese experimental results (character-level BLEU)."}, {"id": 186, "string": "\"FS,\" \"TN,\" and \"FN\" denote forest-based SMT, tree-based NMT, and forest-based NMT systems, respectively."}, {"id": 187, "string": "We performed the paired bootstrap resampling significance test (Koehn, 2004) Table 3 : English-Japanese experimental results (character-level BLEU)."}, {"id": 188, "string": "Experimental results Table 2 and 3 summarize the experimental results."}, {"id": 189, "string": "To avoid the affect of segmentation errors, the performance were evaluated by character-level BLEU (Papineni et al., 2002) ."}, {"id": 190, "string": "We compare our proposed models (i.e., Forest (SoE) and Forest (SoA)) with three types of baseline: a string-to-string model (s2s), forest-based models that do not use score sequences (Forest (No score)), and tree-based models that use the 1-best parsing tree (1-best (No score, SoE, SoA))."}, {"id": 191, "string": "For the 1-best models, we preserve the nodes and hyperedges that are used in the 1-best constituent tree in the packed forest, and remove all other nodes and hyperedges, yielding a pruned forest that contains only the 1-best constituent tree."}, {"id": 192, "string": "For the \"No score\" configurations, we force the input score sequence to be a sequence of 1.0 with the same length as the input symbol sequence, so that neither the embedding layer nor the attention layer are affected by the score sequence."}, {"id": 193, "string": "In addition, we also perform a comparison with some state-of-the-art tree-based systems that are publicly available, including an SMT system  and the NMT systems (Eriguchi et al."}, {"id": 194, "string": "(2016) 2017) )."}, {"id": 195, "string": "For , we use the implementation of cicada 11 ."}, {"id": 196, "string": "For , we reimplemented the \"Mixed RNN Encoder\" model, because of its outstanding performance on the NIST MT corpus."}, {"id": 197, "string": "We can see that for both English-Chinese and English-Japanese, compared with the s2s baseline system, both the 1-best and forest-based configurations yield better results."}, {"id": 198, "string": "This indicates syntactic information contained in the constituent trees or forests is indeed useful for machine translation."}, {"id": 199, "string": "Specifically, we observe the following facts."}, {"id": 200, "string": "First, among the three different frameworks SoE, SoA, and No-score, the SoA framework performs the best, while the No-score framework per-9 https://github.com/tempra28/tree2seq 10 https://github.com/howardchenhd/ Syntax-awared-NMT 11 https://github.com/tarowatanabe/ cicada [Source] In the Czech Republic , which was ravaged by serious floods last summer , the temperatures in its border region adjacent to neighboring Slovakia plunged to minus 18 degrees Celsius ."}, {"id": 201, "string": "forms the worst."}, {"id": 202, "string": "This indicates that the scores of the edges in constituent trees or packed forests, which reflect the confidence of the correctness of the edges, are indeed useful."}, {"id": 203, "string": "In fact, for the 1-best constituent parsing tree, the score of the edge reflects the confidence of the parser."}, {"id": 204, "string": "By using this information, the NMT system succeed to learn a better attention, paying much attention to the confident structure and not paying attention to the unconfident structure, which improved the translation performance."}, {"id": 205, "string": "This fact is ignored by previous studies on tree-based NMT."}, {"id": 206, "string": "Furthermore, it is better to use the scores to modify the values of attention instead of rescaling the word embeddings, because modifying word embeddings carelessly may change the semantic meanings of words."}, {"id": 207, "string": "Second, compared with the cases that only using the 1-best constituent trees, using packed forests yields statistical significantly better results for the SoE and SoA frameworks."}, {"id": 208, "string": "This shows the effectiveness of using more syntactic information."}, {"id": 209, "string": "Compared with one constituent tree, the packed forest, which contains multiple different trees, describes the syntactic structure of the sentence in different aspects, which together increase the accuracy of machine translation."}, {"id": 210, "string": "However, without using the scores, the 1-best constituent tree is preferred."}, {"id": 211, "string": "This is because without using the scores, all trees in the packed forest are treated equally, which makes it easy to import noise into the encoder."}, {"id": 212, "string": "Compared with other types of state-of-the-art systems, our systems using only the 1-best tree (1-best(SoE, SoA)) are better than the other treebased systems."}, {"id": 213, "string": "Moreover, our NMT systems using the packed forests achieve the best performance."}, {"id": 214, "string": "These results also support the usefulness of the scores of the edges and packed forests in NMT."}, {"id": 215, "string": "As for the efficiency, the training time of the SoA system was slightly longer than that of the SoE system, which was about twice of the s2s baseline."}, {"id": 216, "string": "The training time of the tree-based system was about 1.5 times of the baseline."}, {"id": 217, "string": "For the case of Forest (SoA), with 1 core of Tesla P100 GPU and LDC corpus as the training data, training spent about 10 days, and decoding speed was about 10 sentences per second."}, {"id": 218, "string": "The reason for the relatively low efficiency is that the linearized sequences of packed forests were much longer than word sequences, enlarging the scale of the inputs."}, {"id": 219, "string": "Despite this, the training process ended within reasonable time."}, {"id": 220, "string": "Figure 4 illustrates the translation results of an English sentence using several different configurations: the s2s baseline, using only the 1-best tree (SoE), and using the packed forest (SoE)."}, {"id": 221, "string": "This is a sentence from NIST MT 03, and the training corpus is the LDC corpus."}, {"id": 222, "string": "Qualitative analysis For the s2s case, no syntactic information is utilized, and therefore the output of the system is not a grammatical Chinese sentence."}, {"id": 223, "string": "The attributive phrase of \"Czech border region\" is a complete sentence."}, {"id": 224, "string": "However, the attributive is not allowed to be a complete sentence in Chinese."}, {"id": 225, "string": "For the case of using 1-best constituent tree, the output is a grammatical Chinese sentence."}, {"id": 226, "string": "However, the phrase \"adjacent to neighboring Slovakia\" is completely ignored in the translation result."}, {"id": 227, "string": "After analyzing the constituent tree, we found that this phrase was incorrectly parsed as an \"adverb phrase\", so that the NMT system paid little attention to it, because of the low confidence given by the parser."}, {"id": 228, "string": "In contrast, for the case of the packed forest, we can see this phrase was not ignored and was translated correctly."}, {"id": 229, "string": "Actually, besides \"adverb phrase\", this phrase was also correctly parsed as an \"adjective phrase\", and covered by multiple different nodes in the forest, making it difficult for the encoder to ignore the phrase."}, {"id": 230, "string": "We also noticed that our method performed better on learning attention."}, {"id": 231, "string": "For the example in Figure 4 , we observed that for s2s model, the decoder paid attention to the word \"Czech\" twice, which causes the output sentence contains the Chinese translation of Czech twice."}, {"id": 232, "string": "On the other hand, for our forest model, by using the syntax information, the decoder paid attention to the phrase \"In the Czech Republic\" only once, making the decoder generates the correct output."}, {"id": 233, "string": "Related work Incorporating syntactic information into NMT systems is attracting widespread attention nowadays."}, {"id": 234, "string": "Compared with conventional string-to-string NMT systems, tree-based systems demonstrate a better performance with the help of constituent trees or dependency trees."}, {"id": 235, "string": "The first noteworthy study is Eriguchi et al."}, {"id": 236, "string": "(2016) , which used Tree-structured LSTM (Tai et al., 2015) to encode the HPSG syntax tree of the sentence in the source-side in a bottom-up manner."}, {"id": 237, "string": "Then, Chen et al."}, {"id": 238, "string": "(2017) enhanced the encoder with a top-down tree encoder."}, {"id": 239, "string": "As a simple extension of Eriguchi et al."}, {"id": 240, "string": "(2016) , very recently, Zaremoodi and Haffari (2017) proposed a forest-based NMT method by representing the packed forest with a forest-structured neural network."}, {"id": 241, "string": "However, their method was evaluated in small-scale MT settings (each training dataset consists of under 10k parallel sentences)."}, {"id": 242, "string": "In contrast, our proposed method is effective in a largescale MT setting, and we present qualitative analysis regarding the effectiveness of using forests in NMT."}, {"id": 243, "string": "Although these methods obtained good results, the tree-structured network used by the encoder made the training and decoding relatively slow, therefore restricts the scope of application."}, {"id": 244, "string": "Other attempts at encoding syntactic trees have also been proposed."}, {"id": 245, "string": "Eriguchi et al."}, {"id": 246, "string": "(2017) combined the Recurrent Neural Network Grammar (Dyer et al., 2016) with NMT systems, while  linearized the constituent tree and encoded it using RNNs."}, {"id": 247, "string": "The training of these methods is fast, because of the linear structures of RNNs."}, {"id": 248, "string": "However, all these syntax-based NMT systems used only the 1-best parsing tree, making the systems sensitive to parsing errors."}, {"id": 249, "string": "Instead of using trees to represent syntactic information, some studies use other data structures to represent the latent syntax of the input sentence."}, {"id": 250, "string": "For example, Hashimoto and Tsuruoka (2017) proposed translating using a latent graph."}, {"id": 251, "string": "However, such systems do not enjoy the benefit of handcrafted syntactic knowledge, because they do not use a parser trained from a large treebank with human annotations."}, {"id": 252, "string": "Compared with these related studies, our framework utilizes a linearized packed forest, meaning the encoder can encode exponentially many trees in an efficient manner."}, {"id": 253, "string": "The experimental results demonstrated these advantages."}, {"id": 254, "string": "Conclusion and future work We proposed a new NMT framework, which encodes a packed forest for the source sentence using linear-structured neural networks, such as RNN."}, {"id": 255, "string": "Compared with conventional string-tostring NMT systems and tree-to-string NMT systems, our framework can utilize exponentially many linearized parsing trees during encoding, without significantly decreasing the efficiency."}, {"id": 256, "string": "This represents the first attempt at using a forest under the string-to-string NMT framework."}, {"id": 257, "string": "The experimental results demonstrate the effectiveness of our framework."}, {"id": 258, "string": "As future work, we plan to design some more elaborate structures to incorporate the score layer in the encoder."}, {"id": 259, "string": "Further improvement in the translation performance is expected to be achieved for the forest-based NMT system."}, {"id": 260, "string": "We will also apply the proposed linearization method to other tasks."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Preliminaries", "n": "2", "start": 16, "end": 16}, {"section": "Sequence-to-sequence model", "n": "2.1", "start": 17, "end": 51}, {"section": "Linear-structured tree-based NMT systems", "n": "2.2", "start": 52, "end": 59}, {"section": "Packed forest", "n": "2.3", "start": 60, "end": 71}, {"section": "Forest-based NMT", "n": "3", "start": 72, "end": 72}, {"section": "Forest linearization", "n": "3.1", "start": 73, "end": 111}, {"section": "Encoding the linearized forest", "n": "3.2", "start": 112, "end": 169}, {"section": "Setup", "n": "4.1", "start": 170, "end": 187}, {"section": "Experimental results", "n": "4.2", "start": 188, "end": 221}, {"section": "Qualitative analysis", "n": "4.3", "start": 222, "end": 232}, {"section": "Related work", "n": "5", "start": 233, "end": 253}, {"section": "Conclusion and future work", "n": "6", "start": 254, "end": 260}], "figures": [{"filename": "../figure/image/961-Table1-1.png", "caption": "Table 1: Statistics of the corpora.", "page": 5, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 61.44, "y2": 168.0}}, {"filename": "../figure/image/961-Table2-1.png", "caption": "Table 2: English-Chinese experimental results (character-level BLEU). “FS,” “TN,” and “FN” denote forest-based SMT, tree-based NMT, and forest-based NMT systems, respectively. We performed the paired bootstrap resampling significance test (Koehn, 2004) over the NIST MT 03 to 05 corpus, with respect to the s2s baseline, and list the p values in the table.", "page": 6, "bbox": {"x1": 118.56, "x2": 478.08, "y1": 61.44, "y2": 197.28}}, {"filename": "../figure/image/961-Table3-1.png", "caption": "Table 3: English-Japanese experimental results (character-level BLEU).", "page": 6, "bbox": {"x1": 197.76, "x2": 400.32, "y1": 276.48, "y2": 412.32}}, {"filename": "../figure/image/961-Figure1-1.png", "caption": "Figure 1: An example of (a) a packed forest. The numbers in the brackets located at the upper-left corner of each node in the packed forest show one correct topological ordering of the nodes. The packed forest is a compact representation of two trees: (b) the correct constituent tree, and (c) an incorrect constituent tree. Note that the terminal nodes (i.e., words in the sentence) in the packed forest are shown only for illustration, and they do not belong to the packed forest.", "page": 2, "bbox": {"x1": 99.36, "x2": 526.56, "y1": 67.2, "y2": 305.28}}, {"filename": "../figure/image/961-Figure4-1.png", "caption": "Figure 4: Chinese translation results of an English sentence.", "page": 7, "bbox": {"x1": 73.44, "x2": 524.16, "y1": 64.8, "y2": 128.64}}, {"filename": "../figure/image/961-Figure2-1.png", "caption": "Figure 2: Linearization result of the packed forest in Figure 1a", "page": 3, "bbox": {"x1": 312.96, "x2": 537.12, "y1": 63.36, "y2": 121.44}}, {"filename": "../figure/image/961-Figure3-1.png", "caption": "Figure 3: The framework of the forest-based NMT system.", "page": 4, "bbox": {"x1": 72.0, "x2": 521.76, "y1": 63.839999999999996, "y2": 241.44}}]}