{"title": "How do you pronounce your name? Improving G2P with transliterations", "abstract": "Grapheme-to-phoneme conversion (G2P) of names is an important and challenging problem. The correct pronunciation of a name is often reflected in its transliterations, which are expressed within a different phonological inventory. We investigate the problem of using transliterations to correct errors produced by state-of-the-art G2P systems. We present a novel re-ranking approach that incorporates a variety of score and n-gram features, in order to leverage transliterations from multiple languages. Our experiments demonstrate significant accuracy improvements when re-ranking is applied to n-best lists generated by three different G2P programs.", "text": [{"id": 0, "string": "Introduction Grapheme-to-phoneme conversion (G2P), in which the aim is to convert the orthography of a word to its pronunciation (phonetic transcription), plays an important role in speech synthesis and understanding."}, {"id": 1, "string": "Names, which comprise over 75% of unseen words (Black et al., 1998) , present a particular challenge to G2P systems because of their high pronunciation variability."}, {"id": 2, "string": "Guessing the correct pronunciation of a name is often difficult, especially if they are of foreign origin; this is attested by the ad hoc transcriptions which sometimes accompany new names introduced in news articles, especially for international stories with many foreign names."}, {"id": 3, "string": "Transliterations provide a way of disambiguating the pronunciation of names."}, {"id": 4, "string": "They are more abundant than phonetic transcriptions, for example when news items of international or global significance are reported in multiple languages."}, {"id": 5, "string": "In addition, writing scripts such as Arabic, Korean, or Hindi are more consistent and easier to identify than various phonetic transcription schemes."}, {"id": 6, "string": "The process of transliteration, also called phonetic translation (Li et al., 2009b) , involves \"sounding out\" a name and then finding the closest possible representation of the sounds in another writing script."}, {"id": 7, "string": "Thus, the correct pronunciation of a name is partially encoded in the form of the transliteration."}, {"id": 8, "string": "For example, given the ambiguous letter-to-phoneme mapping of the English letter g, the initial phoneme of the name Gershwin may be predicted by a G2P system to be either /g/ (as in Gertrude) or /Ã/ (as in Gerald)."}, {"id": 9, "string": "The transliterations of the name in other scripts provide support for the former (correct) alternative."}, {"id": 10, "string": "Although it seems evident that transliterations should be helpful in determining the correct pronunciation of a name, designing a system that takes advantage of this insight is not trivial."}, {"id": 11, "string": "The main source of the difficulty stems from the differences between the phonologies of distinct languages."}, {"id": 12, "string": "The mappings between phonemic inventories are often complex and context-dependent."}, {"id": 13, "string": "For example, because Hindi has no /w/ sound, the transliteration of Gershwin instead uses a symbol that represents the phoneme /V/, similar to the /v/ phoneme in English."}, {"id": 14, "string": "In addition, converting transliterations into phonemes is often non-trivial; although few orthographies are as inconsistent as that of English, this is effectively the G2P task for the particular language in question."}, {"id": 15, "string": "In this paper, we demonstrate that leveraging transliterations can, in fact, improve the graphemeto-phoneme conversion of names."}, {"id": 16, "string": "We propose a novel system based on discriminative re-ranking that is capable of incorporating multiple transliterations."}, {"id": 17, "string": "We show that simplistic approaches to the problem fail to achieve the same goal, and that transliterations from multiple languages are more helpful than from a single language."}, {"id": 18, "string": "Our approach can be combined with any G2P system that produces n-best lists instead of single outputs."}, {"id": 19, "string": "The experiments that we perform demonstrate significant error reduction for three very different G2P base systems."}, {"id": 20, "string": "2 Improving G2P with transliterations 2.1 Problem definition In both G2P and machine transliteration, we are interested in learning a function that, given an input sequence x, produces an output sequence y."}, {"id": 21, "string": "In the G2P task, x is composed of graphemes and y is composed of phonemes; in transliteration, both sequences consist of graphemes but they represent different writing scripts."}, {"id": 22, "string": "Unlike in machine translation, the monotonicity constraint is enforced; i.e., we assume that x and y can be aligned without the alignment links crossing each other ."}, {"id": 23, "string": "We assume that we have available a base G2P system that produces an n-best list of outputs with a corresponding list of confidence scores."}, {"id": 24, "string": "The goal is to improve the base system's performance by applying existing transliterations of the input x to re-rank the system's n-best output list."}, {"id": 25, "string": "Similarity-based methods A simple and intuitive approach to improving G2P with transliterations is to select from the n-best list the output sequence that is most similar to the corresponding transliteration."}, {"id": 26, "string": "For example, the Hindi transliteration in Figure 1 is arguably closest in perceptual terms to the phonetic transcription of the second output in the n-best list, as compared to the other outputs."}, {"id": 27, "string": "One obvious problem with this method is that it ignores the relative ordering of the n-best lists and their corresponding scores produced by the base system."}, {"id": 28, "string": "A better approach is to combine the similarity score with the output score from the base system, allowing it to contribute an estimate of confidence in its output."}, {"id": 29, "string": "For this purpose, we apply a linear combination of the two scores, where a single parameter λ, ranging between zero and one, determines the relative weight of the scores."}, {"id": 30, "string": "The exact value of λ can be optimized on a training set."}, {"id": 31, "string": "This approach is similar to the method used by Finch and Sumita (2010) to combine the scores of two different machine transliteration systems."}, {"id": 32, "string": "Measuring similarity The approaches presented in the previous section crucially depend on a method for computing the similarity between various symbol sequences that represent the same word."}, {"id": 33, "string": "If we have a method of converting transliterations to phonetic representations, the similarity between two sequences of phonemes can be computed with a simple method such as normalized edit distance or the longest common subsequence ratio, which take into account the number and position of identical phonemes."}, {"id": 34, "string": "Alternatively, we could apply a more complex approach, such as ALINE (Kondrak, 2000) , which computes the distance between pairs of phonemes."}, {"id": 35, "string": "However, the implementation of a conversion program would require ample training data or language-specific expertise."}, {"id": 36, "string": "A more general approach is to skip the transcription step and compute the similarity between phonemes and graphemes directly."}, {"id": 37, "string": "For example, the edit distance function can be learned from a training set of transliterations and their phonetic transcriptions (Ristad and Yianilos, 1998) ."}, {"id": 38, "string": "In this paper, we apply M2M-ALIGNER (Jiampojamarn et al., 2007) , an unsupervised aligner, which is a many-to-many generalization of the learned edit distance algorithm."}, {"id": 39, "string": "M2M-ALIGNER was originally designed to align graphemes and phonemes, but can be applied to discover the alignment between any sets of symbols (given training data)."}, {"id": 40, "string": "The logarithm of the probability assigned to the optimal alignment can then be interpreted as a similarity measure between the two sequences."}, {"id": 41, "string": "Discriminative re-ranking The methods described in Section 2.2, which are based on the similarity between outputs and transliterations, are difficult to generalize when multiple transliterations of a single name are available."}, {"id": 42, "string": "A linear combination is still possible but in this case optimizing the parameters would no longer be straightforward."}, {"id": 43, "string": "Also, we are interested in utilizing other features besides sequence similarity."}, {"id": 44, "string": "The SVM re-ranking paradigm offers a solution  to the problem."}, {"id": 45, "string": "Our re-ranking system is informed by a large number of features, which are based on scores and n-grams."}, {"id": 46, "string": "The scores are of three types: 1."}, {"id": 47, "string": "The scores produced by the base system for each output in the n-best list."}, {"id": 48, "string": "2."}, {"id": 49, "string": "The similarity scores between the outputs and each available transliteration."}, {"id": 50, "string": "3."}, {"id": 51, "string": "The differences between scores in the n-best lists for both (1) and (2) ."}, {"id": 52, "string": "Our set of binary n-gram features includes those used for DIRECTL+ ."}, {"id": 53, "string": "They can be divided into four types: 1."}, {"id": 54, "string": "The context features combine output symbols (phonemes) with n-grams of varying sizes in a window of size c centred around a corresponding position on the input side."}, {"id": 55, "string": "2."}, {"id": 56, "string": "The transition features are bigrams on the output (phoneme) side."}, {"id": 57, "string": "The linear chain features combine the context features with the bigram transition features."}, {"id": 58, "string": "4."}, {"id": 59, "string": "The joint n-gram features are n-grams containing both input and output symbols."}, {"id": 60, "string": "We apply the features in a new way: instead of being applied strictly to a given input-output set, we expand their use across many languages and use all of them simultaneously."}, {"id": 61, "string": "We apply the n-gram features across all transliteration-transcription pairs in addition to the usual input-output pairs corresponding to the n-best lists."}, {"id": 62, "string": "Figure 1 illustrates the set of pairs used for feature generation."}, {"id": 63, "string": "In this paper, we augment the n-gram features by a set of reverse features."}, {"id": 64, "string": "Unlike a traditional G2P generator, our re-ranker has access to the outputs produced by the base system."}, {"id": 65, "string": "By swapping the input and the output side, we can add reverse context and linear-chain features."}, {"id": 66, "string": "Since the n-gram features are also applied to transliteration-transcription pairs, the reverse features enable us to include features which bind a variety of n-grams in the transliteration string with a single corresponding phoneme."}, {"id": 67, "string": "The construction of n-gram features presupposes a fixed alignment between the input and output sequences."}, {"id": 68, "string": "If the base G2P system does not provide input-output alignments, we use M2M-ALIGNER for this purpose."}, {"id": 69, "string": "The transliteration-transcription pairs are also aligned by M2M-ALIGNER, which at the same time produces the corresponding similarity scores."}, {"id": 70, "string": "(We set a lower limit of -100 on the M2M-ALIGNER scores.)"}, {"id": 71, "string": "If M2M-ALIGNER is unable to produce an alignment, we indicate this with a binary feature that is included with the n-gram features."}, {"id": 72, "string": "Experiments We perform several experiments to evaluate our transliteration-informed approaches."}, {"id": 73, "string": "We test simple similarity-based approaches on single-transliteration data, and evaluate our SVM re-ranking approach against this as well."}, {"id": 74, "string": "We then test our approach using all available transliterations."}, {"id": 75, "string": "Relevant code and scripts required to reproduce our experimental results are available online 1 ."}, {"id": 76, "string": "Data & setup For pronunciation data, we extracted all names from the Combilex corpus (Richmond et al., 2009) ."}, {"id": 77, "string": "We discarded all diacritics, duplicates and multi-word names, which yielded 10,084 unique names."}, {"id": 78, "string": "Both the similarity and SVM methods require transliterations for identifying the best candidates in the nbest lists."}, {"id": 79, "string": "They are therefore trained and evaluated on the subset of the G2P corpus for which transliterations available."}, {"id": 80, "string": "Naturally, allowing transliterations from all languages results in a larger corpus than the one obtained by the intersection with transliterations from a single language."}, {"id": 81, "string": "For our experiments, we split the data into 10% for testing, 10% for development, and 80% for training."}, {"id": 82, "string": "The development set was used for initial tests and experiments, and then for our final results the training and development sets were combined into one set for final system training."}, {"id": 83, "string": "For SVM reranking, during both development and testing we split the training set into 10 folds; this is necessary when training the re-ranker as it must have system output scores that are representative of the scores on unseen data."}, {"id": 84, "string": "We ensured that there was never any overlap between the training and testing data for all trained systems."}, {"id": 85, "string": "Our transliteration data come from the shared tasks on transliteration at the 2009 and 2010 Named Entities Workshops (Li et al., 2009a; ."}, {"id": 86, "string": "We use all of the 2010 English-source data plus the English-to-Russian data from 2009, which makes nine languages in total."}, {"id": 87, "string": "In cases where the data provide alternative transliterations for a given input, we keep only one; our preliminary experiments indicated that including alternative transliterations did not improve performance."}, {"id": 88, "string": "It should be noted that these transliteration corpora are noisy: Jiampojamarn et al."}, {"id": 89, "string": "(2009) English-to-Hindi transliteration performance with a simple cleaning of the data."}, {"id": 90, "string": "Our tests involving transliterations from multiple languages are performed on the set of names for which we have both the pronunciation and transliteration data."}, {"id": 91, "string": "There are 7,423 names in the G2P corpus for which at least one transliteration is available."}, {"id": 92, "string": "Table 1 lists the total size of the transliteration corpora as well as the amount of overlap with the G2P data."}, {"id": 93, "string": "Note that the base G2P systems are trained using all 10,084 names in the corpus as opposed to only the 7,423 names for which there are transliterations available."}, {"id": 94, "string": "This ensures that the G2P systems have more training data to provide the best possible base performance."}, {"id": 95, "string": "For our single-language experiments, we normalize the various scores when tuning the linear combination parameter λ so that we can compare values across different experimental conditions."}, {"id": 96, "string": "For SVM re-ranking, we directly implement the method of Joachims (2002) to convert the re-ranking problem into a classification problem, and then use the very fast LIBLINEAR (Fan et al., 2008) to build the SVM models."}, {"id": 97, "string": "Optimal hyperparameter values were determined during development."}, {"id": 98, "string": "We evaluate using word accuracy, the percentage of words for which the pronunciations are correctly predicted."}, {"id": 99, "string": "This measure marks pronunciations that are even slightly different from the correct one as incorrect, so even a small change in pronunciation that might be acceptable or even unnoticeable to humans would count against the system's performance."}, {"id": 100, "string": "Base systems It is important to test multiple base systems in order to ensure that any gain in performance applies to the task in general and not just to a particular system."}, {"id": 101, "string": "We use three G2P systems in our tests: 1."}, {"id": 102, "string": "FESTIVAL (FEST), a popular speech synthesis package, which implements G2P conversion with CARTs (decision trees) (Black et al., 1998) ."}, {"id": 103, "string": "2."}, {"id": 104, "string": "SEQUITUR (SEQ), a generative system based on the joint n-gram approach (Bisani and Ney, 2008) ."}, {"id": 105, "string": "3."}, {"id": 106, "string": "DIRECTL+ (DTL), the discriminative system on which our n-gram features are based ."}, {"id": 107, "string": "All systems are capable of providing n-best output lists along with scores for each output, although for FESTIVAL they had to be constructed from the list of output probabilities for each input character."}, {"id": 108, "string": "We run DIRECTL+ with all of the features described in ) (i.e., context features, transition features, linear chain features, and joint n-gram features)."}, {"id": 109, "string": "System parameters, such as maximum number of iterations, were determined during development."}, {"id": 110, "string": "For SEQUITUR, we keep default options except for the enabling of the 10 best outputs and we convert the probabilities assigned to the outputs to log-probabilities."}, {"id": 111, "string": "We set SEQUITUR's joint n-gram order to 6 (this was also determined during development)."}, {"id": 112, "string": "Note that the three base systems differ slightly in terms of the alignment information that they provide in their outputs."}, {"id": 113, "string": "FESTIVAL operates letter-byletter, so we use the single-letter inputs with the phoneme outputs as the aligned units."}, {"id": 114, "string": "DIRECTL+ specifies many-to-many alignments in its output."}, {"id": 115, "string": "For SEQUITUR, however, since it provides no information regarding the output structure, we use M2M-ALIGNER to induce alignments for n-gram feature generation."}, {"id": 116, "string": "Transliterations from a single language The goal of the first experiment is to compare several similarity-based methods, and to determine how they compare to our re-ranking approach."}, {"id": 117, "string": "In order to find the similarity between phonetic transcriptions, we use the two different methods described in Section 2.2: ALINE and M2M-ALIGNER."}, {"id": 118, "string": "We further test the use of a linear combination of the similarity scores with the base system's score so that its confidence information can be taken into account; the linear combination weight is determined from the training set."}, {"id": 119, "string": "These methods are referred to as ALINE+BASE and M2M+BASE."}, {"id": 120, "string": "For these experiments, our training and testing sets are obtained by intersecting our G2P training and testing sets respectively with the Hindi transliteration corpus, yielding 1,950 names for training and 229 names for testing."}, {"id": 121, "string": "Since the similarity-based methods are designed to incorporate homogeneous same-script transliterations, we can only run this experiment on one language at a time."}, {"id": 122, "string": "Furthermore, ALINE operates on phoneme sequences, so we first need to convert the transliterations to phonemes."}, {"id": 123, "string": "An alternative would be to train a proper G2P system, but this would require a large set of word-pronunciation pairs."}, {"id": 124, "string": "For this experiment, we choose Hindi, for which we constructed a rule-based G2P converter."}, {"id": 125, "string": "Aside from simple one-to-one mapping (romanization) rules, the converter has about ten rules to adjust for context."}, {"id": 126, "string": "For these experiments, we apply our SVM reranking method in two ways: 1."}, {"id": 127, "string": "Using only Hindi transliterations (referred to as SVM-HINDI)."}, {"id": 128, "string": "2."}, {"id": 129, "string": "Using all available languages (referred to as SVM-ALL)."}, {"id": 130, "string": "In both cases, the test set is restricted to the same 229 names, in order to provide a valid comparison."}, {"id": 131, "string": "Table 2 presents the results."}, {"id": 132, "string": "Regardless of the choice of the similarity function, the simplest approaches fail in a spectacular manner, significantly reducing the accuracy with respect to the base system."}, {"id": 133, "string": "The linear combination methods give mixed results, improving the accuracy for FESTIVAL but not for SEQUITUR or DIRECTL+ (although the differences are not statistically significant)."}, {"id": 134, "string": "However, they perform much better than the methods based on similarity scores alone as they are able to take advantage of the base system's output scores."}, {"id": 135, "string": "If we look at the values of λ that provide the best performance  on the training set, we find that they are higher for the stronger base systems, indicating more reliance on the base system output scores."}, {"id": 136, "string": "For example, for ALINE+BASE the FESTIVAL-based system has λ = 0.58 whereas the DIRECTL+-based system has λ = 0.81."}, {"id": 137, "string": "Counter-intuitively, the ALINE+BASE and M2M+BASE methods are unable to improve upon SEQUITUR or DIRECTL+."}, {"id": 138, "string": "We would expect to achieve at least the base system's performance, but disparities between the training and testing sets prevent this."}, {"id": 139, "string": "The two SVM-based methods achieve much better results."}, {"id": 140, "string": "SVM-ALL produces impressive accuracy gains for all three base systems, while SVM-HINDI yields smaller (but still statistically significant) improvements for FESTIVAL and SEQUITUR."}, {"id": 141, "string": "These results suggest that our re-ranking method provides a bigger boost to systems built with different design principles than to DIRECTL+ which utilizes a similar set of features."}, {"id": 142, "string": "On the other hand, the results also show that the information obtained by consulting a single transliteration may be insufficient to improve an already high-performing G2P converter."}, {"id": 143, "string": "Transliterations from multiple languages Our second experiment expands upon the first; we use all available transliterations instead of being restricted to one language."}, {"id": 144, "string": "This rules out the simple similarity-based approaches, but allows us to test our re-ranking approach in a way that fully utilizes the available data."}, {"id": 145, "string": "We test three variants of our transliteration-informed SVM re-ranking approach, Table 3 : Word accuracy of the base system versus the reranking variants with transliterations from multiple languages."}, {"id": 146, "string": "which differ with respect to the set of included features: 1."}, {"id": 147, "string": "SVM-SCORE includes only the three types of score features described in Section 2.4."}, {"id": 148, "string": "2."}, {"id": 149, "string": "SVM-N-GRAM uses only the n-gram features."}, {"id": 150, "string": "3."}, {"id": 151, "string": "SVM-ALL is the full system that combines the score and n-gram features."}, {"id": 152, "string": "The objective is to determine the degree to which each of the feature classes contributes to the overall results."}, {"id": 153, "string": "Because we are using all available transliterations, we achieve much greater coverage over our G2P data than in the previous experiment; in this case, our training set consists of 6,660 names while the test set has 763 names."}, {"id": 154, "string": "Table 3 presents the results."}, {"id": 155, "string": "Note that the baseline accuracies are somewhat lower than in Table 2 because of the different test set."}, {"id": 156, "string": "We find that, when using all features, the SVM re-ranker can provide a very impressive error reduction over FESTIVAL (26.7%) and SEQUITUR (20.7%) and a smaller but still significant (p < 0.01 with the McNemar test) error reduction over DIRECTL+ (12.1%)."}, {"id": 157, "string": "When we consider our results using only the score and n-gram features, we can see that, interestingly, the n-gram features are most important."}, {"id": 158, "string": "We draw a further conclusion from our results: consider the large disparity in improvements over the base systems."}, {"id": 159, "string": "This indicates that FESTIVAL and SEQUITUR are benefiting from the DIRECTL+-style features used in the re-ranking."}, {"id": 160, "string": "Without the n-gram features, however, there is still a significant improvement over FESTIVAL, demonstrating that the scores do provide useful information."}, {"id": 161, "string": "In this case there is no way for DIRECTL+-style information to make its way into the re-ranking; the process is based purely on the transliterations and their similarities with the transcriptions in the output lists, indicating that the system is capable of extracting useful information directly from transliterations."}, {"id": 162, "string": "In the case of DIRECTL+, the transliterations help through the n-gram features rather than the score features; this is probably because the crucial feature that signals the inability of M2M-ALIGNER to align a given transliteration-transcription pair belongs to the set of the n-gram features."}, {"id": 163, "string": "Both the n-gram features and score features are dependent on the alignments, but they differ in that the n-gram features allow weights to be learned for local n-gram pairs whereas the score features are based on global information, providing only a single feature for a given transliteration-transcription pair."}, {"id": 164, "string": "The two therefore overlap to some degree, although the score features still provide useful information via probabilities learned during the alignment training process."}, {"id": 165, "string": "A closer look at the results provides additional insight into the operation of our re-ranking system."}, {"id": 166, "string": "For example, consider the name Bacchus, which DI-RECTL+ incorrectly converts into /baekÙ@s/."}, {"id": 167, "string": "The most likely reason why our re-ranker selects instead the correct pronunciation /baek@s/ is that M2M-ALIGNER fails to align three of the five available transliterations with /baekÙ@s/."}, {"id": 168, "string": "Such alignment failures are caused by a lack of evidence for the mapping of the grapheme representing the sound /k/ in the transliteration training data with the phoneme /Ù/."}, {"id": 169, "string": "In addition, the lack of alignments prevents any n-gram features from being enabled."}, {"id": 170, "string": "Considering the difficulty of the task, the top accuracy of almost 75% is quite impressive."}, {"id": 171, "string": "In fact, many instances of human transliterations in our corpora are clearly incorrect."}, {"id": 172, "string": "For example, the Hindi transliteration of Bacchus contains the /Ù/ consonant instead of the correct /k/."}, {"id": 173, "string": "Moreover, our strict evaluation based on word accuracy counts all system outputs that fail to exactly match the dictionary data as errors."}, {"id": 174, "string": "The differences are often very minor and may reflect an alternative pronunciation."}, {"id": 175, "string": "The phoneme accuracy 2 of our best result is 93.1%, 2 The phoneme accuracy is calculated from the minimum edit distance between the predicted and correct pronunciations."}, {"id": 176, "string": "which provides some idea of how similar the predicted pronunciation is to the correct one."}, {"id": 177, "string": "Effect of multiple transliterations One motivating factor for the use of SVM re-ranking was the ability to incorporate multiple transliteration languages."}, {"id": 178, "string": "But how important is it to use more than one language?"}, {"id": 179, "string": "To examine this question, we look particularly at the sets of names having at most k transliterations available."}, {"id": 180, "string": "Table 4 shows the results with DIRECTL+ as the base system."}, {"id": 181, "string": "Note that the number of names with more than five transliterations was small."}, {"id": 182, "string": "Importantly, we see that the increase in performance when only one transliteration is available is so small as to be insignificant."}, {"id": 183, "string": "From this, we can conclude that obtaining improvement on the basis of a single transliteration is difficult in general."}, {"id": 184, "string": "This corroborates the results of the experiment described in Section 3.3, where we used only Hindi transliterations."}, {"id": 185, "string": "Previous work There are three lines of research that are relevant to our work: (1) G2P in general; (2) G2P on names; and (3) combining diverse data sources and/or systems."}, {"id": 186, "string": "The two leading approaches to G2P are represented by SEQUITUR (Bisani and Ney, 2008) and DIRECTL+ ."}, {"id": 187, "string": "Recent comparisons suggests that the former obtains somewhat higher accuracy, especially when it includes joint n-gram features ."}, {"id": 188, "string": "Systems based on decision trees are far behind."}, {"id": 189, "string": "Our results confirm this ranking."}, {"id": 190, "string": "Names can present a particular challenge to G2P systems."}, {"id": 191, "string": "Kienappel and Kneser (2001) reported a higher error rate for German names than for general words, while on the other hand Black et al."}, {"id": 192, "string": "(1998) report similar accuracy on names as for other types of English words."}, {"id": 193, "string": "Yang et al."}, {"id": 194, "string": "(2006) and van den Heuvel et al."}, {"id": 195, "string": "(2007) post-process the output of a general G2P system with name-specific phonemeto-phoneme (P2P) systems."}, {"id": 196, "string": "They find significant improvement using this method on data sets consisting of Dutch first names, family names, and geographical names."}, {"id": 197, "string": "However, it is unclear whether such an approach would be able to improve the performance of the current state-of-the-art G2P systems."}, {"id": 198, "string": "In addition, the P2P approach works only on single outputs, whereas our re-ranking approach is designed to handle n-best output lists."}, {"id": 199, "string": "Although our approach is (to the best of our knowledge) the first to use different tasks (G2P and transliteration) to inform each other, this is conceptually similar to model and system combination approaches."}, {"id": 200, "string": "In statistical machine translation (SMT), methods that incorporate translations from other languages (Cohn and Lapata, 2007) have proven effective in low-resource situations: when phrase translations are unavailable for a certain language, one can look at other languages where the translation is available and then translate from that language."}, {"id": 201, "string": "A similar pivoting approach has also been applied to machine transliteration ."}, {"id": 202, "string": "Notably, the focus of these works have been on cases in which there are less data available; they also modify the generation process directly, rather than operating on existing outputs as we do."}, {"id": 203, "string": "Ultimately, a combination of the two approaches is likely to give the best results."}, {"id": 204, "string": "Finch and Sumita (2010) combine two very different approaches to transliteration using simple linear interpolation: they use SEQUITUR's n-best outputs and re-rank them using a linear combination of the original SEQUITUR score and the score for that output of a phrased-based SMT system."}, {"id": 205, "string": "The linear weights are hand-tuned."}, {"id": 206, "string": "We similarly use linear combinations, but with many more scores and other features, necessitating the use of SVMs to determine the weights."}, {"id": 207, "string": "Importantly, we combine different data types where they combine different systems."}, {"id": 208, "string": "Conclusions & future work In this paper, we explored the application of transliterations to G2P."}, {"id": 209, "string": "We demonstrated that transliterations have the potential for helping choose between n-best output lists provided by standard G2P systems."}, {"id": 210, "string": "Simple approaches based solely on similarity do not work when tested using a single transliteration language (Hindi), necessitating the use of smarter methods that can incorporate multiple transliteration languages."}, {"id": 211, "string": "We apply SVM reranking to this task, enabling us to use a variety of features based not only on similarity scores but on n-grams as well."}, {"id": 212, "string": "Our method shows impressive error reductions over the popular FESTIVAL system and the generative joint n-gram SEQUITUR system."}, {"id": 213, "string": "We also find significant error reduction using the state-of-the-art DIRECTL+ system."}, {"id": 214, "string": "Our analysis demonstrated that it is essential to provide the re-ranking system with transliterations from multiple languages in order to mitigate the differences between phonological inventories and smooth out noise in the transliterations."}, {"id": 215, "string": "In the future, we plan to generalize our approach so that it can be applied to the task of generating transliterations, and to combine data from distinct G2P dictionaries."}, {"id": 216, "string": "The latter task is related to the notion of domain adaptation."}, {"id": 217, "string": "We would also like to apply our approach to web data; we have shown that it is possible to use noisy transliteration data, so it may be possible to leverage the noisy ad hoc pronunciation data as well."}, {"id": 218, "string": "Finally, we plan to investigate earlier integration of such external information into the G2P process for single systems; while we noted that re-ranking provides a general approach applicable to any system that can generate n-best lists, there is a limit as to what re-ranking can do, as it relies on the correct output existing in the n-best list."}, {"id": 219, "string": "Modifying existing systems would provide greater potential for improving results even though the changes would be necessarily system-specific."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 24}, {"section": "Similarity-based methods", "n": "2.2", "start": 25, "end": 31}, {"section": "Measuring similarity", "n": "2.3", "start": 32, "end": 40}, {"section": "Discriminative re-ranking", "n": "2.4", "start": 41, "end": 57}, {"section": "The linear chain features combine the context features with the bigram transition features.", "n": "3.", "start": 58, "end": 71}, {"section": "Experiments", "n": "3", "start": 72, "end": 75}, {"section": "Data & setup", "n": "3.1", "start": 76, "end": 99}, {"section": "Base systems", "n": "3.2", "start": 100, "end": 115}, {"section": "Transliterations from a single language", "n": "3.3", "start": 116, "end": 142}, {"section": "Transliterations from multiple languages", "n": "3.4", "start": 143, "end": 176}, {"section": "Effect of multiple transliterations", "n": "3.5", "start": 177, "end": 184}, {"section": "Previous work", "n": "4", "start": 185, "end": 207}, {"section": "Conclusions & future work", "n": "5", "start": 208, "end": 219}], "figures": [{"filename": "../figure/image/976-Figure1-1.png", "caption": "Figure 1: An example name showing the data used for feature construction. Each arrow links a pair used to generate features, including n-gram and score features. The score features use similarity scores for transliteration-transcription pairs and system output scores for input-output pairs. One feature vector is constructed for each system output.", "page": 2, "bbox": {"x1": 83.03999999999999, "x2": 519.84, "y1": 144.96, "y2": 224.16}}, {"filename": "../figure/image/976-Table2-1.png", "caption": "Table 2: Word accuracy (in percentages) of various methods when only Hindi transliterations are used.", "page": 5, "bbox": {"x1": 96.0, "x2": 272.15999999999997, "y1": 60.96, "y2": 199.2}}, {"filename": "../figure/image/976-Table3-1.png", "caption": "Table 3: Word accuracy of the base system versus the reranking variants with transliterations from multiple languages.", "page": 5, "bbox": {"x1": 331.68, "x2": 513.12, "y1": 60.96, "y2": 159.35999999999999}}, {"filename": "../figure/image/976-Table1-1.png", "caption": "Table 1: The number of unique single-word entries in the transliteration corpora for each language and the amount of common data (overlap) with the pronunciation data.", "page": 3, "bbox": {"x1": 339.84, "x2": 505.44, "y1": 62.879999999999995, "y2": 197.76}}, {"filename": "../figure/image/976-Table4-1.png", "caption": "Table 4: Absolute improvement in word accuracy (%) over the base system (DIRECTL+) of the SVM re-ranker for various numbers of available transliterations.", "page": 6, "bbox": {"x1": 344.64, "x2": 500.15999999999997, "y1": 62.879999999999995, "y2": 196.79999999999998}}]}