{"title": "Overview of the CL-SciSumm 2016 Shared Task", "abstract": "The CL-SciSumm 2016 Shared Task is the first medium-scale shared task on scientific document summarization in the computational linguistics (CL) domain. The task built off of the experience and training data set created in its namesake pilot task, which was conducted in 2014 by the same organizing committee. The track included three tasks involving: (1A) identifying relationships between citing documents and the referred document, (1B) classifying the discourse facets, and (2) generating the abstractive summary. The dataset comprised 30 annotated sets of citing and reference papers from the open access research papers in the CL domain. This overview paper describes the participation and the official results of the second CL-SciSumm Shared Task, organized as a part of the Joint Workshop onBibliometric-enhanced Information Retrieval and Natural Language Processing for Digital Libraries (BIRNDL 2016), held in New Jersey,USA in June, 2016. The annotated dataset used for this shared task and the scripts used for evaluation can be accessed and used by the community at: https://github.com/WING-NUS/scisumm-corpus.", "text": [{"id": 0, "string": "Introduction The CL-SciSumm task provides resources to encourage research in a promising direction of scientific paper summarization, which considers the set of citation sentences (i.e., \"citances\") that reference a specific paper as a (community created) summary of a topic or paper [21] ."}, {"id": 1, "string": "Citances for a reference paper are considered a synopses of its key points and also its key contributions and importance within an academic community [19] ."}, {"id": 2, "string": "The advantage of using citances is that they are embedded with meta-commentary and offer a contextual, interpretative layer to the cited text."}, {"id": 3, "string": "The drawback, however, is that though a collection of citances offers a view of the cited paper, it does not consider the context of the target user [9] [24] , verify the claim of the citation or provide context from the reference paper, in terms the type of information cited or where it is in the referenced paper [8] ."}, {"id": 4, "string": "CL-SciSumm explores summarization of scientific research, for the computational linguistics research domain."}, {"id": 5, "string": "It encourages the incorporation of new kinds of information in automatic scientific paper summarization, such as the facets of research information being summarized the research paper."}, {"id": 6, "string": "Our previous task suggested that scholars in CL typically cite methods information from other papers."}, {"id": 7, "string": "CL-SciSumm also encourages the use of citing mini-summaries written in other papers, by other scholars, when they refer to the paper."}, {"id": 8, "string": "It is anticipated that these selected facts would closely reflect the most important contributions and applications of the paper."}, {"id": 9, "string": "These insights have been explored in a smaller scope by previous work."}, {"id": 10, "string": "We propose that further explorations can help to advance the state of the art."}, {"id": 11, "string": "Furthermore, we expect that the CL-SciSumm Task could spur the creation of new resources and tools, to automate the synthesis and updating of automatic summaries of CL research papers."}, {"id": 12, "string": "Previous work in scientific summarization has attempted to automatically generate multi-document summaries by instantiating a hierarchical topic tree [6] , generating model citation sentences [17] or implementing a literature review framework [8] ."}, {"id": 13, "string": "However, the limited availability of evaluation resources and humancreated summaries constrains research in this area."}, {"id": 14, "string": "In 2014, the CL-SciSumm Pilot task was conducted as a part of the larger BioMedSumm Task at TAC 5 ."}, {"id": 15, "string": "In 2016, our proposal was not successful with ACL; fortunately it was accepted as a part of the BIRNDL workshop [15] at JCDL-2016 6 ."}, {"id": 16, "string": "The development and dissemination of the CL-SciSumm dataset and the related Shared Task has been generously supported by the Microsoft Research Asia (MSRA) Research Grant 2016."}, {"id": 17, "string": "Task Given: A topic consisting of a Reference Paper (RP) and up to ten Citing Papers (CPs) that all contain citations to the RP."}, {"id": 18, "string": "In each CP, the text spans (i.e., citances) have been identified that pertain to a particular citation to the RP."}, {"id": 19, "string": "Task 1A: For each citance, identify the spans of text (cited text spans) in the RP that most accurately reflect the citance."}, {"id": 20, "string": "These are of the granularity of a sentence fragment, a full sentence, or several consecutive sentences (no more than 5)."}, {"id": 21, "string": "Task 1B: For each cited text span, identify what facet of the paper it belongs to, from a predefined set of facets."}, {"id": 22, "string": "Task 2: Finally, generate a structured summary of the RP from the cited text spans of the RP."}, {"id": 23, "string": "The length of the summary should not exceed 250 words."}, {"id": 24, "string": "This was an optional bonus task."}, {"id": 25, "string": "Evaluation: Participants were required to submit their system outputs from the test set to the task organizers."}, {"id": 26, "string": "An automatic evaluation script was used to measure system performance for Task 1a, in terms of the sentence id overlaps between the sentences identified in system output, versus the gold standard created by human annotators."}, {"id": 27, "string": "Task 1b was evaluated as a proportion of the correctly classified discourse facets by the system, contingent on the expected response of Task 1a."}, {"id": 28, "string": "Task 2 was optional, and evaluated using the ROUGE-N [12] scores between the system output and three types of gold standard summaries of the research paper."}, {"id": 29, "string": "Data: The dataset comprises ten pairs of training sets, development and test sets."}, {"id": 30, "string": "Each pair comprises the annotated citing sentences for a research paper and the discourse facets being referenced, and summaries of the research paper."}, {"id": 31, "string": "CL-SciSumm Pilot 2014 The CL Summarization Pilot Task [7] was conducted as a part of the Biomed-Summ Track at the Text Analysis Conference 2014 (TAC 2014) 7 ."}, {"id": 32, "string": "Ten pairs of annotated citing sentences and summaries were made available to the participants, who reported their performance on the same Tasks described above, as a cross-validation over the same dataset."}, {"id": 33, "string": "System outputs for Task 1a were scored using word overlaps with the gold standard measured by the ROUGE-L score."}, {"id": 34, "string": "Task 1b was scored using precision, recall and F 1 ."}, {"id": 35, "string": "Task 2 was an optional task where system summaries were evaluated against the abstract using ROUGE-L. No centralized evaluation was performed."}, {"id": 36, "string": "All scores were self-reported."}, {"id": 37, "string": "Three teams submitted their system outputs."}, {"id": 38, "string": "clair umich was a supervised system using lexical, syntactic and WordNet based features; MQ system used information retrieval inspired ranking methods; TALN.UPF used various TF-IDF scores."}, {"id": 39, "string": "During this task, the participants reported several errors in the dataset including text encoding and inconsistencies in the text offsets."}, {"id": 40, "string": "The annotators also reported flaws in the xml encoding, and problems in the OCR export to XML."}, {"id": 41, "string": "These issues hindered system building and evaluation."}, {"id": 42, "string": "Accordingly, changes were made to the annotation file format and the XML transformation process in the current task."}, {"id": 43, "string": "Development The CL-SciSumm 2016 task included the original training dataset of the Pilot Task, to encourage teams from the previous edition to participate."}, {"id": 44, "string": "It also incorporated a new development corpus of ten sets for system training, and a separate test corpus of ten sets for evaluation."}, {"id": 45, "string": "Additionally, it provided three types of summaries for each set in each corpus -the abstract, written by the authors of the research paper the community summary, collated from the reference spans of its citances human-written summary written by the annotators of the CL-SciSumm annotation effort 7 http://www.nist.gov/tac/2014 For the general procedure followed to construct the CL-SciSumm corpus, please see [7] ."}, {"id": 46, "string": "There are two differences in the selection of citing papers (CP) for the training corpus, as compared to the development and test corpora."}, {"id": 47, "string": "Firstly, the minimum numbers of CP provided in the former, which was 3, was increased to 8 in the construction of the latter."}, {"id": 48, "string": "Secondly, the maximum number of CPs provided in the former was 10, but this limit was removed in the construction of the latter, so that up to 60 CPs have been provided for a single RP."}, {"id": 49, "string": "This was done to have more citances of which potentially more would mention the RP in greater detail."}, {"id": 50, "string": "This would also produce a wider perspective in the community summary."}, {"id": 51, "string": "Annotation The annotators of the development and test corpora were five postgraduate students in Applied Linguistics, from University of Hyderabad, India."}, {"id": 52, "string": "They were selected out of a larger pool of over twenty-five participants, who were all trained to annotate an RP and its CPs on their personal laptops, using the Knowtator 8 annotation package of the Protege editing environment 9 ."}, {"id": 53, "string": "The annotation scheme was unchanged from what was followed by [7] : Given each RP and its associated CPs, the annotation group was instructed to find citations to the RP in each CP."}, {"id": 54, "string": "Specifically, the citation text, citation marker, reference text, and discourse facet were identified for each citation of the RP found in the CP."}, {"id": 55, "string": "Inadvertently, we included the gold standard annotations for Task 1a and 1b when we released the test corpus."}, {"id": 56, "string": "We alerted the participating teams to this mistake and requested them not to use that information for training their systems."}, {"id": 57, "string": "Overview of Approaches The following paragraphs discuss the approaches followed by the participating systems, in no particular order."}, {"id": 58, "string": "Except for the top performing systems in each of the sub-tasks, we do not provide detailed relative performance information for each system, in this paper."}, {"id": 59, "string": "The evaluation scripts have been provided at the CL-SciSumm Github respository 10 where the participants may run their own evaluation and report the results."}, {"id": 60, "string": "The approach by [14] used the Transdisciplinary Scientific Lexicon (TSL) developed by [5] to build a profile for each discourse facet in citances and reference spans."}, {"id": 61, "string": "Then a similarity function developed by [16] was used to select the best-matching reference span with the same facet as the citance."}, {"id": 62, "string": "For Task 2, the authors used Maximal Marginal Relevance [3] to choose sentences so that they brought new information to the summary."}, {"id": 63, "string": "Nomoto [20] proposed a hybrid model for Task 2, comprising TFIDF and a tripartite neural network."}, {"id": 64, "string": "Stochastic gradient descent was performed on a training data comprising of triples of citance, the true reference and the set of false references for the citance."}, {"id": 65, "string": "Sentence selection was based on a dissimilarity score similar to MMR."}, {"id": 66, "string": "Mao et al."}, {"id": 67, "string": "[11] used an SVM classifier with a topical lexicon to identify the best matching reference spans for a citance, using ifd similarity, Jaccard similarity and context similarity."}, {"id": 68, "string": "They finally submitted six system runs, each following a variant of similarities and approaches -the fusion method, the Jaccard Cascade method, the Jaccard Focused method, the SVM method and two voting methods."}, {"id": 69, "string": "Klampfl et al."}, {"id": 70, "string": "[10] developed three different approaches based on summarization and classification techniques."}, {"id": 71, "string": "They applied a modified version of an unsupervised summarization technique, termed it TextSentenceRank, to the reference document."}, {"id": 72, "string": "Their second method incorporates similarities of sentences to the citation on a textual level, and employed classification to select from candidates previously extracted through the original TextSentenceRank algorithm."}, {"id": 73, "string": "Their third method used unsupervised summarization of the relevant sub-part of the document that was previously selected in a supervised manner."}, {"id": 74, "string": "Saggion et al."}, {"id": 75, "string": "[23] reported their results for the linear regression implementation of WEKA used together with the GATE system."}, {"id": 76, "string": "They trained their model to learn the weights of different features with respect to the relevance of cited text spans and the relevance to a community-based summary."}, {"id": 77, "string": "Two runs were submitted, using SUMMA [22] to score and extract all matched sentences and only the top sentences respectively."}, {"id": 78, "string": "Lu et al."}, {"id": 79, "string": "[13] regarded Task 1a as a ranking problem, applying Learning to Rank strategies."}, {"id": 80, "string": "In contrast, the group cast Task 1b as a standard text classification problem, where novel feature engineering was the team's focus."}, {"id": 81, "string": "Along this vein, the group considered features of both citation contexts and cited spans."}, {"id": 82, "string": "Aggarwal and Sharma [1] propose several heuristics derived from bigram overlap counts between citances and reference text to identify the reference text span for each citance."}, {"id": 83, "string": "This score is used to rank and select sentences from the reference text as output."}, {"id": 84, "string": "Baki et al."}, {"id": 85, "string": "[18] used SVM with subset tree kernel, a type of convolution kernel."}, {"id": 86, "string": "Computed similarities between three tree representations of the citance and reference text formed the convolution kernel."}, {"id": 87, "string": "Their set-up scored better than their TF-IDF baseline method."}, {"id": 88, "string": "They submitted three system runs with this approach."}, {"id": 89, "string": "The PolyU system [2] , for Task 1a, use SVM-rank with lexical and document structural features to rank reference text sentences for every citance."}, {"id": 90, "string": "Task 1b is solved using a decision tree classifier."}, {"id": 91, "string": "Finally, they model summarization as a query-focussed summarization with citances as queries."}, {"id": 92, "string": "They generate summaries (Task 2) by improvising on a Manifold Ranking method (see [2] for details)."}, {"id": 93, "string": "Finally, the system submitted by Conroy and Davis [4] attempted to solve Task 2 with an adaptation of a system developed for the TAC 2014 BioMedSumm Task 11 ."}, {"id": 94, "string": "They provided the results from a simple vector space model, wherein they used a TF representation of the text and non-negative matrix factorization (NNMF) to estimate the latent weights of the terms for scientific document summarization."}, {"id": 95, "string": "They also provide the results from two language models based on the distribution of words in human-written summaries."}, {"id": 96, "string": "System Runs Performance of systems for Task 1a was measured by the number of sentences output by the system that overlap with the sentences in the human annotated reference text span (see section 4.1)."}, {"id": 97, "string": "These numbers were then used to calculate the precision, recall and F 1 score for each system."}, {"id": 98, "string": "As Task 1b is a multi-label classification, this task was also scored by metrics -precision, recall and F 1 score."}, {"id": 99, "string": "Nine systems submitted outputs for Task 1."}, {"id": 100, "string": "The following plots rank the systems for Task 1 by their F 1 scores."}, {"id": 101, "string": "In the figures, all the systems have been identified by their participant number."}, {"id": 102, "string": "Only the top performing systems for Tasks 1a, 1b and 2 have been identified by name in sections 6 and 7."}, {"id": 103, "string": "Task 2, to create a summary of the reference paper from citances and the reference paper text, was evaluated against 3 types of gold standard summaries: the reference paper's abstract, a community summary and a human summary."}, {"id": 104, "string": "A Java Implementation of ROUGE 12 was used to compare the gold summaries against summaries generated by systems."}, {"id": 105, "string": "We calculated ROUGE-2 and ROUGE-4 F 1 scores for the system summaries against each of the 3 summary types."}, {"id": 106, "string": "ROUGE-1 and ROUGE-3, which showed similar results have been omitted from this paper."}, {"id": 107, "string": "Four of the nine system that did Task 1 also did the bonus Task 2."}, {"id": 108, "string": "Following are the plots with their performance measured by ROUGE-2 and ROUGE-4 against the 3 gold standard summary types."}, {"id": 109, "string": "For Task 1a, the best performance was shown by sys16, developed by [2] ."}, {"id": 110, "string": "The next best performance was shown by sys8 [11] and sys6 [20] ."}, {"id": 111, "string": "For Task 1b, the best performance was shown by sys8 [11] , followed by the systems sys16 [2] and sys10 [23] ."}, {"id": 112, "string": "For Task 2, the system by [11] , sys8, performed the best against abstract and community summaries, while sys16 [2] performed well on community summaries."}, {"id": 113, "string": "The system by sys15 [1] , was also a strong performer on these tasks."}, {"id": 114, "string": "On human summaries, the best performance was seen from sys3 [4] ."}, {"id": 115, "string": "The F 1 scores of all systems on Tasks 1a and 1b were generally low."}, {"id": 116, "string": "However, the systems ranked in the first 3 places, did significantly better than systems ranked in the last 3 places."}, {"id": 117, "string": "On Task 2, all systems except sys16 performed better when evaluated against abstracts, than against other summary types."}, {"id": 118, "string": "Furthermore, system performances did not differ significantly from one another when evaluated against human and community summaries."}, {"id": 119, "string": "However, when evaluated against abstracts, the best performing system significantly outperforms systems ranked in the lower half."}, {"id": 120, "string": "Conclusion Ten systems participated in the CL-SciSumm Task 2016."}, {"id": 121, "string": "A variety of heuristical, lexical and supervised approaches were used."}, {"id": 122, "string": "Two of the best performing systems in Task 1a and 1b were also participants in the CL-SciSumm Pilot Task."}, {"id": 123, "string": "The results from Task 2 suggest that automatic summarization systems may be adaptable to different domains, as we observed that the system by [4] , which had originally been developed for biomedical human summaries, outperformed the others."}, {"id": 124, "string": "We also note that systems performing well on Tasks 1a and 1b also do well in generating community summaries -this supports our expectations about the Shared Task, and validates the need to push the state-of-the-art in scientific summarization."}, {"id": 125, "string": "In future work, other methods of evaluation can be used for comparing the performance of the different approaches, and a deeper analysis can lead to new insights about which approaches work well with certain kinds of data."}, {"id": 126, "string": "However, such an inquiry was beyond the scope of this overview paper."}, {"id": 127, "string": "We deem our Task a success, as it has spurred the interest of the community and the development of tools and approaches for scientific summarization."}, {"id": 128, "string": "We are investigating other potential subtasks which could be added into our purview."}, {"id": 129, "string": "We are also scouting for other related research problems, of relevance to the scientific summarization community."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 16}, {"section": "Task", "n": "2", "start": 17, "end": 30}, {"section": "CL-SciSumm Pilot 2014", "n": "3", "start": 31, "end": 42}, {"section": "Development", "n": "4", "start": 43, "end": 50}, {"section": "Annotation", "n": "4.1", "start": 51, "end": 56}, {"section": "Overview of Approaches", "n": "5", "start": 57, "end": 95}, {"section": "System Runs", "n": "6", "start": 96, "end": 119}, {"section": "Conclusion", "n": "7", "start": 120, "end": 129}], "figures": [{"filename": "../figure/image/986-Figure1-1.png", "caption": "Fig. 1. System performances on Task 1a(left) and Task 1b(right).", "page": 5, "bbox": {"x1": 133.92, "x2": 487.2, "y1": 378.71999999999997, "y2": 490.08}}, {"filename": "../figure/image/986-Figure4-1.png", "caption": "Fig. 4. Task 2 system performances on human summaries measured by ROUGE 2 (left) and 4 (right)", "page": 6, "bbox": {"x1": 133.92, "x2": 487.2, "y1": 517.92, "y2": 629.28}}, {"filename": "../figure/image/986-Figure3-1.png", "caption": "Fig. 3. Task 2 system performances on community summaries measured by ROUGE–2 (left) and ROUGE–4 (right)", "page": 6, "bbox": {"x1": 133.92, "x2": 487.2, "y1": 350.88, "y2": 462.24}}, {"filename": "../figure/image/986-Figure2-1.png", "caption": "Fig. 2. Task 2 system performances on abstract summaries measured by ROUGE–2 (left) and ROUGE–4 (right)", "page": 6, "bbox": {"x1": 133.92, "x2": 487.2, "y1": 183.84, "y2": 296.15999999999997}}]}