{"title": "Retrieve, Rerank and Rewrite: Soft Template Based Neural Summarization", "abstract": "Most previous seq2seq summarization systems purely depend on the source text to generate summaries, which tends to work unstably. Inspired by the traditional template-based summarization approaches, this paper proposes to use existing summaries as soft templates to guide the seq2seq model. To this end, we use a popular IR platform to Retrieve proper summaries as candidate templates. Then, we extend the seq2seq framework to jointly conduct template Reranking and templateaware summary generation (Rewriting). Experiments show that, in terms of informativeness, our model significantly outperforms the state-of-the-art methods, and even soft templates themselves demonstrate high competitiveness. In addition, the import of high-quality external summaries improves the stability and readability of generated summaries.", "text": [{"id": 0, "string": "Introduction The exponentially growing online information has necessitated the development of effective automatic summarization systems."}, {"id": 1, "string": "In this paper, we focus on an increasingly intriguing task, i.e., abstractive sentence summarization (Rush et al., 2015a) , which generates a shorter version of a given sentence while attempting to preserve its original meaning."}, {"id": 2, "string": "It can be used to design or refine appealing headlines."}, {"id": 3, "string": "Recently, the application of the attentional sequence-to-sequence (seq2seq) framework has attracted growing attention and achieved state-of-the-art performance on this task (Rush et al., 2015a; Chopra et al., 2016; Nallapati et al., 2016) ."}, {"id": 4, "string": "Most previous seq2seq models purely depend on the source text to generate summaries."}, {"id": 5, "string": "However, as reported in many studies (Koehn and Knowles, 2017) , the performance of a seq2seq model deteriorates quickly with the increase of the length of generation."}, {"id": 6, "string": "Our experiments also show that seq2seq models tend to \"lose control\" sometimes."}, {"id": 7, "string": "For example, 3% of summaries contain less than 3 words, while there are 4 summaries repeating a word for even 99 times."}, {"id": 8, "string": "These results largely reduce the informativeness and readability of the generated summaries."}, {"id": 9, "string": "In addition, we find seq2seq models usually focus on copying source words in order, without any actual \"summarization\"."}, {"id": 10, "string": "Therefore, we argue that, the free generation based on the source sentence is not enough for a seq2seq model."}, {"id": 11, "string": "Template based summarization (e.g., Zhou and Hovy (2004) ) is a traditional approach to abstractive summarization."}, {"id": 12, "string": "In general, a template is an incomplete sentence which can be filled with the input text using the manually defined rules."}, {"id": 13, "string": "For instance, a concise template to conclude the stock market quotation is: [REGION] shares [open/close] [NUMBER] percent [lower/higher], e.g., \"hong kong shares close #.# percent lower\"."}, {"id": 14, "string": "Since the templates are written by humans, the produced summaries are usually fluent and informative."}, {"id": 15, "string": "However, the construction of templates is extremely time-consuming and requires a plenty of domain knowledge."}, {"id": 16, "string": "Moreover, it is impossible to develop all templates for summaries in various domains."}, {"id": 17, "string": "Inspired by retrieve-based conversation systems (Ji et al., 2014) , we assume the golden summaries of the similar sentences can provide a reference point to guide the input sentence summarization process."}, {"id": 18, "string": "We call these existing summaries soft templates since no actual rules are nee-ded to build new summaries from them."}, {"id": 19, "string": "Due to the strong rewriting ability of the seq2seq framework (Cao et al., 2017a) , in this paper, we propose to combine the seq2seq and template based summarization approaches."}, {"id": 20, "string": "We call our summarization system Re 3 Sum, which consists of three modules: Retrieve, Rerank and Rewrite."}, {"id": 21, "string": "We utilize a widely-used Information Retrieval (IR) platform to find out candidate soft templates from the training corpus."}, {"id": 22, "string": "Then, we extend the seq2seq model to jointly learn template saliency measurement (Rerank) and final summary generation (Rewrite)."}, {"id": 23, "string": "Specifically, a Recurrent Neural Network (RNN) encoder is applied to convert the input sentence and each candidate template into hidden states."}, {"id": 24, "string": "In Rerank, we measure the informativeness of a candidate template according to its hidden state relevance to the input sentence."}, {"id": 25, "string": "The candidate template with the highest predicted informativeness is regarded as the actual soft template."}, {"id": 26, "string": "In Rewrite, the summary is generated according to the hidden states of both the sentence and template."}, {"id": 27, "string": "We conduct extensive experiments on the popular Gigaword dataset (Rush et al., 2015b) ."}, {"id": 28, "string": "Experiments show that, in terms of informativeness, Re 3 Sum significantly outperforms the state-ofthe-art seq2seq models, and even soft templates themselves demonstrate high competitiveness."}, {"id": 29, "string": "In addition, the import of high-quality external summaries improves the stability and readability of generated summaries."}, {"id": 30, "string": "The contributions of this work are summarized as follows: • We propose to introduce soft templates as additional input to improve the readability and stability of seq2seq summarization systems."}, {"id": 31, "string": "Code and results can be found at http://www4.comp.polyu."}, {"id": 32, "string": "edu.hk/˜cszqcao/ • We extend the seq2seq framework to conduct template reranking and template-aware summary generation simultaneously."}, {"id": 33, "string": "• We fuse the popular IR-based and seq2seqbased summarization systems, which fully utilize the supervisions from both sides."}, {"id": 34, "string": "Method As shown in Fig."}, {"id": 35, "string": "1 we choose the one with the maximal actual saliency score in C, which speeds up convergence and shows no obvious side effect in the experiments."}, {"id": 36, "string": "Then, we jointly conduct reranking and rewriting through a shared encoder."}, {"id": 37, "string": "Specifically, both the sentence x and the soft template r are converted into hidden states with a RNN encoder."}, {"id": 38, "string": "In the Rerank module, we measure the saliency of r according to its hidden state relevance to x."}, {"id": 39, "string": "In the Rewrite module, a RNN decoder combines the hidden states of x and r to generate a summary y."}, {"id": 40, "string": "More details will be described in the rest of this section Retrieve The purpose of this module is to find out candidate templates from the training corpus."}, {"id": 41, "string": "We assume that similar sentences should hold similar summary patterns."}, {"id": 42, "string": "Therefore, given a sentence x, we find out its analogies in the corpus and pick their summaries as the candidate templates."}, {"id": 43, "string": "Since the size of our dataset is quite large (over 3M), we leverage the widely-used Information Retrieve (IR) system Lucene 1 to index and search efficiently."}, {"id": 44, "string": "We keep the default settings of Lucene 2 to build the IR system."}, {"id": 45, "string": "For each input sentence, we select top 30 searching results as candidate templates."}, {"id": 46, "string": "Jointly Rerank and Rewrite To conduct template-aware seq2seq generation (rewriting), it is a necessary step to encode both the source sentence x and soft template r into hidden states."}, {"id": 47, "string": "Considering that the matching networks based on hidden states have demonstrated the strong ability to measure the relevance of two pieces of texts (e.g., ), we propose to jointly conduct reranking and rewriting through a shared encoding step."}, {"id": 48, "string": "Specifically, we employ a bidirectional Recurrent Neural Network (BiRNN) encoder  to read x and r. Take the sentence x as an example."}, {"id": 49, "string": "Its hidden state of the forward RNN at timestamp i can be Figure 1: Flow chat of the proposed method."}, {"id": 50, "string": "We use the dashed line for Retrieve since there is an IR system embedded."}, {"id": 51, "string": "represented by: − → h x i = RNN(x i , − → h x i−1 ) (1) The BiRNN consists of a forward RNN and a backward RNN."}, {"id": 52, "string": "Suppose the corresponding out- puts are [ − → h x 1 ; · · · ; − → h x −1 ] and [ ← − h x 1 ; · · · ; ← − h x −1 ] , respectively, where the index \"−1\" stands for the last element."}, {"id": 53, "string": "Then, the composite hidden state of a word is the concatenation of the two RNN repre- sentations, i.e., h x i = [ − → h x i ; ← − h x i ]."}, {"id": 54, "string": "The entire repre- sentation for the source sentence is [h x 1 ; · · · ; h x −1 ] ."}, {"id": 55, "string": "Since a soft template r can also be regarded as a readable concise sentence, we use the same BiRNN encoder to convert it into hidden states [h r 1 ; · · · ; h r −1 ]."}, {"id": 56, "string": "Rerank In Retrieve, the template candidates are ranked according to the text similarity between the corresponding indexed sentences and the input sentence."}, {"id": 57, "string": "However, for the summarization task, we expect the soft template r resembles the actual summary y * as much as possible."}, {"id": 58, "string": "Here we use the widely-used summarization evaluation metrics ROUGE (Lin, 2004) to measure the actual saliency s * (r, y * ) (see Section 3.2)."}, {"id": 59, "string": "We utilize the hidden states of x and r to predict the saliency s of the template."}, {"id": 60, "string": "Specifically, we regard the output of the BiRNN as the representation of the sentence or template: h x = [ ← − h x 1 ; − → h x −1 ] (2) h r = [ ← − h r 1 ; − → h r −1 ] (3) Next, we use Bilinear network to predict the saliency of the template for the input sentence."}, {"id": 61, "string": "s(r, x) = sigmoid(h r W s h T x + b s ), (4) where W s and b s are parameters of the Bilinear network, and we add the sigmoid activation function to make the range of s consistent with the actual saliency s * ."}, {"id": 62, "string": "According to , Bilinear outperforms multi-layer forward neural networks in relevance measurement."}, {"id": 63, "string": "As shown later, the difference of s and s * will provide additional supervisions for the seq2seq framework."}, {"id": 64, "string": "Rewrite The soft template r selected by the Rerank module has already competed with the state-of-the-art method in terms of ROUGE evaluation (see Table 4 )."}, {"id": 65, "string": "However, r usually contains a lot of named entities that does not appear in the source (see Table 5 )."}, {"id": 66, "string": "Consequently, it is hard to ensure that the soft templates are faithful to the input sentences."}, {"id": 67, "string": "Therefore, we leverage the strong rewriting ability of the seq2seq model to generate more faithful and informative summaries."}, {"id": 68, "string": "Specifically, since the input of our system consists of both the sentence and soft template, we use the concatenation function 3 to combine the hidden states of the sentence and template: H c = [h x 1 ; · · · ; h x −1 ; h r 1 ; · · · ; h r −1 ] (5) The combined hidden states are fed into the prevailing attentional RNN decoder  to generate the decoding hidden state at the position t: s t = Att-RNN(s t−1 , y t−1 , H c ), (6) where y t−1 is the previous output summary word."}, {"id": 69, "string": "Finally, a sof tmax layer is introduced to predict the current summary word: o t = sof tmax(s t W o ), (7) where W o is a parameter matrix."}, {"id": 70, "string": "Learning There are two types of costs in our system."}, {"id": 71, "string": "For Rerank, we expect the predicted saliency s(r, x) close to the actual saliency s * (r, y * )."}, {"id": 72, "string": "Therefore, J R (θ) = CE(s(r, x), s * (r, y * )) (8) = −s * log s − (1 − s * ) log(1 − s), where θ stands for the model parameters."}, {"id": 73, "string": "For Rewrite, the learning goal is to maximize the estimated probability of the actual summary y * ."}, {"id": 74, "string": "We adopt the common negative log-likelihood (NLL) as the loss function: J G (θ) = − log(p(y * |x, r)) (9) = − t log(o t [y * t ]) To make full use of supervisions from both sides, we combine the above two costs as the final loss function: J(θ) = J R (θ) + J G (θ) (10) We use mini-batch Stochastic Gradient Descent (SGD) to tune model parameters."}, {"id": 75, "string": "The batch size is 64."}, {"id": 76, "string": "To enhance generalization, we introduce dropout (Srivastava et al., 2014) with probability p = 0.3 for the RNN layers."}, {"id": 77, "string": "The initial learning rate is 1, and it will decay by 50% if the generation loss does not decrease on the validation set."}, {"id": 78, "string": "Experiments Datasets We conduct experiments on the Annotated English Gigaword corpus, as with (Rush et al., 2015b) ."}, {"id": 79, "string": "This parallel corpus is produced by pairing the first sentence in the news article and its headline as the summary with heuristic rules."}, {"id": 80, "string": "All the training, development and test datasets can be downloaded at https://github."}, {"id": 81, "string": "com/harvardnlp/sent-summary."}, {"id": 82, "string": "The statistics of the Gigaword corpus is presented in Table 1."}, {"id": 83, "string": "AvgSourceLen is the average input sentence length and AvgTargetLen is the average summary length."}, {"id": 84, "string": "COPY means the copy ratio in the summaries (without stopwords)."}, {"id": 85, "string": "Evaluation Metrics We adopt ROUGE (Lin, 2004) for automatic evaluation."}, {"id": 86, "string": "ROUGE has been the standard evaluation metric for DUC shared tasks since 2004."}, {"id": 87, "string": "It measures the quality of summary by computing the overlapping lexical units between the candidate summary and actual summaries, such as unigram, bi-gram and longest common subsequence (LCS)."}, {"id": 88, "string": "Following the common practice, we report ROUGE-1 (uni-gram), ROUGE-2 (bi-gram) and ROUGE-L (LCS) F1 scores 4 in the following experiments."}, {"id": 89, "string": "We also measure the actual saliency of a candidate template r with its combined ROUGE scores given the actual summary y * : s * (r, y * ) = RG(r, y * ) + RG(r, y * ), (11) where \"RG\" stands for ROUGE for short."}, {"id": 90, "string": "ROUGE mainly evaluates informativeness."}, {"id": 91, "string": "We also introduce a series of metrics to measure the summary quality from the following aspects: LEN DIF The absolute value of the length difference between the generated summaries and the actual summaries."}, {"id": 92, "string": "We use mean value ± standard deviation to illustrate this item."}, {"id": 93, "string": "The average value partially reflects the readability and informativeness, while the standard deviation links to stability."}, {"id": 94, "string": "LESS 3 The number of the generated summaries, which contains less than three tokens."}, {"id": 95, "string": "These extremely short summaries are usually unreadable."}, {"id": 96, "string": "COPY The proportion of the summary words (without stopwords) copied from the source sentence."}, {"id": 97, "string": "A seriously large copy ratio indicates that the summarization system pays more attention to compression rather than required abstraction."}, {"id": 98, "string": "NEW NE The number of the named entities that do not appear in the source sentence or actual summary."}, {"id": 99, "string": "Intuitively, the appearance of new named entities in the summary is likely to bring unfaithfulness."}, {"id": 100, "string": "We use Stanford Co-reNLP (Manning et al., 2014) to recognize named entities."}, {"id": 101, "string": "Implementation Details We use the popular seq2seq framework Open-NMT 5 as the starting point."}, {"id": 102, "string": "To make our model more general, we retain the default settings of OpenNMT to build the network architecture."}, {"id": 103, "string": "Specifically, the dimensions of word embeddings and RNN are both 500, and the encoder and decoder structures are two-layer bidirectional Long Short Term Memory Networks (LSTMs)."}, {"id": 104, "string": "The only difference is that we add the argument \"share embeddings\" to share the word embeddings between the encoder and decoder."}, {"id": 105, "string": "This practice largely reduces model parameters for the monolingual task."}, {"id": 106, "string": "On our computer (GPU: GTX 1080, Memory: 16G, CPU: i7-7700K), the training spends about 2 days."}, {"id": 107, "string": "During test, we use beam search of size 5 to generate summaries."}, {"id": 108, "string": "We add the argument \"replace unk\" to replace the generated unknown words with the source word that holds the highest attention weight."}, {"id": 109, "string": "Since the generated summaries are often shorter than the actual ones, we introduce an additional length penalty argument \"alpha 1\" to encourage longer generation, like Wu et al."}, {"id": 110, "string": "(2016) ."}, {"id": 111, "string": "Baselines We compare our proposed model with the following state-of-the-art neural summarization systems: 2015) for summarization."}, {"id": 112, "string": "This model contained two-layer LSTMs with 500 hidden units in each layer."}, {"id": 113, "string": "OpenNMT We also implement the standard attentional seq2seq model with OpenNMT."}, {"id": 114, "string": "All the settings are the same as our system."}, {"id": 115, "string": "It is noted that OpenNMT officially examined the Gigaword dataset."}, {"id": 116, "string": "We distinguish the official result 6 and our experimental result with suffixes \"O\" and \"I\" respectively."}, {"id": 117, "string": "FTSum Cao et al."}, {"id": 118, "string": "(2017b) encoded the facts extracted from the source sentence to improve both the faithfulness and informativeness of generated summaries."}, {"id": 119, "string": "In addition, to evaluate the effectiveness of our joint learning framework, we develop a baseline named \"PIPELINE\"."}, {"id": 120, "string": "Its architecture is identical to Re 3 Sum."}, {"id": 121, "string": "However, it trains the Rerank module and Rewrite module in pipeline."}, {"id": 122, "string": "tentional seq2seq model OpenNMT I ."}, {"id": 123, "string": "Therefore, it is safe to conclude that soft templates have great contribute to guide the generation of summaries."}, {"id": 124, "string": "Informativeness Evaluation We also examine the performance of directly regarding soft templates as output summaries."}, {"id": 125, "string": "We introduce five types of different soft templates: Random An existing summary randomly selected from the training corpus."}, {"id": 126, "string": "First The top-ranked candidate template given by the Retrieve module."}, {"id": 127, "string": "Max The template with the maximal actual ROUGE scores among the 30 candidate templates."}, {"id": 128, "string": "Optimal An existing summary in the training corpus which holds the maximal ROUGE scores."}, {"id": 129, "string": "Rerank The template with the maximal predicted ROUGE scores among the 30 candidate templates."}, {"id": 130, "string": "It is the actual soft template we adopt."}, {"id": 131, "string": "As shown in Table 4 , the performance of Random is terrible, indicating it is impossible to use one summary template to fit various actual summaries."}, {"id": 132, "string": "Rerank largely outperforms First, which verifies the effectiveness of the Rerank module."}, {"id": 133, "string": "However, according to Max and Rerank, we find the Rerank performance of Re 3 Sum is far from perfect."}, {"id": 134, "string": "Likewise, comparing Max and First, we observe that the improving capacity of the Retrieve module is high."}, {"id": 135, "string": "Notice that Optimal greatly exceeds all the state-of-the-art approaches."}, {"id": 136, "string": "This finding strongly supports our practice of using existing summaries to guide the seq2seq models."}, {"id": 137, "string": "Linguistic Quality Evaluation We also measure the linguistic quality of generated summaries from various aspects, and the results are present in Table 5 ."}, {"id": 138, "string": "As can be seen from the rows \"LEN DIF\" and \"LESS 3\", the performance of Re 3 Sum is almost the same as that of soft templates."}, {"id": 139, "string": "The soft templates indeed well guide the summary generation."}, {"id": 140, "string": "Compared with Source grid positions after the final qualifying session in the indonesian motorcycle grand prix at the sentul circuit , west java , saturday : UNK Target indonesian motorcycle grand prix grid positions Template grid positions for british grand prix OpenNMT circuit Re 3 Sum grid positions for indonesian grand prix Source india 's children are getting increasingly overweight and unhealthy and the government is asking schools to ban junk food , officials said thursday ."}, {"id": 141, "string": "Target indian government asks schools to ban junk food Template skorean schools to ban soda junk food OpenNMT india 's children getting fatter Re 3 Sum indian schools to ban junk food Table 7 : Examples of generated summaries."}, {"id": 142, "string": "We use Bold font to indicate the crucial rewriting behavior from the templates to generated summaries."}, {"id": 143, "string": "Re 3 Sum, the standard deviation of LEN DF is 0.7 times larger in OpenNMT, indicating that Open-NMT works quite unstably."}, {"id": 144, "string": "Moreover, OpenNMT generates 53 extreme short summaries, which seriously reduces readability."}, {"id": 145, "string": "Meanwhile, the copy ratio of actual summaries is 36%."}, {"id": 146, "string": "Therefore, the copy mechanism is severely overweighted in OpenNMT."}, {"id": 147, "string": "Our model is encouraged to generate according to human-written soft templates, which relatively diminishes copying from the source sentences."}, {"id": 148, "string": "Look at the last row \"NEW NE\"."}, {"id": 149, "string": "A number of new named entities appear in the soft templates, which makes them quite unfaithful to source sentences."}, {"id": 150, "string": "By contrast, this index in Re 3 Sum is close to the OpenNMT's."}, {"id": 151, "string": "It highlights the rewriting ability of our seq2seq framework."}, {"id": 152, "string": "Effect of Templates In this section, we investigate how soft templates affect our model."}, {"id": 153, "string": "At the beginning, we feed different types of soft templates (refer to Table 4 ) into the Rewriting module of Re 3 Sum."}, {"id": 154, "string": "As illustrated in Table 6 , the more high-quality templates are provided, the higher ROUGE scores are achieved."}, {"id": 155, "string": "It is interesting to see that,while the ROUGE-2 score of Random templates is zero, our model can still generate acceptable summaries with Random templates."}, {"id": 156, "string": "It seems that Re 3 Sum can automatically judge whether the soft templates are trustworthy and ignore the seriously irrelevant ones."}, {"id": 157, "string": "We believe that the joint learning with the Rerank model plays a vital role here."}, {"id": 158, "string": "Next, we manually inspect the summaries generated by different methods."}, {"id": 159, "string": "We find the outputs of Re 3 Sum are usually longer and more flu-ent than the outputs of OpenNMT."}, {"id": 160, "string": "Some illustrative examples are shown in Table 7 ."}, {"id": 161, "string": "In Example 1, there is no predicate in the source sentence."}, {"id": 162, "string": "Since OpenNMT prefers selecting source words around the predicate to form the summary, it fails on this sentence."}, {"id": 163, "string": "By contract, Re 3 Sum rewrites the template and produces an informative summary."}, {"id": 164, "string": "In Example 2, OpenNMT deems the starting part of the sentences are more important, while our model, guided by the template, focuses on the second part to generate the summary."}, {"id": 165, "string": "In the end, we test the ability of our model to generate diverse summaries."}, {"id": 166, "string": "In practice, a system that can provide various candidate summaries is probably more welcome."}, {"id": 167, "string": "Specifically, two candidate templates with large text dissimilarity are manually fed into the Rewriting module."}, {"id": 168, "string": "The corresponding generated summaries are shown in Table 8."}, {"id": 169, "string": "For the sake of comparison, we also present the 2-best results of OpenNMT with beam search."}, {"id": 170, "string": "As can be seen, with different templates given, our model is likely to generate dissimilar summaries."}, {"id": 171, "string": "In contrast, the 2-best results of OpenNMT is almost the same, and often a shorter summary is only a piece of the other one."}, {"id": 172, "string": "To sum up, our model demonstrates promising prospect in generation diversity."}, {"id": 173, "string": "Related Work Abstractive sentence summarization aims to produce a shorter version of a given sentence while preserving its meaning (Chopra et al., 2016) ."}, {"id": 174, "string": "This task is similar to text simplification (Saggion, 2017) and facilitates headline design and refine."}, {"id": 175, "string": "Early studies on sentence summariza- (Zhou and Hovy, 2004) , syntactic tree pruning (Knight and Marcu, 2002; Clarke and Lapata, 2008) and statistical machine translation techniques (Banko et al., 2000) ."}, {"id": 176, "string": "Recently, the application of the attentional seq2seq framework has attracted growing attention and achieved state-of-the-art performance on this task (Rush et al., 2015a; Chopra et al., 2016; Nallapati et al., 2016) ."}, {"id": 177, "string": "In addition to the direct application of the general seq2seq framework, researchers attempted to integrate various properties of summarization."}, {"id": 178, "string": "For example, Nallapati et al."}, {"id": 179, "string": "(2016) enriched the encoder with hand-crafted features such as named entities and POS tags."}, {"id": 180, "string": "These features have played important roles in traditional feature based summarization systems."}, {"id": 181, "string": "Gu et al."}, {"id": 182, "string": "(2016) found that a large proportion of the words in the summary were copied from the source text."}, {"id": 183, "string": "Therefore, they proposed CopyNet which considered the copying mechanism during generation."}, {"id": 184, "string": "Recently, See et al."}, {"id": 185, "string": "(2017) used the coverage mechanism to discourage repetition."}, {"id": 186, "string": "Cao et al."}, {"id": 187, "string": "(2017b) encoded facts extracted from the source sentence to enhance the summary faithfulness."}, {"id": 188, "string": "There were also studies to modify the loss function to fit the evaluation metrics."}, {"id": 189, "string": "For instance, Ayana et al."}, {"id": 190, "string": "(2016) applied the Minimum Risk Training strategy to maximize the ROUGE scores of generated sum-maries."}, {"id": 191, "string": "Paulus et al."}, {"id": 192, "string": "(2017) used the reinforcement learning algorithm to optimize a mixed objective function of likelihood and ROUGE scores."}, {"id": 193, "string": "Guu et al."}, {"id": 194, "string": "(2017) also proposed to encode human-written sentences to improvement the performance of neural text generation."}, {"id": 195, "string": "However, they handled the task of Language Modeling and randomly picked an existing sentence in the training corpus."}, {"id": 196, "string": "In comparison, we develop an IR system to find proper existing summaries as soft templates."}, {"id": 197, "string": "Moreover, Guu et al."}, {"id": 198, "string": "(2017) used a general seq2seq framework while we extend the seq2seq framework to conduct template reranking and template-aware summary generation simultaneously."}, {"id": 199, "string": "Conclusion and Future Work This paper proposes to introduce soft templates as additional input to guide the seq2seq summarization."}, {"id": 200, "string": "We use the popular IR platform Lucene to retrieve proper existing summaries as candidate soft templates."}, {"id": 201, "string": "Then we extend the seq2seq framework to jointly conduct template reranking and template-aware summary generation."}, {"id": 202, "string": "Experiments show that our model can generate informative, readable and stable summaries."}, {"id": 203, "string": "In addition, our model demonstrates promising prospect in generation diversity."}, {"id": 204, "string": "We believe our work can be extended in vari-ous aspects."}, {"id": 205, "string": "On the one hand, since the candidate templates are far inferior to the optimal ones, we intend to improve the Retrieve module, e.g., by indexing both the sentence and summary fields."}, {"id": 206, "string": "On the other hand, we plan to test our system on the other tasks such as document-level summarization and short text conversation."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 33}, {"section": "Method", "n": "2", "start": 34, "end": 39}, {"section": "Retrieve", "n": "2.1", "start": 40, "end": 45}, {"section": "Jointly Rerank and Rewrite", "n": "2.2", "start": 46, "end": 55}, {"section": "Rerank", "n": "2.2.1", "start": 56, "end": 63}, {"section": "Rewrite", "n": "2.2.2", "start": 64, "end": 69}, {"section": "Learning", "n": "2.3", "start": 70, "end": 77}, {"section": "Datasets", "n": "3.1", "start": 78, "end": 84}, {"section": "Evaluation Metrics", "n": "3.2", "start": 85, "end": 100}, {"section": "Implementation Details", "n": "3.3", "start": 101, "end": 110}, {"section": "Baselines", "n": "3.4", "start": 111, "end": 123}, {"section": "Informativeness Evaluation", "n": "3.5", "start": 124, "end": 136}, {"section": "Linguistic Quality Evaluation", "n": "3.6", "start": 137, "end": 151}, {"section": "Effect of Templates", "n": "3.7", "start": 152, "end": 172}, {"section": "Related Work", "n": "4", "start": 173, "end": 198}, {"section": "Conclusion and Future Work", "n": "5", "start": 199, "end": 206}], "figures": [{"filename": "../figure/image/993-Table6-1.png", "caption": "Table 6: ROUGE F1 (%) performance of Re3Sum generated with different soft templates.", "page": 5, "bbox": {"x1": 313.92, "x2": 519.36, "y1": 62.879999999999995, "y2": 145.92}}, {"filename": "../figure/image/993-Table4-1.png", "caption": "Table 4: ROUGE F1 (%) performance of different types of soft templates.", "page": 5, "bbox": {"x1": 100.8, "x2": 261.12, "y1": 304.8, "y2": 388.32}}, {"filename": "../figure/image/993-Table3-1.png", "caption": "Table 3: ROUGE F1 (%) performance. “RG” represents “ROUGE” for short. “∗” indicates statistical significance of the corresponding model with respect to the baseline model on the 95% confidence interval in the official ROUGE script.", "page": 5, "bbox": {"x1": 81.6, "x2": 280.32, "y1": 62.879999999999995, "y2": 215.04}}, {"filename": "../figure/image/993-Table5-1.png", "caption": "Table 5: Statistics of different types of summaries.", "page": 5, "bbox": {"x1": 72.0, "x2": 291.36, "y1": 672.48, "y2": 743.04}}, {"filename": "../figure/image/993-Table7-1.png", "caption": "Table 7: Examples of generated summaries. We use Bold font to indicate the crucial rewriting behavior from the templates to generated summaries.", "page": 6, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 62.879999999999995, "y2": 233.28}}, {"filename": "../figure/image/993-Figure1-1.png", "caption": "Figure 1: Flow chat of the proposed method. We use the dashed line for Retrieve since there is an IR system embedded.", "page": 2, "bbox": {"x1": 116.64, "x2": 481.44, "y1": 61.44, "y2": 113.28}}, {"filename": "../figure/image/993-Table8-1.png", "caption": "Table 8: Examples of generation with diversity. We use Bold font to indicate the difference between two summaries", "page": 7, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 62.879999999999995, "y2": 313.92}}, {"filename": "../figure/image/993-Table1-1.png", "caption": "Table 1: Data statistics for English Gigaword. AvgSourceLen is the average input sentence length and AvgTargetLen is the average summary length. COPY means the copy ratio in the summaries (without stopwords).", "page": 3, "bbox": {"x1": 325.92, "x2": 507.35999999999996, "y1": 217.44, "y2": 287.03999999999996}}, {"filename": "../figure/image/993-Figure2-1.png", "caption": "Figure 2: Jointly Rerank and Rewrite", "page": 3, "bbox": {"x1": 82.56, "x2": 515.04, "y1": 61.44, "y2": 173.28}}, {"filename": "../figure/image/993-Table2-1.png", "caption": "Table 2: Final perplexity on the development set. † indicates the value is cited from the corresponding paper. ABS+, Featseq2seq and Luong-NMT do not provide this value.", "page": 4, "bbox": {"x1": 352.8, "x2": 480.47999999999996, "y1": 544.8, "y2": 642.24}}]}