{"title": "Simple and Effective Text Simplification Using Semantic and Neural Methods", "abstract": "Sentence splitting is a major simplification operator. Here we present a simple and efficient splitting algorithm based on an automatic semantic parser. After splitting, the text is amenable for further fine-tuned simplification operations. In particular, we show that neural Machine Translation can be effectively used in this situation. Previous application of Machine Translation for simplification suffers from a considerable disadvantage in that they are overconservative, often failing to modify the source in any way. Splitting based on semantic parsing, as proposed here, alleviates this issue. Extensive automatic and human evaluation shows that the proposed method compares favorably to the stateof-the-art in combined lexical and structural simplification.", "text": [{"id": 0, "string": "Introduction Text Simplification (TS) is generally defined as the conversion of a sentence into one or more simpler sentences."}, {"id": 1, "string": "It has been shown useful both as a preprocessing step for tasks such as Machine Translation (MT; Mishra et al., 2014; Štajner and Popović, 2016) and relation extraction (Niklaus et al., 2016) , as well as for developing reading aids, e.g."}, {"id": 2, "string": "for people with dyslexia (Rello et al., 2013) or non-native speakers (Siddharthan, 2002) ."}, {"id": 3, "string": "TS includes both structural and lexical operations."}, {"id": 4, "string": "The main structural simplification operation is sentence splitting, namely rewriting a single sentence into multiple sentences while preserving its meaning."}, {"id": 5, "string": "While recent improvement in TS has been achieved by the use of neural MT (NMT) approaches (Nisioi et al., 2017; Zhang and Lapata, 2017) , where TS is consid-ered a case of monolingual translation, the sentence splitting operation has not been addressed by these systems, potentially due to the rareness of this operation in the training corpora (Narayan and Gardent, 2014; Xu et al., 2015) ."}, {"id": 6, "string": "We show that the explicit integration of sentence splitting in the simplification system could also reduce conservatism, which is a grave limitation of NMT-based TS systems (Alva-Manchego et al., 2017) ."}, {"id": 7, "string": "Indeed, experimenting with a stateof-the-art neural system (Nisioi et al., 2017) , we find that 66% of the input sentences remain unchanged, while none of the corresponding references is identical to the source."}, {"id": 8, "string": "Human and automatic evaluation of the references (against other references), confirm that the references are indeed simpler than the source, indicating that the observed conservatism is excessive."}, {"id": 9, "string": "Our methods for performing sentence splitting as pre-processing allows the TS system to perform other structural (e.g."}, {"id": 10, "string": "deletions) and lexical (e.g."}, {"id": 11, "string": "word substitutions) operations, thus increasing both structural and lexical simplicity."}, {"id": 12, "string": "For combining linguistically informed sentence splitting with data-driven TS, two main methods have been proposed."}, {"id": 13, "string": "The first involves handcrafted syntactic rules, whose compilation and validation are laborious (Shardlow, 2014) ."}, {"id": 14, "string": "For example, Siddharthan and Angrosh (2014) used 111 rules for relative clauses, appositions, subordination and coordination."}, {"id": 15, "string": "Moreover, syntactic splitting rules, which form a substantial part of the rules, are usually language specific, requiring the development of new rules when ported to other languages (Aluísio and Gasperin, 2010; Seretan, 2012; Hung et al., 2012; Barlacchi and Tonelli, 2013 , for Portuguese, French, Vietnamese, and Italian respectively)."}, {"id": 16, "string": "The second method uses linguistic information for detecting potential splitting points, while splitting probabilities are learned us-ing a parallel corpus."}, {"id": 17, "string": "For example, in the system of Narayan and Gardent (2014) (henceforth, HYBRID) , the state-of-the-art for joint structural and lexical TS, potential splitting points are determined by event boundaries."}, {"id": 18, "string": "In this work, which is the first to combine structural semantics and neural methods for TS, we propose an intermediate way for performing sentence splitting, presenting Direct Semantic Splitting (DSS), a simple and efficient algorithm based on a semantic parser which supports the direct decomposition of the sentence into its main semantic constituents."}, {"id": 19, "string": "After splitting, NMT-based simplification is performed, using the NTS system."}, {"id": 20, "string": "We show that the resulting system outperforms HY-BRID in both automatic and human evaluation."}, {"id": 21, "string": "We use the UCCA scheme for semantic representation (Abend and Rappoport, 2013) , where the semantic units are anchored in the text, which simplifies the splitting operation."}, {"id": 22, "string": "We further leverage the explicit distinction in UCCA between types of Scenes (events), applying a specific rule for each of the cases."}, {"id": 23, "string": "Nevertheless, the DSS approach can be adapted to other semantic schemes, like AMR (Banarescu et al., 2013) ."}, {"id": 24, "string": "We collect human judgments for multiple variants of our system, its sub-components, HYBRID and similar systems that use phrase-based MT."}, {"id": 25, "string": "This results in a sizable human evaluation benchmark, which includes 28 systems, totaling at 1960 complex-simple sentence pairs, each annotated by three annotators using four criteria."}, {"id": 26, "string": "1 This benchmark will support the future analysis of TS systems, and evaluation practices."}, {"id": 27, "string": "Previous work is discussed in §2, the semantic and NMT components we use in §3 and §4 respectively."}, {"id": 28, "string": "The experimental setup is detailed in §5."}, {"id": 29, "string": "Our main results are presented in §6, while §7 presents a more detailed analysis of the system's sub-components and related settings."}, {"id": 30, "string": "Related Work MT-based sentence simplification."}, {"id": 31, "string": "Phrasebased Machine Translation (PBMT; Koehn et al., 2003) was first used for TS by Specia (2010) , who showed good performance on lexical simplification and simple rewriting, but under-prediction of other operations."}, {"id": 32, "string": "Štajner et al."}, {"id": 33, "string": "(2015) took a similar approach, finding that it is beneficial to use training data where the source side is highly similar to the target."}, {"id": 34, "string": "Other PBMT for TS systems include the work of Coster and Kauchak (2011b) , which uses Moses (Koehn et al., 2007) , the work of Coster and Kauchak (2011a) , where the model is extended to include deletion, and PBMT-R (Wubben et al., 2012) , where Levenshtein distance to the source is used for re-ranking to overcome conservatism."}, {"id": 35, "string": "The NTS NMT-based system (Nisioi et al., 2017) (henceforth, N17) reported superior performance over PBMT in terms of BLEU and human evaluation scores, and serves as a component in our system (see Section 4)."}, {"id": 36, "string": "took a similar approach, adding lexical constraints to an NMT model."}, {"id": 37, "string": "Zhang and Lapata (2017) combined NMT with reinforcement learning, using SARI (Xu et al., 2016) , BLEU, and cosine similarity to the source as the reward."}, {"id": 38, "string": "None of these models explicitly addresses sentence splitting."}, {"id": 39, "string": "Alva-Manchego et al."}, {"id": 40, "string": "(2017) proposed to reduce conservatism, observed in PBMT and NMT systems, by first identifying simplification operations in a parallel corpus and then using sequencelabeling to perform the simplification."}, {"id": 41, "string": "However, they did not address common structural operations, such as sentence splitting, and claimed that their method is not applicable to them."}, {"id": 42, "string": "Xu et al."}, {"id": 43, "string": "(2016) used Syntax-based Machine Translation (SBMT) for sentence simplification, using a large scale paraphrase dataset (Ganitketitch et al., 2013) for training."}, {"id": 44, "string": "While it does not target structural simplification, we include it in our evaluation for completeness."}, {"id": 45, "string": "Structural sentence simplification."}, {"id": 46, "string": "Syntactic hand-crafted sentence splitting rules were proposed by Chandrasekar et al."}, {"id": 47, "string": "(1996) , Siddharthan (2002) , Siddhathan (2011) in the context of rulebased TS."}, {"id": 48, "string": "The rules separate relative clauses and coordinated clauses and un-embed appositives."}, {"id": 49, "string": "In our method, the use of semantic distinctions instead of syntactic ones reduces the number of rules."}, {"id": 50, "string": "For example, relative clauses and appositives can correspond to the same semantic category."}, {"id": 51, "string": "In syntax-based splitting, a generation module is sometimes added after the split (Siddharthan, 2004) , addressing issues such as reordering and determiner selection."}, {"id": 52, "string": "In our model, no explicit regeneration is applied to the split sentences, which are fed directly to an NMT system."}, {"id": 53, "string": "Glavaš andŠtajner (2013) used a rule-based system conditioned on event extraction and syntax for defining two simplification models."}, {"id": 54, "string": "The eventwise simplification one, which separates events to separate output sentences, is similar to our semantic component."}, {"id": 55, "string": "Differences are in that we use a single semantic representation for defining the rules (rather than a combination of semantic and syntactic criteria), and avoid the need for complex rules for retaining grammaticality by using a subsequent neural component."}, {"id": 56, "string": "Combined structural and lexical TS."}, {"id": 57, "string": "Earlier TS models used syntactic information for splitting."}, {"id": 58, "string": "Zhu et al."}, {"id": 59, "string": "(2010) used syntactic information on the source side, based on the SBMT model of Yamada and Knight (2001) ."}, {"id": 60, "string": "Syntactic structures were used on both sides in the model of Woodsend and Lapata (2011) , based on a quasi-synchronous grammar (Smith and Eisner, 2006) , which resulted in 438 learned splitting rules."}, {"id": 61, "string": "The model of Siddharthan and Angrosh (2014) is similar to ours in that it combines linguistic rules for structural simplification and statistical methods for lexical simplification."}, {"id": 62, "string": "However, we use 2 semantic splitting rules instead of their 26 syntactic rules for relative clauses and appositions, and 85 syntactic rules for subordination and coordination."}, {"id": 63, "string": "Narayan and Gardent (2014) argued that syntactic structures do not always capture the semantic arguments of a frame, which may result in wrong splitting boundaries."}, {"id": 64, "string": "Consequently, they proposed a supervised system (HYBRID) that uses semantic structures (Discourse Semantic Representations, (Kamp, 1981) ) for sentence splitting and deletion."}, {"id": 65, "string": "Splitting candidates are pairs of event variables associated with at least one core thematic role (e.g., agent or patient)."}, {"id": 66, "string": "Semantic annotation is used on the source side in both training and test."}, {"id": 67, "string": "Lexical simplification is performed using the Moses system."}, {"id": 68, "string": "HYBRID is the most similar system to ours architecturally, in that it uses a combination of a semantic structural component and an MT component."}, {"id": 69, "string": "Narayan and Gardent (2016) proposed instead an unsupervised pipeline, where sentences are split based on a probabilistic model trained on the semantic structures of Simple Wikipedia as well as a language model trained on the same corpus."}, {"id": 70, "string": "Lexical simplification is there performed using the unsupervised model of Biran et al."}, {"id": 71, "string": "(2011) ."}, {"id": 72, "string": "As their BLEU and adequacy scores are lower than HYBRID's, we use the latter for comparison."}, {"id": 73, "string": "Stajner and Glavaš (2017) combined rule-based simplification conditioned on event extraction, to-gether with an unsupervised lexical simplifier."}, {"id": 74, "string": "They tackle a different setting, and aim to simplify texts (rather than sentences), by allowing the deletion of entire input sentences."}, {"id": 75, "string": "Split and Rephrase."}, {"id": 76, "string": "recently proposed the Split and Rephrase task, focusing on sentence splitting."}, {"id": 77, "string": "For this purpose they presented a specialized parallel corpus, derived from the WebNLG dataset ."}, {"id": 78, "string": "The latter is obtained from the DBPedia knowledge base (Mendes et al., 2012) using content selection and crowdsourcing, and is annotated with semantic triplets of subject-relation-object, obtained semi-automatically."}, {"id": 79, "string": "They experimented with five systems, including one similar to HY-BRID, as well as sequence-to-sequence methods for generating sentences from the source text and its semantic forms."}, {"id": 80, "string": "The present paper tackles both structural and lexical simplification, and examines the effect of sentence splitting on the subsequent application of a neural system, in terms of its tendency to perform other simplification operations."}, {"id": 81, "string": "For this purpose, we adopt a semantic corpus-independent approach for sentence splitting that can be easily integrated in any simplification system."}, {"id": 82, "string": "Another difference is that the semantic forms in Split and Rephrase are derived semi-automatically (during corpus compilation), while we automatically extract the semantic form, using a UCCA parser."}, {"id": 83, "string": "Direct Semantic Splitting Semantic Representation UCCA (Universal Cognitive Conceptual Annotation; Abend and Rappoport, 2013) is a semantic annotation scheme rooted in typological and cognitive linguistic theory (Dixon, 2010b (Dixon, ,a, 2012 Langacker, 2008) ."}, {"id": 84, "string": "It aims to represent the main semantic phenomena in the text, abstracting away from syntactic forms."}, {"id": 85, "string": "UCCA has been shown to be preserved remarkably well across translations (Sulem et al., 2015) and has also been successfully used for the evaluation of machine translation (Birch et al., 2016) and, recently, for the evaluation of TS (Sulem et al., 2018) and grammatical error correction (Choshen and Abend, 2018) ."}, {"id": 86, "string": "Formally, UCCA structures are directed acyclic graphs whose nodes (or units) correspond either to the leaves of the graph or to several elements viewed as a single entity according to some semantic or cognitive consideration."}, {"id": 87, "string": "A Scene is UCCA's notion of an event or a frame, and is a unit that corresponds to a movement, an action or a state which persists in time."}, {"id": 88, "string": "Every Scene contains one main relation, which can be either a Process or a State."}, {"id": 89, "string": "Scenes contain one or more Participants, interpreted in a broad sense to include locations and destinations."}, {"id": 90, "string": "For example, the sentence \"He went to school\" has a single Scene whose Process is \"went\"."}, {"id": 91, "string": "The two Participants are \"He\" and \"to school\"."}, {"id": 92, "string": "Scenes can have several roles in the text."}, {"id": 93, "string": "First, they can provide additional information about an established entity (Elaborator Scenes), commonly participles or relative clauses."}, {"id": 94, "string": "For example, \"(child) who went to school\" is an Elaborator Scene in \"The child who went to school is John\" (\"child\" serves both as an argument in the Elaborator Scene and as the Center)."}, {"id": 95, "string": "A Scene may also be a Participant in another Scene."}, {"id": 96, "string": "For example, \"John went to school\" in the sentence: \"He said John went to school\"."}, {"id": 97, "string": "In other cases, Scenes are annotated as Parallel Scenes (H), which are flat structures and may include a Linker (L), as in: \"When L [he arrives] H , [he will call them] H \"."}, {"id": 98, "string": "With respect to units which are not Scenes, the category Center denotes the semantic head."}, {"id": 99, "string": "For example, \"dogs\" is the Center of the expression \"big brown dogs\", and \"box\" is the center of \"in the box\"."}, {"id": 100, "string": "There could be more than one Center in a unit, for example in the case of coordination, where all conjuncts are Centers."}, {"id": 101, "string": "We define the minimal center of a UCCA unit u to be the UCCA graph's leaf reached by starting from u and iteratively selecting the child tagged as Center."}, {"id": 102, "string": "For generating UCCA's structures we use TUPA, a transition-based parser (Hershcovich et al., 2017) (specifically, the TUPA BiLST M model)."}, {"id": 103, "string": "TUPA uses an expressive set of transitions, able to support all structural properties required by the UCCA scheme."}, {"id": 104, "string": "Its transition classifier is based on an MLP that receives a BiLSTM encoding of elements in the parser state (buffer, stack and intermediate graph), given word embeddings and other features."}, {"id": 105, "string": "The Semantic Rules For performing DSS, we define two simple splitting rules, conditioned on UCCA's categories."}, {"id": 106, "string": "We currently only consider Parallel Scenes and Elaborator Scenes, not separating Participant Scenes, in order to avoid splitting in cases of nominalizations or indirect speech."}, {"id": 107, "string": "For example, the sentence \"His arrival surprised everyone\", which has, in addition to the Scene evoked by \"surprised\", a Participant Scene evoked by \"arrival\", is not split here."}, {"id": 108, "string": "Rule #1."}, {"id": 109, "string": "Parallel Scenes of a given sentence are extracted, separated in different sentences, and concatenated according to the order of appearance."}, {"id": 110, "string": "More formally, given a decomposition of a sentence S into parallel Scenes Sc 1 , Sc 2 , · · · Sc n (indexed by the order of the first token), we obtain the following rule, where \"|\" is the sentence delimiter: S −→ Sc1|Sc2| · · · |Scn As UCCA allows argument sharing between Scenes, the rule may duplicate the same sub-span of S across sentences."}, {"id": 111, "string": "For example, the rule will convert \"He came back home and played piano\" into \"He came back home\"|\"He played piano.\""}, {"id": 112, "string": "Rule #2."}, {"id": 113, "string": "Given a sentence S, the second rule extracts Elaborator Scenes and corresponding minimal centers."}, {"id": 114, "string": "Elaborator Scenes are then concatenated to the original sentence, where the Elaborator Scenes, except for the minimal center they elaborate, are removed."}, {"id": 115, "string": "Pronouns such as \"who\", \"which\" and \"that\" are also removed."}, {"id": 116, "string": "Formally, if {(Sc 1 , C 1 ) · · · (Sc n , C n )} are the Elaborator Scenes of S and their corresponding minimal centers, the rewrite is: S −→ S − n i=1 (Sci − Ci)|Sc1| · · · |Scn where S −A is S without the unit A."}, {"id": 117, "string": "For example, this rule converts the sentence \"He observed the planet which has 14 known satellites\" to \"He observed the planet| Planet has 14 known satellites.\"."}, {"id": 118, "string": "Article regeneration is not covered by the rule, as its output is directly fed into the NMT component."}, {"id": 119, "string": "After the extraction of Parallel Scenes and Elaborator Scenes, the resulting simplified Parallel Scenes are placed before the Elaborator Scenes."}, {"id": 120, "string": "See Figure 1 ."}, {"id": 121, "string": "Neural Component The split sentences are run through the NTS stateof-the-art neural TS system (Nisioi et al., 2017) , built using the OpenNMT neural machine translation framework (Klein et al., 2017) ."}, {"id": 122, "string": "The architecture includes two LSTM layers, with hidden states of 500 units in each, as well as global attention combined with input feeding (Luong et al., 2015) ."}, {"id": 123, "string": "Training is done with a 0.3 dropout probability (Srivastava et al., 2014) ."}, {"id": 124, "string": "This model uses alignment probabilities between the predictions and the original sentences, rather than characterbased models, to retrieve the original words."}, {"id": 125, "string": "We here consider the w2v initialization for NTS (N17), where word2vec embeddings of size 300 are trained on Google News (Mikolov et al., 2013a) and local embeddings of size 200 are trained on the training simplification corpus (Řehůřek and Sojka, 2010; Mikolov et al., 2013b) ."}, {"id": 126, "string": "Local embeddings for the encoder are trained on the source side of the training corpus, while those for the decoder are trained on the simplified side."}, {"id": 127, "string": "For sampling multiple outputs from the system, beam search is performed during decoding by generating the first 5 hypotheses at each step ordered by the log-likelihood of the target sentence given the input sentence."}, {"id": 128, "string": "We here explore both the highest (h1) and fourth-ranked (h4) hypotheses, which we show to increase the SARI score and to be much less conservative."}, {"id": 129, "string": "2 We thus experiment with two variants of the neural component, denoted by NTS-h1 and NTS-h4."}, {"id": 130, "string": "The pipeline application of the rules and the neural system results in two corresponding models: SENTS-h1 and SENTS-h4."}, {"id": 131, "string": "Experimental Setup Corpus All systems are tested on the test corpus of Xu et al."}, {"id": 132, "string": "(2016) , 3 comprising 359 sentences from the PWKP corpus (Zhu et al., 2010) Neural component."}, {"id": 133, "string": "We use the NTS-w2v model 6 provided by N17, obtained by training on the corpus of Hwang et al."}, {"id": 134, "string": "(2015) and tuning on the corpus of Xu et al."}, {"id": 135, "string": "(2016) ."}, {"id": 136, "string": "The training set is based on manual and automatic alignments between standard English Wikipedia and Simple English Wikipedia, including both good matches and partial matches whose similarity score is above the 0.45 scale threshold (Hwang et al., 2015) ."}, {"id": 137, "string": "The total size of the training set is about 280K aligned sentences, of which 150K sentences are full matches and 130K are partial matches."}, {"id": 138, "string": "7 Comparison systems."}, {"id": 139, "string": "We compare our findings to HYBRID, which is the state of the art for joint structural and lexical simplification, imple-mented by Zhang and Lapata (2017) ."}, {"id": 140, "string": "8 We use the released output of HYBRID, trained on a corpus extracted from Wikipedia, which includes the aligned sentence pairs from Kauchak (2013) , the aligned revision sentence pairs in Woodsend and Lapata (2011) , and the PWKP corpus, totaling about 296K sentence pairs."}, {"id": 141, "string": "The tuning set is the same as for the above systems."}, {"id": 142, "string": "In order to isolate the effect of NMT, we also implement SEMoses, where the neural-based component is replaced by the phrase-based MT system Moses, 9 which is also used in HYBRID."}, {"id": 143, "string": "The training, tuning and test sets are the same as in the case of SENTS."}, {"id": 144, "string": "MGIZA 10 is used for word alignment."}, {"id": 145, "string": "The KenLM language model is trained using the target side of the training corpus."}, {"id": 146, "string": "Additional baselines."}, {"id": 147, "string": "We report human and automatic evaluation scores for Identity (where the output is identical to the input), for Simple Wikipedia where the output is the corresponding aligned sentence in the PWKP corpus, and for the SBMT-SARI system, tuned against SARI (Xu et al., 2016) , which maximized the SARI score on this test set in previous works (Nisioi et al., 2017; Zhang and Lapata, 2017) ."}, {"id": 148, "string": "Automatic evaluation."}, {"id": 149, "string": "The automatic metrics used for the evaluation are: (1) BLEU (Papineni et al., 2002) (2) SARI (System output Against References and against the Input sentence; Xu et al., 2016) , which compares the n-grams of the system output with those of the input and the human references, separately evaluating the quality of words that are added, deleted and kept by the systems."}, {"id": 150, "string": "(3) F add : the addition component of the SARI score (F-score); (4) F keep : the keeping component of the SARI score (F-score); (5) P del : the deletion component of the SARI score (precision)."}, {"id": 151, "string": "11 Each metric is computed against the 8 available references."}, {"id": 152, "string": "We also assess system conservatism, reporting the percentage of sentences copied from the input (%Same), the averaged Levenshtein distance from the source (LD SC , which considers additions, deletions, and substitutions), and the number of source sentences that are split (#Split)."}, {"id": 153, "string": "12 Human evaluation."}, {"id": 154, "string": "Human evaluation is carried out by 3 in-house native English annotators, who rated the different input-output pairs for the different systems according to 4 parameters: Grammaticality (G), Meaning preservation (M), Simplicity (S) and Structural Simplicity (StS)."}, {"id": 155, "string": "Each input-output pair is rated by all 3 annotators."}, {"id": 156, "string": "Elicitation questions are given in Table 1 ."}, {"id": 157, "string": "As the selection process of the input-output pairs in the test corpus of Xu et al."}, {"id": 158, "string": "(2016) , as well as their crowdsourced references, are explicitly biased towards lexical simplification, the use of human evaluation permits us to evaluate the structural aspects of the system outputs, even where structural operations are not attested in the references."}, {"id": 159, "string": "Indeed, we show that system outputs may receive considerably higher structural simplicity scores than the source, in spite of the sample selection bias."}, {"id": 160, "string": "Following previous work (e.g., Narayan and Gardent, 2014; Xu et al., 2016; Nisioi et al., 2017) , Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale."}, {"id": 161, "string": "Note that in the first question, the input sentence is not taken into account."}, {"id": 162, "string": "The grammaticality of the input is assessed by evaluating the Identity transformation (see Table 2 ), providing a baseline for the grammaticality scores of the other systems."}, {"id": 163, "string": "Following N17, a -2 to +2 scale is used for measuring simplicity, where a 0 score indicates that the input and the output are equally complex."}, {"id": 164, "string": "This scale, compared to the standard 1 to 5 scale, permits a better differentiation between cases where simplicity is hurt (the output is more complex than the original) and between cases where the output is as simple as the original, for example in the case of the identity transformation."}, {"id": 165, "string": "Structural simplicity is also evaluated with a -2 to +2 scale."}, {"id": 166, "string": "The question for eliciting StS is accompanied with a negative example, showing a case of lexical simplification, where a complex word is replaced by a simple one (the other questions appear without examples)."}, {"id": 167, "string": "A positive example is not included so as not to bias the annotators by revealing the nature of the operations we focus on (splitting and deletion)."}, {"id": 168, "string": "We follow N17 in applying human evaluation on the first 70 sentences of the test corpus."}, {"id": 169, "string": "13 The resulting corpus, totaling 1960 sentence pairs, each annotated by 3 annotators, also include the additional experiments described in Section 7 as well as the outputs of the NTS and SENTS systems used with the default initialization."}, {"id": 170, "string": "The inter-annotator agreement, using Cohen's quadratic weighted κ (Cohen, 1968) , is computed as the average agreement of the 3 annotator pairs."}, {"id": 171, "string": "The obtained rates are 0.56, 0.75, 0.47 and 0.48 for G, M, S and StS respectively."}, {"id": 172, "string": "System scores are computed by averaging over the 3 annotators and the 70 sentences."}, {"id": 173, "string": "G Is the output fluent and grammatical?"}, {"id": 174, "string": "M Does the output preserve the meaning of the input?"}, {"id": 175, "string": "S Is the output simpler than the input?"}, {"id": 176, "string": "StS Is the output simpler than the input, ignoring the complexity of the words?"}, {"id": 177, "string": "Table 2 : Human evaluation of the different NMT-based systems."}, {"id": 178, "string": "Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale."}, {"id": 179, "string": "A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence."}, {"id": 180, "string": "The highest score in each column appears in bold."}, {"id": 181, "string": "Structural simplification systems are those that explicitly model structural operations."}, {"id": 182, "string": "Results Human evaluation."}, {"id": 183, "string": "Results are presented in Table 2 ."}, {"id": 184, "string": "First, we can see that the two SENTS systems outperform HYBRID in terms of G, M, and S. SENTS-h1 is the best scoring system, under all human measures."}, {"id": 185, "string": "In comparison to NTS, SENTS scores markedly higher on the simplicity judgments."}, {"id": 186, "string": "Meaning preservation and grammaticality are lower for SENTS, which is likely due to the more conservative nature of NTS."}, {"id": 187, "string": "Interestingly, the application of the splitting rules by themselves does not yield a considerably simpler sentence."}, {"id": 188, "string": "This likely stems from the rules not necessarily yielding grammatical sentences (NTS often serves as a grammatical error corrector over it), and from the incorporation of deletions, which are also structural operations, and are performed by the neural system."}, {"id": 189, "string": "An example of high structural simplicity scores for SENTS resulting from deletions is presented in Table 5 , together with the outputs of the other systems and the corresponding human evaluation scores."}, {"id": 190, "string": "NTS here performs lexical simplification, replacing the word \"incursions\" by \"raids\" or \"attacks\"'."}, {"id": 191, "string": "On the other hand, the high StS scores obtained by DSS and SEMoses are due to sentence splittings."}, {"id": 192, "string": "Automatic evaluation."}, {"id": 193, "string": "Results are presented in Table 3 ."}, {"id": 194, "string": "Identity obtains much higher BLEU scores than any other system, suggesting that BLEU may not be informative in this setting."}, {"id": 195, "string": "SARI seems more informative, and assigns the lowest score to Identity and the second highest to the reference."}, {"id": 196, "string": "Both SENTS systems outperform HYBRID in terms of SARI and all its 3 sub-components."}, {"id": 197, "string": "The h4 setting (hypothesis #4 in the beam) is generally best, both with and without the splitting rules."}, {"id": 198, "string": "Comparing SENTS to using NTS alone (without splitting), we see that SENTS obtains higher SARI scores when hypothesis #1 is used and that NTS obtains higher scores when hypothesis #4 is used."}, {"id": 199, "string": "This may result from NTS being more conservative than SENTS (and HYBRID), which is rewarded by SARI (conservatism is indicated by the %Same column)."}, {"id": 200, "string": "Indeed for h1, %Same is reduced from around 66% for NTS, to around 7% for SENTS."}, {"id": 201, "string": "Conservatism further decreases when h4 is used (for both NTS and SENTS)."}, {"id": 202, "string": "Examining SARI's components, we find that SENTS outperforms NTS on F add , and is comparable (or even superior for h1 setting) to NTS on P del ."}, {"id": 203, "string": "The superior SARI score of NTS over SENTS is thus entirely a result of a superior F keep , which is easier for a conservative system to maximize."}, {"id": 204, "string": "Comparing HYBRID with SEMoses, both of which use Moses, we find that SEMoses obtains higher BLEU and SARI scores, as well as G and M human scores, and splits many more sentences."}, {"id": 205, "string": "HYBRID scores higher on the human simplicity measures."}, {"id": 206, "string": "We note, however, that applying NTS alone is inferior to HYBRID in terms of simplicity, and that both components are required to obtain high simplicity scores (with SENTS)."}, {"id": 207, "string": "We also compare the sentence splitting component used in our systems (namely DSS) to that used in HYBRID, abstracting away from deletionbased and lexical simplification."}, {"id": 208, "string": "We therefore apply DSS to the test set (554 sentences) of the Table 4 : Automatic and human evaluation for the different combinations of Moses and DSS."}, {"id": 209, "string": "The automatic metrics as well as the lexical and structural properties reported (%Same: proportion of sentences copied from the input; LDSC: Averaged Levenshtein distance from the source; #Split: number of split sentences) concern the 359 sentences of the test corpus."}, {"id": 210, "string": "Human evaluation, with the G, M, S, and StS parameters, is applied to the first 70 sentences of the corpus."}, {"id": 211, "string": "The highest score in each column appears in bold."}, {"id": 212, "string": "WEB-SPLIT corpus  (See Section 2), which focuses on sentence splitting."}, {"id": 213, "string": "We compare our results to those reported for a variant of HYBRID used without the deletion module, and trained on WEB-SPLIT ."}, {"id": 214, "string": "DSS gets a higher BLEU score (46.45 vs. 39.97) and performs more splittings (number of output sentences per input sentence of 1.73 vs. 1.26)."}, {"id": 215, "string": "Additional Experiments Replacing the parser by manual annotation."}, {"id": 216, "string": "In order to isolate the influence of the parser on the results, we implement a semi-automatic version of the semantic component, which uses manual UCCA annotation instead of the parser, focusing of the first 70 sentences of the test corpus."}, {"id": 217, "string": "We employ a single expert UCCA annotator and use the UCCAApp annotation tool ."}, {"id": 218, "string": "Results are presented in Table 6 , for both SENTS and SEMoses."}, {"id": 219, "string": "In the case of SEMoses, meaning preservation is improved when manual UCCA annotation is used."}, {"id": 220, "string": "On the other hand, simplicity degrades, possibly due to the larger number of Scenes marked by the human annotator (TUPA tends to under-predict Scenes)."}, {"id": 221, "string": "This effect doesn't show with SENTS, where trends are similar to the automatic parses case, and high simplicity scores are obtained."}, {"id": 222, "string": "This demonstrates that UCCA parsing technology is sufficiently mature to be used to carry out structural simplification."}, {"id": 223, "string": "We also directly evaluate the performance of the parser by computing F1, Recall and Precision DAG scores (Hershcovich et al., 2017) , against the manual UCCA annotation."}, {"id": 224, "string": "14 We obtain for primary edges (i.e."}, {"id": 225, "string": "edges that form a tree structure) scores of 68.9 %, 70.5%, and 67.4% for F1, Recall and Precision respectively."}, {"id": 226, "string": "For remotes edges (i.e."}, {"id": 227, "string": "additional edges, forming a DAG), the scores are 45.3%, 40.5%, and 51.5%."}, {"id": 228, "string": "These results are comparable with the out-of-domain results reported by Hershcovich et al."}, {"id": 229, "string": "(2017) ."}, {"id": 230, "string": "Experiments on Moses."}, {"id": 231, "string": "We test other variants of SEMoses, where phrase-based MT is used instead of NMT."}, {"id": 232, "string": "Specifically, we incorporate semantic information in a different manner by implementing two additional models: (1) SETrain1-Moses, where a new training corpus is obtained by applying the splitting rules to the target side of the G M S StS Identity In return, Rollo swore fealty to Charles, converted to Christianity, and undertook to defend the northern region of France against the incursions of other Viking groups."}, {"id": 233, "string": "5.00 5.00 0.00 0.00 Simple Wikipedia In return, Rollo swore fealty to Charles, converted to Christianity, and swore to defend the northern region of France against raids by other Viking groups."}, {"id": 234, "string": "4.67 5.00 1.00 0.00 SBMT-SARI In return, Rollo swore fealty to Charles, converted to Christianity, and set out to defend the north of France from the raids of other viking groups."}, {"id": 235, "string": "4.67 4.67 0.67 0.00 NTS-h1 In return, Rollo swore fealty to Charles, converted to Christianity, and undertook to defend the northern region of France against the raids of other Viking groups."}, {"id": 236, "string": "5.00 5.00 1.00 0.00 NTS-h4 In return, Rollo swore fealty to Charles, converted to Christianity, and undertook to defend the northern region of France against the attacks of other Viking groups."}, {"id": 237, "string": "4.67 5.00 1.00 0.00 DSS Rollo swore fealty to Charles."}, {"id": 238, "string": "Rollo converted to Christianity."}, {"id": 239, "string": "Rollo undertook to defend the northern region of France against the incursions of other viking groups."}, {"id": 240, "string": "4.00 4.33 1.33 1.33 HYBRID In return Rollo swore, and undertook to defend the region of France., Charles, converted 2.33 2.00 0.33 0.33 SEMoses Rollo swore put his seal to Charles."}, {"id": 241, "string": "Rollo converted to Christianity."}, {"id": 242, "string": "Rollo undertook to defend the northern region of France against the incursions of other viking groups."}, {"id": 243, "string": "3.33 4.00 1.33 1.33 SENTS-h1 Rollo swore fealty to Charles."}, {"id": 244, "string": "5.00 2.00 2.00 2.00 SENTS-h4 Rollo swore fealty to Charles and converted to Christianity."}, {"id": 245, "string": "5.00 2.67 1.33 1.33 Table 5 : System outputs for one of the test sentences with the corresponding human evaluation scores (averaged over the 3 annotators)."}, {"id": 246, "string": "Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale."}, {"id": 247, "string": "A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence."}, {"id": 248, "string": "Table 6 : Human evaluation using manual UCCA annotation."}, {"id": 249, "string": "Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale."}, {"id": 250, "string": "A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence."}, {"id": 251, "string": "X m refers to the semi-automatic version of the system X. training corpus; (2) SETrain2-Moses, where the rules are applied to the source side."}, {"id": 252, "string": "The resulting parallel corpus is concatenated to the original training corpus."}, {"id": 253, "string": "We also examine whether training a language model (LM) on split sentences has a positive effect, and train the LM on the split target side."}, {"id": 254, "string": "For each system X, the version with the LM trained on split sentences is denoted by X LM ."}, {"id": 255, "string": "We repeat the same human and automatic evaluation protocol as in §6, presenting results in Table  4 ."}, {"id": 256, "string": "Simplicity scores are much higher in the case of SENTS (that uses NMT), than with Moses."}, {"id": 257, "string": "The two best systems according to SARI are SEMoses and SEMoses LM which use DSS."}, {"id": 258, "string": "In fact, they resemble the performance of DSS applied alone (Tables 2 and 3) , which confirms the high degree of conservatism observed by Moses in simplification (Alva-Manchego et al., 2017) ."}, {"id": 259, "string": "Indeed, all Moses-based systems that don't apply DSS as preprocessing are conservative, obtaining high scores for BLEU, grammaticality and meaning preservation, but low scores for simplicity."}, {"id": 260, "string": "Training the LM on split sentences shows little improvement."}, {"id": 261, "string": "Conclusion We presented the first simplification system combining semantic structures and neural machine translation, showing that it outperforms existing lexical and structural systems."}, {"id": 262, "string": "The proposed approach addresses the over-conservatism of MTbased systems for TS, which often fail to modify the source in any way."}, {"id": 263, "string": "The semantic component performs sentence splitting without relying on a specialized corpus, but only an off-theshelf semantic parser."}, {"id": 264, "string": "The consideration of sentence splitting as a decomposition of a sentence into its Scenes is further supported by recent work on structural TS evaluation (Sulem et al., 2018) , which proposes the SAMSA metric."}, {"id": 265, "string": "The two works, which apply this assumption to different ends (TS system construction, and TS evaluation), confirm its validity."}, {"id": 266, "string": "Future work will leverage UCCA's cross-linguistic applicability to support multi-lingual TS and TS pre-processing for MT."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 29}, {"section": "Related Work", "n": "2", "start": 30, "end": 82}, {"section": "Semantic Representation", "n": "3.1", "start": 83, "end": 104}, {"section": "The Semantic Rules", "n": "3.2", "start": 105, "end": 120}, {"section": "Neural Component", "n": "4", "start": 121, "end": 130}, {"section": "Experimental Setup", "n": "5", "start": 131, "end": 181}, {"section": "Results", "n": "6", "start": 182, "end": 214}, {"section": "Additional Experiments", "n": "7", "start": 215, "end": 260}, {"section": "Conclusion", "n": "8", "start": 261, "end": 266}], "figures": [{"filename": "../figure/image/994-Table6-1.png", "caption": "Table 6: Human evaluation using manual UCCA annotation. Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale. A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence. Xm refers to the semi-automatic version of the system X.", "page": 8, "bbox": {"x1": 101.75999999999999, "x2": 258.24, "y1": 281.76, "y2": 335.03999999999996}}, {"filename": "../figure/image/994-Table5-1.png", "caption": "Table 5: System outputs for one of the test sentences with the corresponding human evaluation scores (averaged over the 3 annotators). Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale. A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence.", "page": 8, "bbox": {"x1": 72.0, "x2": 529.4399999999999, "y1": 63.839999999999996, "y2": 227.04}}, {"filename": "../figure/image/994-Table4-1.png", "caption": "Table 4: Automatic and human evaluation for the different combinations of Moses and DSS. The automatic metrics as well as the lexical and structural properties reported (%Same: proportion of sentences copied from the input; LDSC: Averaged Levenshtein distance from the source; #Split: number of split sentences) concern the 359 sentences of the test corpus. Human evaluation, with the G, M, S, and StS parameters, is applied to the first 70 sentences of the corpus. The highest score in each column appears in bold.", "page": 7, "bbox": {"x1": 80.64, "x2": 515.04, "y1": 248.64, "y2": 324.96}}, {"filename": "../figure/image/994-Table3-1.png", "caption": "Table 3: The left-hand side of the table presents BLEU and SARI scores for the combinations of NTS and DSS, as well as for the baselines. The highest score in each column appears in bold. The right hand side presents lexical and structural properties of the outputs. %Same: proportion of sentences copied from the input; LDSC: Averaged Levenshtein distance from the source; #Split: number of split sentences. Structural simplification systems are those that explicitly model structural operations.", "page": 7, "bbox": {"x1": 137.76, "x2": 457.44, "y1": 62.879999999999995, "y2": 190.07999999999998}}, {"filename": "../figure/image/994-Figure1-1.png", "caption": "Figure 1: Example applications of rules 1 (Figure 1a) and 2 (Figure 1b). In both cases, the original sentence, the semantic parse, the extracted Scenes with the required modifications, and the output of the rules are presented top to bottom. The UCCA categories used are: Parallel Scene (H), Linker (L), Participant (A), Process/State (P/S), Center (C), Elaborator (E), Relator (R).", "page": 3, "bbox": {"x1": 72.0, "x2": 528.0, "y1": 62.879999999999995, "y2": 286.08}}, {"filename": "../figure/image/994-Table1-1.png", "caption": "Table 1: Questions for the human evaluation.", "page": 6, "bbox": {"x1": 79.67999999999999, "x2": 282.24, "y1": 209.76, "y2": 268.32}}, {"filename": "../figure/image/994-Table2-1.png", "caption": "Table 2: Human evaluation of the different NMT-based systems. Grammaticality (G) and Meaning preservation (M) are measured using a 1 to 5 scale. A -2 to +2 scale is used for measuring simplicity (S) and structural simplicity (StS) of the output relative to the input sentence. The highest score in each column appears in bold. Structural simplification systems are those that explicitly model structural operations.", "page": 6, "bbox": {"x1": 96.96, "x2": 264.0, "y1": 296.64, "y2": 425.28}}]}