{"title": "Making Sense of Massive Amounts of Scientific Publications: the Scientific Knowledge Miner Project", "abstract": "The World Wide Web has become the hugest repository ever for scientific publications and it continues to increase at an unprecedented rate. Nevertheless, this information overload makes the exploration of this content a very time-consuming task. In this landscape, the availability of text mining tools to characterize and explore distinctive features of the scientific literature is mandatory. We present the Scientific Knowledge Miner (SKM) Project, that aims to investigate new approaches and frameworks to facilitate the extraction of knowledge from scientific publications across different disciplines. More specifically, we will focus on citation characterization, recommendation and scientific document summarization.", "text": [{"id": 0, "string": "Introduction: During the last decade the amount of scientific information available on-line increased at an unprecedented rate."}, {"id": 1, "string": "Recent estimates reported that a new paper is published every 20 seconds [1] ."}, {"id": 2, "string": "PubMed 1 , Elsevier' Scopus 2 and Thomson Reuther's ISI Web of Knowledge 3 respectively contain more than 24, 57 and 90 million papers."}, {"id": 3, "string": "In this scenario, the exploration of scientific literature has turned into an extremely complex and timeconsuming task."}, {"id": 4, "string": "The availability of text mining tools able to extract, aggregate and turn scientific unstructured textual contents into well organized and interconnected knowledge is fundamental."}, {"id": 5, "string": "However, scientific publications are characterized by several structural (title, abstract, figures, citations...), linguistic and semantic peculiarities that make them difficult to analyze by relying on general purpose text mining tools."}, {"id": 6, "string": "One of the special features of scientific papers is their network of citations, that are starting to be exploited in several context including opinion mining [2, 7] and scientific text summarization [3, 8] ."}, {"id": 7, "string": "Besides citations, the interpretation of the semantics of the actual textual contents of scientific papers usually needs the availability of knowledge repositories with an adequate coverage of scientific concepts and relations that could not be found on global domain knowledge resources like WordNet, DBPedia, FreeBase or BabelNet."}, {"id": 8, "string": "Considering both the peculiar structural and semantic features of scientific publications and the huge amounts of papers that need to be taken into account when we mine scientific literature, customized information extraction, semantic indexing, search and content aggregation approaches are required in order to fully take advantage of the knowledge exposed by scientific articles."}, {"id": 9, "string": "In this context, we present the Scientific Knowledge Miner (SKM) Project."}, {"id": 10, "string": "It aims at developing both knowledge resources and a complex scientific knowledge mining infrastructure that will be exploited to support fine-grained semantic analysis and largescale studies of scientific document collections."}, {"id": 11, "string": "In the context of the SKM Project, we are going to analyze publications by relying and extending the Dr."}, {"id": 12, "string": "Inventor Scientific Text Mining Framework [9] (DRI Framework), a freely available Java-based library."}, {"id": 13, "string": "The DRI Framework enables the automated analysis and characterization of several facets of publications including the identification of the scientific discourse category of sentences (Approach, Background, Future Work, etc."}, {"id": 14, "string": "), the characterization of the purpose of citations and the annotation of Named Entities that occur inside the textual contents of a paper 4 ."}, {"id": 15, "string": "By performing fine-grained semantic analysis of articles and aggregating and merging this information across collections of papers, the scientific literature analysis supported by the SKM Project are characterized by a different, deeper level granularity when compared to platforms like CiteSeer and GoogleScholar: these platforms mainly aggregate scientific papers by extracting and normalizing a structured set of metadata, including titles, authors, citation counts, etc."}, {"id": 16, "string": "In the SKM Project, the DRI Framework will be properly complemented by ad-hoc data normalization, indexing and content visualization infrastructures that will allow the integration of information across papers and the execution of large-scale experiments."}, {"id": 17, "string": "Overview of the SKM Project The core objective of the SKM Project is the investigation of new approaches, the extension and development of software tools and the creation of new datasets that will facilitate the extraction of knowledge from scientific publications across different disciplines."}, {"id": 18, "string": "In particular, we have identified three core research topics that we would like to explore thanks to the SKM Project: 1."}, {"id": 19, "string": "The analysis, the characterization and the navigation of collections of research papers in order to test new, alternative metrics to evaluate their quality; 2."}, {"id": 20, "string": "The investigation of new, state of the art multi-document summarization approaches, tailored to scientific publications; 3."}, {"id": 21, "string": "The evaluation of new approaches to scientific content recommendation that relies on both the contents of a paper and its relations with other scientific results."}, {"id": 22, "string": "To investigate these research topics, we will carry out the following activities: extension and improvement of the Dr."}, {"id": 23, "string": "Inventor Text Mining Framework 5 , a Java library that integrates several Document Engineering and Natural Language Processing tools customized to enable and ease the analysis of the textual contents of scientific publications, both in PDF and JATS XML format."}, {"id": 24, "string": "To get more information on the framework, the interested reader can refer to [9] ."}, {"id": 25, "string": "In the SKM Project will extend the Framework by implementing semi-supervised or unsupervised methods for citation classification (polarity and purpose) and semantically aware relation extraction (e.g."}, {"id": 26, "string": "causal inference), both features useful to support information extraction and automated semantic enrichment of scientific texts; enrichment with new features of the SUMMA document summarization Java library [10] ."}, {"id": 27, "string": "In particular, SUMMA will be able to support the summarization of scientific texts by relying on citation-based summarization approaches (both sentence and paper assessment based on peers opinion)."}, {"id": 28, "string": "We will also implement state of the art multi-document summarization customized to scientific papers, based on the extraction and aggregation of relevant sentences across publications in order to automatically create surveys; implementation of new methodologies for semantic enrichment, interlinking, indexing and navigation of corpora of scientific papers."}, {"id": 29, "string": "We will develop Web crawling approaches specialized to repositories of scientific publications and model relevant structured Web contents (such as conference Websites) in order to complement, enrich or interlink the information mined from scientific publications."}, {"id": 30, "string": "In the meanwhile, we will complement this activities by the definition of proper content indexing, normalization, search and aggregation methodologies and infrastructures to enable the aggregation and browsing of the information extracted from huge collections of scientific publications; creation and sharing of semantically enhanced scientific datasets to train and validate new information extraction approaches."}, {"id": 31, "string": "To this purpose we will take advantage of Annote 6 , the Web based collaborative annotation tool we developed in the context of Dr."}, {"id": 32, "string": "Inventor to support annotators in carrying out complex annotation tasks such as rhetorical sentence classification or summarization."}, {"id": 33, "string": "SKM scientific publication mining infrastructure In this section we introduce the high-level architecture of the infrastructure to crawl, process, index and visualize the contents of corpora of scientific publications in the context of the SKM Project (see Figure 1 )."}, {"id": 34, "string": "Our initial target collections of contents to analyze include open access Web sites of publishers, conferences as well as any kind of on-line repository of scientific publications."}, {"id": 35, "string": "The crawler gathers papers and metadata (name of the conference, editors of a journal paper, etc.)"}, {"id": 36, "string": "from the input Web sites."}, {"id": 37, "string": "The original paper (in PDF or XML) is stored in a repository together with its metadata."}, {"id": 38, "string": "Then, the contents of each paper are This platform is based on Lucene and has been designed to efficiently search across multiple documents, stored using the JSON format."}, {"id": 39, "string": "Contents from different papers are linked by applying title and author normalization procedures."}, {"id": 40, "string": "We will explore and analyze the collections of papers by directly querying Elastic Search by a graphical interface named Kibana."}, {"id": 41, "string": "In Figure 2 we show some preliminary visualization of the information mined from a paper by the DRI Framework."}, {"id": 42, "string": "These visualizations can be accesse on-line at: http://backingdata.org/dri/viz/."}, {"id": 43, "string": "Fig."}, {"id": 44, "string": "2 ."}, {"id": 45, "string": "Web based visualization of the information extracted from a paper thanks to the DRI Framework."}, {"id": 46, "string": "In particular, we can see highlighted in bold the sentences of the paper classified as approach."}, {"id": 47, "string": "Scientific information analysis use cases In this section we briefly present the three core use cases we are going to investigate in the context of the SKM Project."}, {"id": 48, "string": "Even if our initial investigations will be focused on the exploration of these three application scenarios, the scientific publication mining infrastructure that constitutes the core of the SKM Project (see Section 3) can be easily adapted and thus exploited in any other context related to the analysis of large corpora of papers."}, {"id": 49, "string": "Characterization of citations' purpose and polarity The network of citations across papers constitutes one of the most characteristic traits of scientific publications: when a paper cites the work presented in another one the author explicitly identifies a relevant connection among both works."}, {"id": 50, "string": "The count of the citation that a paper receives constitute the basis of the most common metrics exploited to evaluate the scientific production of papers, journals and researchers (i.e."}, {"id": 51, "string": "h-index)."}, {"id": 52, "string": "The effectiveness of citation-based research evaluation metrics would benefit from the possibility to take into account not only the number of citations a paper receives but also the purpose and the polarity of each one of them."}, {"id": 53, "string": "Several classification schemata and approaches have been proposed to characterize aspects related to the purpose and polarity of citations [2, 12] ."}, {"id": 54, "string": "By relying on and extending the set of annotated citation included in the Dr."}, {"id": 55, "string": "Inventor Multi-Layered Annotated Corpus of Scientific Papers [5] 8 , we aim at exploring new approaches to citation purpose and polarity classification, by placing special attention on their robustness across domains and on the limited availability of manually annotated data."}, {"id": 56, "string": "Scientific document summarization Nowadays, the possibility to automatically identify the most relevant contents across a set of scientific publications is essential to deal with and perform screenings of the huge amount of articles currently available on-line."}, {"id": 57, "string": "Several approaches to scientific papers summarization have been proposed [3, 8, 11] ."}, {"id": 58, "string": "Most of them extend general purpose document summarization methodologies by considering information facets that are characteristic of scientific publications."}, {"id": 59, "string": "In particular, the sentences of the papers in which the article to summarize is cited provide valuable material to improve the quality of scientific summarization."}, {"id": 60, "string": "Also the possibility to consider the rhetorical structure (background, approach, future work, etc.)"}, {"id": 61, "string": "of the different excerpts of the contents of a paper to summarize provides valuable information to generate summaries that include contents better balanced across the sections of a paper."}, {"id": 62, "string": "In the SKM Project, we aim at investigating different strategies to improve content and graph-based summarization approaches by considering typed citation networks and by relying on the automated characterization of the rhetorical structure of scientific publications implemented by the DRI Framework."}, {"id": 63, "string": "Recommender system for citations Citation recommendation is a complex task because of the difficulty in matching excerpts of the source paper to the contents of huge amounts of other candidate articles to be cited."}, {"id": 64, "string": "Among the many approaches proposed, many of them rely on text classification as well as on question answering and query ranking [4, 6] ."}, {"id": 65, "string": "The goal of the SKM Project is to develop a recommender system for citations, that helps authors to find relevant articles by relying both on the semantic information extracted by the DRI Framework and on the data aggregated across corpora of papers crawled from the Web."}, {"id": 66, "string": "In order to test our system, we will define a prediction task, where learning from the past, we will try to predict which citations a given article will contain."}, {"id": 67, "string": "Conclusions We introduced Scientific Knowledge Miner (SKM), a project that will facilitate the extraction of knowledge from scientific publications."}, {"id": 68, "string": "We briefly described the SKM scientific publication mining infrastructure that will be exploited to analyze corpora of scientific papers, thus supporting large-scale investigations of scientific contents."}, {"id": 69, "string": "We also presented our future venues of research by describing the three main application scenarios that we plan to investigate in the near future in the context of the SKM Project: characterization of the purpose and polarity of citation, summarization of scientific document and citation recommedation."}], "headers": [{"section": "Introduction:", "n": "1", "start": 0, "end": 16}, {"section": "Overview of the SKM Project", "n": "2", "start": 17, "end": 32}, {"section": "SKM scientific publication mining infrastructure", "n": "3", "start": 33, "end": 45}, {"section": "Scientific information analysis use cases", "n": "4", "start": 46, "end": 48}, {"section": "Characterization of citations' purpose and polarity", "n": "4.1", "start": 49, "end": 55}, {"section": "Scientific document summarization", "n": "4.2", "start": 56, "end": 62}, {"section": "Recommender system for citations", "n": "4.3", "start": 63, "end": 65}, {"section": "Conclusions", "n": "5", "start": 66, "end": 69}], "figures": [{"filename": "../figure/image/999-Figure2-1.png", "caption": "Fig. 2. Web based visualization of the information extracted from a paper thanks to the DRI Framework. In particular, we can see highlighted in bold the sentences of the paper classified as approach.", "page": 3, "bbox": {"x1": 193.92, "x2": 421.44, "y1": 341.76, "y2": 464.15999999999997}}, {"filename": "../figure/image/999-Figure1-1.png", "caption": "Fig. 1. Steps/components of our architecture", "page": 3, "bbox": {"x1": 145.92, "x2": 472.32, "y1": 118.08, "y2": 164.16}}]}