{"title": "A Factory of Comparable Corpora from Wikipedia", "abstract": "Multiple approaches to grab comparable data from the Web have been developed up to date. Nevertheless, coming out with a high-quality comparable corpus of a specific topic is not straightforward. We present a model for the automatic extraction of comparable texts in multiple languages and on specific topics from Wikipedia. In order to prove the value of the model, we automatically extract parallel sentences from the comparable collections and use them to train statistical machine translation engines for specific domains. Our experiments on the English-Spanish pair in the domains of Computer Science, Science, and Sports show that our in-domain translator performs significantly better than a generic one when translating in-domain Wikipedia articles. Moreover, we show that these corpora can help when translating out-of-domain texts.", "text": [{"id": 0, "string": "Introduction Multilingual corpora with different levels of comparability are useful for a range of natural language processing (NLP) tasks."}, {"id": 1, "string": "Comparable corpora were first used for extracting parallel lexicons (Rapp, 1995; Fung, 1995) ."}, {"id": 2, "string": "Later they were used for feeding statistical machine translation (SMT) systems (Uszkoreit et al., 2010) and in multilingual retrieval models (Schönhofen et al., 2007; Potthast et al., 2008) ."}, {"id": 3, "string": "SMT systems estimate the statistical models from bilingual texts (Koehn, 2010) ."}, {"id": 4, "string": "Since only the words that appear in the corpus can be translated, having a corpus of the right domain is important to have high coverage."}, {"id": 5, "string": "However, it is evident that no large collections of parallel texts for all domains and language pairs exist."}, {"id": 6, "string": "In some cases, only general-domain parallel corpora are available; in some others there are no parallel resources at all."}, {"id": 7, "string": "One of the main sources of parallel data is the Web: websites in multiple languages are crawled and contents retrieved to obtain multilingual data."}, {"id": 8, "string": "Wikipedia, an on-line community-curated encyclopaedia with editions in multiple languages, has been used as a source of data for these purposesfor instance, (Adafre and de Rijke, 2006; Potthast et al., 2008; Otero and López, 2010; Plamada and Volk, 2012) ."}, {"id": 9, "string": "Due to its encyclopaedic nature, editors aim at organising its content within a dense taxonomy of categories."}, {"id": 10, "string": "1 Such a taxonomy can be exploited to extract comparable and parallel corpora on specific topics and knowledge domains."}, {"id": 11, "string": "This allows to study how different topics are analysed in different languages, extract multilingual lexicons, or train specialised machine translation systems, just to mention some instances."}, {"id": 12, "string": "Nevertheless, the process is not straightforward."}, {"id": 13, "string": "The community-generated nature of the Wikipedia has produced a reasonably good -yet chaotic-taxonomy in which categories are linked to each other at will, even if sometimes no relationship among them exists, and the borders dividing different areas are far from being clearly defined."}, {"id": 14, "string": "The rest of the paper is distributed as follows."}, {"id": 15, "string": "We briefly overview the definition of comparability levels in the literature and show the difficulties inherent to extracting comparable corpora from Wikipedia (Section 2)."}, {"id": 16, "string": "We propose a simple and effective platform for the extraction of comparable corpora from Wikipedia (Section 3)."}, {"id": 17, "string": "We describe a simple model for the extraction of parallel sentences from comparable corpora (Section 4) ."}, {"id": 18, "string": "Experimental results are reported on each of these sub-tasks for three domains using the English and Spanish Wikipedia editions."}, {"id": 19, "string": "We present an application-oriented evaluation of the comparable corpora by studying the impact of the extracted parallel sentences on a statistical machine translation system (Section 5)."}, {"id": 20, "string": "Finally, we draw conclusions and outline ongoing work (Section 6)."}, {"id": 21, "string": "Background Comparability in multilingual corpora is a fuzzy concept that has received alternative definitions without reaching an overall consensus (Rapp, 1995; Eagles Document Eag-Tcwg-Ctyp, 1996; Fung, 1998; Fung and Cheung, 2004; Wu and Fung, 2005; McEnery and Xiao, 2007; Sharoff et al., 2013) ."}, {"id": 22, "string": "Ideally, a comparable corpus should contain texts in multiple languages which are similar in terms of form and content."}, {"id": 23, "string": "Regarding content, they should observe similar structure, function, and a long list of characteristics: register, field, tenor, mode, time, and dialect (Maia, 2003) ."}, {"id": 24, "string": "Nevertheless, finding these characteristics in real-life data collections is virtually impossible."}, {"id": 25, "string": "Therefore, we attach to the following simpler four-class classification (Skadiņa et al., 2010) : (i) Parallel texts are true and accurate translations or approximate translations with minor languagespecific variations."}, {"id": 26, "string": "(ii) Strongly comparable texts are closely related texts reporting the same event or describing the same subject."}, {"id": 27, "string": "(iii) Weakly comparable texts include texts in the same narrow subject domain and genre, but describing different events, as well as texts within the same broader domain and genre, but varying in sub-domains and specific genres."}, {"id": 28, "string": "(iv) Non-comparable texts are pairs of texts drawn at random from a pair of very large collections of texts in two or more languages."}, {"id": 29, "string": "Wikipedia is a particularly suitable source of multilingual text with different levels of comparability, given that it covers a large amount of languages and topics."}, {"id": 30, "string": "2 Articles can be connected via interlanguage links (i.e., a link from a page in one Wikipedia language to an equivalent page in another language)."}, {"id": 31, "string": "Although there are some missing links and an article can be linked by two or more articles from the same language (Hecht and Gergle, 2010) , the number of available links allows to exploit the multilinguality of Wikipedia."}, {"id": 32, "string": "Still, extracting a comparable corpus on a specific domain from Wikipedia is not so straightforward."}, {"id": 33, "string": "One can take advantage of the usergenerated categories associated to most articles."}, {"id": 34, "string": "Ideally, the categories and sub-categories would compose a hierarchically organized taxonomy, e.g., in the form of a category tree."}, {"id": 35, "string": "Nevertheless, 2 Wikipedia contains 288 language editions out of which 277 are active and 12 have more than 1M articles at the time of writing, June 2015 (http://en.wikipedia.org/ wiki/List_of_Wikipedias)."}, {"id": 36, "string": "Sport Sports Mountain sports  the categories in Wikipedia compose a denselyconnected graph with highly overlapping categories, cycles, etc."}, {"id": 37, "string": "As they are manually-crafted, the categories are somehow arbitrary and, among other consequences, the potential categorisation of articles does not accomplish with the properties for representing the desirable -trusty enoughcategorisation of articles from different domains."}, {"id": 38, "string": "Moreover, many articles are not associated to the categories they should belong to and there is a phenomenon of over-categorization."}, {"id": 39, "string": "3 Figure 1 is an example of the complexity of Wikipedia's category graph topology."}, {"id": 40, "string": "Although this particular example comes from the Wikipedia in Spanish, similar phenomena exist in other editions."}, {"id": 41, "string": "Firstly, the paths from different apparently unrelated categories -Sport and Science-, converge in a common node soon in the graph (node Pyrenees)."}, {"id": 42, "string": "As a result, not only Pyrenees could be considered as a sub-category of both Sport and Science, but all its descendants."}, {"id": 43, "string": "Secondly, cycles exist among the different categories, as in the sequence Mountains of Andorra → Pyrenees → Mountains of the Pyrenees → Mountains of Andorra."}, {"id": 44, "string": "Mountaineering Mountains Mountains of Andorra Ideally, every sub-category of a category should share the same attributes, since the \"failure to observe this principle reduces the predictability [of the taxonomy] and can lead to cross-classification\" (Rowley and Hartley, 2000, p. 196) ."}, {"id": 45, "string": "Although fixing this issue -inherent to all the Wikipedia editions-falls out of the scope of our research, some heuristic strategies are necessary to diminish their impact in the domain definition process."}, {"id": 46, "string": "Plamada and Volk (2012) dodge this issue by extracting a domain comparable corpus using IR techniques."}, {"id": 47, "string": "They use the characteristic vocabulary of the domain (100 terms extracted from an external in-domain corpus) to query a Lucene search engine 4 over the whole encyclopaedia."}, {"id": 48, "string": "Our approach is completely different: we try to get along with Wikipedia's structure with a strategy to walk through the category graph departing from a root or pseudo-root category, which defines our domain of interest."}, {"id": 49, "string": "We empirically set a threshold to stop exploring the graph such that the included categories most likely represent an entire domain (cf."}, {"id": 50, "string": "Section 3)."}, {"id": 51, "string": "This approach is more similar to Cui et al."}, {"id": 52, "string": "(2008) , who explore the Wiki-Graph and score every category in order to assess its likelihood of belonging to the domain."}, {"id": 53, "string": "Other tools are being developed to extract corpora from Wikipedia."}, {"id": 54, "string": "Linguatools 5 released a comparable corpus extracted from Wikipedias in 253 language pairs."}, {"id": 55, "string": "Unfortunately, neither their tool nor the applied methodology description are available."}, {"id": 56, "string": "CatScan2 6 is a tool that allows to explore and search categories recursively."}, {"id": 57, "string": "The Accurat toolkit (Pinnis et al., 2012 ; Ş tefȃnescu, Dan and Ion, Radu and Hunsicker, Sabine, 2012) 7 aligns comparable documents and extracts parallel sentences, lexicons, and named entities."}, {"id": 58, "string": "Finally, the most related tool to ours: CorpusPedia 8 extracts non-aligned, softly-aligned, and strongly-aligned comparable corpora from Wikipedia (Otero and López, 2010) ."}, {"id": 59, "string": "The difference with respect to our model is that they only consider the articles associated to one specific category and not to an entire domain."}, {"id": 60, "string": "The inter-connection among Wikipedia editions in different languages has been exploited for multiple tasks including lexicon induction (Erdmann et al., 2008) , extraction of bilingual dictionaries (Yu and Tsujii, 2009) , and identification of particular translations (Chu et al., 2014; Prochasson and Fung, 2011) ."}, {"id": 61, "string": "Different cross-language NLP tasks have particularly taken advantage of Wikipedia."}, {"id": 62, "string": "Articles have been used for query translation (Schönhofen et al., 2007) and crosslanguage semantic representations for similarity estimation (Cimiano et al., 2009; Potthast et al., 2008; Sorg and Cimiano, 2012) ."}, {"id": 63, "string": "The extraction of parallel corpora from Wikipedia has been a hot topic during the last years (Adafre and de Rijke, 2006; Patry and Langlais, 2011; Plamada and Volk, 2012; Smith et al., 2010; Tomás et al., 2008; Yasuda and Sumita, 2008) ."}, {"id": 64, "string": "Domain-Specific Comparable Corpora Extraction In this section we describe our proposal to extract domain-specific comparable corpora from Wikipedia."}, {"id": 65, "string": "The input to the pipeline is the top category of the domain (e.g., Sport)."}, {"id": 66, "string": "The terminology used in this description is as follows."}, {"id": 67, "string": "Let c be a Wikipedia category and c * be the top category of a domain."}, {"id": 68, "string": "Let a be a Wikipedia article; a ∈ c if a contains c among its categories."}, {"id": 69, "string": "Let G be the Wikipedia category graph."}, {"id": 70, "string": "Vocabulary definition."}, {"id": 71, "string": "The domain vocabulary represents the set of terms that better characterises the domain."}, {"id": 72, "string": "We do not expect to have at our disposal the vocabulary associated to every category."}, {"id": 73, "string": "Therefore, we build it from the Wikipedia itself."}, {"id": 74, "string": "We collect every article a ∈ c * and apply standard pre-processing; i.e., tokenisation, stopwording, numbers and punctuation marks filtering, and stemming (Porter, 1980) ."}, {"id": 75, "string": "In order to reduce noise, tokens shorter than four characters are discarded as well."}, {"id": 76, "string": "The vocabulary is then composed of the top n terms, ranked by term frequency."}, {"id": 77, "string": "This value is empirically determined."}, {"id": 78, "string": "Graph exploration."}, {"id": 79, "string": "The input for this step is G, c * (i.e., the departing node in the graph), and the domain vocabulary."}, {"id": 80, "string": "Departing from c * , we perform a breadth-first search, looking for all those categories which more likely belong to the required domain."}, {"id": 81, "string": "Two constraints are applied in order to make a controlled exploration of the graph: (i) in order to avoid loops and exploring already traversed paths, a node can only be visited once, (ii) in order to avoid exploring the whole categories graph, a stopping criterion is pre-defined."}, {"id": 82, "string": "Our stopping criterion is inspired by the classification tree-breadth first search algorithm (Cui et al., 2008) ."}, {"id": 83, "string": "The core idea is scoring the explored cate- gories to determine if they belong to the domain."}, {"id": 84, "string": "Our heuristic assumes that a category belongs to the domain if its title contains at least one of the terms in the characteristic vocabulary."}, {"id": 85, "string": "Nevertheless, many categories exist that may not include any of the terms in the vocabulary."}, {"id": 86, "string": "(e.g., consider category pato in Spanish -literally \"duck\" in English-which, somehow surprisingly, refers to a sport rather than an animal)."}, {"id": 87, "string": "Our naïve solution to this issue is to consider subsets of categories according to their depth respect to the root."}, {"id": 88, "string": "An entire level of categories is considered part of the domain if a minimum percentage of its elements include vocabulary terms."}, {"id": 89, "string": "In our experiments we use the English and Spanish Wikipedia editions."}, {"id": 90, "string": "9 Table 1 shows some statistics, after filtering disambiguation and redirect pages."}, {"id": 91, "string": "The intersection of articles and categories between the two languages represents the ceiling for the amount of parallel corpora one can gather for this pair."}, {"id": 92, "string": "We focus on three domains: Computer Science (CS), Science (Sc), and Sports (Sp) -the top categories c * from which the graph is explored in order to extract the corresponding comparable corpora."}, {"id": 93, "string": "Table 2 shows the number of root articles associated to c * for each domain and language."}, {"id": 94, "string": "From them, we obtain domain vocabularies with a size between 100 and 400 lemmas (right-side columns) when using the top 10% terms."}, {"id": 95, "string": "We ran experiments using the top 10%, 15%, 20% and 100%."}, {"id": 96, "string": "The relatively small size of these vocabularies allows to manually check that 10% is the best option to characterise the desired category, higher percentages add more noise than in-domain terms."}, {"id": 97, "string": "The plots in Figure 2 show the percentage of categories with at least one domain term in the ti-9 Dumps downloaded from https://dumps."}, {"id": 98, "string": "wikimedia.org in July 2013 and pre-processed with JWPL (Zesch et al., 2008) tle: the starting point for our graph-based method for selecting the in-domain articles."}, {"id": 99, "string": "As expected, nearly 100% of the categories in the root include domain terms and this percentage decreases with increasing depth in the tree."}, {"id": 100, "string": "When extracting the corpus, one must decide the adequate percentage of positive categories allowed."}, {"id": 101, "string": "High thresholds lead to small corpora whereas low thresholds lead to larger -but noisier-corpora."}, {"id": 102, "string": "As in many applications, this is a trade-off between precision and recall and depends on the intended use of the corpus."}, {"id": 103, "string": "The stopping level is selected for every language independently, but in order to reduce noise, the comparable corpus is only built from those articles that appear in both languages and are related via an interlanguage link."}, {"id": 104, "string": "We validate the quality in terms of application-based utility of the generated comparable corpora when used in a translation system (cf."}, {"id": 105, "string": "Section 5)."}, {"id": 106, "string": "Therefore, we choose to give more importance to recall and opt for the corpora obtained with a threshold of 50%."}, {"id": 107, "string": "Parallel Sentence Extraction In this section we describe a simple technique for extracting parallel sentences from a comparable corpus."}, {"id": 108, "string": "Given a pair of articles related by an interlanguage link, we estimate the similarity between all their pairs of cross-language sentences with different text similarity measures."}, {"id": 109, "string": "We repeat the process for all the pairs of articles and rank the resulting sentence pairs according to its similarity."}, {"id": 110, "string": "After defining a threshold for each measure, those sentence pairs with a similarity higher than the threshold are extracted as parallel sentences."}, {"id": 111, "string": "This is a non-supervised method that generates a noisy parallel corpus."}, {"id": 112, "string": "The quality of the similarity measures will then affect the purity of the parallel corpus and, therefore, the quality of the translator."}, {"id": 113, "string": "However, we do not need to be very restrictive with the measures here and still favour a large corpus, since the word alignment process in the SMT system can take care of part of the noise."}, {"id": 114, "string": "Similarity computation."}, {"id": 115, "string": "We compute similarities between pairs of sentences by means of cosine and length factor measures."}, {"id": 116, "string": "The cosine similarity is calculated on three well-known characterisations in cross-language information retrieval and parallel corpora alignment: (i) character ngrams (cng) (McNamee and Mayfield, 2004); (ii) pseudo-cognates (cog) (Simard et al., 1992) ; and (iii) word 1-grams, after translation into a common language, both from English to Spanish and vice versa (mono en , mono es )."}, {"id": 117, "string": "We add the (iv) length factor (len) (Pouliquen et al., 2003) as an independent measure and as penalty (multiplicative factor) on the cosine similarity."}, {"id": 118, "string": "The threshold for each of the measures just introduced is empirically set in a manually annotated corpus."}, {"id": 119, "string": "We define it as the value that maximises the F 1 score on this development set."}, {"id": 120, "string": "To create this set, we manually annotated a corpus with 30 article pairs (10 per domain) at sentence level."}, {"id": 121, "string": "We considered three sentence classes: parallel, comparable, and other."}, {"id": 122, "string": "The volunteers of the exercise were given as guidelines the definitions by Skadiņa et al."}, {"id": 123, "string": "(2010) of parallel text and strongly comparable text (cf."}, {"id": 124, "string": "Section 2)."}, {"id": 125, "string": "A pair that did not match any of these definitions had to be classified as other."}, {"id": 126, "string": "Each article pair was annotated by two volunteers, native speakers of Spanish with high command of English (a total of nine volunteers participated in the process)."}, {"id": 127, "string": "The mean agreement between annotators had a kappa coefficient (Cohen, 1960) of κ ∼ 0.7."}, {"id": 128, "string": "A third annotator resolved disagreed sentences."}, {"id": 129, "string": "10 Table 4 shows the thresholds that obtain the maximum F 1 scores."}, {"id": 130, "string": "It is worth noting that, even if the values of precision and recall are relatively low -the maximum recall is 0.57 for len-, our intention with these simple measures is not to obtain the highest performance in terms of retrieval, but injecting the most useful data to the translator, even at the cost of some noise."}, {"id": 131, "string": "The performance with character 3-grams is the best one, comparable to that of mono, with an F 1 of 0.36."}, {"id": 132, "string": "This suggests that a translator is not mandatory for performing the sentences selection."}, {"id": 133, "string": "Len and 1-grams have no discriminating power and lead to the worse scores (F 1 of 0.14 and 0.21, respectively)."}, {"id": 134, "string": "We ran a second set of experiments to explore the combination of the measures."}, {"id": 135, "string": "the performance obtained by averaging all the similarities (S), also after multiplying them by the length factor and/or the observed F 1 obtained in the previous experiment."}, {"id": 136, "string": "Even if the length factor had shown a poor performance in isolation, it helps to lift the F 1 figures consistently after affecting the similarities."}, {"id": 137, "string": "In this case, F 1 grows up to 0.43."}, {"id": 138, "string": "This impact is not so relevant when the individual F 1 is used for weightingS."}, {"id": 139, "string": "We applied all the measures -both combined and in isolation-on the entire comparable corpora previously extracted."}, {"id": 140, "string": "Table 6 shows the amount of parallel sentences extracted by applying the empirically defined thresholds of Tables 4 and 5."}, {"id": 141, "string": "As expected, more flexible alternatives, such as low-level n-grams or length factor result in a higher amount of retrieved instances, but in all cases the size of the corpora is remarkable."}, {"id": 142, "string": "For the most restricted domain, CS, we get around 200k parallel sentences for a given similarity measure."}, {"id": 143, "string": "For the widest domain, SC, we surpass the 1M sentence pairs."}, {"id": 144, "string": "As it will be shown in the following section, these sizes are already useful to be used for training SMT systems."}, {"id": 145, "string": "Some standard parallel corpora have the same order of magnitude."}, {"id": 146, "string": "For tasks other than MT, where the precision on the extracted pairs can be more important than the recall, one can obtain cleaner corpora by using a threshold that maximises precision instead of F 1 ."}, {"id": 147, "string": "CS Evaluation: Statistical Machine Translation Task In this section we validate the quality of the obtained corpora by studying its impact on statistical machine translation."}, {"id": 148, "string": "There are several parallel corpora for the English-Spanish language pair."}, {"id": 149, "string": "We select as a general-purpose corpus Europarl v7 (Koehn, 2005) , with 1.97M parallel sentences."}, {"id": 150, "string": "The order of magnitude is similar to the largest corpus we have extracted from Wikipedia, so we can compare the results in a size-independent way."}, {"id": 151, "string": "If our corpus extracted from Wikipedia was made up with parallel fragments of the desired domain, it should be the most adequate to translate these domains."}, {"id": 152, "string": "If the quality of the parallel fragments was acceptable, it should also help when translating out-of-domain texts."}, {"id": 153, "string": "In order to test these hypotheses we analyse three settings: (i) train SMT systems only with Wikipedia (WP) or Europarl (EP) to translate domain-specific texts, (ii) train SMT systems with Wikipedia and Europarl to translate domain-specific texts, and (iii) train SMT systems with Wikipedia and Europarl to translate out-of-domain texts (news)."}, {"id": 154, "string": "For the out-of-domain evaluation we use the News Commentaries 2011 test set and the News Commentaries 2009 for development."}, {"id": 155, "string": "11 For the in-domain evaluation we build the test and development sets in a semiautomatic way."}, {"id": 156, "string": "We depart from the parallel corpora gathered in Section 4 from which sentences with more than four tokens and beginning with a letter are selected."}, {"id": 157, "string": "We estimate its perplexity with respect to a language model obtained with Europarl in order to select the most fluent sentences and then we rank the parallel sentences according to their similarity and perplexity."}, {"id": 158, "string": "The top-n fragments were manually revised and extracted to build the Wikipedia test (WPtest) and development (WPdev) sets."}, {"id": 159, "string": "We repeated the process for the three studied domains and drew 300 parallel fragments for development for every domain and 500 for test."}, {"id": 160, "string": "We removed these sentences from the corresponding training corpora."}, {"id": 161, "string": "For one of the domains, CS, we also gathered a test set from a parallel corpus of GNOME localisation files (Tiedemann, 2012) ."}, {"id": 162, "string": "Table 7 shows the size in number of sentences of these test sets and of the 20 Wikipedia training sets used for translation."}, {"id": 163, "string": "Only one measure, that with the highest F 1 score, is selected from each family: c3g, cog, mono en andS·len (cf."}, {"id": 164, "string": "Tables 4 and 5)."}, {"id": 165, "string": "We also compile the corpus that results from the union of the previous four."}, {"id": 166, "string": "Notice that, although we eliminate duplicates from this corpus, the size of the union is close to the sum of the individual corpora."}, {"id": 167, "string": "This indicates that every similarity measure selects a different set of parallel fragments."}, {"id": 168, "string": "Beside the specialised corpus for each domain, we build a larger corpus with all the data (Un)."}, {"id": 169, "string": "Again, duplicate fragments coming from articles belonging to more than one domain are removed."}, {"id": 170, "string": "SMT systems are trained using standard freely available software."}, {"id": 171, "string": "We estimate a 5-gram language model using interpolated Kneser-Ney discounting with SRILM (Stolcke, 2002) ."}, {"id": 172, "string": "Word alignment is done with GIZA++ (Och and Ney, 2003) and both phrase extraction and decoding are done with Moses (Koehn et al., 2007) ."}, {"id": 173, "string": "We optimise the feature weights of the model with Minimum Error Rate Training (MERT) (Och, 2003) against the BLEU evaluation metric (Papineni et al., 2002) ."}, {"id": 174, "string": "Our model considers the language model, direct and inverse phrase probabilities, direct and inverse lexical probabilities, phrase and word penalties, and a lexicalised reordering."}, {"id": 175, "string": "(i) Training systems with Wikipedia or Europarl for domain-specific translation."}, {"id": 176, "string": "Table 8 shows the evaluation results on WPtest."}, {"id": 177, "string": "All the specialised systems obtain significant improvements with respect to the Europarl system, regardless of their size."}, {"id": 178, "string": "For instance, the worst specialised system (c3g with only 95,715 sentences for CS) outperforms by more than 10 points of BLEU the general Europarl translator."}, {"id": 179, "string": "The most complete system (the union of the four representatives) doubles the BLEU score for all the domains with an impressive improvement of 30 points."}, {"id": 180, "string": "This is of course possible due to the nature of the test set that has been extracted from the same collection as the training data and therefore shares its structure and vocabulary."}, {"id": 181, "string": "To give perspective to these high numbers we evaluate the systems trained on the CS domain  against the GNOME dataset (Table 9) ."}, {"id": 182, "string": "Except for c3g, the Wikipedia translators always outperform the baseline with EP; the union system improves it by 4 BLEU points (22.41 compared to 18.15) with a four times smaller corpus."}, {"id": 183, "string": "This confirms that a corpus automatically extracted with an F 1 smaller than 0.5 is still useful for SMT."}, {"id": 184, "string": "Notice also that using only the in-domain data (CS) is always better than using the whole WP corpus (Un) even if the former is in general ten times smaller (cf."}, {"id": 185, "string": "Table 7 )."}, {"id": 186, "string": "According to this indirect evaluation of the similarity measures, character n-grams (c3g) represent the worst alternative."}, {"id": 187, "string": "These results contradict the direct evaluation, where c3g and mono en had the highest F 1 scores on the development set among the individual similarity measures."}, {"id": 188, "string": "The size of the corpus is not relevant here: when we train all the systems with the same amount of data, the ranking in the quality of the measures remains the same."}, {"id": 189, "string": "To see this, we trained four additional systems with the top m number of parallel fragments, where m is the size of the smallest corpus for the union of domains: Un-c3g."}, {"id": 190, "string": "This new comparison is reported in columns \"Comp.\""}, {"id": 191, "string": "in Tables 8 and 9."}, {"id": 192, "string": "In this fair comparison c3g is still the worst measure andS·len the best one."}, {"id": 193, "string": "The translator built from its associated corpus outperforms with less than half of the data used for training the general one (883,366 vs. 1,965,734 parallel fragments) both in WPtest (56.78 vs. 30.63) and GNOME (19.76 vs. 18.15 )."}, {"id": 194, "string": "(ii) Training systems on Wikipedia and Europarl for domain-specific translation."}, {"id": 195, "string": "Now we enrich the general translator with Wikipedia data or, equivalently, complement the Wikipedia translator with out-of-domain data."}, {"id": 196, "string": "Table 10 shows the results."}, {"id": 197, "string": "Augmenting the size of the indomain corpus by 2 million fragments improves the results even more, about 2 points of BLEU   when using all the union data."}, {"id": 198, "string": "System c3g benefits the most of the inclusion of the Europarl data."}, {"id": 199, "string": "The reason is that it is the individual system with less corpus available and the one obtaining the worst results."}, {"id": 200, "string": "In fact, the better the Wikipedia system, the less important the contribution from Europarl is."}, {"id": 201, "string": "For the independent test set GNOME, Table 11 shows that the union corpus on CS is better than any combination of Wikipedia and Europarl."}, {"id": 202, "string": "Still, as aforementioned, the best performance on this test set is obtained with a pure in-domain system (cf."}, {"id": 203, "string": "are controlled by the Europarl baseline."}, {"id": 204, "string": "In general, systems in which we include only texts from an unrelated domain do not improve the performance of the Europarl system alone, results of the combined system are better when we use Wikipedia texts from all the domains together (column Un) for training."}, {"id": 205, "string": "This suggests that, as expected, a general Wikipedia corpus is necessary to build a general translator."}, {"id": 206, "string": "This is a different problem to deal with."}, {"id": 207, "string": "Conclusions and Ongoing Work In this paper we presented a model for the automatic extraction of in-domain comparable corpora from Wikipedia."}, {"id": 208, "string": "It makes possible the automatic extraction of monolingual and comparable article collections as well as a one-click parallel corpus generation for on-demand language pairs and domains."}, {"id": 209, "string": "Given a pair of languages and a main category, the model explores the Wikipedia categories graph and identifies a subset of categories (and their associated articles) to generate a document-aligned comparable corpus."}, {"id": 210, "string": "The resulting corpus can be exploited for multiple natural language processing tasks."}, {"id": 211, "string": "Here we applied it as part of a pipeline for the extraction of domainspecific parallel sentences."}, {"id": 212, "string": "These parallel instances allowed for a significant improvement in the machine translation quality when compared to a generic system and applied to a domain specific corpus (in-domain)."}, {"id": 213, "string": "The experiments are shown for the English-Spanish language pair and the domains Computer Science, Science, and Sports."}, {"id": 214, "string": "Still it can be applied to other language pairs and domains."}, {"id": 215, "string": "The prototype is currently operating in other languages."}, {"id": 216, "string": "The only prerequisite is the existence of the corresponding Wikipedia edition and some basic processing tools such as a tokeniser and a lemmatiser."}, {"id": 217, "string": "Our current efforts intend to generate a more robust model for parallel sentences identification and the design of other indirect evaluation schemes to validate the model performance."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 20}, {"section": "Background", "n": "2", "start": 21, "end": 63}, {"section": "Domain-Specific Comparable Corpora Extraction", "n": "3", "start": 64, "end": 106}, {"section": "Parallel Sentence Extraction", "n": "4", "start": 107, "end": 146}, {"section": "Evaluation: Statistical Machine Translation Task", "n": "5", "start": 147, "end": 206}, {"section": "Conclusions and Ongoing Work", "n": "6", "start": 207, "end": 217}], "figures": [{"filename": "../figure/image/1004-Table6-1.png", "caption": "Table 6: Size of the parallel corpora extracted with each similarity measure.", "page": 5, "bbox": {"x1": 313.92, "x2": 519.36, "y1": 187.68, "y2": 413.28}}, {"filename": "../figure/image/1004-Table4-1.png", "caption": "Table 4: Best thresholds and their associated Precision (P), recall (R) and F1.", "page": 5, "bbox": {"x1": 127.67999999999999, "x2": 469.44, "y1": 62.4, "y2": 148.32}}, {"filename": "../figure/image/1004-Table5-1.png", "caption": "Table 5: Precision, recall, and F1 for the average of the similarities weighted by length model (len) and/or their F1.", "page": 5, "bbox": {"x1": 81.6, "x2": 280.32, "y1": 187.68, "y2": 274.08}}, {"filename": "../figure/image/1004-Figure1-1.png", "caption": "Figure 1: Slice of the Spanish Wikipedia category graph (as in May 2015) departing from categories Sport and Science. Translated for clarity.", "page": 1, "bbox": {"x1": 310.08, "x2": 529.92, "y1": 62.879999999999995, "y2": 212.16}}, {"filename": "../figure/image/1004-Table7-1.png", "caption": "Table 7: Number of sentences of the Wikipedia parallel corpora used to train the SMT systems (top rows) and of the sets used for development and test.", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 524.16, "y1": 62.4, "y2": 176.16}}, {"filename": "../figure/image/1004-Table8-1.png", "caption": "Table 8: BLEU scores obtained on the Wikipedia test sets for the 20 specialised systems described in Section 5. A comparison column (Comp.) where all the systems are trained with corpora of the same size is also included (see text).", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 524.16, "y1": 248.64, "y2": 346.08}}, {"filename": "../figure/image/1004-Table10-1.png", "caption": "Table 10: BLEU scores obtained on the Wikipedia test set for the 20 systems trained with the combination of the Europarl (EP) and the Wikipedia corpora. The results with a Europarl system and the best one from Table 8 (union) shown for comparison.", "page": 7, "bbox": {"x1": 306.71999999999997, "x2": 523.1999999999999, "y1": 62.4, "y2": 183.35999999999999}}, {"filename": "../figure/image/1004-Table11-1.png", "caption": "Table 11: BLEU scores obtained on the GNOME test set for systems trained with Europarl and Wikipedia. A system with Europarl achieves a score of 18.15.", "page": 7, "bbox": {"x1": 346.56, "x2": 486.24, "y1": 284.64, "y2": 378.24}}, {"filename": "../figure/image/1004-Table9-1.png", "caption": "Table 9: BLEU scores obtained on the GNOME test set for systems trained only with Wikipedia. A system with Europarl achieves a score of 18.15.", "page": 7, "bbox": {"x1": 99.84, "x2": 262.08, "y1": 62.879999999999995, "y2": 156.0}}, {"filename": "../figure/image/1004-Table1-1.png", "caption": "Table 1: Amount of articles and categories in the Wikipedia editions and in the intersection (i.e., pages linked across languages).", "page": 3, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 62.4, "y2": 129.12}}, {"filename": "../figure/image/1004-Table2-1.png", "caption": "Table 2: Number of articles in the root categories and size of the resulting domain vocabulary.", "page": 3, "bbox": {"x1": 311.03999999999996, "x2": 515.52, "y1": 193.44, "y2": 330.71999999999997}}, {"filename": "../figure/image/1004-Table12-1.png", "caption": "Table 12: BLEU scores for the out-of-domain evaluation on the News Commentaries 2011 test set. We show in boldface all the systems that improve the Europarl translator, which achieves a score of 27.02.", "page": 8, "bbox": {"x1": 74.88, "x2": 287.03999999999996, "y1": 62.4, "y2": 175.2}}, {"filename": "../figure/image/1004-Table3-1.png", "caption": "Table 3: Number of article pairs according to the percentage of positive categories used to select the levels of the graph and distance from the root at which the percentage is smaller to the desired one.", "page": 4, "bbox": {"x1": 72.0, "x2": 288.0, "y1": 62.4, "y2": 151.2}}]}