{"title": "ACBiMA: Advanced Chinese Bi-Character Word Morphological Analyzer", "abstract": "While morphological information has been demonstrated to be useful for various Chinese NLP tasks, there is still a lack of complete theories, category schemes, and toolkits for Chinese morphology. This paper focuses on the morphological structures of Chinese bi-character words, where a corpus were collected based on a welldefined morphological type scheme covering both Chinese derived words and compound words. With the corpus, a morphological analyzer is developed to classify Chinese bi-character words into the defined categories, which outperforms strong baselines and achieves about 66% macro F-measure for compound words, and effectively covers derived words.", "text": [{"id": 0, "string": "Introduction Considering that Chinese is an analytic language without inflectional morphemes, Chinese morphology mainly focuses on analyzing morphological word formation."}, {"id": 1, "string": "In this paper, we conceive the Chinese word forming process from a syntactic point of view (Packard, 2000) ."}, {"id": 2, "string": "The analysis and prediction of the intra-word syntactic structures, i.e., the \"morphological structures\", have been shown to be effective in various Chinese NLP tasks, e.g., sentiment analysis (Ku et al., 2009; Huang, 2009 ), POS tagging (Qiu et al., 2008) , word segmentation (Gao et al., 2005) , and parsing (Li, 2011; Li and Zhou, 2012; Zhang et al., 2013) ."}, {"id": 3, "string": "Thus, this paper focuses on analyzing the morphological structures of Chinese bi-character content words."}, {"id": 4, "string": "Huang et al."}, {"id": 5, "string": "(2010) observed that 52% multicharacter Chinese tokens are bi-character 1 , which reflects that the core task of Chinese morphological analysis should be aimed at bi-character words."}, {"id": 6, "string": "Previous work tended to focus on longer unknown words (Tseng and Chen, 2002; Tseng et al., 2005; Lu et al., 2008; Qiu et al., 2008) or the functionality of morphemic characters (Galmar and Chen, 2010) , and none of them effectively covered Chinese bi-character words."}, {"id": 7, "string": "To the best of our knowledge, Huang et al."}, {"id": 8, "string": "(2010) is the only work focused on Chinese bi-character words, where they analyzed Chinese morphological types and developed a suite of classifiers to predict the types."}, {"id": 9, "string": "However, their work covers only a subset of Chinese content words and has limited scalability."}, {"id": 10, "string": "Therefore, this paper addresses the issues, which expands their work by developing a more detailed scheme and collecting more words to produce a generalized analyzer."}, {"id": 11, "string": "Our contributions are three-fold: • Linguistic -we propose a morphological type scheme for full coverage of Chinese bicharacter content words, and developed a corpus containing about 11K words."}, {"id": 12, "string": "• Technical -we develop an effective morphological classifier for Chinese bi-character words, achieving 66% macro F-measure for compound words, and and effectively covers derived words."}, {"id": 13, "string": "• Practical -we release the collected data and the analyzer with the trained model to provide additional Chinese morphological features for other NLP tasks."}, {"id": 14, "string": "2 Morphological Type Scheme Our morphological type category scheme is developed based on the literature (X.-H. Cheng, 1992; Lu et al., 2008; Huang et al., 2010) and the naming conventions of Stanford typed dependency (Chang   The two major categories of Chinese bicharacter content words are derived words and compound words."}, {"id": 15, "string": "Derived words are words formed in certain formations (e.g."}, {"id": 16, "string": "duplication), while compound words are composed of constituent characters following certain syntactic relations."}, {"id": 17, "string": "Table 1 and 2 present detailed category schemes."}, {"id": 18, "string": "Note that for derived words, the characters \"有/you/have\" and \"是/shi/be\" are of a special type of existential constructions (Tao, 2007) , so we isolate them from common prefixes to distinguish their unique characteristics."}, {"id": 19, "string": "The \"els\" type (compound words) consists of exceptional words that cannot be categorized into our com-pound words scheme."}, {"id": 20, "string": "Morphological Type Classification Due to the difference between derived words and compound words, we respectively adopt rulebased and machine learning approaches to predict their morphological types."}, {"id": 21, "string": "Note that all of our approaches and features assume that Chinese morphological structures are independent from wordlevel contexts (Tseng and Chen, 2002; Li, 2011) ."}, {"id": 22, "string": "Derived Word: Rule-Based Approach By definition, a morphological derived word can be recognized based on its formation."}, {"id": 23, "string": "Therefore, we apply the pattern matching rules described in Table 1 to build a rule-based classifier."}, {"id": 24, "string": "To evaluate the coverage of these developed rules, we run the classifier on Chinese Treebank 7.0 (CTB) (Levy and Manning, 2003) , where 2.9% of bi-character content words are annotated as derived words (842 unique word types)."}, {"id": 25, "string": "Our rules are able to capture derived words with a precision of 0.97."}, {"id": 26, "string": "The false positives are caused by the ambiguity of Chinese characters \"子/zi\" and \"兒/er\"."}, {"id": 27, "string": "3 The ambiguity results in mis-classifications such as \"父子/fu-zi/fatherson/father and son\" into the \"sfx\" type instead of the \"conj\" type."}, {"id": 28, "string": "Table 1 defines the patterns we consider as derived words, and the words that do not belong to the defined classes will be considered as compound words."}, {"id": 29, "string": "Compound Word: Machine Learning Approach To automatically predict morphological types for compound words, we perform machine learning techniques to capture generalizations from various features."}, {"id": 30, "string": "For each bi-character word C 1 C 2 , we extract character-level features for C 1 and C 2 individually, as well as a single word-level feature for C 1 C 2 ."}, {"id": 31, "string": "Table 3 describes our feature set."}, {"id": 32, "string": "For character-level features, a Chinese character may take on 3 different roles: word, morpheme, or alphabet symbol, where the extracted features are organized according to these roles."}, {"id": 33, "string": "In addition, we propose word-level features, e.g."}, {"id": 34, "string": "POS of C 1 C 2 , to capture the word information dismissed by the previous work (Huang et al., 2010) with consideration that such clue helps classification."}, {"id": 35, "string": "We experiment with various ML classification models: Naïve Bayes (John and Langley, 1995) , Random Forest (Breiman, 2001) , and Support Vector Machine (Platt, 1999; Keerthi et al., 2001; Hastie and Tibshirani, 1998) for the classification task."}, {"id": 36, "string": "The three types of baselines are compared: Majority, Stanford Dependency Map, and Tabular Models."}, {"id": 37, "string": "The Tabular Models first assign the POS tags to each known character C based on different heuristics (i.e., the most frequent POS of C in CTB, the POS of C with most senses in Dict, and the POS of C annotated by Stanford Parser), and then assigns the most frequent morphological type obtained from training data to each POS combination, e.g., \"(VV, NN) = vobj\"."}, {"id": 38, "string": "The Stanford Dependency Map takes the dependency relation between C 1 and C 2 as predicted by the Stanford Parser (Chang et al., 2009) , and maps it to a corresponding morphological type, which is learned from training data."}, {"id": 39, "string": "The Majority baseline always outputs the majority type, i.e., the \"n-head\" type."}, {"id": 40, "string": "We develop a Chinese morphological type corpus containing 11,366 bi-character compound words, referred to as \"ACBiMA Corpus 1.0.\""}, {"id": 41, "string": "This corpus is incrementally developed in two stages: The \"initial set\" is first developed for preliminary study and analysis."}, {"id": 42, "string": "We randomly extracted about 3,200 content words from Chinese Treebank 5.1 (Xue et al., 2005) , and removed the derived words."}, {"id": 43, "string": "After manually checking for and removing errors, the initial set contains 3,052 words, which are further annotated with \"morphological types\" and \"difficulty level of determining\" (1, 2, or 3) by trained native speakers and examined again by experts."}, {"id": 44, "string": "The inter-annotator agreement on a 50-word held-out set, averaged over all annotator pairs, is 0.726 Kappa."}, {"id": 45, "string": "In the second stage, we expand on the initial set into a larger corpus for practical use."}, {"id": 46, "string": "We sampled about 3,000 words from CTB 5.1 and annotated them with their morphological types."}, {"id": 47, "string": "Moreover, we obtained the 6,500-word corpus developed by Huang et al."}, {"id": 48, "string": "(2010) 4 and manually split its \"Substantive-Modifier\" words into \"a-head\", \"nhead\", or \"v-head\" types to match our category scheme."}, {"id": 49, "string": "In total, the expanded dataset consists of 11,366 unique bi-character compound word types (see Table 4 )."}, {"id": 50, "string": "Experiments We performed 10-fold cross-validation experiments on the entire dataset to evaluate our ap-4 The words in Huang et al."}, {"id": 51, "string": "(2010) are sampled from the NTCIR CIRB040 news corpus, and the distribution of types is similar to that of our initial set."}, {"id": 52, "string": "This suggests that the morphological types distribution between different Chinese corpora are similar."}, {"id": 53, "string": "proaches for compound words."}, {"id": 54, "string": "5 As mentioned in §3.2, we compared against different baselines."}, {"id": 55, "string": "Table 5 presents the results of our experiments, and the average human-judged difficulty level (in initial set) is also listed for comparison."}, {"id": 56, "string": "Random Forest and SVM outperformed all other models and baselines."}, {"id": 57, "string": "The best accuracy is 0.674; 65% of words in the initial set are labeled as \"easy\" by human annotators, suggesting that our classifiers are comparable to human performance on the \"easy\" instances."}, {"id": 58, "string": "Also, we achieved similar level of performance in macro F1-measure when compared to Huang et al."}, {"id": 59, "string": "(2010) 6 , despite our task being more challenging due to having two extra types."}, {"id": 60, "string": "Conclusion and Future Work In this paper, we developed a set of tools and resources for leveraging morphology of Chinese bicharacter words."}, {"id": 61, "string": "We propose a category scheme, develop a corpus, and build an effective morphological analyzer."}, {"id": 62, "string": "In future work, we intend to explore other NLP tasks where we can take advantage of ACBiMA and our tools to improve performance."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 13}, {"section": "Morphological Type Scheme", "n": "2", "start": 14, "end": 19}, {"section": "Morphological Type Classification", "n": "3", "start": 20, "end": 21}, {"section": "Derived Word: Rule-Based Approach", "n": "3.1", "start": 22, "end": 28}, {"section": "Compound Word: Machine Learning Approach", "n": "3.2", "start": 29, "end": 49}, {"section": "Experiments", "n": "5", "start": 50, "end": 58}, {"section": "Conclusion and Future Work", "n": "6", "start": 59, "end": 62}], "figures": [{"filename": "../figure/image/1011-Table4-1.png", "caption": "Table 4: Morphological category distribution", "page": 2, "bbox": {"x1": 319.68, "x2": 510.24, "y1": 382.56, "y2": 520.3199999999999}}, {"filename": "../figure/image/1011-Table3-1.png", "caption": "Table 3: Features for the Compound Word C1C2 ( Dict: Revised Mandarin Chinese Dictionary (Ministry of Education (MoE), 1994); CTB: Chinese Treebank 5.1 (Xue et al., 2005))", "page": 2, "bbox": {"x1": 72.0, "x2": 533.28, "y1": 102.72, "y2": 336.96}}, {"filename": "../figure/image/1011-Table1-1.png", "caption": "Table 1: The category description and examples for derived words", "page": 1, "bbox": {"x1": 75.84, "x2": 522.24, "y1": 88.8, "y2": 189.12}}, {"filename": "../figure/image/1011-Figure1-1.png", "caption": "Figure 1: The morphological category scheme of Chinese bi-character content words", "page": 1, "bbox": {"x1": 73.44, "x2": 291.36, "y1": 428.15999999999997, "y2": 528.0}}, {"filename": "../figure/image/1011-Table2-1.png", "caption": "Table 2: The category description and examples for compound words", "page": 1, "bbox": {"x1": 72.0, "x2": 522.24, "y1": 226.56, "y2": 368.15999999999997}}, {"filename": "../figure/image/1011-Table5-1.png", "caption": "Table 5: 10-fold cross-validation classification performance (MF: Macro F-measure, ACC: Accuracy)", "page": 3, "bbox": {"x1": 72.0, "x2": 537.12, "y1": 88.8, "y2": 228.95999999999998}}]}