{"title": "Multi-Passage Machine Reading Comprehension with Cross-Passage Answer Verification", "abstract": "Machine reading comprehension (MRC) on real web data usually requires the machine to answer a question by analyzing multiple passages retrieved by search engine. Compared with MRC on a single passage, multi-passage MRC is more challenging, since we are likely to get multiple confusing answer candidates from different passages. To address this problem, we propose an end-to-end neural model that enables those answer candidates from different passages to verify each other based on their content representations. Specifically, we jointly train three modules that can predict the final answer based on three factors: the answer boundary, the answer content and the cross-passage answer verification. The experimental results show that our method outperforms the baseline by a large margin and achieves the state-of-the-art performance on the English MS-MARCO dataset and the Chinese DuReader dataset, both of which are designed for MRC in real-world settings.", "text": [{"id": 0, "string": "Introduction Machine reading comprehension (MRC), empowering computers with the ability to acquire knowledge and answer questions from textual data, is believed to be a crucial step in building a general intelligent agent (Chen et al., 2016) ."}, {"id": 1, "string": "Recent years have seen rapid growth in the MRC community."}, {"id": 2, "string": "With the release of various datasets, the MRC task has evolved from the early cloze-style test (Hermann et al., 2015; Hill et al., 2015) to answer extraction from a single passage (Rajpurkar et al., 2016) and to the latest more complex question answering on web data (Nguyen et al., 2016; Dunn et al., 2017; He et al., 2017) ."}, {"id": 3, "string": "Great efforts have also been made to develop models for these MRC tasks , especially for the answer extraction on single passage (Wang and Jiang, 2016; Seo et al., 2016; Pan et al., 2017) ."}, {"id": 4, "string": "A significant milestone is that several MRC models have exceeded the performance of human annotators on the SQuAD dataset 1 (Rajpurkar et al., 2016 )."}, {"id": 5, "string": "However, this success on single Wikipedia passage is still not adequate, considering the ultimate goal of reading the whole web."}, {"id": 6, "string": "Therefore, several latest datasets (Nguyen et al., 2016; He et al., 2017; Dunn et al., 2017) attempt to design the MRC tasks in more realistic settings by involving search engines."}, {"id": 7, "string": "For each question, they use the search engine to retrieve multiple passages and the MRC models are required to read these passages in order to give the final answer."}, {"id": 8, "string": "One of the intrinsic challenges for such multipassage MRC is that since all the passages are question-related but usually independently written, it's probable that multiple confusing answer candidates (correct or incorrect) exist."}, {"id": 9, "string": "Table 1 shows an example from MS-MARCO."}, {"id": 10, "string": "We can see that all the answer candidates have semantic matching with the question while they are literally different and some of them are even incorrect."}, {"id": 11, "string": "As is shown by Jia and Liang (2017) , these confusing answer candidates could be quite difficult for MRC models to distinguish."}, {"id": 12, "string": "Therefore, special consideration is required for such multi-passage MRC problem."}, {"id": 13, "string": "In this paper, we propose to leverage the answer candidates from different passages to verify the final correct answer and rule out the noisy incorrect answers."}, {"id": 14, "string": "Our hypothesis is that the cor-Question: What is the difference between a mixed and pure culture?"}, {"id": 15, "string": "Passages: [1] A culture is a society's total way of living and a society is a group that live in a defined territory and participate in common culture."}, {"id": 16, "string": "While the answer given is in essence true, societies originally form for the express purpose to enhance ."}, {"id": 17, "string": "."}, {"id": 18, "string": "."}, {"id": 19, "string": "[2] ."}, {"id": 20, "string": "."}, {"id": 21, "string": "."}, {"id": 22, "string": "There has been resurgence in the economic system known as capitalism during the past two decades."}, {"id": 23, "string": "4."}, {"id": 24, "string": "The mixed economy is a balance between socialism and capitalism."}, {"id": 25, "string": "As a result, some institutions are owned and maintained by ."}, {"id": 26, "string": "."}, {"id": 27, "string": "."}, {"id": 28, "string": "[3] A pure culture is one in which only one kind of microbial species is found whereas in mixed culture two or more microbial species formed colonies."}, {"id": 29, "string": "Culture on the other hand, is the lifestyle that the people in the country ."}, {"id": 30, "string": "."}, {"id": 31, "string": "."}, {"id": 32, "string": "[4] Best Answer: A pure culture comprises a single species or strains."}, {"id": 33, "string": "A mixed culture is taken from a source and may contain multiple strains or species."}, {"id": 34, "string": "A contaminated culture contains organisms that derived from some place ."}, {"id": 35, "string": "."}, {"id": 36, "string": "."}, {"id": 37, "string": "[5] ."}, {"id": 38, "string": "."}, {"id": 39, "string": "."}, {"id": 40, "string": "It will be at that time when we can truly obtain a pure culture."}, {"id": 41, "string": "A pure culture is a culture consisting of only one strain."}, {"id": 42, "string": "You can obtain a pure culture by picking out a small portion of the mixed culture ."}, {"id": 43, "string": "."}, {"id": 44, "string": "."}, {"id": 45, "string": "[6] A pure culture is one in which only one kind of microbial species is found whereas in mixed culture two or more microbial species formed colonies."}, {"id": 46, "string": "A pure culture is a culture consisting of only one strain."}, {"id": 47, "string": "."}, {"id": 48, "string": "."}, {"id": 49, "string": "."}, {"id": 50, "string": "· · · · · · Reference Answer: A pure culture is one in which only one kind of microbial species is found whereas in mixed culture two or more microbial species formed colonies."}, {"id": 51, "string": "rect answers could occur more frequently in those passages and usually share some commonalities, while incorrect answers are usually different from one another."}, {"id": 52, "string": "The example in Table 1 demonstrates this phenomenon."}, {"id": 53, "string": "We can see that the answer candidates extracted from the last four passages are all valid answers to the question and they are semantically similar to each other, while the answer candidates from the other two passages are incorrect and there is no supportive information from other passages."}, {"id": 54, "string": "As human beings usually compare the answer candidates from different sources to deduce the final answer, we hope that MRC model can also benefit from the cross-passage answer verification process."}, {"id": 55, "string": "The overall framework of our model is demonstrated in Figure 1 , which consists of three modules."}, {"id": 56, "string": "First, we follow the boundary-based MRC models (Seo et al., 2016; Wang and Jiang, 2016) to find an answer candidate for each passage by identifying the start and end position of the answer ( Figure 2) ."}, {"id": 57, "string": "Second, we model the meanings of the answer candidates extracted from those passages and use the content scores to measure the quality of the candidates from a second perspective."}, {"id": 58, "string": "Third, we conduct the answer verification by enabling each answer candidate to attend to the other candidates based on their representations."}, {"id": 59, "string": "We hope that the answer candidates can collect supportive information from each other according to their semantic similarities and further decide whether each candidate is correct or not."}, {"id": 60, "string": "Therefore, the final answer is determined by three factors: the boundary, the content and the crosspassage answer verification."}, {"id": 61, "string": "The three steps are modeled using different modules, which can be jointly trained in our end-to-end framework."}, {"id": 62, "string": "We conduct extensive experiments on the MS-MARCO (Nguyen et al., 2016) and DuReader (He et al., 2017) datasets."}, {"id": 63, "string": "The results show that our answer verification MRC model outperforms the baseline models by a large margin and achieves the state-of-the-art performance on both datasets."}, {"id": 64, "string": "Figure 1 gives an overview of our multi-passage MRC model which is mainly composed of three modules including answer boundary prediction, answer content modeling and answer verification."}, {"id": 65, "string": "First of all, we need to model the question and passages."}, {"id": 66, "string": "Following Seo et al."}, {"id": 67, "string": "(2016) , we compute the question-aware representation for each passage (Section 2.1)."}, {"id": 68, "string": "Based on this representation, we employ a Pointer Network (Vinyals et al., 2015) to predict the start and end position of the answer in the module of answer boundary prediction (Section 2.2)."}, {"id": 69, "string": "At the same time, with the answer content model (Section 2.3), we estimate whether each word should be included in the answer and thus obtain the answer representations."}, {"id": 70, "string": "Next, in the answer verification module (Section 2.4), each answer candidate can attend to the other answer candidates to collect supportive information and we compute one score for each candidate Figure 1 : Overview of our method for multi-passage machine reading comprehension to indicate whether it is correct or not according to the verification."}, {"id": 71, "string": "The final answer is determined by not only the boundary but also the answer content and its verification score (Section 2.5)."}, {"id": 72, "string": "Our Approach Question and Passage Modeling Given a question Q and a set of passages {P i } retrieved by search engines, our task is to find the best concise answer to the question."}, {"id": 73, "string": "First, we formally present the details of modeling the question and passages."}, {"id": 74, "string": "Encoding We first map each word into the vector space by concatenating its word embedding and sum of its character embeddings."}, {"id": 75, "string": "Then we employ bi-directional LSTMs (BiLSTM) to encode the question Q and passages {P i } as follows: u Q t = BiLSTM Q (u Q t−1 , [e Q Q-P Matching One essential step in MRC is to match the question with passages so that important information can be highlighted."}, {"id": 76, "string": "We use the Attention Flow Layer (Seo et al., 2016) to conduct the Q-P matching in two directions."}, {"id": 77, "string": "The similarity matrix S ∈ R |Q|×|P i | between the question and passage i is changed to a simpler version, where the similarity between the t th word in the question and the k th word in passage i is computed as: S t,k = u Q t · u P i k (3) Then the context-to-question attention and question-to-context attention is applied strictly following Seo et al."}, {"id": 78, "string": "(2016) to obtain the questionaware passage representation {ũ P i t }."}, {"id": 79, "string": "We do not give the details here due to space limitation."}, {"id": 80, "string": "Next, another BiLSTM is applied in order to fuse the contextual information and get the new representation for each word in the passage, which is regarded as the match output: v P i t = BiLSTM M (v P i t−1 ,ũ P i t ) (4) Based on the passage representations, we introduce the three main modules of our model."}, {"id": 81, "string": "Answer Boundary Prediction To extract the answer span from passages, mainstream studies try to locate the boundary of the answer, which is called boundary model."}, {"id": 82, "string": "Following (Wang and Jiang, 2016) , we employ Pointer Network (Vinyals et al., 2015) to compute the probability of each word to be the start or end position of the span: g t k = w a 1 tanh(W a 2 [v P k , h a t−1 ]) (5) α t k = exp(g t k )/ |P| j=1 exp(g t j ) (6) c t = |P| k=1 α t k v P k (7) h a t = LSTM(h a t−1 , c t ) (8) By utilizing the attention weights, the probability of the k th word in the passage to be the start and end position of the answer is obtained as α 1 k and α 2 k ."}, {"id": 83, "string": "It should be noted that the pointer network is applied to the concatenation of all passages, which is denoted as P so that the probabilities are comparable across passages."}, {"id": 84, "string": "This boundary model can be trained by minimizing the negative log probabilities of the true start and end indices: L boundary = − 1 N N i=1 (log α 1 y 1 i + log α 2 y 2 i ) (9) where N is the number of samples in the dataset and y 1 i , y 2 i are the gold start and end positions."}, {"id": 85, "string": "Answer Content Modeling Previous work employs the boundary model to find the text span with the maximum boundary score as the final answer."}, {"id": 86, "string": "However, in our context, besides locating the answer candidates, we also need to model their meanings in order to conduct the verification."}, {"id": 87, "string": "An intuitive method is to compute the representation of the answer candidates separately after extracting them, but it could be hard to train such model end-to-end."}, {"id": 88, "string": "Here, we propose a novel method that can obtain the representation of the answer candidates based on probabilities."}, {"id": 89, "string": "Specifically, we change the output layer of the classic MRC model."}, {"id": 90, "string": "Besides predicting the boundary probabilities for the words in the passages, we also predict whether each word should be included in the content of the answer."}, {"id": 91, "string": "The content probability of the k th word is computed as: p c k = sigmoid(w c 1 ReLU(W c 2 v P i k )) (10) Training this content model is also quite intuitive."}, {"id": 92, "string": "We transform the boundary labels into a continuous segment, which means the words within the answer span will be labeled as 1 and other words will be labeled as 0."}, {"id": 93, "string": "In this way, we define the loss function as the averaged cross entropy: L content = − 1 N 1 |P| N i=1 |P | j=1 [y c k log p c k + (1 − y c k ) log(1 − p c k )] (11) The content probabilities provide another view to measure the quality of the answer in addition to the boundary."}, {"id": 94, "string": "Moreover, with these probabilities, we can represent the answer from passage i as a weighted sum of all the word embeddings in this passage: r A i = 1 |P i | |P i | k=1 p c k [e P i k , c P i k ] (12) Cross-Passage Answer Verification The boundary model and the content model focus on extracting and modeling the answer within a single passage respectively, with little consideration of the cross-passage information."}, {"id": 95, "string": "However, as is discussed in Section 1, there could be multiple answer candidates from different passages and some of them may mislead the MRC model to make an incorrect prediction."}, {"id": 96, "string": "It's necessary to aggregate the information from different passages and choose the best one from those candidates."}, {"id": 97, "string": "Therefore, we propose a method to enable the answer candidates to exchange information and verify each other through the cross-passage answer verification process."}, {"id": 98, "string": "Given the representation of the answer candidates from all passages {r A i }, each answer candidate then attends to other candidates to collect supportive information via attention mechanism: s i,j = 0, if i = j, r A i · r A j , otherwise (13) α i,j = exp(s i,j )/ n k=1 exp(s i,k ) (14) r A i = n j=1 α i,j r A j (15) Herer A i is the collected verification information from other passages based on the attention weights."}, {"id": 99, "string": "Then we pass it together with the original representation r A i to a fully connected layer: g v i = w v [r A i ,r A i , r A i r A i ] (16) We further normalize these scores over all passages to get the verification score for answer candidate A i : p v i = exp(g v i )/ n j=1 exp(g v j ) (17) In order to train this verification model, we take the answer from the gold passage as the gold answer."}, {"id": 100, "string": "And the loss function can be formulated as the negative log probability of the correct answer: L verif y = − 1 N N i=1 log p v y v i (18) where y v i is the index of the correct answer in all the answer candidates of the i th instance ."}, {"id": 101, "string": "Joint Training and Prediction As is described above, we define three objectives for the reading comprehension model over multiple passages: 1. finding the boundary of the answer; 2. predicting whether each word should be included in the content; 3. selecting the best answer via cross-passage answer verification."}, {"id": 102, "string": "According to our design, these three tasks can share the same embedding, encoding and matching layers."}, {"id": 103, "string": "Therefore, we propose to train them together as multi-task learning (Ruder, 2017) ."}, {"id": 104, "string": "The joint objective function is formulated as follows: L = L boundary + β 1 L content + β 2 L verif y (19) where β 1 and β 2 are two hyper-parameters that control the weights of those tasks."}, {"id": 105, "string": "When predicting the final answer, we take the boundary score, content score and verification score into consideration."}, {"id": 106, "string": "We first extract the answer candidate A i that has the maximum boundary score from each passage i."}, {"id": 107, "string": "This boundary score is computed as the product of the start and end probability of the answer span."}, {"id": 108, "string": "Then for each answer candidate A i , we average the content probabilities of all its words as the content score of A i ."}, {"id": 109, "string": "And we can also predict the verification score for A i using the verification model."}, {"id": 110, "string": "Therefore, the final answer can be selected from all the answer candidates according to the product of these three scores."}, {"id": 111, "string": "Experiments To verify the effectiveness of our model on multipassage machine reading comprehension, we conduct experiments on the MS-MARCO (Nguyen et al., 2016) and DuReader (He et al., 2017) datasets."}, {"id": 112, "string": "Our method achieves the state-of-the-art performance on both datasets."}, {"id": 113, "string": "Datasets We choose the MS-MARCO and DuReader datasets to test our method, since both of them are  One prerequisite for answer verification is that there should be multiple correct answers so that they can verify each other."}, {"id": 114, "string": "Both the MS-MARCO and DuReader datasets require the human annotators to generate multiple answers if possible."}, {"id": 115, "string": "Table 2 shows the proportion of questions that have multiple answers."}, {"id": 116, "string": "However, the same answer that occurs many times is treated as one single answer here."}, {"id": 117, "string": "Therefore, we also report the proportion of questions that have multiple answer spans to match with the human-generated answers."}, {"id": 118, "string": "A span is taken as valid if it can achieve F1 score larger than 0.7 compared with any reference answer."}, {"id": 119, "string": "From these statistics, we can see that the phenomenon of multiple answers is quite common for both MS-MARCO and DuReader."}, {"id": 120, "string": "These answers will provide strong signals for answer verification if we can leverage them properly."}, {"id": 121, "string": "Implementation Details For MS-MARCO, we preprocess the corpus with the reversible tokenizer from Stanford CoreNLP  and we choose the span that achieves the highest ROUGE-L score with the reference answers as the gold span for training."}, {"id": 122, "string": "We employ the 300-D pre-trained Glove embeddings (Pennington et al., 2014) and keep it fixed during training."}, {"id": 123, "string": "The character embeddings are randomly initialized with its dimension as 30."}, {"id": 124, "string": "For DuReader, we follow the preprocessing described in He et al."}, {"id": 125, "string": "(2017) ."}, {"id": 126, "string": "We tune the hyper-parameters according to the Model ROUGE-L BLEU-1 FastQA Ext (Weissenborn et al., 2017) 33.67 33.93 Prediction (Wang and Jiang, 2016) 37.33 40.72 ReasoNet (Shen et al., 2017) 38.81 39.86 R-Net (Wang et al., 2017c) 42.89 42.22 S-Net (Tan et al., 2017) 45  Two simple yet effective technologies are employed to improve the final performance on these two datasets respectively."}, {"id": 127, "string": "For MS-MARCO, approximately 8% questions have the answers as Yes or No, which usually cannot be solved by extractive approach (Tan et al., 2017) ."}, {"id": 128, "string": "We address this problem by training a simple Yes/No classifier for those questions with certain patterns (e.g., starting with \"is\")."}, {"id": 129, "string": "Concretely, we simply change the output layer of the basic boundary model so that it can predict whether the answer is \"Yes\" or \"No\"."}, {"id": 130, "string": "For DuReader, the retrieved document usually contains a large number of paragraphs that cannot be fed into MRC models directly (He et al., 2017) ."}, {"id": 131, "string": "The original paper employs a simple a simple heuristic strategy to select a representative paragraph for each document, while we train a paragraph ranking model for this."}, {"id": 132, "string": "We will demonstrate the effects of these two technologies later."}, {"id": 133, "string": "Table 3 shows the results of our system and other state-of-the-art models on the MS-MARCO test set."}, {"id": 134, "string": "We adopt the official evaluation metrics, including ROUGE-L (Lin, 2004) and BLEU-1 (Papineni et al., 2002) ."}, {"id": 135, "string": "As we can see, for both metrics, our single model outperforms all the other competing models with an evident margin, which is extremely hard considering the near-human per-   formance."}, {"id": 136, "string": "If we ensemble the models trained with different random seeds and hyper-parameters, the results can be further improved and outperform the ensemble model in Tan et al."}, {"id": 137, "string": "(2017) , especially in terms of the BLEU-1."}, {"id": 138, "string": "Results on MS-MARCO Results on DuReader The results of our model and several baseline systems on the test set of DuReader are shown in Table 4 ."}, {"id": 139, "string": "The BiDAF and Match-LSTM models are provided as two baseline systems (He et al., 2017) ."}, {"id": 140, "string": "Based on BiDAF, as is described in Section 3.2, we tried a new paragraph selection strategy by employing a paragraph ranking (PR) model."}, {"id": 141, "string": "We can see that this paragraph ranking can boost the BiDAF baseline significantly."}, {"id": 142, "string": "Finally, we implement our system based on this new strategy, and our system (single model) achieves further improvement by a large margin."}, {"id": 143, "string": "Question: What is the difference between a mixed and pure culture Scores Answer Candidates: Boundary Content Verification [1] A culture is a society's total way of living and a society is a group ."}, {"id": 144, "string": "."}, {"id": 145, "string": "."}, {"id": 146, "string": "1.0 × 10 −2 1.0 × 10 −1 1.1 × 10 −1 [2] The mixed economy is a balance between socialism and capitalism."}, {"id": 147, "string": "1.0 × 10 −4 4.0 × 10 −2 3.2 × 10 −2 [3] A pure culture is one in which only one kind of microbial species is ."}, {"id": 148, "string": "."}, {"id": 149, "string": "."}, {"id": 150, "string": "5.5 × 10 −3 7.7 × 10 −2 1.2 × 10 −1 [4] A pure culture comprises a single species or strains."}, {"id": 151, "string": "A mixed ."}, {"id": 152, "string": "."}, {"id": 153, "string": "."}, {"id": 154, "string": "2.7 × 10 −3 8.1 × 10 −2 1.3 × 10 −1 [5] A pure culture is a culture consisting of only one strain."}, {"id": 155, "string": "5.8 × 10 −4 7.9 × 10 −2 5.1 × 10 −2 [6] A pure culture is one in which only one kind of microbial species ."}, {"id": 156, "string": "."}, {"id": 157, "string": "."}, {"id": 158, "string": "5.8 × 10 −3 9.1 × 10 −2 2.7 × 10 −1 ."}, {"id": 159, "string": "."}, {"id": 160, "string": "."}, {"id": 161, "string": "."}, {"id": 162, "string": "."}, {"id": 163, "string": "."}, {"id": 164, "string": "."}, {"id": 165, "string": "."}, {"id": 166, "string": "."}, {"id": 167, "string": "."}, {"id": 168, "string": "."}, {"id": 169, "string": "."}, {"id": 170, "string": "Analysis and Discussion Ablation Study To get better insight into our system, we conduct in-depth ablation study on the development set of MS-MARCO, which is shown in Table 5 ."}, {"id": 171, "string": "Following Tan et al."}, {"id": 172, "string": "(2017) , we mainly focus on the ROUGE-L score that is averaged case by case."}, {"id": 173, "string": "We first evaluate the answer verification by ablating the cross-passage verification model so that the verification loss and verification score will not be used during training and testing."}, {"id": 174, "string": "Then we remove the content model in order to test the necessity of modeling the content of the answer."}, {"id": 175, "string": "Since we don't have the content scores, we use the boundary probabilities instead to compute the answer representation for verification."}, {"id": 176, "string": "Next, to show the benefits of joint training, we train the boundary model separately from the other two models."}, {"id": 177, "string": "Finally, we remove the yes/no classification in order to show the real improvement of our end-toend model compared with the baseline method that predicts the answer with only the boundary model."}, {"id": 178, "string": "From Table 5 , we can see that the answer verification makes a great contribution to the overall improvement, which confirms our hypothesis that cross-passage answer verification is useful for the multi-passage MRC."}, {"id": 179, "string": "For the ablation of the content model, we analyze that it will not only affect the content score itself, but also violate the verification model since the content probabilities are necessary for the answer representation, which will be further analyzed in Section 4.3."}, {"id": 180, "string": "Another discovery is that jointly training the three models can provide great benefits, which shows that the three tasks are actually closely related and can boost each other with shared representations at bottom layers."}, {"id": 181, "string": "At last, comparing our method with the baseline, we achieve an improvement of nearly 3 points without the yes/no classification."}, {"id": 182, "string": "This significant improvement proves the effectiveness of our approach."}, {"id": 183, "string": "Case Study To demonstrate how each module of our model takes effect when predicting the final answer, we conduct a case study in Table 6 with the same example that we discussed in Section 1."}, {"id": 184, "string": "For each answer candidate, we list three scores predicted by the boundary model, content model and verification model respectively."}, {"id": 185, "string": "On the one hand, we can see that these three scores generally have some relevance."}, {"id": 186, "string": "For example, the second candidate is given lowest scores by all the three models."}, {"id": 187, "string": "We analyze that this is because the models share the same encoding and matching layers at bottom level and this relevance guarantees that the content and verification models will not violate the boundary model too much."}, {"id": 188, "string": "On the other hand, we also see that the verification score can really make a difference here when the boundary model makes an incorrect decision among the confusing answer candidates ([1], [3], [4], [6] )."}, {"id": 189, "string": "Besides, as we expected, the verification model tends to give higher scores for those answers that have semantic commonality with each other ([3] , [4], [6] ), which are all valid answers in this case."}, {"id": 190, "string": "By multiplying the three scores, our model finally predicts the answer correctly."}, {"id": 191, "string": "Necessity of the Content Model In our model, we compute the answer representation based on the content probabilities predicted by a separate content model instead of directly using the boundary probabilities."}, {"id": 192, "string": "We argue that this content model is necessary for our answer verification process."}, {"id": 193, "string": "Figure 2 plots the predicted content probabilities as well as the boundary probabilities The  noun  charge  unit  has  1  sense  :  1  ."}, {"id": 194, "string": "a  measure  of  the  quantity  of  electricity  -LRB-determined  by  the  amount  of  an  electric  current  and  the  time  for  which  it  flows  -RRB-."}, {"id": 195, "string": "familiarity  info  :  charge  unit  used  as  a  noun  is  very  rare  ."}, {"id": 196, "string": "start probability end probability content probability Figure 2 : The boundary probabilities and content probabilities for the words in a passage for a passage."}, {"id": 197, "string": "We can see that the boundary and content probabilities capture different aspects of the answer."}, {"id": 198, "string": "Since answer candidates usually have similar boundary words, if we compute the answer representation based on the boundary probabilities, it's difficult to model the real difference among different answer candidates."}, {"id": 199, "string": "On the contrary, with the content probabilities, we pay more attention to the content part of the answer, which can provide more distinguishable information for verifying the correct answer."}, {"id": 200, "string": "Furthermore, the content probabilities can also adjust the weights of the words within the answer span so that unimportant words (e.g."}, {"id": 201, "string": "\"and\" and \".\")"}, {"id": 202, "string": "get lower weights in the final answer representation."}, {"id": 203, "string": "We believe that this refined representation is also good for the answer verification process."}, {"id": 204, "string": "Related Work Machine reading comprehension made rapid progress in recent years, especially for singlepassage MRC task, such as SQuAD (Rajpurkar et al., 2016) ."}, {"id": 205, "string": "Mainstream studies (Seo et al., 2016; Wang and Jiang, 2016; Xiong et al., 2016) treat reading comprehension as extracting answer span from the given passage, which is usually achieved by predicting the start and end position of the answer."}, {"id": 206, "string": "We implement our boundary model similarly by employing the boundary-based pointer network (Wang and Jiang, 2016) ."}, {"id": 207, "string": "Another inspiring work is from Wang et al."}, {"id": 208, "string": "(2017c) , where the authors propose to match the passage against itself so that the representation can aggregate evidence from the whole passage."}, {"id": 209, "string": "Our verification model adopts a similar idea."}, {"id": 210, "string": "However, we collect information across passages and our attention is based on the answer representation, which is much more efficient than attention over all passages."}, {"id": 211, "string": "For the model training, Xiong et al."}, {"id": 212, "string": "(2017) argues that the boundary loss encourages exact answers at the cost of penalizing overlapping answers."}, {"id": 213, "string": "Therefore they propose a mixed objective that incorporates rewards derived from word overlap."}, {"id": 214, "string": "Our joint training approach has a similar function."}, {"id": 215, "string": "By taking the content and verification loss into consideration, our model will give less loss for overlapping answers than those unmatched answers, and our loss function is totally differentiable."}, {"id": 216, "string": "Recently, we also see emerging interests in multi-passage MRC from both the academic (Dunn et al., 2017; Joshi et al., 2017) and industrial community (Nguyen et al., 2016; He et al., 2017) ."}, {"id": 217, "string": "Early studies (Shen et al., 2017; Wang et al., 2017c) usually concat those passages and employ the same models designed for singlepassage MRC."}, {"id": 218, "string": "However, more and more latest studies start to design specific methods that can read multiple passages more effectively."}, {"id": 219, "string": "In the aspect of passage selection, Wang et al."}, {"id": 220, "string": "(2017a) introduced a pipelined approach that rank the passages first and then read the selected passages for answering questions."}, {"id": 221, "string": "Tan et al."}, {"id": 222, "string": "(2017) treats the passage ranking as an auxiliary task that can be trained jointly with the reading comprehension model."}, {"id": 223, "string": "Actually, the target of our answer verification is very similar to that of the passage selection, while we pay more attention to the answer content and the answer verification process."}, {"id": 224, "string": "Speaking of the answer verification, Wang et al."}, {"id": 225, "string": "(2017b) has a similar motivation to ours."}, {"id": 226, "string": "They attempt to aggregate the evidence from different passages and choose the final answer from n-best candidates."}, {"id": 227, "string": "However, they implement their idea as a separate reranking step after reading comprehension, while our answer verification is a component of the whole model that can be trained end-to-end."}, {"id": 228, "string": "Conclusion In this paper, we propose an end-to-end framework to tackle the multi-passage MRC task ."}, {"id": 229, "string": "We creatively design three different modules in our model, which can find the answer boundary, model the answer content and conduct cross-passage answer verification respectively."}, {"id": 230, "string": "All these three modules can be trained with different forms of the answer labels and training them jointly can provide further improvement."}, {"id": 231, "string": "The experimental results demonstrate that our model outperforms the baseline models by a large margin and achieves the state-of-the-art performance on two challenging datasets, both of which are designed for MRC on real web data."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 71}, {"section": "Question and Passage Modeling", "n": "2.1", "start": 72, "end": 80}, {"section": "Answer Boundary Prediction", "n": "2.2", "start": 81, "end": 84}, {"section": "Answer Content Modeling", "n": "2.3", "start": 85, "end": 93}, {"section": "Cross-Passage Answer Verification", "n": "2.4", "start": 94, "end": 100}, {"section": "Joint Training and Prediction", "n": "2.5", "start": 101, "end": 109}, {"section": "Experiments", "n": "3", "start": 110, "end": 112}, {"section": "Datasets", "n": "3.1", "start": 113, "end": 120}, {"section": "Implementation Details", "n": "3.2", "start": 121, "end": 137}, {"section": "Results on DuReader", "n": "3.4", "start": 138, "end": 169}, {"section": "Ablation Study", "n": "4.1", "start": 170, "end": 182}, {"section": "Case Study", "n": "4.2", "start": 183, "end": 190}, {"section": "Necessity of the Content Model", "n": "4.3", "start": 191, "end": 203}, {"section": "Related Work", "n": "5", "start": 204, "end": 227}, {"section": "Conclusion", "n": "6", "start": 228, "end": 231}], "figures": [{"filename": "../figure/image/1035-Table4-1.png", "caption": "Table 4: Performance on the DuReader test set", "page": 5, "bbox": {"x1": 324.96, "x2": 508.32, "y1": 240.48, "y2": 324.0}}, {"filename": "../figure/image/1035-Table3-1.png", "caption": "Table 3: Performance of our method and competing models on the MS-MARCO test set", "page": 5, "bbox": {"x1": 152.64, "x2": 445.44, "y1": 62.879999999999995, "y2": 201.12}}, {"filename": "../figure/image/1035-Table5-1.png", "caption": "Table 5: Ablation study on MS-MARCO development set", "page": 5, "bbox": {"x1": 315.84, "x2": 517.4399999999999, "y1": 355.68, "y2": 452.15999999999997}}, {"filename": "../figure/image/1035-Table1-1.png", "caption": "Table 1: An example from MS-MARCO. The text in bold is the predicted answer candidate from each passage according to the boundary model. The candidate from [1] is chosen as the final answer by this model, while the correct answer is from [6] and can be verified by the answers from [3], [4], [5].", "page": 1, "bbox": {"x1": 72.0, "x2": 538.0799999999999, "y1": 65.28, "y2": 253.92}}, {"filename": "../figure/image/1035-Table6-1.png", "caption": "Table 6: Scores predicted by our model for the answer candidates shown in Table 1. Although the candidate [1] gets high boundary and content scores, the correct answer [6] is preferred by the verification model and is chosen as the final answer.", "page": 6, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 62.879999999999995, "y2": 172.32}}, {"filename": "../figure/image/1035-Figure1-1.png", "caption": "Figure 1: Overview of our method for multi-passage machine reading comprehension", "page": 2, "bbox": {"x1": 77.28, "x2": 520.3199999999999, "y1": 67.67999999999999, "y2": 298.08}}, {"filename": "../figure/image/1035-Figure2-1.png", "caption": "Figure 2: The boundary probabilities and content probabilities for the words in a passage", "page": 7, "bbox": {"x1": 75.84, "x2": 520.3199999999999, "y1": 66.24, "y2": 165.6}}, {"filename": "../figure/image/1035-Table2-1.png", "caption": "Table 2: Percentage of questions that have multiple valid answers or answer spans", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 62.879999999999995, "y2": 105.11999999999999}}]}