{"title": "Multimodal Affective Analysis Using Hierarchical Attention Strategy with Word-Level Alignment", "abstract": "Multimodal affective computing, learning to recognize and interpret human affect and subjective information from multiple data sources, is still challenging because: (i) it is hard to extract informative features to represent human affects from heterogeneous inputs; (ii) current fusion strategies only fuse different modalities at abstract levels, ignoring time-dependent interactions between modalities. Addressing such issues, we introduce a hierarchical multimodal architecture with attention and word-level fusion to classify utterancelevel sentiment and emotion from text and audio data. Our introduced model outperforms state-of-the-art approaches on published datasets, and we demonstrate that our model's synchronized attention over modalities offers visual interpretability.", "text": [{"id": 0, "string": "Introduction With the recent rapid advancements in social media technology, affective computing is now a popular task in human-computer interaction."}, {"id": 1, "string": "Sentiment analysis and emotion recognition, both of which require applying subjective human concepts for detection, can be treated as two affective computing subtasks on different levels (Poria et al., 2017a) ."}, {"id": 2, "string": "A variety of data sources, including voice, facial expression, gesture, and linguistic content have been employed in sentiment analysis and emotion recognition."}, {"id": 3, "string": "In this paper, we focus on a multimodal structure to leverage the advantages of each data source."}, {"id": 4, "string": "Specifically, given an utterance, we consider the linguistic content and acoustic characteristics together to recognize the opinion or emotion."}, {"id": 5, "string": "Our work is important and useful * Equally Contribution because speech is the most basic and commonly used form of human expression."}, {"id": 6, "string": "A basic challenge in sentiment analysis and emotion recognition is filling the gap between extracted features and the actual affective states ."}, {"id": 7, "string": "The lack of high-level feature associations is a limitation of traditional approaches using low-level handcrafted features as representations (Seppi et al., 2008; Rozgic et al., 2012) ."}, {"id": 8, "string": "Recently, deep learning structures such as CNNs and LSTMs have been used to extract high-level features from text and audio (Eyben et al., 2010a; Poria et al., 2015) ."}, {"id": 9, "string": "However, not all parts of the text and vocal signals contribute equally to the predictions."}, {"id": 10, "string": "A specific word may change the entire sentimental state of text; a different vocal delivery may indicate inverse emotions despite having the same linguistic content."}, {"id": 11, "string": "Recent approaches introduce attention mechanisms to focus the models on informative words (Yang et al., 2016) and attentive audio frames (Mirsamadi et al., 2017) for each individual modality."}, {"id": 12, "string": "However, to our knowledge, there is no common multimodal structure with attention for utterancelevel sentiment and emotion classification."}, {"id": 13, "string": "To address such issue, we design a deep hierarchical multimodal architecture with an attention mechanism to classify utterance-level sentiments and emotions."}, {"id": 14, "string": "It extracts high-level informative textual and acoustic features through individual bidirectional gated recurrent units (GRU) and uses a multi-level attention mechanism to select the informative features in both the text and audio module."}, {"id": 15, "string": "Another challenge is the fusion of cues from heterogeneous data."}, {"id": 16, "string": "Most previous works focused on combining multimodal information at a holistic level, such as integrating independent predictions of each modality via algebraic rules (Wöllmer et al., 2013) or fusing the extracted modality-specific features from entire utterances (Poria et al., 2016) ."}, {"id": 17, "string": "They extract word-level features in a text branch, but process audio at the frame-level or utterance-level."}, {"id": 18, "string": "These methods fail to properly learn the time-dependent interactions across modalities and restrict feature integration at timestamps due to the different time scales and formats of features of diverse modalities (Poria et al., 2017a) ."}, {"id": 19, "string": "However, to determine human meaning, it is critical to consider both the linguistic content of the word and how it is uttered."}, {"id": 20, "string": "A loud pitch on different words may convey inverse emotions, such as the emphasis on \"hell\" for anger but indicating happy on \"great\"."}, {"id": 21, "string": "Synchronized attentive information across text and audio would then intuitively help recognize the sentiments and emotions."}, {"id": 22, "string": "Therefore, we compute a forced alignment between text and audio for each word and propose three fusion approaches (horizontal, vertical, and fine-tuning attention fusion) to integrate both the feature representations and attention at the word-level."}, {"id": 23, "string": "We evaluated our model on four published sentiment and emotion datasets."}, {"id": 24, "string": "Experimental results show that the proposed architecture outperforms state-of-the-art approaches."}, {"id": 25, "string": "Our methods also allow for attention visualization, which can be used for interpreting the internal attention distribution for both single-and multi-modal systems."}, {"id": 26, "string": "The contributions of this paper are: (i) a hierarchical multimodal structure with attention mechanism to learn informative features and high-level associations from both text and audio; (ii) three wordlevel fusion strategies to combine features and learn correlations in a common time scale across different modalities; (iii) word-level attention visualization to help human interpretation."}, {"id": 27, "string": "The paper is organized as follows: We list related work in section 2."}, {"id": 28, "string": "Section 3 describes the proposed structure in detail."}, {"id": 29, "string": "We present the experiments in section 4 and provide the result analysis in section 5."}, {"id": 30, "string": "We discuss the limitations in section 6 and conclude with section 7."}, {"id": 31, "string": "Related Work Despite the large body of research on audio-visual affective analysis, there is relatively little work on combining text data."}, {"id": 32, "string": "Early work combined human transcribed lexical features and low-level handcrafted acoustic features using feature-level fusion ."}, {"id": 33, "string": "Others used SVMs fed bag of words (BoW) and part of speech (POS) features in addition to low-level acoustic features (Seppi et al., 2008; Rozgic et al., 2012; Savran et al., 2012; Rosas et al., 2013; Jin et al., 2015) ."}, {"id": 34, "string": "All of the above extracted low-level features from each modality separately."}, {"id": 35, "string": "More recently, deep learning was used to extract higher-level multimodal features."}, {"id": 36, "string": "Bidirectional LSTMs were used to learn long-range dependencies from low-level acoustic descriptors and derivations (LLDs) and visual features (Eyben et al., 2010a; Wöllmer et al., 2013) ."}, {"id": 37, "string": "CNNs can extract both textual (Poria et al., 2015) and visual features (Poria et al., 2016) for multiple kernel learning of feature-fusion."}, {"id": 38, "string": "Later, hierarchical LSTMs were used (Poria et al., 2017b) ."}, {"id": 39, "string": "A deep neural network was used for feature-level fusion in (Gu et al., 2018) and  introduced a tensor fusion network to further improve the performance."}, {"id": 40, "string": "A very recent work using word-level fusion was provided by ."}, {"id": 41, "string": "The key differences between this work and the proposed architecture are: (i) we design a fine-tunable hierarchical attention structure to extract word-level features for each individual modality, rather than simply using the initialized textual embedding and extracted LLDs from CO-VAREP (Degottex et al., 2014) ; (ii) we propose diverse representation fusion strategies to combine both the word-level representations and attention weights, instead of using only word-level fusion; (iii) our model allows visualizing the attention distribution at both the individual modality and at fusion to help model interpretability."}, {"id": 42, "string": "Our architecture is inspired by the document classification hierarchical attention structure that works at both the sentence and word level (Yang et al., 2016) ."}, {"id": 43, "string": "For audio, an attention-based BLSTM and CNN were applied to discovering emotion from frames (Huang and Narayanan, 2016; Neumann and Vu, 2017) ."}, {"id": 44, "string": "Frame-level weighted-pooling with local attention was shown to outperform frame-wise, final-frame, and framelevel mean-pooling for speech emotion recognition (Mirsamadi et al., 2017) ."}, {"id": 45, "string": "level fusion module."}, {"id": 46, "string": "We first make a forced alignment between the text and audio during preprocessing."}, {"id": 47, "string": "Then, the text attention module and audio attention module extract the features from the corresponding inputs (shown in Algorithm 1)."}, {"id": 48, "string": "The word-level fusion module fuses the extracted feature vectors and makes the final prediction via a shared representation (shown in Algorithm 2)."}, {"id": 49, "string": "Forced Alignment and Preprocessing The forced alignment between the audio and text on the word-level prepares the different data for feature extraction."}, {"id": 50, "string": "We align the data at the wordlevel because words are the basic unit in English for human speech comprehension."}, {"id": 51, "string": "We used aeneas 1 to determine the time interval for each word in the audio file based on the Sakoe-Chiba Band Dynamic Time Warping (DTW) algorithm (Sakoe and Chiba, 1978) ."}, {"id": 52, "string": "For the text input, we first embedded the words into 300-dimensional vectors by word2vec (Mikolov et al., 2013) , which gives us the best result compared to GloVe and LexVec."}, {"id": 53, "string": "Unknown words were randomly initialized."}, {"id": 54, "string": "Given a sentence S with N words, let w i represent the ith word."}, {"id": 55, "string": "We embed the words through the word2vec embedding matrix W e by: T i = W e w i , i ∈ [1, N ] (1) where T i is the embedded word vector."}, {"id": 56, "string": "For the audio input, we extracted Melfrequency spectral coefficients (MFSCs) from raw audio signals as acoustic inputs for two reasons."}, {"id": 57, "string": "Firstly, MFSCs maintain the locality of the data by preventing new bases of spectral energies resulting from discrete cosine transform in MFCCs extraction (Abdel-Hamid et al., 2014) ."}, {"id": 58, "string": "Secondly, it has more dimensions in the frequency domain that aid learning in deep models (Gu et al., 2017) ."}, {"id": 59, "string": "We used 64 filter banks to extract the MFSCs for each audio frame to form the MFSCs map."}, {"id": 60, "string": "To facilitate training, we only used static coefficients."}, {"id": 61, "string": "Each word's MFSCs can be represented as a matrix with 64 × n dimensions, where n is the interval for the given word in frames."}, {"id": 62, "string": "We zero-pad all intervals to the same length L, the maximum frame numbers of the word in the dataset."}, {"id": 63, "string": "We did extract LLD features using OpenSmile (Eyben et al., 2010b) software and combined them with the MFSCs during our training stage."}, {"id": 64, "string": "However, we did not find an 1 https://www.readbeyond.it/aeneas/ Text Attention Module To extract features from embedded text input at the word level, we first used bidirectional GRUs, which are able to capture the contextual information between words."}, {"id": 65, "string": "It can be represented as: t h → i , t h ← i = bi GRU (T i ), i ∈ [1, N ] (2) where bi GRU is the bidirectional GRU, t h → i and t h ← i denote respectively the forward and backward contextual state of the input text."}, {"id": 66, "string": "We combined t h → i and t h ← i as t h i to represent the feature vector for the ith word."}, {"id": 67, "string": "We choose GRUs instead of LSTMs because our experiments show that LSTMs lead to similar performance (0.07% higher accuracy) with around 25% more trainable parameters."}, {"id": 68, "string": "To create an informative word representation, we adopted a word-level attention strategy that generates a one-dimensional vector denoting the importance for each word in a sequence (Yang et al., 2016) ."}, {"id": 69, "string": "As defined by (Bahdanau et al., Algorithm 1 FEATURE EXTRACTION 1: procedure FORCED ALIGNMENT 2: Determine time interval of each word 3: find w i ← → [A ij ], j ∈ [1, L], i ∈ [1, N ] 4: end procedure 5: procedure TEXT BRANCH 6: Text Attention Module 7: for i ∈ [1, N ] do 8: T i ← getEmbedded(w i ) 9: t h i ← bi GRU (T i ) 10: t e i ← getEnergies(t h i ) 11: t α i ← getDistribution(t e i ) 12: end for 13: return t h i , t α i 14: end procedure 15: procedure AUDIO BRANCH 16: for i ∈ [1, N ] do 17: Frame-Level Attention Module 18: for j ∈ [1, L] do 19: f h ij ← bi GRU (A ij ) 20: f e ij ← getEnergies(f h ij ) 21: f α ij ← getDistribution(f e ij ) 22: end for 23: f V i ← weightedSum(f α ij , f h ij ) 24: Word-Level Attention Module 25: w h i ← bi GRU (f V i ) 26: w e i ← getEnergies(w h i ) 27: w α i ← getDistribution(w e i ) 28: end for 29: return w h i , w α i 30: end procedure 2014), we compute the textual attentive energies t e i and textual attention distribution t α i by: t e i = tanh(W t t h i + b t ), i ∈ [1, N ] (3) t α i = exp(t e i v t ) N k=1 exp(t e k v t ) (4) where W t and b t are the trainable parameters and v t is a randomly-initialized word-level weight vector in the text branch."}, {"id": 70, "string": "To learn the word-level interactions across modalities, we directly use the textual attention distribution t α i and textual bidirectional contextual state t h i as the output to aid word-level fusion, which allows further computations between text and audio branch on both the contextual states and attention distributions."}, {"id": 71, "string": "Audio Attention Module We designed a hierarchical attention model with frame-level acoustic attention and word-level at-tention for acoustic feature extraction."}, {"id": 72, "string": "Frame-level Attention captures the important MFSC frames from the given word to generate the word-level acoustic vector."}, {"id": 73, "string": "Similar to the text attention module, we used a bidirectional GRU: f h → ij , f h ← ij = bi GRU (A ij ), j ∈ [1, L] (5) where f h → ij and f h ← ij denote the forward and backward contextual states of acoustic frames."}, {"id": 74, "string": "A ij denotes the MFSCs of the jth frame from the ith word, i ∈ [1, N ]."}, {"id": 75, "string": "f h ij represents the hidden state of the jth frame of the ith word, which consists of f h → ij and f h ← ij ."}, {"id": 76, "string": "We apply the same attention mechanism used for textual attention module to extract the informative frames using equation 3 and 4."}, {"id": 77, "string": "As shown in Figure 1 , the input of equation 3 is f h ij and the output is the framelevel acoustic attentive energies f e ij ."}, {"id": 78, "string": "We calculate the frame-level attention distribution f α ij by using f e ij as the input for equation 4."}, {"id": 79, "string": "We form the word-level acoustic vector f V i by taking a weighted sum of bidirectional contextual state f h ij of the frame and the corresponding framelevel attention distribution f α ij Specifically, f V i = j f α ij f h ij (6) Word-level Attention aims to capture the word-level acoustic attention distribution w α i based on formed word vector f V i ."}, {"id": 80, "string": "We first used equation 2 to generate the word-level acoustic contextual states w h i , where the input is f V i and w h i = (w h → i , w h ← i )."}, {"id": 81, "string": "Then, we compute the word-level acoustic attentive energies w e i via equation 3 as the input for equation 4."}, {"id": 82, "string": "The final output is an acoustic attention distribution w α i from equation 4 and acoustic bidirectional contextual state w h i ."}, {"id": 83, "string": "Word-level Fusion Module Fusion is critical to leveraging multimodal features for decision-making."}, {"id": 84, "string": "Simple feature concatenation without considering the time scales ignores the associations across modalities."}, {"id": 85, "string": "We introduce word-level fusion capable of associating the text and audio at each word."}, {"id": 86, "string": "We propose three fusion strategies (Figure 2 and Algorithm 2): horizontal fusion, vertical fusion, and fine-tuning attention fusion."}, {"id": 87, "string": "These methods allow easy synchronization between modalities, taking advantage of the attentive associations across text and audio, creating a shared high-level representation."}, {"id": 88, "string": "Horizontal Fusion (HF) 3: for i ∈ [1, N ] do 4: t V i ← weighted(t α i , t h i ) 5: w V i ← weighted(w α i , w h i ) 6: V i ← dense([t V i , w V i ]) 7: end for 8: Vertical Fusion (VF) 9: for i ∈ [1, N ] do 10: h i ← dense([t h i , w h i ]) 11: s α i ← average([t α i , w α i ]) 12: V i ← weighted(h i , E ← convN et(V 1 , V 2 , ..., V N ) 22: return E 23: end procedure Horizontal Fusion (HF) provides the shared representation that contains both the textual and acoustic information for a given word (Figure 2  (a) )."}, {"id": 89, "string": "The HF has two steps: (i) combining the bidirectional contextual states (t h i and w h i in Figure 1) and attention distributions for each branch (t α i and w α i in Figure 1 ) independently to form the word-level textual and acoustic representations."}, {"id": 90, "string": "As shown in Figure 2 , given the input (t α i , t h i ) and (w α i , w h i ), we first weighed each input branch by: t V i = t α i t h i (7) w V i = w α i w h i (8) where t V i and w V i are word-level representations for text and audio branches, respectively; (ii) concatenating them into a single space and further applying a dense layer to create the shared context vector V i , and V i = (t V i , w V i )."}, {"id": 91, "string": "The HF combines the unimodal contextual states and attention weights; there is no attention interaction between the text modality and audio modality."}, {"id": 92, "string": "The shared vectors retain the most significant characteristics from respective branches and encourages the decision making to focus on local informative features."}, {"id": 93, "string": "Vertical Fusion (VF) combines textual attentions and acoustic attentions at the word-level, using a shared attention distribution over both modalities instead of focusing on local informative representations (Figure 2 (b) )."}, {"id": 94, "string": "The VF is computed in three steps: (i) using a dense layer after the concatenation of the word-level textual (t h i ) and acoustic (w h i ) bidirectional contextual states to form the shared contextual state h i ; (ii) averaging the textual (t α i ) and acoustic (w α i ) attentions for each word as the shared attention distribution s α i ; (iii) computing the weight of h i and s α i as final shared context vectors V i , where V i = h i s α i ."}, {"id": 95, "string": "Because the shared attention distribution (s α i ) is based on averages of unimodal attentions, it is a joint attention of both textual and acoustic attentive information."}, {"id": 96, "string": "Fine-tuning Attention Fusion (FAF) preserves the original unimodal attentions and provides a fine-tuning attention for the final prediction (Figure2 (c) )."}, {"id": 97, "string": "The averaging of attention weights in vertical fusion potentially limits the representational power."}, {"id": 98, "string": "Addressing such issue, we propose a trainable attention layer to tune the shared attention in three steps: (i) computing the shared attention distribution s α i and shared bidirectional contextual states h i separately using the same approach as in vertical fusion; (ii) applying attention fine-tuning: u e i = tanh(W u h i + b u ) (9) u α i = exp(u e i v u ) N k=1 exp(u e k v u ) + s α i (10) where W u , b u , and v u are additional trainable parameters."}, {"id": 99, "string": "The u α i can be understood as the sum of the fine-tuning score and the original shared attention distribution s α i ; (iii) calculating the weight of u α i and h i to form the final shared context vector V i ."}, {"id": 100, "string": "Decision Making The output of the fusion layer V i is the ith shared word-level vectors."}, {"id": 101, "string": "To further make use of the combined features for classification, we applied a CNN structure with one convolutional layer and one max-pooling layer to extract the final representation from shared word-level vectors (Poria et al., 2016; Wang et al., 2016) ."}, {"id": 102, "string": "We set up various widths for the convolutional filters (Kim, 2014) and generated a feature map c k by: f i = tanh(W c V i:i+k−1 + b c ) (11) c k = max{f 1 , f 2 , ..., f N } (12) where k is the width of the convolutional filters, f i represents the features from window i to i + k − 1."}, {"id": 103, "string": "W c and b c are the trainable weights and biases."}, {"id": 104, "string": "We get the final representation c by concatenating all the feature maps."}, {"id": 105, "string": "A softmax function is used for the final classification."}, {"id": 106, "string": "Experiments Datasets We evaluated our model on four published datasets: two multimodal sentiment datasets (MOSI and YouTube) and two multimodal emotion recognition datasets (IEMOCAP and EmotiW)."}, {"id": 107, "string": "MOSI dataset is a multimodal sentiment intensity and subjectivity dataset consisting of 93 reviews with 2199 utterance segments (Zadeh et al., 2016) ."}, {"id": 108, "string": "Each segment was labeled by five individual annotators between -3 (strong negative) to +3 (strong positive)."}, {"id": 109, "string": "We used binary labels based on the sign of the annotations' average."}, {"id": 110, "string": "YouTube dataset is an English multimodal dataset that contains 262 positive, 212 negative, and 133 neutral utterance-level clips provided by (Morency et al., 2011) ."}, {"id": 111, "string": "We only consider the positive and negative labels during our experiments."}, {"id": 112, "string": "IEMOCAP is a multimodal emotion dataset including visual, audio, and text data (Busso et al., 2008) ."}, {"id": 113, "string": "For each sentence, we used the label agreed on by the majority (at least two of the three annotators)."}, {"id": 114, "string": "In this study, we evaluate both the 4catgeory (happy+excited, sad, anger, and neutral) and 5-catgeory(happy+excited, sad, anger, neutral, and frustration) emotion classification problems."}, {"id": 115, "string": "The final dataset consists of 586 happy, 1005 excited, 1054 sad, 1076 anger, 1677 neutral, and 1806 frustration."}, {"id": 116, "string": "EmotiW 2 is an audio-visual multimodal utterance-level emotion recognition dataset consist of video clips."}, {"id": 117, "string": "To keep the consistency with the IEMOCAP dataset, we used four emotion categories as the final dataset including 150 happy, 117 sad, 133 anger, and 144 neutral."}, {"id": 118, "string": "We used IBM Watson 3 speech to text software to transcribe the audio data into text."}, {"id": 119, "string": "Baselines We compared the proposed architecture to published models."}, {"id": 120, "string": "Because our model focuses on extracting sentiment and emotions from human speech, we only considered the audio and text branch applied in the previous studies."}, {"id": 121, "string": "Sentiment Analysis Baselines BL-SVM extracts a bag-of-words as textual features and low-level descriptors as acoustic features."}, {"id": 122, "string": "An SVM structure is used to classify the sentiments (Rosas et al., 2013) ."}, {"id": 123, "string": "LSTM-SVM uses LLDs as acoustic features and bag-of-n-grams (BoNGs) as textual features."}, {"id": 124, "string": "The final estimate is based on decision-level fusion of text and audio predictions (Wöllmer et al., 2013) ."}, {"id": 125, "string": "Table 1 : Comparison of models."}, {"id": 126, "string": "WA = weighted accuracy."}, {"id": 127, "string": "UA = unweighted accuracy."}, {"id": 128, "string": "* denotes that we duplicated the method from cited research with the corresponding dataset in our experiment."}, {"id": 129, "string": "C-MKL 1 uses a CNN structure to capture the textual features and fuses them via multiple kernel learning for sentiment analysis (Poria et al., 2015) ."}, {"id": 130, "string": "TFN uses a tensor fusion network to extract interactions between different modality-specific features ."}, {"id": 131, "string": "LSTM(A) introduces a word-level LSTM with temporal attention structure to predict sentiments on MOSI dataset ."}, {"id": 132, "string": "Emotion Recognition Baselines SVM Trees extracts LLDs and handcrafted bagof-words as features."}, {"id": 133, "string": "The model automatically generates an ensemble of SVM trees for emotion classification (Rozgic et al., 2012) ."}, {"id": 134, "string": "GSV-eVector generates new acoustic representations from selected LLDs using Gaussian Supervectors and extracts a set of weighed handcrafted textual features as an eVector."}, {"id": 135, "string": "A linear kernel SVM is used as the final classifier (Jin et al., 2015) ."}, {"id": 136, "string": "C-MKL 2 extracts textual features using a CNN and uses openSMILE to extract 6373 acoustic features."}, {"id": 137, "string": "Multiple kernel learning is used as the final classifier (Poria et al., 2016) ."}, {"id": 138, "string": "H-DMS uses a hybrid deep multimodal structure to extract both the text and audio emotional features."}, {"id": 139, "string": "A deep neural network is used for feature-level fusion (Gu et al., 2018) ."}, {"id": 140, "string": "Fusion Baselines Utterance-level Fusion (UL-Fusion) focuses on fusing text and audio features from an entire utterance (Gu et al., 2017) ."}, {"id": 141, "string": "We simply concatenate the textual and acoustic representations into a joint feature representation."}, {"id": 142, "string": "A softmax function is used for sentiment and emotion classification."}, {"id": 143, "string": "Decision-level Fusion (DL-Fusion) Inspired by (Wöllmer et al., 2013) , we extract textual and acoustic sentence representations individually and infer the results via two softmax classifiers, respectively."}, {"id": 144, "string": "As suggested by Wöllmer, we calculate a weighted sum of the text (1.2) result and audio (0.8) result as the final prediction."}, {"id": 145, "string": "Model Training We implemented the model in Keras with Tensorflow as the backend."}, {"id": 146, "string": "We set 100 as the dimension for each GRU, meaning the bidirectional GRU dimension is 200."}, {"id": 147, "string": "For the decision making, we selected 2, 3, 4, and 5 as the filter width and apply 300 filters for each width."}, {"id": 148, "string": "We used the rectified linear unit (ReLU) activation function and set 0.5 as the dropout rate."}, {"id": 149, "string": "We also applied batch normalization functions between each layer to overcome internal covariate shift (Ioffe and Szegedy, 2015) ."}, {"id": 150, "string": "We first trained the text attention module and audio attention module individually."}, {"id": 151, "string": "Then, we tuned the fusion network based on the word-level representation outputs from each fine-tuning module."}, {"id": 152, "string": "For all training procedures, we set the learning rate to 0.001 and used Adam optimization and categorical cross-entropy loss."}, {"id": 153, "string": "For all datasets, we considered the speakers independent and used an 80-20 training-testing split."}, {"id": 154, "string": "We further separated 20% from the training dataset for validation."}, {"id": 155, "string": "We trained the model with 5-fold cross validation and used 8 as the mini batch size."}, {"id": 156, "string": "We set the same amount of samples from each class to balance the training dataset during each iteration."}, {"id": 157, "string": "Result Analysis Comparison with Baselines The experimental results of different datasets show that our proposed architecture achieves state-of-the-art performance in both sentiment analysis and emotion recognition (Table 1) ."}, {"id": 158, "string": "We re-implemented some published methods (Rosas et al., 2013; Wöllmer et al., 2013) on MOSI to get baselines."}, {"id": 159, "string": "For sentiment analysis, the proposed architecture with FAF strategy achieves 76.4% weighted accuracy, which outperforms all the five baselines (Table 1 )."}, {"id": 160, "string": "The result demonstrates that the proposed hierarchical attention architecture and word-level fusion strategies indeed help improve the performance."}, {"id": 161, "string": "There are several findings worth mentioning: (i) our model outperforms the baselines without using the low-level handcrafted acoustic features, indicating the sufficiency of MFSCs; (ii) the proposed approach achieves performance comparable to the model using text, audio, and visual data together ."}, {"id": 162, "string": "This demonstrates that the visual features do not contribute as much during the fusion and prediction on MOSI; (iii) we notice that (Poria et al., 2017b) reports better accuracy (79.3%) on MOSI, but their model uses a set of utterances instead of a single utterance as input."}, {"id": 163, "string": "For emotion recognition, our model with FAF achieves 72.7% accuracy, outperforming all the baselines."}, {"id": 164, "string": "The result shows the proposed model brings a significant accuracy gain to emotion recognition, demonstrating the pros of the finetuning attention structure."}, {"id": 165, "string": "It also shows that wordlevel attention indeed helps extract emotional features."}, {"id": 166, "string": "Compared to C-MKL 2 and SVM Trees that require feature selection before fusion and prediction, our model does not need an additional architecture to select features."}, {"id": 167, "string": "We further evaluated our models on 5 emotion categories, including frustration."}, {"id": 168, "string": "Our model shows 4.2% performance improvement over H-DMS and achieves 0.644 weighted-F1."}, {"id": 169, "string": "As H-DMS only achieves 0.594 F1 and also uses low-level handcrafted features, our model is more robust and efficient."}, {"id": 170, "string": "From Table 1 , all the three proposed fusion strategies outperform UL-Fusion and DL-Fusion on both MOSI and IEMOCAP."}, {"id": 171, "string": "Unlike utterancelevel fusion that ignores the time-scale-sensitive associations across modalities, word-level fusion combines the modality-specific features for each word by aligning text and audio, allowing associative learning between the two modalities, similar to what humans do in natural conversation."}, {"id": 172, "string": "The result indicates that the proposed methods improve the model performance by around 6% accu- Table 3 : Accuracy (%) and F1 score for generalization testing."}, {"id": 173, "string": "racy."}, {"id": 174, "string": "We also notice that the structure with FAF outperforms the HF and VF on both MOSI and IEMOCAP dataset, which demonstrates the effectiveness and importance of the FAF strategy."}, {"id": 175, "string": "Modality and Generalization Analysis From Table 2 , we see that textual information dominates the sentiment prediction on MOSI and there is an only 1.4% accuracy improvement from fusing text and audio."}, {"id": 176, "string": "However, on IEMOCAP, audio-only outperforms text-only, but as expected, there is a significant performance improvement by combining textual and audio."}, {"id": 177, "string": "The difference in modality performance might because of the more significant role vocal delivery plays in emotional expression than in sentimental expression."}, {"id": 178, "string": "We further tested the generalizability of the proposed model."}, {"id": 179, "string": "For sentiment generalization testing, we trained the model on MOSI and tested on the YouTube dataset (Table 3) , which achieves 66.2% accuracy and 0.665 F1 scores."}, {"id": 180, "string": "For emotion recognition generalization testing, we tested the model (trained on IEMOCAP) on EmotiW and achieves 61.4% accuracy."}, {"id": 181, "string": "The potential reasons that may influence the generalization are: (i) the biased labeling for different datasets (five annotators of MOSI vs one annotator of Youtube); (ii) incomplete utterance in YouTube dataset (such as \"about\", \"he\", etc."}, {"id": 182, "string": "); (iii) without enough speech information (EmotiW is a wild audiovisual dataset that focuses on facial expression)."}, {"id": 183, "string": "Visualize Attentions Our model allows us to easily visualize the attention weights of text, audio, and fusion to better understand how the attention mechanism works."}, {"id": 184, "string": "We introduce the emotional distribution visualizations for word-level acoustic attention (w α i ), word-level textual attention (t α i ), shared attention (s α i ), and fine-tuning attention based on the FAF structure (u α i ) for two example sentences (Figure 3) ."}, {"id": 185, "string": "The color gradation represents the importance of the corresponding source data at the word-level."}, {"id": 186, "string": "Based on our visualization, the textual attention distribution (t α i ) denotes the words that carry the most emotional significance, such as \"hell\" for anger (Figure 3 a) ."}, {"id": 187, "string": "The textual attention shows that \"don't\", \"like\", and \"west-sider\" have similar weights in the happy example (Figure 3 b) ."}, {"id": 188, "string": "It is hard to assign this sentence happy given only the text attention."}, {"id": 189, "string": "However, the acoustic attention focuses on \"you're\" and \"west-sider\", removing emphasis from \"don't\" and \"like\"."}, {"id": 190, "string": "The shared attention (s α i ) and fine-tuning attention (u α i ) successfully combine both textual and acoustic attentions and assign joint attention to the correct words, which demonstrates that the proposed method can capture emphasis from both modalities at the word-level."}, {"id": 191, "string": "Discussion There are several limitations and potential solutions worth mentioning: (i) the proposed architecture uses both the audio and text data to analyze the sentiments and emotions."}, {"id": 192, "string": "However, not all the data sources contain or provide textual information."}, {"id": 193, "string": "Many audio-visual emotion clips only have acoustic and visual information."}, {"id": 194, "string": "The proposed architecture is more related to spoken language analysis than predicting the sentiments or emotions based on human speech."}, {"id": 195, "string": "Automatic speech recognition provides a potential solution for generating the textual information from vocal signals."}, {"id": 196, "string": "(ii) The word alignment can be easily applied to human speech."}, {"id": 197, "string": "However, it is difficult to align the visual information with text, especially if the text only describes the video or audio."}, {"id": 198, "string": "Incorporating visual information into an aligning model like ours would be an interesting research topic."}, {"id": 199, "string": "(iii) The limited amount of multimodal sentiment analysis and emotion recognition data is a key issue for current research, especially for deep models that require a large number of samples."}, {"id": 200, "string": "Compared large unimodal sentiment analysis and emotion recognition datasets, the MOSI dataset only consists of 2199 sentence-level samples."}, {"id": 201, "string": "In our experiments, the EmotiW and MOUD datasets could only be used for generalization analysis due to their small size."}, {"id": 202, "string": "Larger and more general datasets are necessary for multimodal sentiment analysis and emotion recognition in the future."}, {"id": 203, "string": "Conclusion In this paper, we proposed a deep multimodal architecture with hierarchical attention for sentiment and emotion classification."}, {"id": 204, "string": "Our model aligned the text and audio at the word-level and applied attention distributions on textual word vectors, acoustic frame vectors, and acoustic word vectors."}, {"id": 205, "string": "We introduced three fusion strategies with a CNN structure to combine word-level features to classify emotions."}, {"id": 206, "string": "Our model outperforms the state-ofthe-art methods and provides effective visualization of modality-specific features and fusion feature interpretation."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 30}, {"section": "Related Work", "n": "2", "start": 31, "end": 48}, {"section": "Forced Alignment and Preprocessing", "n": "3.1", "start": 49, "end": 63}, {"section": "Text Attention Module", "n": "3.2", "start": 64, "end": 70}, {"section": "Audio Attention Module", "n": "3.3", "start": 71, "end": 82}, {"section": "Word-level Fusion Module", "n": "3.4", "start": 83, "end": 99}, {"section": "Decision Making", "n": "3.5", "start": 100, "end": 105}, {"section": "Datasets", "n": "4.1", "start": 106, "end": 117}, {"section": "Baselines", "n": "4.2", "start": 118, "end": 120}, {"section": "Sentiment Analysis Baselines", "n": "4.2.1", "start": 121, "end": 131}, {"section": "Emotion Recognition Baselines", "n": "4.2.2", "start": 132, "end": 139}, {"section": "Fusion Baselines", "n": "4.2.3", "start": 140, "end": 144}, {"section": "Model Training", "n": "4.3", "start": 145, "end": 156}, {"section": "Comparison with Baselines", "n": "5.1", "start": 157, "end": 174}, {"section": "Modality and Generalization Analysis", "n": "5.2", "start": 175, "end": 182}, {"section": "Visualize Attentions", "n": "5.3", "start": 183, "end": 190}, {"section": "Discussion", "n": "6", "start": 191, "end": 202}, {"section": "Conclusion", "n": "7", "start": 203, "end": 206}], "figures": [{"filename": "../figure/image/1036-Table1-1.png", "caption": "Table 1: Comparison of models. WA = weighted accuracy. UA = unweighted accuracy. * denotes that we duplicated the method from cited research with the corresponding dataset in our experiment.", "page": 6, "bbox": {"x1": 73.92, "x2": 526.0799999999999, "y1": 62.879999999999995, "y2": 195.35999999999999}}, {"filename": "../figure/image/1036-Figure1-1.png", "caption": "Figure 1: Overall Architecture", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 61.44, "y2": 359.03999999999996}}, {"filename": "../figure/image/1036-Table2-1.png", "caption": "Table 2: Accuracy (%) and F1 score on text only (T), audio only (A), and multi-modality using FAF (T+A).", "page": 7, "bbox": {"x1": 321.59999999999997, "x2": 510.24, "y1": 62.879999999999995, "y2": 132.0}}, {"filename": "../figure/image/1036-Table3-1.png", "caption": "Table 3: Accuracy (%) and F1 score for generalization testing.", "page": 7, "bbox": {"x1": 318.71999999999997, "x2": 514.0799999999999, "y1": 187.68, "y2": 285.12}}, {"filename": "../figure/image/1036-Figure3-1.png", "caption": "Figure 3: Attention visualization.", "page": 8, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 61.44, "y2": 161.28}}, {"filename": "../figure/image/1036-Figure2-1.png", "caption": "Figure 2: Fusion strategies. t hi: word-level textual bidirectional state. t αi: word-level textual attention distribution. w hi: word-level acoustic bidirectional state. w αi: word-level acoustic attention distribution. s αi: shared attention distribution. u αi: fine-tuning attention distribution. Vi: shared word-level representation.", "page": 4, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 61.44, "y2": 219.35999999999999}}]}