{"title": "Minoan linguistic resources: The Linear A Digital Corpus", "abstract": "This paper describes the Linear A/Minoan digital corpus and the approaches we applied to develop it. We aim to set up a suitable study resource for Linear A and Minoan.", "text": [{"id": 0, "string": "Firstly we start by introducing Linear A and Minoan in order to make it clear why we should develop a digital marked up corpus of the existing Linear A transcriptions."}, {"id": 1, "string": "Secondly we list and describe some of the existing resources about Linear A: Linear A documents (seals, statuettes, vessels etc."}, {"id": 2, "string": "), the traditional encoding systems (standard code numbers referring to distinct symbols), a Linear A font, and the newest (released on June 16th 2014) Unicode Standard Characters set for Linear A. Thirdly we explain our choice concerning the data format: why we decided to digitize the Linear A resources; why we decided to convert all the transcriptions in standard Unicode characters; why we decided to use an XML format; why we decided to implement the TEI-EpiDoc DTD."}, {"id": 3, "string": "Lastly we describe: the developing process (from the data collection to the issues we faced and the solving strategies); a new font we developed (synchronized with the Unicode Characters Set) in order to make the data readable even on systems that are not updated."}, {"id": 4, "string": "Finally, we discuss the corpus we developed in a Cultural Heritage preservation perspective and suggest some future works."}, {"id": 5, "string": "Introduction to Linear A and Minoan Linear A is the script used by the Minoan Civilization (Cotterell, 1980) from 2500 to 1450 BC."}, {"id": 6, "string": "Writing system Time span Cretan Hieroglyphic 2100 -1700 BC Linear A 2500 -1450 BC Linear B 1450 -1200 BC The Minoan Civilization arose on the island of Crete in the Aegean Sea during the Bronze Age."}, {"id": 7, "string": "Minoan ruins and artifacts have been found mainly in Crete but also in other Greek islands and in mainland Greece, in Bulgaria, in Turkey and in Israel."}, {"id": 8, "string": "Linear A is not used anymore and, even after decades of studies (it was discovered by Sir Arthur Evans around 1900 (Evans, 1909) ), it still remains undeciphered."}, {"id": 9, "string": "All the assumptions and hypotheses made about Linear A and Minoan (its underlying language) are mainly based on the comparison with the well known Linear B, the famous child system originated by Linear A."}, {"id": 10, "string": "In fact, Linear B was fully deciphered during the 1950s by Michael Ventris 1 and was found to encode an ancient Greek dialect used by the Mycenaean civilization."}, {"id": 11, "string": "Archaeologist Arthur Evans named the script 'Linear' because it consisted just of lines inscribed in clay (Robinson, 2009) There have been several attempts to decipher Linear A and the Minoan Language."}, {"id": 12, "string": "We can divide the underlying hypotheses in six groups: Greek-like language (Nagy, 1963) , distinct Indo-European branch (Owens, 1999) , Anatolian language close to Luwian (Palmer, 1958) , archaic form of Phoenician (Dietrich and Loretz, 2001) , Indo-Iranian (Faure, 1998) and Etruscan-like language (Giulio M. Facchetti and Negri, 2003) ."}, {"id": 13, "string": "There is also an interesting attempt (Younger, 2000b) to decipher single words, specifically toponyms, by applying Linear B phonetic values to the symbols shared by both Linear A and Linear B and following the assumption that toponyms are much more likely to survive as loans in Mycenaean Greek (written in Linear B); we show an example of this approach in Table 2."}, {"id": 14, "string": "In the next sections we describe the available existing resources concerning Linear A and the Linear A Digital Corpus: why and how we developed it."}, {"id": 15, "string": "Linear A available resources Even if Linear A and Linear B were discovered more than one century ago, Linear A has not been deciphered yet."}, {"id": 16, "string": "Nevertheless, many scholars worked on collecting and organizing all the available data in order to study and to decipher the script and the language."}, {"id": 17, "string": "Probably due to the fact that only historical linguists, philologists and archaeologists attempted to collect and organize all the existing data, nowadays a rich and well organized digital corpus is still not available."}, {"id": 18, "string": "In this section we describe all the available Linear A resources, including both physical documents and digital data."}, {"id": 19, "string": "Table 3 : Indexed types of support (Younger, 2000e) ."}, {"id": 20, "string": "Linear A documents Linear A was written on a variety of media, such as stone offering tables, gold and silver hair pins, and pots (inked and inscribed)."}, {"id": 21, "string": "The clay documents consist of tablets, roundels, and sealings (one-hole, two-hole, and flat-based)."}, {"id": 22, "string": "Roundels are related to a \"conveyance of a commodity, either within the central administration or between the central administration and an external party\" (Palmer, 1995; Schoep, 2002) ."}, {"id": 23, "string": "The roundel is the record of this transaction that stays within the central administration as the commodity moves out of the transacting bureau (Hallager, 1996) ."}, {"id": 24, "string": "Two-hole sealings probably dangled from commodities brought into the center; onehole sealings apparently dangled from papyrus/parchment documents; flat-based sealings (themselves never inscribed) were pressed against the twine that secured papyrus/parchment documents (Younger, 2000g; Schoep, 2002) as shown by photographs (Müller, 1999) , (Müller, 2002) of the imprints that survive on the underside of flat-based sealings."}, {"id": 25, "string": "There are 1,427 Linear A documents containing 7,362-7,396 signs, much less than the quantity of data we have for Linear B (more than 4,600 documents containing 57,398 signs) (Younger, 2000f) ."}, {"id": 26, "string": "Godart and Olivier's Collection of Linear A Inscriptions There is a complete and organized collection of Linear A documents on a paper corpus, the GORILA Louis Godart and Jean-Pierre Olivier, Recueil des inscriptions en Linéaire A (Godart and Olivier, 1976) ."}, {"id": 27, "string": "Godart and Olivier have indexed the documents by original location and type of support, following the Raison-Pope Index (Raison and Pope, 1971) ."}, {"id": 28, "string": "For example, the document AP Za 1 is from AP = Apodoulou and the support type is Za = stone vessels as shown in Table 3 ."}, {"id": 29, "string": "Younger (2000h) provides a map with all the Cretan sites and one with all the Greek non-Cretan sites (Younger, 2000i) ."}, {"id": 30, "string": "Godart and Olivier also provide referential data about conservation places (mainly museums), and periodization (for example: EM II = Second Early Minoan)."}, {"id": 31, "string": "Since 1976, this has been the main source of data and point of reference about Linear A documents and it has set up the basis for further studies."}, {"id": 32, "string": "Even recent corpora, such as the Corpus transnuméré du linéaire A (Raison and Pope, 1994) , always refer to GORILA precise volumes and pages describing each document."}, {"id": 33, "string": "John G. Younger's website Younger (2000j) has published a website that is the best digital resource available (there is another interesting project, never completed, on Yannis Deliyannis's website 2 )."}, {"id": 34, "string": "It collects most of the existing inscriptions (taking GORILA as main source of data and point of reference) transcribed as Linear B phonetic values (like the KU-NI-SU transcription above)."}, {"id": 35, "string": "The transcriptions are kept up to date and a complete restructuring in June 2015 has been announced (Younger, 2000j) ."}, {"id": 36, "string": "GORILA symbols catalogue Many transcription systems have been defined."}, {"id": 37, "string": "The first one has been proposed by Raison and Pope (1971) and uses a string composed by one or two characters (Lm, L or Lc depending on the symbol, respectively metric, phonetic or compound) followed by a number, for example: L2."}, {"id": 38, "string": "This system has been widely used by many scholars such as David Woodley Packard (president of the Packard Humanities Institute 3 ), Colin Renfrew and Richard Janko (Packard, 1974; Renfrew, 1977; Janko, 1982) ."}, {"id": 39, "string": "The second one, used in the GORILA collection (Godart and Olivier, 1976 ) and on John G. Younger's website, consists of a string composed by one or two characters (AB if the symbol is shared by Linear A and Linear B, A if the symbol is only used in Linear A) followed by a number and eventually other alphabetical characters (due to addenda and corrigenda to earlier versions), for example: AB03."}, {"id": 40, "string": "Many scholars transcribe the symbols shared by Linear A and B with the assumed phonetical/syllabic transcription."}, {"id": 41, "string": "This syllabic transcription is based on the corresponding Linear B phonetic values."}, {"id": 42, "string": "Younger (2000a) provides a conversion table of Pope and Raison's transcription system, GO-RILA's transcription system and his own phonetic/syllabic transcription system."}, {"id": 43, "string": "Developing our corpus, we worked mainly on Younger's syllabic and GORILA transcriptions, because the Unicode Linear A encoding is broadly based on the GORILA catalogue, which is also the basic set of characters used in decipherment efforts 4 ."}, {"id": 44, "string": "We provide an example of different transcriptions for the same symbol in Table 4 ."}, {"id": 45, "string": "As can be noticed, the Unicode encoding is based on the GORILA transcription system."}, {"id": 46, "string": "Linear A Font The best Linear A Font available is LA.ttf, released by D.W. Borgdorff 5 in 2004."}, {"id": 47, "string": "In this font some arbitrary Unicode positions for Latin characters are mapped to Linear A symbols."}, {"id": 48, "string": "On one hand this allows the user to type Linear A symbols directly by pressing the keys on the keyboard; on the other hand, only transliterations can be produced."}, {"id": 49, "string": "The text eventually typed internally will be a series of Latin characters."}, {"id": 50, "string": "It should be remarked that this font would not be useful to make readable a Linear A corpus that is non-translittered and encoded in Unicode."}, {"id": 51, "string": "Unicode Linear A Characters Set On June 16th 2014, Version 7.0 of Unicode standard was released 6 , adding 2,834 new characters and including, finally, the Linear A character set."}, {"id": 52, "string": "Linear A block has been set in the range 10600-1077F and the order mainly follows GORILA's one 7 , as seen in Table 4 ."}, {"id": 53, "string": "This Unicode Set covers simple signs, vase shapes, complex signs, complex signs with vase shapes, fractions and compound fractions."}, {"id": 54, "string": "This is a resource that opens, for the first time, the possibility to develop a Linear A digital corpus not consisting of a transliteration or alternative transcription."}, {"id": 55, "string": "Corpus data format Many scholars have faced the issues for data curation and considered various possibilities."}, {"id": 56, "string": "Among all the possible solutions, we chose to develop the Linear A Digital Corpus as a collection of TEI-EpiDoc XML documents."}, {"id": 57, "string": "In this section we explain why."}, {"id": 58, "string": "Why Digital?"}, {"id": 59, "string": "Many epigraphic corpora have begun to be digitalized; there are many reasons to do so."}, {"id": 60, "string": "A digital corpus can include several representations of the inscriptions (Mahoney, 2007) : • pictures of the original document; • pictures of drawings or transcriptions made by hand simplifying the document; • diplomatic transcriptions; • edited texts; • translations; • commentaries."}, {"id": 61, "string": "Building a database is enough to get much richer features than the ones a paper corpus would provide."}, {"id": 62, "string": "The most visible feature of an epigraphic database is its utility as an Index Universalis (Gómez Pantoja and Álvarez, 2011); unlike hand-made indexes, there is no need to constrain the number of available search-keys."}, {"id": 63, "string": "Needless to say, the opportunity to have the data available also on the web is valuable."}, {"id": 64, "string": "Why Unicode?"}, {"id": 65, "string": "Text processing must also take into account the writing systems represented in the corpus."}, {"id": 66, "string": "If the corpus consists of inscriptions written in the Latin alphabet, then the writing system of the inscriptions is the same as that of the Western European modern languages used for meta-data, translations, and commentaries."}, {"id": 67, "string": "In our case, unluckily, we have to deal with Linear A, so we need to find a way to represent our text."}, {"id": 68, "string": "Scholars objected to epigraphic databases on the ground of its poor graphic ability to represent non-Latin writing systems (García Barriocanal et al., 2011) ."}, {"id": 69, "string": "This led to the use of non-standard fonts in some databases which probed to be a bad move, compromising overall compatibility and system upgrading."}, {"id": 70, "string": "This approach is appealing because if the corpus needs to be printed, sooner or later fonts will be a need in all cases."}, {"id": 71, "string": "The font-based solution assumes that all the software involved can recognize font-change markers."}, {"id": 72, "string": "Unluckily, some Database Management Systems (DMSs) do not allow changes of font within a text field and some export or interchange formats lose font information."}, {"id": 73, "string": "When the scripts of the corpus are all supported, which will be the case for any script still used by a living language, Unicode is a better approach."}, {"id": 74, "string": "Despite Minoan not being a living language, Linear A is finally part of the Unicode 7.0 Character Code Charts 8 but some sign groups conventionally interpreted as numbers have no Unicode representation."}, {"id": 75, "string": "Why XML?"}, {"id": 76, "string": "Until not so long ago, markup systems have always involved special typographical symbols in the text-brackets, underdots, and so on."}, {"id": 77, "string": "Some epigraphers see XML as a natural transformation of what they have always done, with all the additional benefits that come from standardization within the community."}, {"id": 78, "string": "There is a growing consensus that XML is the best way to encode text."}, {"id": 79, "string": "Some corpora may also use the typographical marks of the Leiden system, which has the advan-<glyph xml:id=\"n5\"> <glyphName> Number 5 </glyphName> <mapping type=\"standardized\"> 5 </mapping> </glyph> tage of being entirely familiar to the epigraphers who create and maintain the corpus."}, {"id": 80, "string": "Unfortunately, the special brackets, underdots, and other typographical devices may not be supported by the character set of the computer system to be used."}, {"id": 81, "string": "A key incentive for using XML is the ability to exchange data with other projects."}, {"id": 82, "string": "It is convenient to be able to divide the information in many layers: cataloging, annotating, commenting and editing the inscriptions."}, {"id": 83, "string": "In some cases, merging different layers from different projects could be a need (for example when each of these projects is focused on a specific layer, for which provides the best quality), as a consequence the resulting data should be in compatible forms."}, {"id": 84, "string": "If the projects use the same Document Type Definition (DTD), in the same way, this is relatively easy."}, {"id": 85, "string": "While corpora that store their texts as wordprocessor files with Leiden markup can also share data, they must agree explicitly on the details of text layout, file formats, and character encodings."}, {"id": 86, "string": "With XML, it is possible to define either elements or entities for unsupported characters."}, {"id": 87, "string": "This feature is particularly interesting in our case, giving a solution for the numbers representation (Linear A numbers, except for fractions, have no Unicode representation)."}, {"id": 88, "string": "Suppose you want to mark up the sign group , conventionally interpreted as the number 5, in the XML."}, {"id": 89, "string": "As specified in the TEI DTD, this could be expressed as <g ref=\"#n5\"/>, where the element g indicates a glyph, or a non-standard character and the attribute value points to the element glyph, which contains information about the specific glyph."}, {"id": 90, "string": "An example is given in Figure 1 ."}, {"id": 91, "string": "Alternatively, the project might define an entity to represent this character."}, {"id": 92, "string": "Either way, the XML text notes that there is the Linear A number 5, and the later rendering of the text for display or printing can substitute the appropriate character in a known font, a picture of the character, or even a numeral from a different system."}, {"id": 93, "string": "Such approaches assume that tools are available for these conversions; some application, transformation, or stylesheet must have a way to know how to interpret the given element or entity."}, {"id": 94, "string": "The usage of XML provides two advantages: in first place, it makes possible the encoding of the characters that occur in the text (as shown above); in second place, it's really useful for encoding meta-information."}, {"id": 95, "string": "Why EpiDoc?"}, {"id": 96, "string": "If a project decides to use XML, the most appropriate DTD (or schema) to be used needs to be chosen."}, {"id": 97, "string": "As in every other humanities discipline, the basic question is whether to use a general DTD, like the TEI, or to write a project-specific one."}, {"id": 98, "string": "Some projects need DTDs that are extremely specific to the types of inscriptions they are dealing with, instead other projects prefer to rely on existing, widely used DTDs."}, {"id": 99, "string": "Mahoney (2007) has deeply analyzed all the digitization issues, taking into account all the advantages and disadvantages of different approaches; her conclusion is that it's best to use EpiDoc 9 an XML encoding tool that could be also used to write structured documents compliant with the TEI standard 10 ."}, {"id": 100, "string": "The EpiDoc DTD is the TEI, with a few epigraphically oriented customizations made using the standard TEI mechanisms."}, {"id": 101, "string": "Rather than writing a DTD for epigraphy from scratch, the Epi-Doc group uses the TEI because TEI has already addressed many of the taxonomic and semantic challenges faced by epigraphers, because the TEIusing community can provide a wide range of best-practice examples and guiding expertise, and because existing tooling built around TEI could easily lead to early and effective presentation and use of TEI-encoded epigraphic texts (Mahoney, 2007) ."}, {"id": 102, "string": "The TEI and EpiDoc approaches have already been adopted by several epigraphic projects (Bodard, 2009 ), such as the Dêmos project (Furman University) and the corpus of Macedonian and Thracian inscriptions being compiled at KERA, the Research Center for Greek and Roman Antiquity at Athens (Mahoney, 2007) ."}, {"id": 103, "string": "Also other scholars evaluate EpiDoc as a suitable choice."}, {"id": 104, "string": "Felle (2011) compares the EAGLE (Electronic Archive of Greek and Latin Epigraphy 11 ) project with the EpiDoc existing resources, viewing these resources as different but complementary."}, {"id": 105, "string": "Álvarez et al."}, {"id": 106, "string": "(2010) and Gómez Pantoja and Álvarez (2011) discuss the possibility of sharing Epigraphic Information as EpiDoc-based Linked Data and describe how they implemented a relational-to-linked data solution for the Hispania Epigraphica database."}, {"id": 107, "string": "Cayless (2003) evaluates EpiDoc as a relevant digital tool for Epigraphy allowing for a uniform representation of epigraphic metadata."}, {"id": 108, "string": "The EpiDoc guidelines are emerging as one standard for digital epigraphy with the TEI."}, {"id": 109, "string": "EpiDoc is not the only possible way to use the TEI for epigraphic texts but the tools, documentation, and examples 12 make it a good environment for new digitization projects as ours."}, {"id": 110, "string": "EpiDoc structure An EpiDoc document is structured as a standard TEI document with the teiHeader element including some initial Desc sections (fileDesc, encodingDesc, profileDesc, revisionDesc, etc) containing metadata, general information and descriptions (here we annotated place, period, kind of support and specific objects/fragments IDs)."}, {"id": 111, "string": "An interesting use of encodingDesc is shown in Figure 1 above: the gliph element has to be defined inside its parent element charDecl and its grandparent element encodingDesc."}, {"id": 112, "string": "The teiHeader element is followed by the text element including the body element composed by a series of unnumbered <div>s, distinguished by their type attributes (we show an example of the Epidoc <div> element in Figure 2 )."}, {"id": 113, "string": "Typical divisions might include: • text itself (type=\"edition\"); • translation (type=\"translation\"); 11 http://www.eagle-eagle.it/ 12 http://wiki.tei-c.org/index.php/ Samples_of_TEI_texts • description (type=\"description\"; • commentary (type=\"commentary\"); • historical information(type=\"history\"); • bibliography (type=\"bibliography\")."}, {"id": 114, "string": "<div lang=\"minoan\" n=\"text\" type=\"edition\" part=\"N\" sample=\"complete\" org=\"uniform\"> <head lang=\"eng\">Edition</head> <cb rend=\"front\" n=\"HM 1673\"/> <ab part=\"N\"> <lb n=\"1\"/> <w part=\"N\"> </w> <space dim=\"horizontal\" extent=\"1em\" unit=\"character\"/> <w part=\"N\"> </w> <lb n=\"2\"/> <w part=\"N\"> </w> <g ref=\"#n5\"/> <w part=\"N\"> </w> <lb n=\"3\"/> <w part=\"N\"> </w> <g ref=\"#n12\"/> <w part=\"N\"> </w> <lb n=\"4\"/> <w part=\"N\"> </w> <g ref=\"#n6\"/> <lb n=\"5\"/> <w part=\"N\"> </w> <lb n=\"6\"/> <g ref=\"#n4\"/> <w part=\"N\"> </w> <supplied reason=\"damage\"> </supplied> <gap extent=\"2em\" reason=\"lost\" unit=\"character\" dim=\"right\"/> </ab> </div> The EpiDoc DTD introduces a finite set of possible values for the type of a <div>, so that there is a clear distinction between sections covering different aspects, such as the commentary, the description or the archaeological history."}, {"id": 115, "string": "One advantage of structured markup is that editors can encode more information about how certain a particular feature is."}, {"id": 116, "string": "The date of an inscription, for example, can be encoded as a range of possible dates."}, {"id": 117, "string": "EpiDoc includes the TEI <certainty> element and the cert attribute to encourage editors to say whether or not they are completely confident of a given reading."}, {"id": 118, "string": "After some discussion, the EpiDoc community (Mahoney, 2007) decided that certainty should be expressed as a yes-or-no value: either the editor is certain of the reading, or not."}, {"id": 119, "string": "Gradual certainty is too complicated to manage and is best explained in the commentary."}, {"id": 120, "string": "Developing the Linear A Corpus The hope that computational approaches could help decipher Linear A, along with the evident lack of rich digital resources in this field, led us to develop this new resource."}, {"id": 121, "string": "In this section we describe which issues we faced and which solving strategies we used."}, {"id": 122, "string": "Data Collection Luckily the existence of Younger's website and GORILA volumes, together with the Raison-Pope Index, made possible a semi-automatic collection process, starting from syllabic transcriptions taken from Younger's website (with his permission), converting them in Unicode strings through Python scripts and acquiring all the metadata provided in Younger's transcriptions (location and support IDs, conservation place, periodization etc.)."}, {"id": 123, "string": "Younger's resources on his website consist of two HTML pages, one containing inscriptions from Haghia Triada (that is the richest location in terms of documents found there) (Younger, 2000k) and the other containing documents from all the other locations (Younger, 2000l )."}, {"id": 124, "string": "Younger's transcriptions are well enriched with metadata."}, {"id": 125, "string": "The metadata convey the same information found in GORILA, including the Raison-Pope Index, plus some additional description of the support (this was not necessary in GORILA volumes, where the transcriptions are shown just next to the documents pictures) and the reference to the specific GORILA volume and pages."}, {"id": 126, "string": "Segmentation Issues When working on ancient writing systems, segmentation issues are expected to come up."}, {"id": 127, "string": "John G. Younger explains (Younger, 2000c ) that in Linear A separation is mainly indicated in two ways: first, by associating sign groups with numbers or logograms, thereby implying a separation; second, by placing a dot between two sign groups, thereby explicitly separating the sign groups or between a sign group and some other sign like a transaction sign or a logogram."}, {"id": 128, "string": "Younger also explains that in texts that employ a string of sign groups, dots are used to separate them and this practice is most notable on non-bureaucratic texts and especially in religious texts."}, {"id": 129, "string": "On his website, Younger also covers the hyphenization issue (Younger, 2000d) , explaining that in some cases we find a split across lines and the reason may involve separating prefixes from base words (the root of a sign group) or base words from their suffixes."}, {"id": 130, "string": "As Younger points out, this hypothesis would require evidence showing that affixes are involved."}, {"id": 131, "string": "The hyphenization issue is more complex to solve because a 'neutral' resource should avoid transcriptions implying a well known segmentation for Linear A sign groups."}, {"id": 132, "string": "In Younger's transcriptions, split sign groups are reunified in order to make it clearer when a known sign group is there."}, {"id": 133, "string": "Instead, our digital collection keeps the text as it is on the document, all the information about interpretations of such kind can be stored separately."}, {"id": 134, "string": "Obtaining Unicode transcriptions We managed to obtain Unicode encoded transcriptions by automatically converting Younger's phonetic transcriptions to GORILA transcriptions (manually checked against GORILA volumes) and then by automatically converting GORILA transcriptions to Unicode codes and printing them as Unicode characters (UTF-8 encoding)."}, {"id": 135, "string": "In order to create the syllables-to-GORILA and the GORILA-to-Unicode dictionaries, we took into account Younger's conversion table mentioned in Subsection 2.4 and the official Unicode documentation (containing explicit Unicode-to-GORILA mapping information)."}, {"id": 136, "string": "All these processing steps have been implemented through Python scripts."}, {"id": 137, "string": "XML annotation Once collected the whole corpus encoded in Unicode, we automatically added part of the XML annotation through a python script."}, {"id": 138, "string": "These documents have been later manually corrected and completed, checking against GORILA volumes."}, {"id": 139, "string": "A new Linear A font Before the Unicode 7.0 release, there was no way to visualize Unicode characters in the range 10600-1077F."}, {"id": 140, "string": "Even now, systems that are not updated may have trouble to visualize those characters."}, {"id": 141, "string": "Some implementations for Unicode support in certain contexts (for example for L A T E X's output) are not always up-to-date, so it is not obvious that the fonts for the most recent characters sets are available."}, {"id": 142, "string": "We decided to develop a new Linear A font, solving the main issue found in LA.ttf (wrong Unicode positions)."}, {"id": 143, "string": "Starting from the official Unicode documentation, we created a set of symbols graphically similar to the official ones and aligned them to the right Unicode positions."}, {"id": 144, "string": "We decided to name the font John_Younger.ttf to show our appreciation for Younger's work."}, {"id": 145, "string": "He made the results of GORILA available to a wider public on digital media; this is the same goal we want to pursue by developing and distributing this font."}, {"id": 146, "string": "We released the font file at the following URL: http://openfontlibrary."}, {"id": 147, "string": "org/en/font/john-younger."}, {"id": 148, "string": "The Linear A Digital Corpus as cultural resource As stated by European Commission (2015) and UNESCO (2003) , the meaning of the notion of cultural heritage does not apply just to material objects and works of art, but also to 'intangible cultural heritage', as traditions and creative expressions."}, {"id": 149, "string": "In this perspective, linguistic corpora fit perfectly this definition; in fact, they contain information about tradition, knowledge and lifestyle of a certain culture."}, {"id": 150, "string": "Despite the fact that the Minoan language has not yet been deciphered, we know that the Linear A corpus provides interesting information concerning economy, commerce and religion."}, {"id": 151, "string": "As mentioned in Subsection 2.1, Schoep (2002) made a critical assessment of the Linear A tablets and their role in the administrative process, studying the physical supports."}, {"id": 152, "string": "Ruth Palmer (1995) made a deep study of commodities distributions (listing precise quantities and places) among Minoan centers, even without a full understanding of documents contents."}, {"id": 153, "string": "As Palmer points out, 'the ideograms for basic commodities, and the formats of the Linear A texts are similar enough to their Linear B counterparts to allow valid comparison of the types and amounts of commodities which appear in specific contexts'."}, {"id": 154, "string": "So, it's possible to have 'an idea of the focus of the economy' and of 'the scale and complexity of the transactions'."}, {"id": 155, "string": "From the linear A tablets, we can infer information about the resources management and administration system of Minoan centers."}, {"id": 156, "string": "Van den Kerkhof and Rem (2007) analyzed the Minoan libation formulas: religious inscriptions on cups, ladles and tables that were used in the offerings of oil and other powerful drinks at dawn."}, {"id": 157, "string": "The priestesses that carried out the Minoan libation ritual used all kinds of utensils, and they often inscribed their sacred formulas onto these objects."}, {"id": 158, "string": "Around thirty of these texts have survived (whole or in part) on libation tables, ladles and vases, written in various kinds of handwriting."}, {"id": 159, "string": "Transcripts of these religious inscriptions are available from Consani et al."}, {"id": 160, "string": "(1999) and from John G. Younger (2000m) on his website."}, {"id": 161, "string": "As noticed by Duhoux (1989) the Minoan libation formulas have a fixed structure with variable elements."}, {"id": 162, "string": "In fact, some studies (Davis, 2014) about Minoan syntax have been made by observing the sign groups order found in these regular formulas."}, {"id": 163, "string": "More importantly, the presence of olive-like ideograms could tell us that the Minoans used olive oil for libation (Van den Kerkhof and Rem, 2007) ."}, {"id": 164, "string": "Beyond all these parts of the Minoan cultural heritage already available, a huge part is preserved there too: the Minoan language, with its hidden stories reflecting the life of a civilization."}, {"id": 165, "string": "We hope that our contribution can be useful to the community and that the Minoan, in its digital form, may finally be deciphered through computational approaches."}, {"id": 166, "string": "Future Work We are working on XSL style sheets in order to create suitable HTML pages."}, {"id": 167, "string": "All the data will be freely available and published at the following URL: http://ling.ied.edu.HK/ gregoire/lineara."}, {"id": 168, "string": "A further step will be developing a web interface to annotate, and dynamically enrich the corpus information."}], "headers": [{"section": "Introduction to Linear A and Minoan", "n": "1", "start": 4, "end": 14}, {"section": "Linear A available resources", "n": "2", "start": 15, "end": 19}, {"section": "Linear A documents", "n": "2.1", "start": 20, "end": 25}, {"section": "Godart and Olivier's Collection of Linear A Inscriptions", "n": "2.2", "start": 26, "end": 32}, {"section": "John G. Younger's website", "n": "2.3", "start": 33, "end": 35}, {"section": "GORILA symbols catalogue", "n": "2.4", "start": 36, "end": 45}, {"section": "Linear A Font", "n": "2.5", "start": 46, "end": 50}, {"section": "Unicode Linear A Characters Set", "n": "2.6", "start": 51, "end": 54}, {"section": "Corpus data format", "n": "3", "start": 55, "end": 58}, {"section": "Why Digital?", "n": "3.1", "start": 59, "end": 64}, {"section": "Why Unicode?", "n": "3.2", "start": 65, "end": 75}, {"section": "Why XML?", "n": "3.3", "start": 76, "end": 95}, {"section": "Why EpiDoc?", "n": "3.4", "start": 96, "end": 109}, {"section": "EpiDoc structure", "n": "3.5", "start": 110, "end": 118}, {"section": "Developing the Linear A Corpus", "n": "4", "start": 119, "end": 121}, {"section": "Data Collection", "n": "4.1", "start": 122, "end": 125}, {"section": "Segmentation Issues", "n": "4.2", "start": 126, "end": 133}, {"section": "Obtaining Unicode transcriptions", "n": "4.3", "start": 134, "end": 135}, {"section": "XML annotation", "n": "4.4", "start": 136, "end": 138}, {"section": "A new Linear A font", "n": "4.5", "start": 139, "end": 147}, {"section": "The Linear A Digital Corpus as cultural resource", "n": "5", "start": 148, "end": 164}, {"section": "Future Work", "n": "6", "start": 165, "end": 168}], "figures": [{"filename": "../figure/image/1038-Table1-1.png", "caption": "Table 1: Time spans of Cretan Hieroglyphic, Linear A and Linear B.", "page": 0, "bbox": {"x1": 329.76, "x2": 503.03999999999996, "y1": 206.4, "y2": 254.88}}, {"filename": "../figure/image/1038-Table2-1.png", "caption": "Table 2: Example of John G. Younger’s deciphering attempt.", "page": 1, "bbox": {"x1": 110.88, "x2": 251.04, "y1": 64.8, "y2": 108.47999999999999}}, {"filename": "../figure/image/1038-Table3-1.png", "caption": "Table 3: Indexed types of support (Younger, 2000e).", "page": 1, "bbox": {"x1": 338.4, "x2": 494.4, "y1": 64.8, "y2": 223.67999999999998}}, {"filename": "../figure/image/1038-Table4-1.png", "caption": "Table 4: Excerpt of John G. Younger’s transcription systems conversion table extended with the Unicode codes.", "page": 2, "bbox": {"x1": 77.75999999999999, "x2": 297.59999999999997, "y1": 65.75999999999999, "y2": 114.24}}]}