{"title": "Introduction to SIGHAN 2015 Bake-off for Chinese Spelling Check", "abstract": "This paper introduces the SIGHAN 2015 Bake-off for Chinese Spelling Check, including task description, data preparation, performance metrics, and evaluation results. The competition reveals current state-of-the-art NLP techniques in dealing with Chinese spelling checking. All data sets with gold standards and evaluation tool used in this bake-off are publicly available for future research.", "text": [{"id": 0, "string": "Introduction to SIGHAN 2015 Bake-off for Chinese Spelling Check 1 Introduction Chinese spelling checkers are relatively difficult to develop, partly because no word delimiters exist among Chinese words and a Chinese word can contain only a single character or multiple characters."}, {"id": 1, "string": "Furthermore, there are more than 13 thousand Chinese characters, instead of only 26 letters in English, and each with its own context to constitute a meaningful Chinese word."}, {"id": 2, "string": "All these make Chinese spell checking a challengeable task."}, {"id": 3, "string": "An empirical analysis indicated that Chinese spelling errors frequently arise from confusion among multiple-character words, which are phonologically and visually similar, but semantically distinct (Liu et al., 2011) ."}, {"id": 4, "string": "The automatic spelling checker should have both capabilities of identifying the spelling errors and suggesting the correct characters of erroneous usages."}, {"id": 5, "string": "The SIGHAN 2013 Bake-off for Chinese Spelling Check was the first campaign to provide data sets as benchmarks for the performance evaluation of Chinese spelling checkers (Wu et al., 2013) ."}, {"id": 6, "string": "The data in SIGHAN 2013 originated from the essays written by native Chinese speakers."}, {"id": 7, "string": "Following the experience of the first evaluation, the second bake-off was held in CIPS-SIGHAN Joint CLP-2014 conference, which focuses on the essays written by learners of Chinese as a Foreign Language (CFL) (Yu et al., 2014) ."}, {"id": 8, "string": "Due to the greater challenge in detecting and correcting spelling errors in CFL leaners' written essays, SIGHAN 2015 Bake-off, again features a Chinese Spelling Check task, providing an evaluation platform for the development and implementation of automatic Chinese spelling checkers."}, {"id": 9, "string": "Given a passage composed of several sentences, the checker is expected to identify all possible spelling errors, highlight their locations, and suggest possible corrections."}, {"id": 10, "string": "The rest of this article is organized as follows."}, {"id": 11, "string": "Section 2 provides an overview of the SIGHAN 2015 Bake-off for Chinese Spelling Check."}, {"id": 12, "string": "Section 3 introduces the developed data sets."}, {"id": 13, "string": "Section 4 proposes the evaluation metrics."}, {"id": 14, "string": "Section 5 compares results from the various contestants."}, {"id": 15, "string": "Finally, we conclude this paper with findings and offer future research directions in Section 6."}, {"id": 16, "string": "Task Description The goal of this task is to evaluate the capability of a Chinese spelling checker."}, {"id": 17, "string": "A passage consisting of several sentences with/without spelling errors is given as the input."}, {"id": 18, "string": "The checker should return the locations of incorrect characters and suggest the correct characters."}, {"id": 19, "string": "Each character or punctuation mark occupies 1 spot for counting location."}, {"id": 20, "string": "The input instance is given a unique passage number pid."}, {"id": 21, "string": "If the sentence contains no spelling errors, the checker should return \"pid, 0\"."}, {"id": 22, "string": "If an input passage contains at least one spelling error, the output format is \"pid [, location, correction]+\", where the symbol \"+\" indicates there is one or more instance of the predicted element \"[, location, correction]\"."}, {"id": 23, "string": "\"Location\" and \"correction\", respectively, denote the location of incorrect character and its correct version."}, {"id": 24, "string": "Examples are given as follows."}, {"id": 25, "string": "There are 2 wrong characters in Ex."}, {"id": 26, "string": "1, and correct characters \"希,\" and \"望\" should be used in locations 4, and 5, respectively."}, {"id": 27, "string": "In Ex."}, {"id": 28, "string": "2, the 17 th character \"偏\" is wrong, and should be \"遍\"."}, {"id": 29, "string": "Location \"0\" denotes that there is no spelling error in Ex."}, {"id": 30, "string": "3 Data Preparation The learner corpus used in our task was collected from the essay section of the computer-based Test of Chinese as a Foreign Language (TOCFL), administered in Taiwan."}, {"id": 31, "string": "The spelling errors were manually annotated by trained native Chinese speakers, who also provided corrections corresponding to each error."}, {"id": 32, "string": "The essays were then split into three sets as follows (1) Training Set: this set included 970 selected essays with a total of 3,143 spelling errors."}, {"id": 33, "string": "Each essay is represented in SGML format shown in Fig."}, {"id": 34, "string": "1 ."}, {"id": 35, "string": "The title attribute is used to describe the essay topic."}, {"id": 36, "string": "Each passage is composed of several sentences, and each passage contains at least one spelling error, and the data indicates both the error's location and corresponding correction."}, {"id": 37, "string": "All essays in this set are used to train the developed spelling checker."}, {"id": 38, "string": "(2) Dryrun Set: a total of 39 passages were given to participants to familiarize themselves with the final testing process."}, {"id": 39, "string": "Each participant can submit several runs generated using different models with different parameter settings of their checkers."}, {"id": 40, "string": "In addition to make sure that the submitted results can be correctly evaluated, participants can fine-tune their developed models in the dryrun phase."}, {"id": 41, "string": "The purpose of dryrun is to validate the submitted output format only, and no dryrun outcomes were considered in the official evaluation (3) Test Set: this set consists of 1,100 testing passages."}, {"id": 42, "string": "Half of these passages contained no spelling errors, while the other half included at least one spelling error."}, {"id": 43, "string": "The evaluation was con- ducted as an open test."}, {"id": 44, "string": "In addition to the data sets provided, registered participant teams were allowed to employ any linguistic and computational resources to detect and correct spelling errors."}, {"id": 45, "string": "Besides, passages written by CFL learners may yield grammatical errors, missing or redundant words, poor word selection, or word ordering problems."}, {"id": 46, "string": "The task in question focuses exclusively on spelling error correction."}, {"id": 47, "string": "<ESSAY title=\"學中文的第一天\"> <TEXT> <PASSAGE id=\"A2-0521-1\"> 這位小姐說：你應 該一直走到十只路口，再右磚一直走經過一家銀 行就到了。</PASSAGE> <PASSAGE id=\"A2-0521-2\">應為今天是第一天， 老師先請學生自己給介紹。</PASSAGE> </TEXT> <MISTAKE id=\"A2-0521-1\" location=\"15\"> <WRONG>十只路口</WRONG> <CORRECTION>十字路口</CORRECTION> </MISTAKE> <MISTAKE id=\"A2-0521-1\" location=\"21\"> <WRONG>右磚</WRONG> <CORRECTION>右轉</CORRECTION> </MISTAKE> <MISTAKE id=\"A2-0521-2\" location=\"1\"> <WRONG>應為</WRONG> <CORRECTION>因為</CORRECTION> </MISTAKE> </ESSAY> Figure 1 ."}, {"id": 48, "string": "An essay represented in SGML format Table 1 shows the confusion matrix used for performance evaluation."}, {"id": 49, "string": "In the matrix, TP (True Positive) is the number of passages with spelling errors that are correctly identified by the spelling checker; FP (False Positive) is the number of passages in which non-existent errors are identified; TN (True Negative) is the number of passages without spelling errors which are correctly identified as such; FN (False Negative) is the number of passages with spelling errors for which no errors are detected."}, {"id": 50, "string": "Performance Metrics The criteria for judging correctness are determined at two levels as follows."}, {"id": 51, "string": "(1) Detection level: all locations of incorrect characters in a given passage should be completely identical with the gold standard."}, {"id": 52, "string": "(2) Correction level: all locations and corresponding corrections of incorrect characters should be completely identical with the gold standard."}, {"id": 53, "string": "In addition to achieve satisfactory detection/correction performance, reducing the false positive rate, that is the mistaken identification of errors where none exist, is also important (Wu et al., 2010) ."}, {"id": 54, "string": "The following metrics are measured at both levels with the help of the confusion matrix."}, {"id": 55, "string": "For example, if 5 testing inputs with gold standards are \"A2-0092-2, 0\", \"A2-0243-1, 3, 健, 4, 康\", \"B2-1923-2, 8, 誤, 41, 情\", \"B2-2731-1, 0\", and \"B2-3754-3, 10, 觀\", and the system outputs the result as \"A2-0092-2, 5, 玩\", \"A2-0243-1, 3, 件, 4, 康\", \"B2-1923-2, 8, 誤, 41, 情\", \"B2-2731-1, 0\", and \"B2-3754-3, 11, 觀\", the evaluation tool will yield the following performance: Table 3 shows the task testing results."}, {"id": 56, "string": "The research team NCTU&NTUT achieved the lowest false positive rate at 0.0509."}, {"id": 57, "string": "For the detectionlevel evaluations, according to the test data distribution, a baseline system can achieve an accuracy level of 0.5 by always reporting all testing cases as correct without errors."}, {"id": 58, "string": "The system result submitted by CAS achieved promising performance exceeding 0.7."}, {"id": 59, "string": "We used the F1 score to reflect the tradeoff between precision and recall."}, {"id": 60, "string": "As shown in the testing results, CAS provided the best error detection results, achieving a high F1 score of 0.6404."}, {"id": 61, "string": "For correction-level evaluations, the correction accuracy provided by the CAS system (0.6918) significantly outperformed the other teams."}, {"id": 62, "string": "Besides, in terms of correction precision and recall, the spelling checker developed by CAS also outperforms the others, which in turn has the highest F1 score of 0.6254."}, {"id": 63, "string": "Note that it is difficult to correct all spelling errors found in the input passages, since some sentences contain multiple errors and only correcting some of them are regarded as a wrong case in our evaluation."}, {"id": 64, "string": "Table 4 summarizes the participants' developed approaches and the usages of linguistic resources."}, {"id": 65, "string": "Among 6 teams that submitted the official testing results, NCYU did not submit the report of its developed method."}, {"id": 66, "string": "None of the submitted systems provided superior performance in all metrics, though those submitted by CAS and NCTU&NTUT provided relatively best overall performance when different metric is considered."}, {"id": 67, "string": "The CAS team proposes a unified framework for Chinese spelling correction."}, {"id": 68, "string": "They used HMM-based approach to segment sentences and generate correction candidates."}, {"id": 69, "string": "Then, a twostage filter process is applied to re-ranking the candidates for choosing the most promising candidates."}, {"id": 70, "string": "The NCTU&NTUT team proposes a word vector/conditional random field based spelling error detector."}, {"id": 71, "string": "They utilize the error detection results to guide and speed up the timeconsuming language model rescoring procedure."}, {"id": 72, "string": "By this way, potential Chinese spelling errors could be detected and corrected in a modified sentence with the maximum language model score."}, {"id": 73, "string": "Evaluation Results Participant (Ordered by abbreviations of names) #Runs Conclusions and Future Work This paper provides an overview of SIGHAN 2015 Bake-off for Chinese spelling check, including task design, data preparation, evaluation metrics, performance evaluation results and the approaches used by the participant teams."}, {"id": 74, "string": "Regardless of actual performance, all submissions contribute to the knowledge in search for an effective Chinese spell checker, and the individual reports in the Bake-off proceedings provide useful insight into Chinese language processing."}, {"id": 75, "string": "We hope the data sets collected for this Bakeoff can facilitate and expedite future development of effective Chinese spelling checkers."}, {"id": 76, "string": "Therefore, all data sets with gold standards and evaluation tool are made publicly available at http://ir.itc.ntnu.edu.tw/lre/sighan8csc.html."}, {"id": 77, "string": "The future direction focuses on the development of Chinese grammatical error correction."}, {"id": 78, "string": "We plan to build new language resources to help improve existing techniques for computer-aided Chinese language learning."}, {"id": 79, "string": "In addition, new data sets obtained from CFL learners will be investigated for the future enrichment of this research topic."}], "headers": [{"section": "Task Description", "n": "2", "start": 16, "end": 29}, {"section": "Data Preparation", "n": "3", "start": 30, "end": 49}, {"section": "Performance Metrics", "n": "4", "start": 50, "end": 72}, {"section": "Conclusions and Future Work", "n": "6", "start": 73, "end": 79}], "figures": [{"filename": "../figure/image/1040-Table1-1.png", "caption": "Table 1. Confusion matrix for evaluation.", "page": 2, "bbox": {"x1": 69.6, "x2": 292.32, "y1": 247.67999999999998, "y2": 340.32}}, {"filename": "../figure/image/1040-Table4-1.png", "caption": "Table 4. A summary of participants’ developed systems", "page": 4, "bbox": {"x1": 70.56, "x2": 524.16, "y1": 69.6, "y2": 440.15999999999997}}, {"filename": "../figure/image/1040-Figure1-1.png", "caption": "Figure 1. An essay represented in SGML format", "page": 1, "bbox": {"x1": 305.76, "x2": 523.1999999999999, "y1": 196.79999999999998, "y2": 445.91999999999996}}, {"filename": "../figure/image/1040-Table2-1.png", "caption": "Table 2. Submission statistics for all participants", "page": 3, "bbox": {"x1": 69.6, "x2": 525.12, "y1": 272.64, "y2": 444.0}}, {"filename": "../figure/image/1040-Table3-1.png", "caption": "Table 3. Testing results of our Chinese spelling check task.", "page": 3, "bbox": {"x1": 69.6, "x2": 525.12, "y1": 496.79999999999995, "y2": 684.9599999999999}}]}