{"title": "Post Retraction Citations in Context", "abstract": "In this paper we explore post retraction citations to retracted papers. The reasons for retractions in our sample were data manipulation, small sample size, scientific misconduct, and duplicate publication by the authors. We found, that the huge majority of the citations are positive, and the citing papers usually fail to mention that the cited article was retracted. Retracted articles are freely available at the publishers' site, which is probably a catalyst for receiving more citations.", "text": [{"id": 0, "string": "Introduction Studies on retracted articles show that the amount of retracted articles has increased in relative measure to the overall increase in scientific publications [1, 2] ."}, {"id": 1, "string": "Although retracting articles helps purge the scientific literature of erroneous or unethical research, citations to such research present a real challenge."}, {"id": 2, "string": "Citing articles that were retracted especially due to plagiarism, data falsification or any other unethical practices interferes with the process of eliminating such studies form the literature and research."}, {"id": 3, "string": "There are two types of retraction citations; citations that a retracted article received prior to its retraction and citations that are received post retraction and despite retraction notices [3, 4] ."}, {"id": 4, "string": "Both types of citations put the scientific process in jeopardy, especially when they are cited as legitimate references to previous work."}, {"id": 5, "string": "Some studies on retracted articles have shown that retracted articles that received a high number of citations preretraction are more likely to occur additional citations post-retraction [4, 5] ."}, {"id": 6, "string": "A good example is described in a study by [6] who studied the case of Scott S. Reuben who was convicted of fabricating data in 25 of his studies which resulted in mass retractions of his articles."}, {"id": 7, "string": "The authors of the study have shown that the popularity of Reuben's articles did not diminish post-retraction even 5 years after the retractions have been made."}, {"id": 8, "string": "Another phenomenon that was identified in the literature is of authors' selfciting their retracted articles and thus contributing to the perception that their retracted work is valid [7] ."}, {"id": 9, "string": "In this study we sought out to find the context around post-retraction citations with the main purpose of finding out whether they are negatively, positively or neutrally mentioned."}, {"id": 10, "string": "In this case study we present a sample of five retracted articles that have post-retraction citations tracked in 2015 and 2016."}, {"id": 11, "string": "2 Data collection ScienceDirect, Elsevier's full text database was accessed in October 2014."}, {"id": 12, "string": "The database was queried for the term \"RETRACTED\" in the article title and its retraction notice."}, {"id": 13, "string": "In ScienceDirect, each retracted article is preceded with the word \"RETRACTED\"."}, {"id": 14, "string": "In addition, each Elsevier journal incorporates a retraction notice which explains who retracted article and the reason for retraction."}, {"id": 15, "string": "This allowed us to manually code each article in our dataset with an additional field \"retracted by\" that represented the person/s requesting the retraction."}, {"id": 16, "string": "A total of 1,203 results retrieved from which 988 were retracted articles."}, {"id": 17, "string": "The results excluded were retraction notices, duplicates and papers whose original titles included the word \"retracted\"."}, {"id": 18, "string": "For this study we selected the five top articles that were cited most (more than 20 times) since 2015."}, {"id": 19, "string": "This way we made sure that the papers all cite retracted articles (since they were all retracted before October 2014)."}, {"id": 20, "string": "The reason for this decision is that the retraction date of many of the retracted articles is unknown."}, {"id": 21, "string": "For each article we extracted the citing documents and analyzed the ones appearing in 2015 and 2016."}, {"id": 22, "string": "Overall, we analyzed located 125 citing documents and analyzed 109 of them; 16 documents were unavailable to us mostly because they appear in books to which we did not have access."}, {"id": 23, "string": "Each citing document was inspected to identify the precise mention of the retracted article within the text."}, {"id": 24, "string": "Each mention was categorized as follows: Positive: A positive citation indicates that the retracted article was cited as legitimate prior work and its findings used to corroborate the author/s current study."}, {"id": 25, "string": "Negative: A negative citations indicates that the authors mentioned the retracted article as such and its findings as inappropriate."}, {"id": 26, "string": "Neutral: A neutral citation indicates that the retracted article was mentioned as a publication that appears in the literature and does not include judgement on its validity."}, {"id": 27, "string": "This article was published in 2010 in Cell and retracted in 2014 due to irregularities in graphs and data misrepresentation in the images."}, {"id": 28, "string": "Although the graphs and images did not have any bearing on the validity of the results, according to the retraction notice, the editors stated that \"…the level of care in figure preparation in Donmez et al."}, {"id": 29, "string": "falls well below the standard that we expect, and we are therefore retracting the paper\"."}, {"id": 30, "string": "We conducted an individual content analysis of the most recent 36 citations which were tracked in 2015 and 2016."}, {"id": 31, "string": "We were able to analyze 32 citing articles in context."}, {"id": 32, "string": "Our results show that the citations are mostly positive (see Fig."}, {"id": 33, "string": "1 )."}, {"id": 34, "string": "One negative mention was found in a letter to the editor of Journal of Korean Medical Science written \"giving the above article as an example of how altered graphics are causing bias in the biomedical field and result in numerous articles being retracted\" [8] ."}, {"id": 35, "string": "In this case, the editor indicated that the actual results of the study were valid, and this could be the reason for the continuous citations of the article."}, {"id": 36, "string": "In one other case, although the article was cited positively in the paper, in the reference list it was noted that the article was retracted."}, {"id": 37, "string": "This article, published in 2012 was the subject of a debate surrounding the validity of the findings, use of animals and even accusations of fraud."}, {"id": 38, "string": "Its publication and retraction process have resulted in the \"Séralini affair\" which became a big media news item."}, {"id": 39, "string": "The article described a 2-year study of rats which were fed genetically modified (GM) crops and showed increased tumors."}, {"id": 40, "string": "The study, which was also scrutinized by government agencies, received major media attention that resulted in the creation of a social movement against GM food."}, {"id": 41, "string": "The demand to label of all GM foods is still underway."}, {"id": 42, "string": "Despite the accusation of fraud and fabrication of results, the editors found no such evidence to that effect."}, {"id": 43, "string": "However, the article was retracted because of the \"low number of animals\" used in this study which lead to the conclusion that \"no definitive conclusions can be reached with this small sample size\"."}, {"id": 44, "string": "This article was cited 109 times since its publication in 2012 with 23 citations tracked after its retraction (2015-2016) out of which 18 citing articles were accessible to us."}, {"id": 45, "string": "As can be seen in Fig."}, {"id": 46, "string": "2 post-retraction citations are divided."}, {"id": 47, "string": "Although more citations are seen to be negative, the positive and neutral ones are also present."}, {"id": 48, "string": "The negative citations mostly point to the media frenzy around the results."}, {"id": 49, "string": "Positive mentions appear in similar studies which claim that concerns raised by the GM study are valid and the dangers of GM foods to humans should be studied further."}, {"id": 50, "string": "The study was republished in 2014 by Environmental Sciences Europe [9] ."}, {"id": 51, "string": "The republication of the study stirred another controversial discussion in the scientific community with several scientists writing letters expressing their concerns regarding the appearance of the same study in another journal [10] ."}, {"id": 52, "string": "The republished article received 17 citations in 2015 and 2016."}, {"id": 53, "string": "The vast majority of them being positive mentions (see Fig."}, {"id": 54, "string": "3 )."}, {"id": 55, "string": "In addition, some criticism towards the peer-review practices of the retracting editors were also detected [10] ."}, {"id": 56, "string": "The one negative mention of the re-published article was criticism towards the media frenzy around the topic and the inability of the scientific community to refute invalid results."}, {"id": 57, "string": "The authors state that \"Although scientists have investigated each GMO crisis and reached scientific and rational conclusions, they have less ability to disseminate information than the media, so the public is not promptly informed of their rational and objective viewpoints as experts\" [11, p.134 ]."}, {"id": 58, "string": "The leading author of the paper, Dipak Das and his lab at the University of Connecticut Health Sciences Center were the subject of an ethical investigation by the university."}, {"id": 59, "string": "The results of the university's investigation led to the retraction of all of Dr. Das' papers due to scientific misconduct and data manipulation."}, {"id": 60, "string": "This particular paper was investigated by the journal's ethics committee along with an additional paper that appeared in This article was retracted in 2014 due to serious data manipulation and falsification."}, {"id": 61, "string": "In the retraction notice of this article, the editors of the journal went to great lengths to examine and re-examine the statistical claims made by the authors using the services of three separate methodologists."}, {"id": 62, "string": "Following the methodologists' findings of irregularities in the reported data and falsification of results, and the authors' lack of proper response to their findings, the article was retracted from the journal."}, {"id": 63, "string": "However, the article continued to be cited despite the lengthy and detailed retraction notice."}, {"id": 64, "string": "A close examination of the post retraction citations (2015-March 2016 -24 citations of which 23 were analyzed) shows that all citations were positive citations, meaning that the citing authors used findings from this article to support their findings."}, {"id": 65, "string": "The subject of \"authentic leadership\" is popular in management studies and has seen a surge in publications since 2012."}, {"id": 66, "string": "This could explain the overall positive citations of the article."}, {"id": 67, "string": "This article, published in 1999 was retracted due to an identical version which was published 2 years earlier."}, {"id": 68, "string": "In the retraction notice the editors state that \"The article duplicates significant parts of a paper that had already appeared in [J China Textil Univ, 1997, 14(3), [8] [9] [10] [11] [12] [13] \"."}, {"id": 69, "string": "The authors in this case re-used data they already published on and re-published it in a different journal."}, {"id": 70, "string": "However, this article has been cited even in recent years despite being retracted for many years."}, {"id": 71, "string": "A content analysis of the 18 out of the 21 recently citing articles from 2015 and 2016 shows that this article is being referred to mostly in positive context or mentioned as a legitimate piece in the literature."}, {"id": 72, "string": "Here too, there is one paper that cites the article positively in the text, but in the references it appears as retracted."}, {"id": 73, "string": "4 Discussion and Conclusions As can be seen from the examples above, retracted articles continue to be cited years after retraction and despite retraction notices being posted on publishers' platforms."}, {"id": 74, "string": "In some cases, the continuous citations rates could be the result of general interest by the public or media."}, {"id": 75, "string": "For example, the Séralini article evoked an ongoing public debate regarding the safety of GM foods which resulted in a call to label all such food."}, {"id": 76, "string": "This could explain the continuing interest in the study and its citations."}, {"id": 77, "string": "The article was also republished and thus continues to be cited despite of the fact that the authors did not modify it."}, {"id": 78, "string": "In the case of the Mukherjee article, again, public interest could explain its continuing citations."}, {"id": 79, "string": "Resveratrol was hailed by the media as an important supplement that could ensure longevity and good health and is an off the counter supplement available in vitamin shops."}, {"id": 80, "string": "Finally, the Walumbwa article which describes 'authentic leadership' and followers' dynamic is also a topic of media and business management interest."}, {"id": 81, "string": "With numerous management books published on this topic it has been accepted as a management style encouraged by corporations."}, {"id": 82, "string": "In other cases, the reason for retraction does not deter others from citing the article."}, {"id": 83, "string": "For example, the Donmez article (case study 1 above) was retracted because of poor graphing and data representation."}, {"id": 84, "string": "However, the editors do state in the retraction notice that these faults do not apply to the results of the study, even though on PubPeer [14] there was an extensive discussion on problems with the article."}, {"id": 85, "string": "The editors' approval of the results could be the reason for the continuing citations to the article."}, {"id": 86, "string": "The Li article, as another example, re-used data and thus violated the originality rule of scientific publishing."}, {"id": 87, "string": "However, the data itself was not refuted by the editors and the article that was published first seems to be inaccessible."}, {"id": 88, "string": "Regardless of the reasons speculated for the post-retractions citations, the fact that invalid and falsified research is continuing to appear as valid research is concerning."}, {"id": 89, "string": "We recommend that publishers use reference checks to all submitted articles to detect citations of retracted articles and remove them or at least request an explanation from the authors for citing a retracted paper in a positive or neutral manner."}, {"id": 90, "string": "This explanation should clearly appear in the paper."}, {"id": 91, "string": "In addition, we would recommend the deletion of retracted articles from publishers' websites."}, {"id": 92, "string": "Currently, at least for the major publishers: Elsevier, Springer Nature and Wiley, but possibly a general practice, retracted articles are not only available on the publishers' site, but they are freely available, without the need for a subscription or for a one-time payment."}, {"id": 93, "string": "While leaving a retraction notice, the article itself should not appear on platforms such as ScienceDirect or others."}, {"id": 94, "string": "Although versions of these articles may appear elsewhere, the journal websites should not carry these versions and make it difficult for authors to download, read and consequently cite retracted articles."}, {"id": 95, "string": "Acknowledgement The first author was supported by EU COST Actions PEERE (TD1306) and KnowEscape (TD1210)."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 47}, {"section": "Acknowledgement", "n": "5", "start": 48, "end": 95}], "figures": [{"filename": "../figure/image/1052-Figure1-1.png", "caption": "Fig. 1. Citations in context for the Donmez et al. article", "page": 2, "bbox": {"x1": 135.35999999999999, "x2": 438.24, "y1": 230.88, "y2": 323.03999999999996}}, {"filename": "../figure/image/1052-Figure3-1.png", "caption": "Fig. 3. Citations in context for the republished Séralini et al. article", "page": 3, "bbox": {"x1": 135.35999999999999, "x2": 410.4, "y1": 430.56, "y2": 520.3199999999999}}, {"filename": "../figure/image/1052-Figure2-1.png", "caption": "Fig. 2. Citations in context for the Séralini et al. article", "page": 3, "bbox": {"x1": 135.84, "x2": 400.32, "y1": 146.88, "y2": 240.95999999999998}}]}