{"title": "A Dependency-to-String Model for Chinese-Japanese SMT System", "abstract": "This paper describes the Beijing Jiaotong University Chinese-Japanese machine translation system which participated in the 2st Workshop on Asian Translation (WAT2015). We exploit the syntactic and semantic knowledge encoded in dependency tree to build a dependency-to-string translation model for Chinese-Japanese statistical machine translation (SMT). Our system achieves a BLEU of 34.87 and a RIBES of 79.25 on the Chinese-Japanese translation task in the official evaluation.", "text": [{"id": 0, "string": "Introduction Motivated by representing the grammatical function of the constituents of a sentence or phrase，dependency grammar holds both syntactic and semantic knowledge．How to building translation model by exploiting the syntactic and semantic knowledge encoded in dependency tree has been now one of the most popular research topics in the recent years． In dependency tree based models, researchers propose some tree decomposition methods or grammars to build translation model."}, {"id": 1, "string": "These models can be classified into string-to-tree model, tree-to-tree model and tree-to-string model."}, {"id": 2, "string": "Our system participated in WAT2015 (Nakazawa et al., 2015) adopts tree-to-string model."}, {"id": 3, "string": "Particularly, we use the dependency-to-string translation method proposed by (Xie et al., 2011) in Chinese-Japanese translation task."}, {"id": 4, "string": "This method proposes a novel tree decompose tion, which takes head-dependents relation (HDR) fragments as elementary structures of rule extraction."}, {"id": 5, "string": "An HDR is a tree fragment composed of a head and all its dependents."}, {"id": 6, "string": "In this method, the translation rules are expressed with the source side as generalized HDR fragments and the target sides as strings."}, {"id": 7, "string": "The model takes substitution as the only operation and can specify reordering information directly into translation rules, thus requires no additional heuristics or reordering models as the previous works."}, {"id": 8, "string": "And the model is more concise."}, {"id": 9, "string": "Section 2 describes dependency-to-string translation model in detail."}, {"id": 10, "string": "Section 3 reports on our experiment results on a Chinese-SMT system."}, {"id": 11, "string": "Section 4 concludes this paper."}, {"id": 12, "string": "Dependency-to-String Translation Model In this paper, we describes the translation model in four aspects, dependency-to-string grammar, translation rule acquisition, the model and the decoding."}, {"id": 13, "string": "Dependency-to-String Grammar A dependency structure for a sentence is a directed acyclic graph with words as nodes and modification relations as edges, each edge directing from a head to a dependent."}, {"id": 14, "string": "Figure 1 FIFA World Cup in South Africa successfully hold Here are some properties of a HDR fragment : 1) head determines the syntactic category of HDR, and can often replace HDR; 2) head determines the semantic category of HDR; dependent gives semantic specification."}, {"id": 15, "string": "According to the above properties, we can represent the corresponding HDR fragment with head."}, {"id": 16, "string": "The translation rules of dependency-to-string model can be classified into two categories: -HDR rules, which represent the source side as generalized HDR fragments and the target sides as strings and act as both translation rules and reordering rules."}, {"id": 17, "string": "-H rules, which represent the source side as a word and the target side as words or strings and are used for translating words."}, {"id": 18, "string": "Figure 1 shows examples of the two translation rules."}, {"id": 19, "string": "(b), (c) and (d) are three examples of HDR rules, and (d) is an example of H rules."}, {"id": 20, "string": "In the figure, the nodes modified by \"*\" are head of HDR fragment."}, {"id": 21, "string": "By the way, the three HDR rules describes translation ways of the same sentence pattern (that is, constituted by \"noun phrase + preposition phrase + adverb + verb\" ) and different contexts."}, {"id": 22, "string": "Thereinto, rule (b) appoints its context completely, rule (c) restrains its context partially and rule (d) has no restraint for its context."}, {"id": 23, "string": "Rule Acquisition The rule acquisition of dependency-to-string model begins with a parallel corpus with word-aligned results, the source dependency structures and the target side sentence."}, {"id": 24, "string": "We accomplish the rule automatic acquisition through the following three steps: 1) Tree annotation: annotate the necessary information on each node of depend ency trees for translation rule acquisition."}, {"id": 25, "string": "2) Acceptable HDR fragments identification: identify HDR fragments from the annotated trees for HDR rules generation."}, {"id": 26, "string": "3) HDR rules generation: generate a series of HDR rules according to the identified acceptable HDR fragments."}, {"id": 27, "string": "The following describes each of these in detail."}, {"id": 28, "string": "Tree Annotation and Acceptable HDR Fragments Identification 83 The tree annotation can be accomplished by a single postorder transversal of dependency tree T. For each node n of T, we annotated with head span hsp(n) and dependency span dsp(n) (Xie et al., 2011) ."}, {"id": 29, "string": "During the recursive walk, we calculate hsp(n) according to alignment relation for each node n accessed."}, {"id": 30, "string": "The dsp(n) can be obtained according to hsp(n) and dependency span of all dependents of n. After tree annotation, we can identify HDR fragments for HDR rules generation, according to head span and dependency span of each node."}, {"id": 31, "string": "HDR Rules and H Rules Generation According to the identified acceptable HDR fragments, a series of lexicalized and unlexicalized HDR rules will be generated."}, {"id": 32, "string": "This paper will not describe in detail about it and you can refer to (Xie et al., 2011) ."}, {"id": 33, "string": "H rules acquisition can be implemented as a sub procedure of HDR rules acquisition."}, {"id": 34, "string": "Specifically, in the recursive walk of dependency tree, a H rule is generated according to alignment information for each node accessed."}, {"id": 35, "string": "Translation Model Given the dependency-to-string grammar, for a given source language dependency tree T, it may generate more than one derivations D that convert a source dependency tree T into a target string e, thus producing varieties of candidate translations."}, {"id": 36, "string": "To compare the candidate translations, we adopt a general log-linear model (Och and Ney, 2002) to define D as: P(D) ∝ ∏ ϕi (D) λi (1) where ϕi (D) is feature function defined on derivation D and λi are the feature weights."}, {"id": 37, "string": "Our paper used seven features as follows: 1) translation probabilities: P(t|s) and P(s|t); 2) lexical translation probabilities: Plex (t|s) and Plex (s|t); 3) rule penalty: exp(-1); 4) target word penalty: exp(|e|); 5) language model : Plm(e); Decoding Our decoder is based on bottom up chart parsing algorithm that convert the input dependency structure into a target string."}, {"id": 38, "string": "It finds the best derivation among all possible derivations D. Given a source dependency structure T, the decoder traverses each internal node n of T in post-order."}, {"id": 39, "string": "And we process it as follows."}, {"id": 40, "string": "1) If n is a leaf node, it checks the rule set for matched translation rules H and uses the rules to generate candidate translation; 2) If n is a internal node, it enumerates all instances of the related sentence, clauses or phrases of the HDR fragment rooted at n, and checks the translation rule set for matched translation rules."}, {"id": 41, "string": "If there is no matched rules, we construct a pseudo translation rule according to the word order of the HDR fragment in the source side; 3) Make use of Cube Pruning algorithm (Chiang, 2007; Huang and Chiang, 2007) to generate the candidate translation for the node n. To balance the decoder's performance and speed, we use four constraints as follows: 1) Beam-threshold: we get the score threshold from the best score in the current stack multiplied by a fixed ratio."}, {"id": 42, "string": "The candidate translations with a score worse than the score threshold will be discarded; 2) beam-limit: the maximum number of candidate translations in the beam; 3) rule-threshold: we get the rule score threshold from the best score multiplied by a fixed ratio in the rule table queue."}, {"id": 43, "string": "The rules with a score worse than rule score threshold will be dis-carded; 4) rule-limit: the maximum number of rules in the rule table queue."}, {"id": 44, "string": "For our experiments, we set the beam-threshold = 10 -2 , beam-limit = 100, rule-threshold = 10 -2 and rule-limit = 100."}, {"id": 45, "string": "Table 1 The comparison results of the two systems Then, we use dependency-to-string model described in Section 2 to build a Chinese-Japanese translation system."}, {"id": 46, "string": "And use the BLUE score and RIBES score for evaluation."}, {"id": 47, "string": "Experiments Data preparation Experiments and Evaluation Results The Chinese-Japanese translation system (Dep2str) consists of three modules: 1) Rule extraction module: extract rules using the Chinese dependency tree, the Japanese sentence and alignment information of the training corpus."}, {"id": 48, "string": "2) Decoding module: decode the Chinese sentences for the n-best Japanese translations according to the model parameters that have been set."}, {"id": 49, "string": "3) Training module: train the translation model using minimum error rate to get the best parameters on the development data."}, {"id": 50, "string": "We then decode the test data using the system."}, {"id": 51, "string": "Table 1 shows the number of the extracted translation rules and the translation performance on the test data."}, {"id": 52, "string": "Furthermore, we implemented a MOSES PBSMT system (Koehn et al., 2002) as the baseline for a comparison."}, {"id": 53, "string": "In our experiments the value of the distortion limit of the baseline system is the default."}, {"id": 54, "string": "The number of translation rules and translation performance of the baseline system are also showed in the table."}, {"id": 55, "string": "In terms of the number of translation rules, the number of the extracted translation rules in the baseline system is over 3 times more than that of dep2str system."}, {"id": 56, "string": "We think that the lack of restrictions on syntactic structure resulted in this."}, {"id": 57, "string": "In terms of translation performance, the BLEU score and RIBES score on the test data achieved by dep2str system are higher than the baseline system by 0.62 and 0.31 respectively."}, {"id": 58, "string": "These evaluation results illustrate that the translation system based on the dependency-to-string model is effective on the Chinese-Japanese translation task."}, {"id": 59, "string": "Conclusions This paper describes the Beijing Jiaotong University Chinese-Japanese machine translation system participated in WAT2015."}, {"id": 60, "string": "The system employs a dependency-to-string model, which takes the HDR fragments as elementary structures for the rule extraction and directly specifies the ordering information in translation rules, making the decoding algorithm simplified."}, {"id": 61, "string": "The experiment results on the ASPEC data showed that the BLEU score and the RIBES score are increased by 0.62 and 0.31 respectively, compared with the phrase-based system."}, {"id": 62, "string": "At present, the accuracy of the Chinese dependency parsing is not very high, and our system's performance is affected by the accuracy."}, {"id": 63, "string": "Meanwhile, we filtered out the sentences which could not be parsed by the dependency parser."}, {"id": 64, "string": "This caused a decrease in the amount of training data by about 100 thousand sentence pairs."}, {"id": 65, "string": "We think that the system's performance will be improved with Chinese dependency parsing with high accuracy."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 9}, {"section": "Dependency-to-String Translation Model", "n": "2", "start": 10, "end": 10}, {"section": "Dependency-to-String Grammar", "n": "2.1", "start": 11, "end": 13}, {"section": "FIFA World Cup in South Africa successfully hold", "n": "2010", "start": 14, "end": 22}, {"section": "Rule Acquisition", "n": "2.2", "start": 23, "end": 30}, {"section": "HDR Rules and H Rules Generation", "n": "2.2.2", "start": 31, "end": 34}, {"section": "Translation Model", "n": "2.3", "start": 35, "end": 36}, {"section": "Decoding", "n": "2.4", "start": 37, "end": 46}, {"section": "Experiments and Evaluation Results", "n": "3.2", "start": 47, "end": 58}, {"section": "Conclusions", "n": "4", "start": 59, "end": 65}], "figures": [{"filename": "../figure/image/1065-Figure1-1.png", "caption": "Figure 1: Examples of dependency structure (a), HDR rules (b), (c) , (d)and H rules (e).", "page": 1, "bbox": {"x1": 316.32, "x2": 517.4399999999999, "y1": 75.84, "y2": 471.35999999999996}}, {"filename": "../figure/image/1065-Table1-1.png", "caption": "Table 1 The comparison results of the two systems", "page": 3, "bbox": {"x1": 302.4, "x2": 538.0799999999999, "y1": 70.56, "y2": 120.0}}]}