{"title": "Bringing replication and reproduction together with generalisability in NLP: Three reproduction studies for Target Dependent Sentiment Analysis", "abstract": "Lack of repeatability and generalisability are two significant threats to continuing scientific development in Natural Language Processing. Language models and learning methods are so complex that scientific conference papers no longer contain enough space for the technical depth required for replication or reproduction. Taking Target Dependent Sentiment Analysis as a case study, we show how recent work in the field has not consistently released code, or described settings for learning methods in enough detail, and lacks comparability and generalisability in train, test or validation data. To investigate generalisability and to enable state of the art comparative evaluations, we carry out the first reproduction studies of three groups of complementary methods and perform the first large-scale mass evaluation on six different English datasets. Reflecting on our experiences, we recommend that future replication or reproduction experiments should always consider a variety of datasets alongside documenting and releasing their methods and published code in order to minimise the barriers to both repeatability and generalisability. We have released our code with a model zoo on GitHub with Jupyter Notebooks to aid understanding and full documentation, and we recommend that others do the same with their papers at submission time through an anonymised GitHub account.", "text": [{"id": 0, "string": "Introduction Repeatable (replicable and/or reproducible 1 ) experimentation is a core tenet of the scientific endeavour."}, {"id": 1, "string": "In Natural Language Processing (NLP) research as in other areas, this requires three crucial components: (a) published methods described in sufficient detail (b) a working code base and (c) open dataset(s) to permit training, testing and validation to be reproduced and generalised."}, {"id": 2, "string": "In the cognate sub-discipline of corpus linguistics, releasing textual datasets has been a defining feature of the community for many years, enabling multiple comparative experiments to be conducted on a stable basis since the core underlying corpora are community resources."}, {"id": 3, "string": "In NLP, with methods becoming increasingly complex with the use of machine learning and deep learning approaches, it is often difficult to describe all settings and configurations in enough detail without releasing code."}, {"id": 4, "string": "The work described in this paper emerged from recent efforts at our research centre to reimplement other's work across a number of topics (e.g."}, {"id": 5, "string": "text reuse, identity resolution and sentiment analysis) where previously published methods were not easily repeatable because of missing or broken code or dependencies, and/or where methods were not sufficiently well described to enable reproduction."}, {"id": 6, "string": "We focus on one sub-area of sentiment analysis to illustrate the extent of these problems, along with our initial recommendations and contributions to address the issues."}, {"id": 7, "string": "The area of Target Dependent Sentiment Analysis (TDSA) and NLP in general has been growing rapidly in the last few years due to new neural network methods that require no feature engineering."}, {"id": 8, "string": "However it is difficult to keep track of the state of the art as new models are tested on different datasets, thus preventing true comparative evaluations."}, {"id": 9, "string": "This is best shown by table 1 where many approaches This work is licenced under a Creative Commons Attribution 4.0 International Licence."}, {"id": 10, "string": "Licence details: http:// creativecommons.org/licenses/by/4.0/ 1 We follow the definitions in Antske Fokkens' guest blog post \"replication (obtaining the same results using the same experiment) as well as reproduction (reach the same conclusion through different means)\" from http://coling2018."}, {"id": 11, "string": "org/slowly-growing-offspring-zigglebottom-anno-2017-guest-post/ are evaluated on the SemEval dataset (Pontiki et al., 2014) but not all."}, {"id": 12, "string": "Datasets can vary by domain (e.g."}, {"id": 13, "string": "product), type (social media, review), or medium (written or spoken), and to date there has been no comparative evaluation of methods from these multiple classes."}, {"id": 14, "string": "Our primary and secondary contributions therefore, are to carry out the first study that reports results across all three different dataset classes, and to release a open source code framework implementing three complementary groups of TDSA methods."}, {"id": 15, "string": "In terms of reproducibility via code release, recent TDSA papers have generally been very good with regards to publishing code alongside their papers (Mitchell et al., 2013; Zhang et al., 2016; Liu and Zhang, 2017; Wang et al., 2017) but other papers have not released code (Wang et al., 2016; Tay et al., 2017) ."}, {"id": 16, "string": "In some cases, the code was initially made available, then removed, and is now back online (Tang et al., 2016a) ."}, {"id": 17, "string": "Unfortunately, in some cases even when code has been published, different results have been obtained relative to the original paper."}, {"id": 18, "string": "This can be seen when Chen et al."}, {"id": 19, "string": "(2017) used the code and embeddings in Tang et al."}, {"id": 20, "string": "(2016b) they observe different results."}, {"id": 21, "string": "Similarly, when others (Tay et al., 2017; Chen et al., 2017) attempt to replicate the experiments of Tang et al."}, {"id": 22, "string": "(2016a) they also produce different results to the original authors."}, {"id": 23, "string": "Our observations within this one sub-field motivates the need to investigate further and understand how such problems can be avoided in the future."}, {"id": 24, "string": "In some cases, when code has been released, it is difficult to use which could explain why the results were not reproduced."}, {"id": 25, "string": "Of course, we would not expect researchers to produce industrial strength code, or provide continuing free ongoing support for multiple years after publication, but the situation is clearly problematic for the development of the new field in general."}, {"id": 26, "string": "In this paper, we therefore reproduce three papers chosen as they employ widely differing methods: Neural Pooling (NP) , NP with dependency parsing (Wang et al., 2017) , and RNN (Tang et al., 2016a) , as well as having been applied largely to different datasets."}, {"id": 27, "string": "At the end of the paper, we reflect on bringing together elements of repeatability and generalisability which we find are crucial to NLP and data science based disciplines more widely to enable others to make use of the science created."}, {"id": 28, "string": "Related work Reproducibility and replicability have long been key elements of the scientific method, but have been gaining renewed prominence recently across a number of disciplines with attention being given to a 'reproducibility crisis'."}, {"id": 29, "string": "For example, in pharmaceutical research, as little as 20-25% of papers were found to be replicable (Prinz et al., 2011) ."}, {"id": 30, "string": "The problem has also been recognised in computer science in general (Collberg and Proebsting, 2016) ."}, {"id": 31, "string": "Reproducibility and replicability have been researched for sometime in Information Retrieval (IR) since the Grid@CLEF pilot track (Ferro and Harman, 2009 )."}, {"id": 32, "string": "The aim was to create a 'grid of points' where a point defined the performance of a particular IR system using certain pre-processing techniques on a defined dataset."}, {"id": 33, "string": "Louridas and Gousios (2012) looked at reproducibility in Software Engineering after trying to replicate another authors results and concluded with a list of requirements for papers to be reproducible: (a) All data related to the paper, (b) All code required to reproduce the paper and (c) Documentation for the code and data."}, {"id": 34, "string": "Fokkens et al."}, {"id": 35, "string": "(2013) looked at reproducibility in WordNet similarity and Named Entity Recognition finding five key aspects that cause experimental variation and therefore need to be clearly stated: (a) pre-processing, (b) experimental setup, (c) versioning, (d) system output, (e) system variation."}, {"id": 36, "string": "In Twitter sentiment analysis, Sygkounas et al."}, {"id": 37, "string": "(2016) stated the need for using the same library versions and datasets when replicating work."}, {"id": 38, "string": "Different methods of releasing datasets and code have been suggested."}, {"id": 39, "string": "Ferro and Harman (2009) defined a framework (CIRCO) that enforces a pre-processing pipeline where data can be extracted at each stage therefore facilitating a validation step."}, {"id": 40, "string": "They stated a mechanism for storing results, dataset and pre-processed data 2 ."}, {"id": 41, "string": "Louridas and Gousios (2012) suggested the use of a virtual machine alongside papers to bundle the data and code together, while most state the advantages of releasing source code (Fokkens et al., 2013; Potthast et al., 2016; Sygkounas et al., 2016) ."}, {"id": 42, "string": "The act of reproducing or replicating results is not just for validating research but to also show how it can be improved."}, {"id": 43, "string": "Ferro and Silvello (2016) followed up their initial research and were able to analyse which pre-processing techniques were important on a French monolingual dataset and how the different techniques affected each other given an IR system."}, {"id": 44, "string": "Fokkens et al."}, {"id": 45, "string": "(2013) showed how changes in the five key aspects affected results."}, {"id": 46, "string": "The closest related work to our reproducibility study is that of Marrese-Taylor and Matsuo (2017) which they replicate three different syntactic based aspect extraction methods."}, {"id": 47, "string": "They found that parameter tuning was very important however using different pre-processing pipelines such as Stanford's CoreNLP did not have a consistent effect on the results."}, {"id": 48, "string": "They found that the methods stated in the original papers are not detailed enough to replicate the study as evidenced by their large results differential."}, {"id": 49, "string": "Dashtipour et al."}, {"id": 50, "string": "(2016) undertook a replication study in sentiment prediction, however this was at the document level and on different datasets and languages to the originals."}, {"id": 51, "string": "In other areas of (aspectbased) sentiment analysis, releasing code for published systems has not been a high priority, e.g."}, {"id": 52, "string": "in SemEval 2016 task 5 (Pontiki et al., 2016) only 1 out of 21 papers released their source code."}, {"id": 53, "string": "In IR, specific reproducible research tracks have been created 3 and we are pleased to see the same happening at COLING 2018 4 ."}, {"id": 54, "string": "Turning now to the focus of our investigations, Target Dependent sentiment analysis (TDSA) research (Nasukawa and Yi, 2003) arose as an extension to the coarse grained analysis of document level sentiment analysis (Pang et al., 2002; Turney, 2002) ."}, {"id": 55, "string": "Since its inception, papers have applied different methods such as feature based (Kiritchenko et al., 2014) , Recursive Neural Networks (RecNN) (Dong et al., 2014) , Recurrent Neural Networks (RNN) (Tang et al., 2016a) , attention applied to RNN (Wang et al., 2016; Chen et al., 2017; Tay et al., 2017) , Neural Pooling (NP) Wang et al., 2017) , RNN combined with NP (Zhang et al., 2016) , and attention based neural networks (Tang et al., 2016b) ."}, {"id": 56, "string": "Others have tackled TDSA as a joint task with target extraction, thus treating it as a sequence labelling problem."}, {"id": 57, "string": "Mitchell et al."}, {"id": 58, "string": "(2013) carried out this task using Conditional Random Fields (CRF), and this work was then extended using a neural CRF ."}, {"id": 59, "string": "Both approaches found that combining the two tasks did not improve results compared to treating the two tasks separately, apart from when considering POS and NEG when the joint task performs better."}, {"id": 60, "string": "Finally,  created an attention RNN for this task which was evaluated on two very different datasets containing written and spoken (video-based) reviews where the domain adaptation between the two shows some promise."}, {"id": 61, "string": "Overall, within the field of sentiment analysis there are other granularities such as sentence level (Socher et al., 2013) , topic (Augenstein et al., 2018) , and aspect (Wang et al., 2016; Tay et al., 2017) ."}, {"id": 62, "string": "Aspect-level sentiment analysis relates to identifying the sentiment of (potentially multiple) topics in the same text although this can be seen as a similar task to TDSA."}, {"id": 63, "string": "However the clear distinction between aspect and TDSA is that TDSA requires the target to be mentioned in the text itself while aspect-level employs a conceptual category with potentially multiple related instantiations in the text."}, {"id": 64, "string": "Tang et al."}, {"id": 65, "string": "(2016a) created a Target Dependent LSTM (TDLSTM) which encompassed two LSTMs either side of the target word, then improved the model by concatenating the target vector to the input embeddings to create a Target Connected LSTM (TCLSTM)."}, {"id": 66, "string": "Adding attention has become very popular recently."}, {"id": 67, "string": "Tang et al."}, {"id": 68, "string": "(2016b) showed the speed and accuracy improvements of using multiple attention layers only over LSTM based methods, however they found that it could not model complex sentences e.g."}, {"id": 69, "string": "negations."}, {"id": 70, "string": "Liu and Zhang (2017) showed that adding attention to a Bi-directional LSTM (BLSTM) improves the results as it takes the importance of each word into account with respect to the target."}, {"id": 71, "string": "Chen et al."}, {"id": 72, "string": "(2017) also combined a BLSTM and attention, however they used multiple attention layers and combined the results using a Gated Recurrent Unit (GRU) which they called Recurrent Attention on Memory (RAM), and they found this method to allow models to better understand more complex sentiment for each comparison."}, {"id": 73, "string": "used neural pooling features e.g."}, {"id": 74, "string": "max, min, etc of the word embeddings of the left and right context of the target word, the target itself, and the whole Tweet."}, {"id": 75, "string": "They inputted the features into a linear SVM, and showed the importance of using the left and right context for the first time."}, {"id": 76, "string": "They found in their study that using a combination of Word2Vec embeddings and sentiment embeddings  performed best alongside using sentiment lexicons to filter the embedding space."}, {"id": 77, "string": "Other studies have adopted more linguistic approaches."}, {"id": 78, "string": "Wang et al."}, {"id": 79, "string": "(2017) extended the work of  by using the dependency linked words from the target."}, {"id": 80, "string": "Dong et al."}, {"id": 81, "string": "(2014) used the dependency tree to create a Recursive Neural Network (RecNN) inspired by Socher et al."}, {"id": 82, "string": "(2013) but compared to Socher et al."}, {"id": 83, "string": "(2013) they also utilised the dependency tags to create an Adaptive RecNN (ARecNN)."}, {"id": 84, "string": "Critically, the methods reported above have not been applied to the same datasets, therefore a true comparative evaluation between the different methods is somewhat difficult."}, {"id": 85, "string": "This has serious implications for generalisability of methods."}, {"id": 86, "string": "We correct that limitation in our study."}, {"id": 87, "string": "There are two papers taking a similar approach to our work in terms of generalisability although they do not combine them with the reproduction issues that we highlight."}, {"id": 88, "string": "First, Chen et al."}, {"id": 89, "string": "(2017) compared results across Se-mEval's laptop and restaurant reviews in English (Pontiki et al., 2014) , a Twitter dataset (Dong et al., 2014) and their own Chinese news comments dataset."}, {"id": 90, "string": "They did perform a comparison across different languages, domains, corpora types, and different methods; SVM with features (Kiritchenko et al., 2014) , Rec-NN (Dong et al., 2014) , TDLSTM (Tang et al., 2016a) , Memory Neural Network (MNet) (Tang et al., 2016b) and their own attention method."}, {"id": 91, "string": "However, the Chinese dataset was not released, and the methods were not compared across all datasets."}, {"id": 92, "string": "By contrast, we compare all methods across all datasets, using techniques that are not just from the Recurrent Neural Network (RNN) family."}, {"id": 93, "string": "A second paper, by Barnes et al."}, {"id": 94, "string": "(2017) compares seven approaches to (document and sentence level) sentiment analysis on six benchmark datasets, but does not systematically explore reproduction issues as we do in our paper."}, {"id": 95, "string": "Datasets used in our experiments We are evaluating our models over six different English datasets deliberately chosen to represent a range of domains, types and mediums."}, {"id": 96, "string": "As highlighted above, previous papers tend to only carry out evaluations on one or two datasets which limits the generalisability of their results."}, {"id": 97, "string": "In this paper, we do not consider the quality or inter-annotator agreement levels of these datasets but it has been noted that some datasets may have issues here."}, {"id": 98, "string": "For example, Pavlopoulos and Androutsopoulos (2014) point out that the Hu and Liu (2004) dataset does not state their inter-annotator agreement scores nor do they have aspect terms that express neutral opinion."}, {"id": 99, "string": "We only use a subset of the English datasets available."}, {"id": 100, "string": "For two reasons."}, {"id": 101, "string": "First, the time it takes to write parsers and run the models."}, {"id": 102, "string": "Second, we only used datasets that contain three distinct sentiments (Wilson (2008) only has two)."}, {"id": 103, "string": "From the datasets we have used, we have only had issue with parsing Wang et al."}, {"id": 104, "string": "(2017) where the annotations for the first set of the data contains the target span but the second set does not."}, {"id": 105, "string": "Thus making it impossible to use the second set of annotation and forcing us to only use a subset of the dataset."}, {"id": 106, "string": "An as example of this: \"Got rid of bureaucrats 'and we put that money, into 9000 more doctors and nurses'... to turn the doctors into bureaucrats#BattleForNumber10\" in that Tweet 'bureaucrats' was annotated as negative but it does not state if it was the first or second instance of 'bureaucrats' since it does not use target spans."}, {"id": 107, "string": "As we can see from table 2, generally the social media datasets (Twitter and YouTube) contain more targets per sentence with the exception of Dong et al."}, {"id": 108, "string": "(2014) and Mitchell et al."}, {"id": 109, "string": "(2013) ."}, {"id": 110, "string": "The only dataset that has a small difference between the number of unique sentiments per sentence is the Wang et al."}, {"id": 111, "string": "(2017) Reproduction studies In the following subsections, we present the three different methods that we are reproducing and how their results differ from the original analysis."}, {"id": 112, "string": "In all of the experiments below, we lower case all text and tokenise using Twokenizer (Gimpel et al., 2011) ."}, {"id": 113, "string": "This was done as the datasets originate from Twitter and this pre-processing method was to some extent stated in  and assumed to be used across the others as they do not explicitly state how they pre-process in the papers."}, {"id": 114, "string": "Reproduction of Vo and Zhang (2015) Vo and Zhang (2015) created the first NP method for TDSA."}, {"id": 115, "string": "It takes the word vectors of the left, right, target word, and full tweet/sentence/text contexts and performs max, min, average, standard deviation, and product pooling over these contexts to create a feature vector as input to the Support Vector Machine For each of the experiments below we used the following configurations unless otherwise stated: we performed 5 fold stratified cross validation, features are scaled using Max Min scaling before inputting into the SVM, and used the respective C-Values for the SVM stated in the paper for each of the models."}, {"id": 116, "string": "One major difficulty with the description of the method in the paper and re-implementation is handling the same target multiple appearances issue as originally raised by Wang et al."}, {"id": 117, "string": "(2017) ."}, {"id": 118, "string": "As the method requires context with regards to the target word, if there is more than one appearance of the target word then the method does not specify which to use."}, {"id": 119, "string": "We therefore took the approach of Wang et al."}, {"id": 120, "string": "(2017) and found all of the features for each appearance and performed median pooling over features."}, {"id": 121, "string": "This change could explain the subtle differences between the results we report and those of the original paper."}, {"id": 122, "string": "used three different sentiment lexicons: MPQA 5 (Wilson et al., 2005) , NRC 6 (Mohammad and Turney, 2010) , and HL 7 (Hu and Liu, 2004) ."}, {"id": 123, "string": "We found a small difference in word counts between their reported statistics for the MPQA lexicons and those we performed ourselves, as can be seen in the bold numbers in table 3."}, {"id": 124, "string": "Originally, we assumed that a word can only occur in one sentiment class within the same lexicon, and this resulted in differing counts for all lexicons."}, {"id": 125, "string": "This distinction is not clearly documented in the paper or code."}, {"id": 126, "string": "However, our assumption turned out to be incorrect, giving a further illustration of why detailed descriptions and documentation of all decisions is important."}, {"id": 127, "string": "We ran the same experiment as  to show the effectiveness of sentiment lexicons the results can be seen in table 4."}, {"id": 128, "string": "We can clearly see there are some difference not just with the accuracy scores but the rank of the sentiment lexicons."}, {"id": 129, "string": "We found just using HL was best and MPQA does help performance compared to the Target-dep baseline which differs to  findings."}, {"id": 130, "string": "Since we found that using just HL performed best, the rest of the results will apply the Target-dep+ method using HL and using HL & MPQA to show the affect of using the lexicon that both we and  found best."}, {"id": 131, "string": "The original authors tested their methods using three different word vectors: 1."}, {"id": 132, "string": "Word2Vec trained by  on 5 million Tweets containing emoticons (W2V), 2."}, {"id": 133, "string": "Sentiment Specific Word Embedding (SSWE) from , and 3."}, {"id": 134, "string": "W2V and SSWE combined."}, {"id": 135, "string": "Neither of these word embeddings are available from the original authors as  never released the embeddings and the link to  embeddings no longer works 8 ."}, {"id": 136, "string": "However, the embeddings were released through Wang et al."}, {"id": 137, "string": "(2017) code base 9 following requesting of the code from ."}, {"id": 138, "string": "Figure 1 shows the results of the different word embeddings across the different methods."}, {"id": 139, "string": "The main finding we see is that SSWE by themselves are not as informative as W2V vectors which is different to the findings of ."}, {"id": 140, "string": "However we agree that combining the two vectors is beneficial and that the rank of methods is the same in our observations."}, {"id": 141, "string": "Sentiment Lexicons Word Counts Scaling and Final Model comparison We test all of the methods on the test data set of Dong et al."}, {"id": 142, "string": "(2014) and show the difference between the original and reproduced models in figure 2."}, {"id": 143, "string": "Finally, we show the effect of scaling using Max Min and not scaling the data."}, {"id": 144, "string": "As stated before, we have been using Max Min scaling on the NP features, however  did not mention scaling in their paper."}, {"id": 145, "string": "The library they were using, LibLinear (Fan et al., 2008) , suggests in its practical guide (Hsu et al., 2003) to scale each feature to [0, 1] but this was not re-iterated by ."}, {"id": 146, "string": "We are using scikit-learn's (Pedregosa et al., 2011) LinearSVC which is a wrapper of LibLinear, hence making it appropriate to use here."}, {"id": 147, "string": "As can be seen in figure 2, not scaling can affect the results by around one-third."}, {"id": 148, "string": "Reproduction of Wang et al."}, {"id": 149, "string": "(2017) Wang et al."}, {"id": 150, "string": "(2017) extended the NP work of  and instead of using the full tweet/sentence/text contexts they used the full dependency graph of the target word."}, {"id": 151, "string": "Thus, they created three different methods: 1."}, {"id": 152, "string": "TDParseuses only the full dependency graph context, 2."}, {"id": 153, "string": "TDParse the feature of TDParseand the left and right contexts, and 3."}, {"id": 154, "string": "TDParse+ the features of TDParse and LS and RS contexts."}, {"id": 155, "string": "The experiments are performed on the Dong et al."}, {"id": 156, "string": "(2014) and Wang et al."}, {"id": 157, "string": "(2017) Twitter datasets where we train and test on the previously specified train and test splits."}, {"id": 158, "string": "We also scale our features using Max Min scaling before inputting into the SVM."}, {"id": 159, "string": "We used all three sentiment lexicons as in the original paper, and we found the C-Value by performing 5 fold stratified cross validation on the training datasets."}, {"id": 160, "string": "The results of these experiments can be seen in figure 3 10 ."}, {"id": 161, "string": "As found with the results of  replication, scaling is very important but is typically overlooked when reporting."}, {"id": 162, "string": "8 http://ir.hit.edu.cn/˜dytang/ 9 https://github.com/bluemonk482/tdparse 10 For the Election Twitter dataset TDParse+ result were never reported in the original paper."}, {"id": 163, "string": "Tang et al."}, {"id": 164, "string": "(2016a) was the first to use LSTMs specifically for TDSA."}, {"id": 165, "string": "They created three different models: 1."}, {"id": 166, "string": "LSTM a standard LSTM that runs over the length of the sentence and takes no target information into account, 2."}, {"id": 167, "string": "TDLSTM runs two LSTMs, one over the left and the other over the right context of the target word and concatenates the output of the two, and 3."}, {"id": 168, "string": "TCLSTM same as the TDLSTM method but each input word vector is concatenated with vector of the target word."}, {"id": 169, "string": "All of the methods outputs are fed into a softmax activation function."}, {"id": 170, "string": "The experiments are performed on the Dong et al."}, {"id": 171, "string": "(2014) dataset where we train and test on the specified splits."}, {"id": 172, "string": "For the LSTMs we initialised the weights using uniform distribution U(0.003, 0.003), used Stochastic Gradient Descent (SGD) a learning rate of 0.01, cross entropy loss, padded and truncated sequence to the length of the maximum sequence in the training dataset as stated in the original paper, and we did not \"set the clipping threshold of softmax layer as 200\" (Tang et al., 2016a) as we were unsure what this meant."}, {"id": 173, "string": "With regards to the number of epochs trained, we used early stopping with a patience of 10 and allowed 300 epochs."}, {"id": 174, "string": "Within their experiments they used SSWE  and Glove Twitter vectors 11 (Pennington et al., 2014) ."}, {"id": 175, "string": "As the paper being reproduced does not define the number of epochs they trained for, we use early stopping."}, {"id": 176, "string": "Thus for early stopping we require to split the training data into train and validation sets to know when to stop."}, {"id": 177, "string": "As it has been shown by Reimers and Gurevych (2017) that the random seed statistically significantly changes the results of experiments we ran each model over each word embedding thirty times, using a different seed value but keeping the same stratified train and validation split, and  reported the results on the same test data as the original paper."}, {"id": 178, "string": "As can be seen in Figure 4 , the initial seed value makes a large difference more so for the smaller embeddings."}, {"id": 179, "string": "In table 5, we show the difference between our mean and maximum result and the original result for each model using the 200 dimension Glove Twitter vectors."}, {"id": 180, "string": "Even though the mean result is quite different from the original the maximum is much closer."}, {"id": 181, "string": "Our results generally agree with their results on the ranking of the word vectors and the embeddings."}, {"id": 182, "string": "Overall, we were able to reproduce the results of all three papers."}, {"id": 183, "string": "However for the neural network/deep learning approach of Tang et al."}, {"id": 184, "string": "(2016a) we agree with Reimers and Gurevych (2017) that reporting multiple runs of the system over different seed values is required as the single performance scores can be misleading, which could explain why previous papers obtained different results to the original for the TDLSTM method (Chen et al., 2017; Tay et al., 2017) ."}, {"id": 185, "string": "Mass Evaluation For all of the methods we pre-processed the text by lower casing and tokenising using Twokenizer (Gimpel et al., 2011) , and we used all three sentiment lexicons where applicable."}, {"id": 186, "string": "We found the best word vectors from SSWE and the common crawl 42B 300 dimension Glove vectors by five fold stratified cross validation for the NP methods and the highest accuracy on the validation set for the LSTM methods."}, {"id": 187, "string": "We chose these word vectors as they have very different sizes (50 and 300), also they have been shown to perform well in different text types; SSWE for social media (Tang et al., 2016a) and Glove for reviews (Chen et al., 2017) ."}, {"id": 188, "string": "To make the experiments quicker and computationally less expensive, we filtered out all words from the word vectors that did not appear in the train and test datasets, and this is equivalent with respect to word coverage as using all words."}, {"id": 189, "string": "Finally we only reported results for the LSTM methods with one seed value and not multiple due to time constraints."}, {"id": 190, "string": "The results of the methods using the best found word vectors on the test sets can be seen in table 6."}, {"id": 191, "string": "We find that the TDParse methods generally perform best but only clearly outperforms the other nondependency parser methods on the YouTuBean dataset."}, {"id": 192, "string": "We hypothesise that this is due to the dataset containing, on average, a deeper constituency tree depth which could be seen as on average more complex sentences."}, {"id": 193, "string": "This could be due to it being from the spoken medium compared to the rest of the datasets which are written."}, {"id": 194, "string": "Also that using a sentiment lexicon is almost always beneficial, but only by a small amount."}, {"id": 195, "string": "Within the LSTM based methods the TDLSTM method generally performs the best indicating that the extra target information that the TCLSTM method contains is not needed, but we believe this needs further analysis."}, {"id": 196, "string": "We can conclude that the simpler NP models perform well across domain, type and medium and that even without language specific tools and lexicons they are competitive to the more complex LSTM based methods."}, {"id": 197, "string": "Dataset Target-Dep F1 Discussion and conclusion The fast developing subfield of TDSA has so far lacked a large-scale comparative mass evaluation of approaches using different models and datasets."}, {"id": 198, "string": "In this paper, we address this generalisability limitation and perform the first direct comparison and reproduction of three different approaches for TDSA."}, {"id": 199, "string": "While carrying out these reproductions, we have noted and described above, the many emerging issues in previous research related to incomplete descriptions of methods and settings, patchy release of code, and lack of comparative evaluations."}, {"id": 200, "string": "This is natural in a developing field, but it is crucial for ongoing development within NLP in general that improved repeatability practices are adopted."}, {"id": 201, "string": "The practices adopted in our case studies are to reproduce the methods in open source code, adopt only open data, provide format conversion tools to ingest the different data formats, and describe and document all settings via the code and Jupyter Notebooks (released initially in anonymous form at submission time) 12 ."}, {"id": 202, "string": "We therefore argue that papers should not consider repeatability (replication or reproduction) or generalisability alone, but these two key tenets of scientific practice should be brought together."}, {"id": 203, "string": "In future work, we aim to extend our reproduction framework further, and extend the comparative evaluation to languages other than English."}, {"id": 204, "string": "This will necessitate changes in the framework since we expect that dependency parsers and sentiment lexicons will be unavailable for specific languages."}, {"id": 205, "string": "Also we will explore through error analysis in which situations different neural network architectures perform best."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 27}, {"section": "Related work", "n": "2", "start": 28, "end": 94}, {"section": "Datasets used in our experiments", "n": "3", "start": 95, "end": 110}, {"section": "Reproduction studies", "n": "4", "start": 111, "end": 113}, {"section": "Reproduction of Vo and Zhang (2015)", "n": "4.1", "start": 114, "end": 140}, {"section": "Scaling and Final Model comparison", "n": "4.1.3", "start": 141, "end": 148}, {"section": "Reproduction of Wang et al. (2017)", "n": "4.2", "start": 149, "end": 184}, {"section": "Mass Evaluation", "n": "5", "start": 185, "end": 196}, {"section": "Discussion and conclusion", "n": "6", "start": 197, "end": 205}], "figures": [{"filename": "../figure/image/1071-Table4-1.png", "caption": "Table 4: Effectiveness of Sentiment Lexicons", "page": 5, "bbox": {"x1": 171.84, "x2": 426.24, "y1": 527.52, "y2": 643.1999999999999}}, {"filename": "../figure/image/1071-Table3-1.png", "caption": "Table 3: Sentiment lexicon statistics comparison", "page": 5, "bbox": {"x1": 72.96, "x2": 524.16, "y1": 369.59999999999997, "y2": 485.28}}, {"filename": "../figure/image/1071-Table1-1.png", "caption": "Table 1: Methods and Datasets", "page": 1, "bbox": {"x1": 99.84, "x2": 498.24, "y1": 397.44, "y2": 640.3199999999999}}, {"filename": "../figure/image/1071-Figure1-1.png", "caption": "Figure 1: Effectiveness of word embedding", "page": 6, "bbox": {"x1": 139.68, "x2": 458.4, "y1": 180.48, "y2": 380.15999999999997}}, {"filename": "../figure/image/1071-Table6-1.png", "caption": "Table 6: Mass Evaluation Results", "page": 9, "bbox": {"x1": 89.75999999999999, "x2": 507.35999999999996, "y1": 62.879999999999995, "y2": 204.95999999999998}}, {"filename": "../figure/image/1071-Figure3-1.png", "caption": "Figure 3: TDParse Final Results", "page": 7, "bbox": {"x1": 132.96, "x2": 465.12, "y1": 269.76, "y2": 445.91999999999996}}, {"filename": "../figure/image/1071-Figure2-1.png", "caption": "Figure 2: Target Dependent Final Results", "page": 7, "bbox": {"x1": 132.0, "x2": 466.08, "y1": 61.44, "y2": 239.04}}, {"filename": "../figure/image/1071-Table5-1.png", "caption": "Table 5: LSTM Final Results Figure 4: Distribution of the LSTM results", "page": 8, "bbox": {"x1": 75.84, "x2": 524.16, "y1": 61.44, "y2": 209.28}}, {"filename": "../figure/image/1071-Table2-1.png", "caption": "Table 2: Dataset Statistics", "page": 4, "bbox": {"x1": 78.72, "x2": 518.4, "y1": 211.67999999999998, "y2": 438.24}}]}