{"title": "Unsupervised Learning and Modeling of Knowledge and Intent for Spoken Dialogue Systems", "abstract": "Spoken dialogue systems (SDS) are rapidly appearing in various smart devices (smartphone, smart-TV, in-car navigating  system, etc). The key role in a successful SDS is a spoken language understanding (SLU) component, which parses user utterances into semantic concepts in order to understand users' intentions. However, such semantic concepts and their structure are manually created by experts, and the annotation process results in extremely high cost and poor scalability in system development. Therefore, the dissertation focuses on improving SDS generalization and scalability by automatically inferring domain knowledge and learning structures from unlabeled conversations through a matrix factorization (MF) technique. With the automatically acquired semantic concepts and structures, we further investigate whether such information can be utilized to effectively understand user utterances and then show the feasibility of reducing human effort during SDS development.", "text": [{"id": 0, "string": "Introduction Various smart devices (e.g."}, {"id": 1, "string": "smartphone, smart-TV, in-car navigating system) are incorporating spoken language interfaces, a.k.a."}, {"id": 2, "string": "spoken dialogue systems (SDS), in order to help users finish tasks more efficiently."}, {"id": 3, "string": "The key role in a successful SDS is a spoken language understanding (SLU) component; in order to capture the language variation from dialogue participants, the SLU component must create a mapping between the natural language inputs and semantic representations that correspond to users' intentions."}, {"id": 4, "string": "The semantic representation must include \"concepts' and a \"structure\": concepts are the domain-specific topics, and the structure describes the relations between concepts and conveys intentions."}, {"id": 5, "string": "However, most prior work focused on learning the mapping between utterances and semantic representations, where such knowledge still remains predefined."}, {"id": 6, "string": "The need of annotations results in extremely high cost and poor scalability in system development."}, {"id": 7, "string": "Therefore, current technology usually limits conversational interactions to a few narrow predefined domains/topics."}, {"id": 8, "string": "With the increasing conversational interactions, this dissertation focuses on improving generalization and scalability of building SDSs with little human effort."}, {"id": 9, "string": "In order to achieve the goal, two questions need to be addressed: 1) Given unlabelled conversations, how can a system automatically induce and organize the domain-specific concepts?"}, {"id": 10, "string": "2) With the automatically acquired knowledge, how can a system understand user utterances and intents?"}, {"id": 11, "string": "To tackle the above problems, we propose to acquire the domain knowledge that captures human's semantics, intents, and behaviors."}, {"id": 12, "string": "Then based on the acquired knowledge, we build an SLU component to understand users and to offer better interactions in dialogues."}, {"id": 13, "string": "The dissertation shows the feasibility of building a dialogue learning system that is able to understand how particular domains work based on unlabeled conversations."}, {"id": 14, "string": "As a result, an initial SDS can be automatically built according to the learned knowledge, and its performance can be quickly improved by interacting with users for practical usage, presenting the potential of reducing human effort for SDS development."}, {"id": 15, "string": "Our MF method completes a partially-missing matrix for semantic decoding/behavior prediction."}, {"id": 16, "string": "Dark circles are observed facts, shaded circles are inferred facts."}, {"id": 17, "string": "The ontology induction maps observed feature patterns to semantic concepts."}, {"id": 18, "string": "The feature relation model constructs correlations between observed feature patterns."}, {"id": 19, "string": "The concept relation model learns the high-level semantic correlations for inferring hidden semantic slots or predicting subsequent behaviors."}, {"id": 20, "string": "Reasoning with matrix factorization incorporates these models jointly, and produces a coherent and domain-specific SLU model."}, {"id": 21, "string": "the intent detection problem in SLU, showing that results obtained from the unsupervised training process align well with the performance of traditional supervised learning."}, {"id": 22, "string": "Following their success of unsupervised SLU, recent studies have also obtained interesting results on the tasks of relation detection (Hakkani-Tür et al., 2013; Chen et al., 2014a) , entity extraction (Wang et al., 2014) , and extending domain coverage (El-Kahky et al., 2014; Chen and Rudnicky, 2014) ."}, {"id": 23, "string": "However, most studies above do not explicitly learn latent factor representations from the data-while we hypothesize that the better robustness can be achieved by explicitly modeling the measurement errors (usually produced by automatic speech recognizers (ASR)) using latent variable models and taking additional local and global semantic constraints into account."}, {"id": 24, "string": "Latent Variable Modeling in SLU Early studies on latent variable modeling in speech included the classic hidden Markov model for statistical speech recognition (Jelinek, 1997) ."}, {"id": 25, "string": "Recently,  were the first to study the intent detection problem using query logs and a discrete Bayesian latent variable model."}, {"id": 26, "string": "In the field of dialogue modeling, the partially observable Markov decision process (POMDP) (Young et al., 2013) model is a popular technique for dialogue management, reducing the cost of handcrafted dialogue managers while producing robustness against speech recognition errors."}, {"id": 27, "string": "More recently,  used a semi-supervised LDA model to show improvement on the slot filling task."}, {"id": 28, "string": "Also, Zhai and Williams (2014) proposed an unsupervised model for connecting words with latent states in HMMs using topic models, obtaining interesting qualitative and quantitative results."}, {"id": 29, "string": "However, for unsupervised SLU, it is not obvious how to incorporate additional information in the HMMs."}, {"id": 30, "string": "With increasing works about learn-ing the feature matrices for language representations (Mikolov et al., 2013) , matrix factorization (MF) has become very popular for both implicit and explicit feedback (Rendle et al., 2009; Chen et al., 2015a) ."}, {"id": 31, "string": "This thesis proposal is the first to propose a framework about unsupervised SLU modeling, which is able to simultaneously consider various local and global knowledge automatically learned from unlabelled data using a matrix factorization (MF) technique."}, {"id": 32, "string": "The Proposed Work The proposed framework is shown in Figure 1(a) , where there are two main parts, one is knowledge acquisition and another is SLU modeling by MF."}, {"id": 33, "string": "The first part is to acquire the domain knowledge that is useful for building the domain-specific dialogue systems, which addresses the question about how to induce and organize the semantic concepts (the first problem)."}, {"id": 34, "string": "Here we propose ontology induction and structure learning procedures."}, {"id": 35, "string": "The ontology induction refers to the semantic concept induction (yellow block) and the structure learning refers to relation models (blue and pink blocks) in Figure 1 (a)."}, {"id": 36, "string": "The details are described in Section 4."}, {"id": 37, "string": "The second part is to self-train an SLU component using the acquired knowledge for the domainspecific SDS, and this part answers to the question about how to utilize the obtained information in SDSs to understand user utterances and intents."}, {"id": 38, "string": "There are two aspects regarding to SLU modeling, semantic decoding and behavior prediction."}, {"id": 39, "string": "The semantic decoding is to parse the input utterances into semantic forms for better understanding, and the behavior prediction is to predict the subsequent user behaviors for providing better system interactions."}, {"id": 40, "string": "This dissertation plans to apply MF techniques to unsupervised SLU modeling, including both semantic decoding and behavior prediction."}, {"id": 41, "string": "In the proposed model, we first build a feature matrix to represent training utterances, where each row refers to an utterance and each column refers to an observed feature pattern or a learned semantic concept (either a slot or a behavior)."}, {"id": 42, "string": "terance implies the meaning facet food."}, {"id": 43, "string": "The MF approach is able to learn the latent feature vectors for utterances and semantic concepts, inferring implicit semantics to improve the decoding process-namely, by filling the matrix with probabilities (lower part of the matrix in Figure 1(b) )."}, {"id": 44, "string": "The feature model is built on the observed feature patterns and the learned concepts, where the concepts are obtained from the knowledge acquisition process Chen et al., 2015b) ."}, {"id": 45, "string": "Section 5.1 explains the detail of the feature model."}, {"id": 46, "string": "In order to consider the additional structure information, we propose a relation propagation model based on the learned structure, which includes a feature relation model (blue block) and a concept relation model (pink block) described in Section 5.2."}, {"id": 47, "string": "Finally we train an SLU model by learning latent feature vectors for utterances and slots/behaviors through MF techniques."}, {"id": 48, "string": "Combining with a relation propagation model, the trained SLU model is able to estimate the probability that each concept occurs in the testing utterance, and how likely each concept is domain-specific simultaneously."}, {"id": 49, "string": "In other words, the SLU model is able to transform testing utterances into domainspecific semantic representations or predicted behaviors without human involvement."}, {"id": 50, "string": "Knowledge Acquisition Given unlabeled conversations and available knowledge resources, we plan to extract organized knowledge that can be used for domain-specific SDSs."}, {"id": 51, "string": "The ontology induction and structure learning are proposed to automate an ontology building process."}, {"id": 52, "string": "2014b) proposed to automatically induce semantic slots for SDSs by framesemantic parsing, where all ASR-decoded utter- ances are parsed using SEMAFOR 1 , a state-ofthe-art frame-semantic parser (Das et al., 2010; Das et al., 2013) , and then all frames from parsed results are extracted as slot candidates (Dinarelli et al., 2009) ."}, {"id": 53, "string": "For example, Figure 2 shows an example of an ASR-decoded text output parsed by SEMAFOR."}, {"id": 54, "string": "There are three frames (capability, expensiveness, and locale by use) in the utterance, which we consider as slot candidates."}, {"id": 55, "string": "Ontology Induction Since SEMAFOR was trained on FrameNet annotation, which has a more generic framesemantic context, not all the frames from the parsing results can be used as the actual slots in the domain-specific dialogue systems."}, {"id": 56, "string": "For instance, in Figure 2 , \"expensiveness\" and \"locale by use\" frames are essentially the key slots for the purpose of understanding in the restaurant query domain, whereas the \"capability\" frame does not convey particularly valuable information for the domain-specific SDS."}, {"id": 57, "string": "In order to fix this issue, Chen et al."}, {"id": 58, "string": "(2014b) proved that integrating continuous-valued word embeddings with a probabilistic frame-semantic parser is able to identify key semantic slots in an unsupervised fashion, reducing the cost of designing task-oriented SDSs."}, {"id": 59, "string": "Structure Learning A key challenge of designing a coherent semantic ontology for SLU is to consider the structure and relations between semantic concepts."}, {"id": 60, "string": "In practice, however, it is difficult for domain experts and professional annotators to define a coherent slot set, while considering various lexical, syntactic, and semantic dependencies."}, {"id": 61, "string": "The previous work exploited the typed syntactic dependency theory for unsupervised induction and organization of semantic slots in SDSs (Chen et al., 2015b) ."}, {"id": 62, "string": "More specifically, two knowledge graphs, a slot-based semantic knowledge graph and a word-based lexical knowledge graph, are automatically constructed."}, {"id": 63, "string": "To jointly consider the word-to-word, word-to-slot, and slot-to-slot relations, we use a random walk inference algorithm to combine these two knowledge graphs, guided by dependency grammars."}, {"id": 64, "string": "Figure 3 is a simplified example of the automatically built semantic knowledge graph corresponding to the restaurant domain."}, {"id": 65, "string": "The experiments showed that considering inter-slot relations is crucial for generating a more coherent and compete slot set, resulting in a better SLU model, while enhancing the interpretability of semantic slots."}, {"id": 66, "string": "SLU Modeling by Matrix Factorization For two aspects of SLU modeling: semantic decoding and behavior prediction, we plan to apply MF to both tasks by treating learned concepts as semantic slots and human behaviors respectively."}, {"id": 67, "string": "Considering the benefits brought by MF techniques, including 1) modeling the noisy data, 2) modeling hidden information, and 3) modeling the dependency between observations, the dissertation applies an MF approach to SLU modeling for SDSs."}, {"id": 68, "string": "In our model, we use U to denote the set of input utterances, F as the set of observed feature patterns, and S as the set of semantic concepts we would like to predict (slots or human behaviors)."}, {"id": 69, "string": "The pair of an utterance u ∈ U and a feature/concept x ∈ {F +S}, u, x , is a fact."}, {"id": 70, "string": "The input to our model is a set of observed facts O, and the observed facts for a given utterance is denoted by { u, x ∈ O}."}, {"id": 71, "string": "The goal of our model is to estimate, for a given utterance u and a given feature pattern/concept x, the probability, p(M u,x = 1), where M u,x is a binary random variable that is true if and only if x is the feature pattern/domainspecific concept in the utterance u."}, {"id": 72, "string": "We introduce a series of exponential family models that estimate the probability using a natural parameter θ u,x and the logistic sigmoid function: p(M u,x = 1 | θ u,x ) = σ(θ u,x ) (1) = 1 1 + exp (−θ u,x ) ."}, {"id": 73, "string": "We construct a matrix M |U |×(|F |+|S|) as observed facts for MF by integrating a feature model and a relation propagation model below."}, {"id": 74, "string": "Feature Model First, we build a binary feature pattern matrix F f based on the observations, where each row refers to an utterance and each column refers to a feature pattern (a word or a phrase)."}, {"id": 75, "string": "In other words, F f carries the basic word/phrase vector for each utterance, which is illustrated as the left part of the matrix in Figure 1(b) ."}, {"id": 76, "string": "Then we build a binary matrix F s based on the induced semantic concepts from Section 4.1, which also denotes the slot/behavior features for all utterances (right part of the matrix in Figure 1(b) )."}, {"id": 77, "string": "For building the feature model M F , we concatenate two matrices and obtain M F = [ F f F s ], which refers to the upper part of the matrix in Figure 1(b) for training utterances."}, {"id": 78, "string": "Relation Propagation Model It is shown that the structure of semantic concepts helps decide domain-specific slots and further improves the SLU performance (Chen et al., 2015b) ."}, {"id": 79, "string": "With the learned structure from Section 4.2, we can model the relations between semantic concepts, such as inter-slot and inter-behavior relations."}, {"id": 80, "string": "Also, the relations between feature patterns can be modeled in the similar way."}, {"id": 81, "string": "We construct two knowledge graphs to model the structure: • Feature knowledge graph is built as G f = V f , E f f , where V f = {f i ∈ F } and E f f = {e ij | f i , f j ∈ V f }."}, {"id": 82, "string": "• Semantic concept knowledge graph is built as G s = V s , E ss , where V s = {s i ∈ S} and E ss = {e ij | s i , s j ∈ V s }."}, {"id": 83, "string": "The structured graph can model the relation between the connected node pair (x i , x j ) as r(x i , x j )."}, {"id": 84, "string": "Here we compute two matrices R s = [r(s i , s j )] |S|×|S| and R f = [r(f i , f j )] |F |×|F | to represent concept relations and feature relations respectively."}, {"id": 85, "string": "With the built relation models, we combine them as a relation propagation matrix M R 2 : M R = R f 0 0 R s ."}, {"id": 86, "string": "(2) The goal of this matrix is to propagate scores between nodes according to different types of relations in the constructed knowledge graphs (Chen and Metze, 2012) ."}, {"id": 87, "string": "Integrated Model With a feature model M F and a relation propagation model M R , we integrate them into a single matrix."}, {"id": 88, "string": "M = M F · (M R + I) (3) = F f R f + F f 0 0 F s R s + F s , where M is final matrix and I is the identity matrix in order to remain the original values."}, {"id": 89, "string": "The matrix M is similar to M F , but some weights are enhanced through the relation propagation model."}, {"id": 90, "string": "The feature relations are built by F f R f , which is the matrix with internal weight propagation on the feature knowledge graph (the blue arrow in Figure 1(b) )."}, {"id": 91, "string": "Similarly, F s R s models the semantic concept correlations, and can be treated as the matrix with internal weight propagation on the semantic concept knowledge graph (the pink arrow in Figure 1(b) )."}, {"id": 92, "string": "The propagation model can be treated as running a random walk algorithm on the graphs."}, {"id": 93, "string": "By integrating with the relation propagation model, the relations can be propagated via the knowledge graphs, and the hidden information may be modeled based on the assumption that mutual relations usually help inference (Chen et al., 2015b) ."}, {"id": 94, "string": "Hence, the structure information can be automatically involved in the matrix."}, {"id": 95, "string": "In conclusion, for each utterance, the integrated model not only predicts the probabilities that semantic concepts occur but also considers whether they are domain-specific."}, {"id": 96, "string": "Model Learning The proposed model is parameterized through weights and latent component vectors, where the parameters are estimated by maximizing the log likelihood of observed data (Collins et al., 2001) ."}, {"id": 97, "string": "θ * = arg max θ u∈U p(θ | M u ) (4) = arg max θ u∈U p(M u | θ)p(θ) = arg max θ u∈U ln p(M u | θ) − λ θ , where M u is the vector corresponding to the utterance u from M u,x in (1), because we assume that each utterance is independent of others."}, {"id": 98, "string": "To avoid treating unobserved facts as designed negative facts, we consider our positive-only data as implicit feedback."}, {"id": 99, "string": "Bayesian Personalized Ranking (BPR) is an optimization criterion that learns from implicit feedback for MF, which uses a variant of the ranking: giving observed true facts higher scores than unobserved (true or false) facts (Rendle et al., 2009 )."}, {"id": 100, "string": "Riedel et al."}, {"id": 101, "string": "(2013) also showed that BPR learns the implicit relations and improves a relation extraction task."}, {"id": 102, "string": "To estimate the parameters in (4), we create a dataset of ranked pairs from M in (3): for each utterance u and each observed fact f + = u, x + , where M u,x ≥ δ, we choose each semantic concept x − such that f − = u, x − , where M u,x < δ, which refers to the semantic concept we have not observed in utterance u."}, {"id": 103, "string": "That is, we construct the observed data O from M ."}, {"id": 104, "string": "Then for each pair of facts f + and f − , we want to model p(f + ) > p(f − ) and hence θ f + > θ f − according to (1)."}, {"id": 105, "string": "BPR maximizes the summation of each ranked pair, where the objective is u∈U ln p(M u | θ) = f + ∈O f − ∈O ln σ(θ f + − θ f − )."}, {"id": 106, "string": "(5) The BPR objective is an approximation to the per utterance AUC (area under the ROC curve), which directly correlates to what we want to achieve -well-ranked semantic concepts per utterance, which denotes the better estimation of semantic slots or human behaviors."}, {"id": 107, "string": "To maximize the objective in (5), we employ a stochastic gradient descent (SGD) algorithm (Rendle et al., 2009) ."}, {"id": 108, "string": "For each randomly sampled observed fact u, x + , we sample an unobserved fact u, x − , which results in |O| fact pairs f − , f + ."}, {"id": 109, "string": "For each pair, we perform an SGD update using the gradient of the corresponding objective function for matrix factorization (Gantner et al., 2011) ."}, {"id": 110, "string": "Conclusion and Future Work This thesis proposal proposes an unsupervised SLU approach by automating the dialogue learning process on speech conversations."}, {"id": 111, "string": "The preliminary results show that for the automatic speech recognition (ASR) transcripts (word error rate is about 37%), the acquired knowledge can be successfully applied to SLU modeling through MF techniques, guiding the direction of the methodology."}, {"id": 112, "string": "The main planed tasks include: • Semantic concept identification • Semantic concept annotation • SLU modeling by matrix factorization In this thesis proposal, ongoing work and future plans have been presented towards an automatically built domain-specific SDS."}, {"id": 113, "string": "With increasing semantic resources, such as Google's Knowledge Graph and Microsoft Satori, the dissertation shows the feasibility that utilizing available knowledge improves the generalization and the scalability of dialogue system development for practical usage."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 31}, {"section": "The Proposed Work", "n": "3", "start": 32, "end": 49}, {"section": "Knowledge Acquisition", "n": "4", "start": 50, "end": 54}, {"section": "Ontology Induction", "n": "4.1", "start": 55, "end": 58}, {"section": "Structure Learning", "n": "4.2", "start": 59, "end": 65}, {"section": "SLU Modeling by Matrix Factorization", "n": "5", "start": 66, "end": 73}, {"section": "Feature Model", "n": "5.1", "start": 74, "end": 77}, {"section": "Relation Propagation Model", "n": "5.2", "start": 78, "end": 86}, {"section": "Integrated Model", "n": "5.3", "start": 87, "end": 95}, {"section": "Model Learning", "n": "5.4", "start": 96, "end": 109}, {"section": "Conclusion and Future Work", "n": "6", "start": 110, "end": 113}], "figures": [{"filename": "../figure/image/1077-Figure2-1.png", "caption": "Figure 2: An example of probabilistic framesemantic parsing on ASR output. FT: frame target. FE: frame element. LU: lexical unit.", "page": 2, "bbox": {"x1": 313.44, "x2": 516.96, "y1": 66.72, "y2": 131.04}}, {"filename": "../figure/image/1077-Figure1-1.png", "caption": "Figure 1: (a): The proposed framework. (b): Our MF method completes a partially-missing matrix for semantic decoding/behavior prediction. Dark circles are observed facts, shaded circles are inferred facts. The ontology induction maps observed feature patterns to semantic concepts. The feature relation model constructs correlations between observed feature patterns. The concept relation model learns the high-level semantic correlations for inferring hidden semantic slots or predicting subsequent behaviors. Reasoning with matrix factorization incorporates these models jointly, and produces a coherent and domain-specific SLU model.", "page": 1, "bbox": {"x1": 76.8, "x2": 518.88, "y1": 65.28, "y2": 383.03999999999996}}, {"filename": "../figure/image/1077-Figure3-1.png", "caption": "Figure 3: A simplified example of the automatically derived knowledge graph.", "page": 3, "bbox": {"x1": 104.64, "x2": 255.35999999999999, "y1": 67.67999999999999, "y2": 168.0}}]}