{"title": "Massively Multilingual Transfer for NER", "abstract": "In cross-lingual transfer, NLP models over one or more source languages are applied to a lowresource target language. While most prior work has used a single source model or a few carefully selected models, here we consider a \"massive\" setting with many such models. This setting raises the problem of poor transfer, particularly from distant languages. We propose two techniques for modulating the transfer, suitable for zero-shot or few-shot learning, respectively. Evaluating on named entity recognition, we show that our techniques are much more effective than strong baselines, including standard ensembling, and our unsupervised method rivals oracle selection of the single best individual model. 1 * Both authors contributed equally to this work. 1  The code and the datasets will be made available at https://github.com/afshinrahimi/mmner.", "text": [{"id": 0, "string": "Introduction Supervised learning remains king in natural language processing, with most tasks requiring large quantities of annotated corpora."}, {"id": 1, "string": "The majority of the world's 6,000+ languages however have limited or no annotated text, and therefore much of the progress in NLP has yet to be realised widely."}, {"id": 2, "string": "Cross-lingual transfer learning is a technique which can compensate for the dearth of data, by transferring knowledge from high-to lowresource languages, which has typically taken the form of annotation projection over parallel corpora or other multilingual resources (Yarowsky et al., 2001; Hwa et al., 2005) , or making use of transferable representations, such as phonetic transcriptions (Bharadwaj et al., 2016) , closely related languages (Cotterell and Duh, 2017) or bilingual dictionaries (Mayhew et al., 2017; Xie et al., 2018) ."}, {"id": 3, "string": "Most methods proposed for cross-lingual transfer rely on a single source language, which limits the transferable knowledge to only one source."}, {"id": 4, "string": "The target language might be similar to many source languages, on the grounds of the script, word order, loan words etc, and transfer would benefit from these diverse sources of information."}, {"id": 5, "string": "There are a few exceptions, which use transfer from several languages, ranging from multitask learning (Duong et al., 2015; Ammar et al., 2016; Fang and Cohn, 2017) , and annotation projection from several languages (Täckström, 2012; Fang and Cohn, 2016; Plank and Agić, 2018) ."}, {"id": 6, "string": "However, to the best of our knowledge, none of these approaches adequately account for the quality of transfer, but rather \"weight\" the contribution of each language uniformly."}, {"id": 7, "string": "In this paper, we propose a novel method for zero-shot multilingual transfer, inspired by research in truth inference in crowd-sourcing, a related problem, in which the 'ground truth' must be inferred from the outputs of several unreliable annotators (Dawid and Skene, 1979) ."}, {"id": 8, "string": "In this problem, the best approaches estimate each model's reliability, and their patterns of mistakes (Kim and Ghahramani, 2012) ."}, {"id": 9, "string": "Our proposed model adapts these ideas to a multilingual transfer setting, whereby we learn the quality of transfer, and language-specific transfer errors, in order to infer the best labelling in the target language, as part of a Bayesian graphical model."}, {"id": 10, "string": "The key insight is that while the majority of poor models make lots of mistakes, these mistakes are diverse, while the few good models consistently provide reliable input."}, {"id": 11, "string": "This allows the model to infer which are the reliable models in an unsupervised manner, i.e., without explicit supervision in the target language, and thereby make accurate inferences despite the substantial noise."}, {"id": 12, "string": "In the paper, we also consider a supervised setting, where a tiny annotated corpus is available in the target language."}, {"id": 13, "string": "We present two methods to use this data: 1) estimate reliability parameters of the Bayesian model, and 2) explicit model selection and fine-tuning of a low-resource supervised model, thus allowing for more accurate modelling of language specific parameters, such as character embeddings, shown to be important in previous work (Xie et al., 2018) ."}, {"id": 14, "string": "Experimenting on two NER corpora, one with as many as 41 languages, we show that single model transfer has highly variable performance, and uniform ensembling often substantially underperforms the single best model."}, {"id": 15, "string": "In contrast, our zero-shot approach does much better, exceeding the performance of the single best model, and our few-shot supervised models result in further gains."}, {"id": 16, "string": "Approach We frame the problem of multilingual transfer as follows."}, {"id": 17, "string": "We assume a collection of H models, all trained in a high resource setting, denoted M h = {M h i , i ∈ (1, H)}."}, {"id": 18, "string": "Each of these models are not well matched to our target data setting, for instance these may be trained on data from different domains, or on different languages, as we evaluate in our experiments, where we use crosslingual embeddings for model transfer."}, {"id": 19, "string": "This is a problem of transfer learning, namely, how best we can use the H models for best results in the target language."}, {"id": 20, "string": "2 Simple approaches in this setting include a) choosing a single model M ∈ M h , on the grounds of practicality, or the similarity between the model's native data condition and the target, and this model is used to label the target data; or b) allowing all models to 'vote' in an classifier ensemble, such that the most frequent outcome is selected as the ensemble output."}, {"id": 21, "string": "Unfortunately neither of these approaches are very accurate in a cross-lingual transfer setting, as we show in §4, where we show a fixed source language model (en) dramatically underperforms compared to oracle selection of source language, and the same is true for uniform voting."}, {"id": 22, "string": "Motivated by these findings, we propose novel methods for learning."}, {"id": 23, "string": "For the \"zero-shot\" setting where no labelled data is available in the target, we propose the BEA uns method inspired by work 2 We limit our attention to transfer in a 'black-box' setting, that is, given predictive models, but not assuming access to their data, nor their implementation."}, {"id": 24, "string": "This is the most flexible scenario, as it allows for application to settings with closed APIs, and private datasets."}, {"id": 25, "string": "It does, however, preclude multitask learning, as the source models are assumed to be static."}, {"id": 26, "string": "in truth inference from crowd-sourced datasets or diverse classifiers ( §2.1)."}, {"id": 27, "string": "To handle the \"few-shot\" case §2.2 presents a rival supervised technique, RaRe, based on using very limited annotations in the target language for model selection and classifier fine-tuning."}, {"id": 28, "string": "V (j) π z i y ij β α i = 1 ."}, {"id": 29, "string": "."}, {"id": 30, "string": "."}, {"id": 31, "string": "N j = 1 ."}, {"id": 32, "string": "."}, {"id": 33, "string": "."}, {"id": 34, "string": "H Zero-Shot Transfer One way to improve the performance of the ensemble system is to select a subset of component models carefully, or more generally, learn a non-uniform weighting function."}, {"id": 35, "string": "Some models do much better than others, on their own, so it stands to reason that identifying these handful of models will give rise to better ensemble performance."}, {"id": 36, "string": "How might we proceed to learn the relative quality of models in the setting where no annotations are available in the target language?"}, {"id": 37, "string": "This is a classic unsupervised inference problem, for which we propose a probabilistic graphical model, inspired by Kim and Ghahramani (2012) ."}, {"id": 38, "string": "We develop a generative model, illustrated in Figure 1 , of the transfer models' predictions, y ij , where i ∈ [1, N ] is an instance (a token or an entity span), and j ∈ [1, H] indexes a transfer model."}, {"id": 39, "string": "The generative process assumes a 'true' label, z i ∈ [1, K], which is corrupted by each transfer model, in producing the prediction, y ij ."}, {"id": 40, "string": "The corruption process is described by P (y ij = l|z i = k, V (j) ) = V (j) kl , where V (j) ∈ R K×K is the confusion matrix specific to a transfer model."}, {"id": 41, "string": "To complete the story, the confusion matrices are drawn from vague row-wise independent Dirichlet priors, with a parameter α = 1, and the true labels are governed by a Dirichlet prior, π, which is drawn from an uninformative Dirichlet distribution with a parameter β = 1."}, {"id": 42, "string": "This generative model is referred to as BEA."}, {"id": 43, "string": "Inference under the BEA model involves ex-plaining the observed predictions Y in the most efficient way."}, {"id": 44, "string": "Where several transfer models have identical predictions, k, on an instance, this can be explained by letting z i = k, 3 and the confusion matrices of those transfer models assigning high probability to V (j) kk ."}, {"id": 45, "string": "Other, less reliable, transfer models will have divergent predictions, which are less likely to be in agreement, or else are heavily biased towards a particular class."}, {"id": 46, "string": "Accordingly, the BEA model can better explain these predictions through label confusion, using the off-diagonal elements of the confusion matrix."}, {"id": 47, "string": "Aggregated over a corpus of instances, the BEA model can learn to differentiate between those reliable transfer models, with high V (j) kk and those less reliable ones, with high V (j) kl , l = k. This procedure applies perlabel, and thus the 'reliability' of a transfer model is with respect to a specific label, and may differ between classes."}, {"id": 48, "string": "This helps in the NER setting where many poor transfer models have excellent accuracy for the outside label, but considerably worse performance for entity labels."}, {"id": 49, "string": "For inference, we use mean-field variational Bayes (Jordan, 1998) , which learns a variational distribution, q(Z, V, π) to optimise the evidence lower bound (ELBO), log P (Y |α, β) ≥ E q(Z,V,π) log P (Y, Z, V, π|α, β) q(Z, V, π) assuming a fully factorised variational distribution, q(Z, V, π) = q(Z)q(V )q(π)."}, {"id": 50, "string": "This gives rise to an iterative learning algorithm with update rules: E q log π k (1a) =ψ β + i q(z i = k) − ψ (Kβ + N ) E q log V (j) kl (1b) =ψ α + i q(z i = k)1[y ij = l] − ψ Kα + i q(z i = k) q(z i = k) ∝ exp    E q log π k + j E q log V (j) ky ij    (2) 3 Although there is no explicit breaking of the symmetry of the model, we initialise inference using the majority vote, which results in a bias towards this solution."}, {"id": 51, "string": "where ψ is the digamma function, defined as the logarithmic derivative of the gamma function."}, {"id": 52, "string": "The sets of rules (1) and (2) are applied alternately, to update the values of E q log π k , E q log V (j) kl , and q(z ij = k) respectively."}, {"id": 53, "string": "This repeats until convergence, when the difference in the ELBO between two iterations is smaller than a threshold."}, {"id": 54, "string": "The final prediction of the model is based on q(Z), using the maximum a posteriori label z i = arg max z q(z i = z)."}, {"id": 55, "string": "This method is referred to as BEA uns ."}, {"id": 56, "string": "In our NER transfer task, classifiers are diverse in their F1 scores ranging from almost 0 to around 80, motivating spammer removal (Raykar and Yu, 2012) to filter out the worst of the transfer models."}, {"id": 57, "string": "We adopt a simple strategy that first estimates the confusion matrices for all transfer models on all labels, then ranks them based on their mean recall on different entity categories (elements on the diagonals of their confusion matrices), and then runs the BEA model again using only labels from the top k transfer models only."}, {"id": 58, "string": "We call this method BEA uns×2 and its results are reported in §4."}, {"id": 59, "string": "Token versus Entity Granularity Our proposed aggregation method in §2.1 is based on an assumption that the true annotations are independent from each other, which simplifies the model but may generate undesired results."}, {"id": 60, "string": "That is, entities predicted by different transfer models could be mixed, resulting in labels inconsistent with the BIO scheme."}, {"id": 61, "string": "Table 1 shows an example, where a sentence with 4 words is annotated by 5 transfer models with 4 different predictions, among which at most one is correct as they overlap."}, {"id": 62, "string": "However, the aggregated result in the token view is a mixture of two predictions, which is supported by no transfer models."}, {"id": 63, "string": "To deal with this problem, we consider aggre-gating the predictions in the entity view."}, {"id": 64, "string": "As shown in Table 1 , we convert the predictions for tokens to predictions for ranges, aggregate labels for every range, and then resolve remaining conflicts."}, {"id": 65, "string": "A prediction is ignored if it conflicts with another one with higher probability."}, {"id": 66, "string": "By using this greedy strategy, we can solve the conflicts raised in entitylevel aggregation."}, {"id": 67, "string": "We use superscripts tok and ent to denote token-level and entity-level aggregations, i.e."}, {"id": 68, "string": "BEA tok uns and BEA ent uns ."}, {"id": 69, "string": "Few-Shot Transfer Until now, we have assumed no access to annotations in the target language."}, {"id": 70, "string": "However, when some labelled text is available, how might this best be used?"}, {"id": 71, "string": "In our experimental setting, we assume a modest set of 100 labelled sentences, in keeping with a low-resource setting (Garrette and Baldridge, 2013) ."}, {"id": 72, "string": "4 We propose two models BEA sup and RaRe in this setting."}, {"id": 73, "string": "Supervising BEA (BEA sup ) One possibility is to use the labelled data to find the posterior for the parameters V (j) and π of the Bayesian model described in §2.1."}, {"id": 74, "string": "Let n k be the number of instances in the labelled data whose true label is k, and n jkl the number of instances whose true label is k and classifier j labels them as l. Then the quantities in Equation (1) can be calculated as E log π k =ψ(n k ) − ψ(N ) E log v jkl =ψ(n jkl ) − ψ l n jkl ."}, {"id": 75, "string": "These are used in Equation (2) for inference on the test set."}, {"id": 76, "string": "We refer to this setting as BEA sup ."}, {"id": 77, "string": "Ranking and Retraining (RaRe) We also propose an alternative way of exploiting the limited annotations, RaRe, which first ranks the systems, and then uses the top ranked models' outputs alongside the gold data to retrain a model on the target language."}, {"id": 78, "string": "The motivation is that the above technique is agnostic to the input text, and therefore is unable to exploit situations where regularities occur, such as common words or character patterns that are indicative of specific class labels, including names, titles, etc."}, {"id": 79, "string": "These signals are unlikely to be consistently captured by crosslingual transfer."}, {"id": 80, "string": "Training a model on the target language with a character encoder component, can distil the signal that are captured by the transfer models, while relating this towards generalisable lexical and structural evidence in the target language."}, {"id": 81, "string": "This on its own will not be enough, as many tokens will be consistently misclassified by most or all of the transfer models, and for this reason we also perform model fine-tuning using the supervised data."}, {"id": 82, "string": "The ranking step in RaRe proceeds by evaluating each of the H transfer models on the target gold set, to produce scores s h (using the F 1 score)."}, {"id": 83, "string": "The scores are then truncated to the top k ≤ H values, such that s h = 0 for those systems h not ranked in the top k, and normalised ω h = s h k j=1 s j ."}, {"id": 84, "string": "The range of scores are quite wide, covering 0.00 − 0.81 (see Figure 2 ), and accordingly this simple normalisation conveys a strong bias towards the top scoring transfer systems."}, {"id": 85, "string": "The next step is a distillation step, where a model is trained on a large unannotated dataset in the target language, such that the model predictions match those of a weighted mixture of transfer models, using ω = (ω 1 , ."}, {"id": 86, "string": "."}, {"id": 87, "string": "."}, {"id": 88, "string": ", ω H ) as the mixing weights."}, {"id": 89, "string": "This process is implemented as minibatch scheduling, where the labels for each minibatch are randomly sampled from transfer model h with probability ω h ."}, {"id": 90, "string": "5 This is repeated over the course of several epochs of training."}, {"id": 91, "string": "Finally, the model is fine-tuned using the small supervised dataset, in order to correct for phenomena that are not captured from model transfer, particularly character level information which is not likely to transfer well for all but the most closely related languages."}, {"id": 92, "string": "Fine-tuning proceeds for a fixed number of epochs on the supervised dataset, to limit overtraining of richly parameterise models on a tiny dataset."}, {"id": 93, "string": "Note that in all stages, the same supervised dataset is used, both in ranking and fine-tuning, and moreover, we do not use a development set."}, {"id": 94, "string": "This is not ideal, and generalisation performance would likely improve were we to use additional annotated data, however our meagre use of data is designed for a low resource setting where labelled data is at a premium."}, {"id": 95, "string": "Experiments Data Our primarily evaluation is over a subset of the Wikiann NER corpus (Pan et al., 2017) , using 41 out of 282 languages, where the langauges were chosen based on their overlap with multilingual word embedding resources from Lample et al."}, {"id": 96, "string": "(2018) ."}, {"id": 97, "string": "6 The NER taggs are in IOB2 format comprising of LOC, PER, and ORG."}, {"id": 98, "string": "The distribution of labels is highly skewed, so we created balanced datasets, and partitioned into training, development, and test sets, details of which are in the Appendix."}, {"id": 99, "string": "For comparison with prior work, we also evaluate on the CoNLL 2002 and 2003 datasets (Tjong Kim Sang, 2002; Tjong Kim Sang and De Meulder, 2003) , which we discuss further in §4."}, {"id": 100, "string": "For language-independent word embedding features we use fastText 300 dimensional Wikipedia embeddings (Bojanowski et al., 2017) , and map them to the English embedding space using character-identical words as the seed for the Procrustes rotation method for learning bingual embedding spaces from MUSE (Lample et al., 2018)."}, {"id": 101, "string": "7 Similar to Xie et al."}, {"id": 102, "string": "(2018) we don't rely on a bilingual dictionary, so the method can be easily applied to other languages."}, {"id": 103, "string": "Model Variations As the sequential tagger, we use a BiLSTM-CRF (Lample et al., 2016) , which has been shown to result in state-of-the-art results in high resource settings (Ma and Hovy, 2016; Lample et al., 2016) ."}, {"id": 104, "string": "This model includes both word embeddings (for which we used fixed cross-lingual embeddings) and character embeddings, to form a parameterised potential function in a linear chain conditional random field."}, {"id": 105, "string": "With the exception of batch size and learning rate which were tuned (details in Appendix), we kept the architecture and the hyperparameters the same as the published code."}, {"id": 106, "string": "8 6 With ISO 639-1 codes: af, ar, bg, bn, bs, ca, cs, da, de, el, en, es, et, fa, fi, fr, he, hi, hr, hu, id, it, lt, lv, mk, ms, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, ta, tl, tr, uk and vi."}, {"id": 107, "string": "7 We also experimented with other bilingual embedding methods, including: supervised learning over bilingual dictionaries, which barely affected system performance; and pure-unsupervised methods (Lample et al., 2018; Artetxe et al., 2018) , which performed substantially worse."}, {"id": 108, "string": "For this reason we use identical word type seeding, which is preferred as it imposes no additional supervision requirement."}, {"id": 109, "string": "8 https://github.com/guillaumegenthial/ sequence_tagging We trained models on all 41 languages in both high-resource (HSup) and naive supervised lowresource (LSup) settings, where HSup pre-trained models were used for transfer in a leave-one-out setting, i.e., taking the predictions of 40 models into a single target language."}, {"id": 110, "string": "The same BiLSTM-CRF is also used for RaRe."}, {"id": 111, "string": "To avoid overfitting, we use early stopping based on a validation set for the HSup, and LSup baselines."}, {"id": 112, "string": "For RaRe, given that the model is already trained on noisy data, we stop fine-tuning after only 5 iterations, chosen based on the performance for the first four languages."}, {"id": 113, "string": "We compare the supervised HSup and LSup monolingual baselines with our proposed transfer models: MV uniform ensemble, a.k.a."}, {"id": 114, "string": "\"majority vote\"; BEA uns×2 , BEA uns unsupervised aggregation models, applied to entities or tokens (see §2.1); BEA sup supervised estimation of BEA Results We report the results for single source direct transfer, and then show that our proposed multilingual methods outperform majority voting."}, {"id": 115, "string": "Then we analyse the choice of source languages, and how it affects transfer."}, {"id": 116, "string": "10 Finally we report results on CoNLL NER datasets."}, {"id": 117, "string": "9 Because BWET uses identical characters for bilingual dictionary induction, we observed many English loan words in the target language mapped to the same word in the induced bilingual dictionaries."}, {"id": 118, "string": "Filtering such dictionary items might improve BWET."}, {"id": 119, "string": "10 For detailed results see  Direct Transfer The first research question we consider is the utility of direct transfer, and the simple majority vote ensembling method."}, {"id": 120, "string": "As shown in Figure 2 , using a single model for direct transfer (English: en) is often a terrible choice."}, {"id": 121, "string": "The oracle choice of source language model does much better, however it is not always a closely related language (e.g., Italian: it does best for Indonesian: id, despite the target being closer to Malay: ms)."}, {"id": 122, "string": "Note the collection of Cyrillic languages (bg, mk, uk) where the oracle is substantially better than the majority vote, which is likely due to script differences."}, {"id": 123, "string": "The role of script appears to be more important than language family, as seen for Slavic languages where direct transfer works well between between pairs languages using the same alphabet (Cyrillic versus Latin), but much more poorly when there is an alphabet mismatch."}, {"id": 124, "string": "11 The transfer relationship is not symmetric e.g., Persian: fa does best for Arabic: ar, but German: de does best for Persian."}, {"id": 125, "string": "Figure 2 also shows that ensemble voting is well below the oracle best language, which is likely to be a result of overall high error rates coupled with error correlation between models, and little can be gained from ensembling."}, {"id": 126, "string": "Multilingual Transfer We report the results for the proposed low-resource supervised models (RaRe and BEA sup ), and unsupervised models (BEA uns and BEA uns×2 ), summarised as an average over the 41 languages in Figure 3 (see Appendix A for the full table of results)."}, {"id": 127, "string": "The figure compares against high-and low-resource supervised baselines (HSup and LSup, respectively), and BWET."}, {"id": 128, "string": "The best performance is achieved with a high supervision (HSup, F 1 = 89.2), while very limited supervision (LSup) results in a considerably lower F 1 of 62.1."}, {"id": 129, "string": "The results for MV tok show that uniform ensembling of multiple source models is even worse, by about 5 points."}, {"id": 130, "string": "Unsupervised zero-shot learning dramatically improves upon MV tok , and BEA ent uns outperforms BEA tok uns , showing the effectiveness of inference over entities rather than tokens."}, {"id": 131, "string": "It is clear that having access to limited annotation in the target language makes a substantial difference in BEA ent sup and RaRe with F 1 of 74.8 and 77.4, respectively."}, {"id": 132, "string": "Further analysis show that majority voting works reasonably well for Romance and Germanic languages, which are well represented in the dataset, but fails miserably compared to single best for Slavic languages (e.g."}, {"id": 133, "string": "ru, uk, bg) where there are only a few related languages."}, {"id": 134, "string": "For most of the isolated languages (ar, fa, he, vi, ta), explicitly training a model in RaRe outperforms BEA ent sup , showing that relying only on aggregation of annotated data has limitations, in that it cannot exploit character and structural features."}, {"id": 135, "string": "Choice of Source Languages An important question is how the other models, particularly the unsupervised variants, are affected by the number and choice of sources languages."}, {"id": 136, "string": "Figure 4 charts the performance of MV, BEA, and RaRe against the number of source models, comparing the use of ideal or realistic selection methods to attempt to find the best source models."}, {"id": 137, "string": "MV ent , BEA ent sup , and RaRe use a small labeled dataset to rank the source models."}, {"id": 138, "string": "BEA ent uns, oracle has the access to the perfect ranking of source models based on their real F 1 on the test set."}, {"id": 139, "string": "BEA uns×2 is completely unsupervised in that it uses its own estimates to rank all source models."}, {"id": 140, "string": "MV doesn't show any benefit with more than 3 source models."}, {"id": 141, "string": "12 In contrast, BEA and RaRe con- 12 The sawtooth pattern arises from the increased numbers of ties (broken randomly) with even numbers of inputs."}, {"id": 142, "string": "tinue to improve with up to 10 languages."}, {"id": 143, "string": "We show that BEA in two realistic scenarios (unsupervised: BEA ent uns×2 , and supervised: BEA ent sup ) is highly effective at discriminating between good and bad source models, and thus filtering out the bad models gives the best results."}, {"id": 144, "string": "The BEA ent uns×2 curve shows the effect of filtering using purely unsupervised signal, which has a positive, albeit mild effect on performance."}, {"id": 145, "string": "In BEA ent uns, oracle although the source model ranking is perfect, it narrowly outperforms BEA."}, {"id": 146, "string": "Note also that neither of the BEA curves show evidence of the sawtooth pattern, i.e., they largely benefit from more inputs, irrespective of their parity."}, {"id": 147, "string": "Finally, adding supervision in the target language in RaRe further improves upon the unsupervised models."}, {"id": 148, "string": "CoNLL Dataset Finally, we apply our model to the CoNLL-02/03 datasets, to benchmark our technique against related work."}, {"id": 149, "string": "This corpus is much less rich than Wikiann used above, as it includes only four languages (en, de, nl, es), and furthermore, the languages are closely related and share the same script."}, {"id": 150, "string": "Results in Table 2 show that our methods are competitive with benchmark methods, and, moreover, the use of 100 annotated sentences in the target language (RaRe l ) gives good improvements over unsupervised models."}, {"id": 151, "string": "13 Results also show that MV does very well, especially MV ent , and its performance is comparable to BEA's."}, {"id": 152, "string": "Note that there are only 3 source models and none of them is clearly bad, so BEA estimates that they are similarly reliable which results in little difference in terms of performance between BEA and MV."}, {"id": 153, "string": "Related Work Two main approaches for cross-lingual transfer are representation and annotation projection."}, {"id": 154, "string": "Representation projection learns a model in a highresource source language using representations that are cross-linguistically transferable, and then directly applies the model to data in the target language."}, {"id": 155, "string": "This can include the use of crosslingual word clusters  and word embeddings (Ammar et al., 2016; Ni et al., 2017) , multitask learning with a closely related high-resource language (e.g."}, {"id": 156, "string": "Spanish for Galician) (Cotterell and Duh, 2017), or bridging  the source and target languages through phonemic transcription (Bharadwaj et al., 2016) or Wikification (Tsai et al., 2016) ."}, {"id": 157, "string": "In annotation projection, the annotations of tokens in a source sentence are projected to their aligned tokens in the target language through a parallel corpus."}, {"id": 158, "string": "Annotation projection has been applied to POS tagging ( (Täckström, 2012; Plank and Agić, 2018) use only one language (often English) as the source language."}, {"id": 159, "string": "In multi-source language setting, majority voting is often used to aggregate noisy annotations (e.g."}, {"id": 160, "string": "Plank and Agić (2018) )."}, {"id": 161, "string": "Fang and Cohn (2016) show the importance of modelling the annotation biases that the source language(s) might project to the target language."}, {"id": 162, "string": "Transfer from multiple source languages: Previous work has shown the improvements of multi-source transfer in NER (Täckström, 2012; Fang et al., 2017; Enghoff et al., 2018) , POS tagging (Snyder et al., 2009; Plank and Agić, 2018) , and parsing (Ammar et al., 2016) compared to single source transfer, however, multi-source transfer might be noisy as a result of divergence in script, phonology, morphology, syntax, and semantics between the source languages, and the target language."}, {"id": 163, "string": "To capture such differences, various methods have been proposed: latent variable models (Snyder et al., 2009 ), majority voting (Plank and Agić, 2018) , utilising typological features (Ammar et al., 2016) , or explicitly learning annotation bias (Fang and Cohn, 2017)."}, {"id": 164, "string": "Our work is also related to knowledge distillation from multiple source models applied in parsing (Kuncoro et al., 2016) and machine translation (Kim and Rush, 2016; Johnson et al., 2017) ."}, {"id": 165, "string": "In this work, we use truth inference to model the transfer annotation bias from diverse source models."}, {"id": 166, "string": "Finally, our work is related to truth inference from crowd-sourced annotations (Whitehill et al., 2009; Welinder et al., 2010) , and most importantly from diverse classifiers (Kim and Ghahramani, 2012; Ratner et al., 2017) ."}, {"id": 167, "string": "Nguyen et al."}, {"id": 168, "string": "(2017) propose a hidden Markov model for aggregating crowdsourced sequence labels, but only learn per-class accuracies for workers instead of full confusion matrices in order to address the data sparsity problem in crowdsourcing."}, {"id": 169, "string": "Conclusion Cross-lingual transfer does not work out of the box, especially when using large numbers of source languages, and distantly related target languages."}, {"id": 170, "string": "In an NER setting using a collection of 41 languages, we showed that simple methods such as uniform ensembling do not work well."}, {"id": 171, "string": "We proposed two new multilingual transfer models (RaRe and BEA), based on unsupervised transfer, or a supervised transfer setting with a small 100 sentence labelled dataset in the target language."}, {"id": 172, "string": "We also compare our results with BWET (Xie et al., 2018) , a state-of-the-art unsupervised single source (English) transfer model, and showed that multilingual transfer outperforms it, however, our work is orthogonal to their work in that if training data from multiple source models is created, RaRe and BEA can still combine them, and outperform majority voting."}, {"id": 173, "string": "Our unsupervised method, BEA uns , provides a fast and simple way of annotating data in the target language, which is capable of reasoning under noisy annotations, and outperforms several competitive baselines, including the majority voting ensemble, a low-resource supervised baseline, and the oracle single best transfer model."}, {"id": 174, "string": "We show that light supervision improves performance further, and that our second approach, RaRe, based on ranking transfer models and then retraining on the target language, results in further and more consistent performance improvements."}, {"id": 175, "string": "A Appendices A.1 Hyperparameters We tuned the batch size and the learning rate using development sets in four languages, 14 and then fixed these hyperparameters for all other languages in each model."}, {"id": 176, "string": "The batch size was 1 sentence in low-resource scenarios (in baseline LSup and fine-tuning of RaRe), and to 100 sentences, in high-resource settings (HSup and the pretraining phase of RaRe)."}, {"id": 177, "string": "The learning rate was set to 0.001 and 0.01 for the high-resource and low-resource baseline models, respectively, and to 0.005, 0.0005 for the pretraining and fine-tuning phase of RaRe based on development results for the four languages."}, {"id": 178, "string": "For CoNLL datasets, we had to decrease the batch size of the pre-training phase from 100 to 20 (because of GPU memory issues)."}, {"id": 179, "string": "A.2 Cross-lingual Word Embeddings We experimented with Wiki and CommonCrawl monolingual embeddings from fastText (Bojanowski et al., 2017) ."}, {"id": 180, "string": "Each of the 41 languages is mapped to English embedding space using three methods from MUSE: 1) supervised with bilingual dictionaries; 2) seeding using identical character sequences; and 3) unsupervised training using adversarial learning (Lample et al., 2018) ."}, {"id": 181, "string": "The crosslingual mappings are evaluated by precision at k = 1."}, {"id": 182, "string": "The resulting cross-lingual embeddings are then used in NER direct transfer in a leave-one-out setting for the 41 languages (41×40 transfers), and we report the mean F 1 in Table 3 ."}, {"id": 183, "string": "CommonCrawl doesn't perform well in bilingual induction despite having larger text corpora, and underperforms in direct transfer NER."}, {"id": 184, "string": "It is also evident that using identical character strings instead of a bilingual dictionary as the seed for learning a supervised bilingual mapping barely affects the performance."}, {"id": 185, "string": "This finding also applies to few-shot learning over larger ensembles: running RaRe over 40 source languages achieves an average F 1 of 77.9 when using embeddings trained with a dictionary, versus 76.9 using string identity instead."}, {"id": 186, "string": "For this reason we have used the string identity method in the paper (e.g., Table 4 ), providing greater portability to language pairs without a bilingual dictionary."}, {"id": 187, "string": "Experiments with unsupervised mappings performed substantially worse than supervised methods, and so we didn't explore these further."}, {"id": 188, "string": "14 Afrikaans, Arabic, Bulgarian and Bengali."}, {"id": 189, "string": "A.3 Direct Transfer Results In Figure 5 the performance of an NER model trained in a high-resource setting on a source language applied on the other 40 target languages (leave-one-out) is shown."}, {"id": 190, "string": "An interesting finding is that symmetry does not always hold (e.g."}, {"id": 191, "string": "id vs. ms or fa vs. ar)."}, {"id": 192, "string": "A.4 Detailed Low-resource Results The result of applying baselines, proposed models and their variations, and unsupervised transfer model of Xie et al."}, {"id": 193, "string": "(2018) are shown in Table 4 ."}, {"id": 194, "string": "ar he id ms tl vi af nl en de da no sv el tr fa bn hi ta ca es fr it pt ro bg mk ru uk bs cs hr pl sk sl sq lt lv et fi hu  17 7 9 3 7 12 6 3 2 36 10 5 28 3 6 35 17 14 21 8 13 4 2 15 10 72 63 72 15 2 2 7 2 3 2 12 2 4 3 7 12 13 16 9 9 8 8 9 7 29 14 10 19 10 13 25 17 13 16 14 20 10 9 18 14 52 39 61 10 10 7 11 9 9 9 7 8 10 9 12 17 11 14 9 7 4 5 4 3 27 11 6 21 6 8 33 19 17 25 14 14 7 5 19 16 56 58 60 6 12 4 10 5 5 5 5 5 7 12 9 9 23 62 50 37 47 57 70 58 63 Figure 5 : The direct transfer performance of a source NER model trained in a high-resource setting applied on the other 40 target languages, and evaluated in terms of phrase-level F 1 ."}, {"id": 195, "string": "The languages are roughly sorted by language family."}, {"id": 196, "string": "Slavic languages in Cyrillic script are from bg to uk, and those in Latin script are from bs to sl."}, {"id": 197, "string": "µ ---89.2 62.1 74.3 77.4 76.9 74.8 60.2 50.5 72.8 69.7 64.5 56.7 71.6 σ ---2.8 5.2 7.3 6.4 6.4 9.6 24.1 14.7 11.5 12.6 13.7 25 11.5 Table 4 : The size of training and test sets (development set size equals test set size) in thousand sentences, and the precision at 1 for Bilingual dictionaries induced from mapping languages to the English embedding space (using identical characters) is shown (BiDic.P@1)."}, {"id": 198, "string": "F 1 scores on the test set, comparing baseline supervised models (HSup, LSup), multilingual transfer from top k source languages (RaRe, 5 runs, k = 1, 10, 40), an unsupervised RaRe with uniform expertise and no fine-tuning (RaRe uns ), and aggregation methods: majority voting (MV tok ), BEA tok uns and BEA ent uns (Bayesian aggregation in token-and entity-level), and the oracle single best annotation (Oracle)."}, {"id": 199, "string": "We also compare with BWET (Xie et al., 2018) , an unsupervised transfer model with stateof-the-art on CoNLL NER datasets."}, {"id": 200, "string": "The mean and standard deviation over all 41 languages, µ, σ, are also reported."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Approach", "n": "2", "start": 16, "end": 33}, {"section": "Zero-Shot Transfer", "n": "2.1", "start": 34, "end": 58}, {"section": "Token versus Entity Granularity", "n": "2.1.1", "start": 59, "end": 68}, {"section": "Few-Shot Transfer", "n": "2.2", "start": 69, "end": 94}, {"section": "Data", "n": "3.1", "start": 95, "end": 102}, {"section": "Model Variations", "n": "3.2", "start": 103, "end": 113}, {"section": "Results", "n": "4", "start": 114, "end": 152}, {"section": "Related Work", "n": "5", "start": 153, "end": 168}, {"section": "Conclusion", "n": "6", "start": 169, "end": 200}], "figures": [{"filename": "../figure/image/1095-Figure3-1.png", "caption": "Figure 3: The mean and standard deviation for the F1 score of the proposed unsupervised models (BEAtokuns and BEA ent", "page": 5, "bbox": {"x1": 75.84, "x2": 286.56, "y1": 269.76, "y2": 436.32}}, {"filename": "../figure/image/1095-Figure2-1.png", "caption": "Figure 2: Best source language ( ) compared with en ( ), and majority voting ( ) over all source languages in terms of F1 performance in direct transfer shown for a subset of the 41 target languages (x axis). Worst transfer score, not shown here, is about 0. See §3 for details of models and datasets.", "page": 5, "bbox": {"x1": 85.44, "x2": 521.28, "y1": 66.24, "y2": 203.04}}, {"filename": "../figure/image/1095-Figure1-1.png", "caption": "Figure 1: Plate diagram for the BEA model.", "page": 1, "bbox": {"x1": 338.88, "x2": 495.35999999999996, "y1": 62.879999999999995, "y2": 172.32}}, {"filename": "../figure/image/1095-Figure4-1.png", "caption": "Figure 4: The mean F1 performance of MVent, BEAentsup, BEA ent", "page": 6, "bbox": {"x1": 88.8, "x2": 273.59999999999997, "y1": 62.879999999999995, "y2": 238.07999999999998}}, {"filename": "../figure/image/1095-Table4-1.png", "caption": "Table 4: The size of training and test sets (development set size equals test set size) in thousand sentences, and the precision at 1 for Bilingual dictionaries induced from mapping languages to the English embedding space (using identical characters) is shown (BiDic.P@1). F1 scores on the test set, comparing baseline supervised models (HSup, LSup), multilingual transfer from top k source languages (RaRe, 5 runs, k = 1, 10, 40), an unsupervised RaRe with uniform expertise and no fine-tuning (RaRe uns), and aggregation methods: majority voting (MVtok), BEAtokuns and BEA ent", "page": 13, "bbox": {"x1": 120.96, "x2": 477.12, "y1": 102.24, "y2": 618.24}}, {"filename": "../figure/image/1095-Table1-1.png", "caption": "Table 1: An example sentence with its aggregated labels in both token view and entity view. Aggregation in token view may generate results inconsistent with the BIO scheme.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 62.4, "y2": 155.04}}, {"filename": "../figure/image/1095-Figure5-1.png", "caption": "Figure 5: The direct transfer performance of a source NER model trained in a high-resource setting applied on the other 40 target languages, and evaluated in terms of phrase-level F1. The languages are roughly sorted by language family. Slavic languages in Cyrillic script are from bg to uk, and those in Latin script are from bs to sl.", "page": 12, "bbox": {"x1": 76.8, "x2": 517.4399999999999, "y1": 170.88, "y2": 610.56}}, {"filename": "../figure/image/1095-Table2-1.png", "caption": "Table 2: The performance of RaRe and BEA in terms of phrase-based F1 on CoNLL NER datasets compared with state-of-the-art benchmark methods. Resource requirements are indicated with superscripts, p: parallel corpus, w: Wikipedia, d: dictionary, l: 100 NER annotation, 0: no extra resources.", "page": 7, "bbox": {"x1": 74.88, "x2": 287.03999999999996, "y1": 62.4, "y2": 291.36}}, {"filename": "../figure/image/1095-Table3-1.png", "caption": "Table 3: The effect of the choice of monolingual word embeddings (Common Crawl and Wikipedia), and their cross-lingual mapping on NER direct transfer. Word translation accuracy, and direct transfer NER F1 are averaged over 40 languages.", "page": 11, "bbox": {"x1": 313.92, "x2": 518.4, "y1": 62.4, "y2": 169.92}}]}