{"title": "Introducing a Lexicon of Verbal Polarity Shifters for English", "abstract": "The sentiment polarity of a phrase does not only depend on the polarities of its words, but also on how these are affected by their context. Negation words (e.g. not, no, never) can change the polarity of a phrase. Similarly, verbs and other content words can also act as polarity shifters (e.g. fail, deny, alleviate). While individually more sparse, they are far more numerous. Among verbs alone, there are more than 1200 shifters. However, sentiment analysis systems barely consider polarity shifters other than negation words. A major reason for this is the scarcity of lexicons and corpora that provide information on them. We introduce a lexicon of verbal polarity shifters that covers the entirety of verbs found in WordNet. We provide a fine-grained annotation of individual word senses, as well as information for each verbal shifter on the syntactic scopes that it can affect.", "text": [{"id": 0, "string": "Introduction Polarity shifters are content words that exhibit semantic properties similar to negation."}, {"id": 1, "string": "For example, the negated statement in (1) can also be achieved by the verbal shifter fail instead of the negation not, as shown in (2)."}, {"id": 2, "string": "(1) Peter did not pass the exam."}, {"id": 3, "string": "(2) Peter failed shifter to pass the exam."}, {"id": 4, "string": "As with negation words, polarity shifters change the polarity of a statement."}, {"id": 5, "string": "This can happen to both positive and negative statements."}, {"id": 6, "string": "In (3) the positive polarity of scholarship is shifted by denied, resulting in a negative polarity for the phrase."}, {"id": 7, "string": "Conversely, the overall polarity of (4) is positive despite the negative polarity of pain."}, {"id": 8, "string": "Polarity shifting is also caused by other content word classes, such as nouns (e.g."}, {"id": 9, "string": "downfall) and adjectives (e.g."}, {"id": 10, "string": "devoid)."}, {"id": 11, "string": "However, this work focusses on verbs, due to their importance as minimal semantic units, far-reaching scopes and potential basis for nominal shifter lexicons (see §2.2.)."}, {"id": 12, "string": "Knowledge of polarity shifting is important for a variety of tasks, especially sentiment analysis (Wiegand et al., 2010; Liu, 2012; Wilson et al., 2005) , as well as relation extraction (Sanchez-Graillet and Poesio, 2007) and textual entailment recognition (Harabagiu et al., 2006) ."}, {"id": 13, "string": "The majority of research into polarity shifting for sentiment analysis has focussed on negation words (Wiegand et al., 2010; Schouten and Frasincar, 2016; Pak and Paroubek, 2010) ."}, {"id": 14, "string": "Negation words (e.g."}, {"id": 15, "string": "not, no, never) are mostly function words, of which only a small number exists, so exhaustive coverage is comparatively simple."}, {"id": 16, "string": "Content word classes, such as verbs, are considerably more difficult to cover comprehensively due to their sheer number."}, {"id": 17, "string": "For example, WordNet (Miller et al., 1990) contains over 10k verbal lemmas."}, {"id": 18, "string": "Most verbs are also far less frequent than common negation words, making individual verbal shifters seem less important."}, {"id": 19, "string": "However, overall, verbal shifter lemmas occur 2.6 times as often as negation words (see §4.)."}, {"id": 20, "string": "Most existing resources on negation and polarity shifting cover few to no instances of verbal shifters (see §2.3.)."}, {"id": 21, "string": "To remedy this, we introduce a complete lexicon of verbal shifters with annotations of polarity shifters and their shifting scope for each word sense."}, {"id": 22, "string": "Our contributions are as follows: (i) A complete lexicon of verbal polarity shifters, covering all verbs found in WordNet 3.1."}, {"id": 23, "string": "(ii) A fine grained annotation, labelling every sense of a verb separately."}, {"id": 24, "string": "(iii) Annotations for shifter scope, indicating which parts of a sentence are affected by the shifting."}, {"id": 25, "string": "The entire dataset is publicly available."}, {"id": 26, "string": "1 Background In this section we will provide a formal definition of polarity shifters ( §2.1."}, {"id": 27, "string": "), motivate our focus on verbal shifters ( §2.2.)"}, {"id": 28, "string": "and discuss related work ( §2.3.)."}, {"id": 29, "string": "Polarity Shifters The notion of valence or polarity shifting was brought to broad awareness in the research community by the work of Polanyi and Zaenen (2006) ."}, {"id": 30, "string": "Those authors drew attention to the fact that the basic valence of individual lexical items may be shifted in context due to (a) the presence of certain other lexical items, (b) the genre type and discourse structure of the text and (c) cultural factors."}, {"id": 31, "string": "In subsequent research, the term shifter has since mostly been applied to the case of lexical items that influence polarity."}, {"id": 32, "string": "Further, the notion of shifting is most prototypically used for situations where a discrete polarity switch occurs between the classes positive, negative and neutral."}, {"id": 33, "string": "However, for other authors, including Polanyi and Zaenen (2006) , intensification (e.g."}, {"id": 34, "string": "very disappointing) and downtoning (e.g."}, {"id": 35, "string": "somewhat disappointing) of polar intensity also falls within the scope of shifting."}, {"id": 36, "string": "We partially follow this view in that we consider downtoning to be shifting, as it moves the polarity of a word in the opposite direction, i.e."}, {"id": 37, "string": "making a positive expression less positive (e.g."}, {"id": 38, "string": "hardly satisfying) and a negative one less negative (e.g."}, {"id": 39, "string": "slightly problematic)."}, {"id": 40, "string": "We do not consider intensifiers as shifters, as they support the already existing polarity."}, {"id": 41, "string": "In most research, shifters are commonly illustrated and enumerated rather than formally defined."}, {"id": 42, "string": "Polanyi and Zaenen (2006) for instance list negation words, intensifiers, modals and presuppositional items as lexical contextual polarity shifters."}, {"id": 43, "string": "Setting aside downtoners for now, the common denominator of shifting is negation."}, {"id": 44, "string": "Negation marks contexts in which a situation that the speaker expected fails to occur or hold."}, {"id": 45, "string": "When this situation is part of a binary opposition (dead -alive), one can firmly conclude that the complementary state of affairs holds (not dead ⇒ alive)."}, {"id": 46, "string": "In cases where the negation affects a scalar notion, which is common in evaluative contexts, the understanding that arises depends on which kinds of scalar inferences and default assumptions are made in the context (Paradis and Willners, 2006) ."}, {"id": 47, "string": "Thus, not good denies the applicability of an evaluation in the region of good or better, but leaves open just how far in the direction of badness the actual interpretation lies: \"It wasn't good\" may be continued with \"but it was ok\" to yield a neutral or mildly positive evaluation or with \"in fact, it was terrible\" to yield a strongly negative one."}, {"id": 48, "string": "2 While downtoners (e.g."}, {"id": 49, "string": "somewhat) applied to scalar predicates such as good do not directly express contradiction, they do give rise to negative entailments and inferences."}, {"id": 50, "string": "Moreover, the structure of scales intrinsically provides shifting."}, {"id": 51, "string": "Thus, while something being good allows it to be even more positive (\"The movie was good."}, {"id": 52, "string": "In fact, it was excellent."}, {"id": 53, "string": "\"), something being somewhat good bounds its positiveness and opens up more negative meanings (\"The performance was somewhat good, but overall rather disappointing\")."}, {"id": 54, "string": "Considering these properties of scales, one can see shifting at work even in the case of downtoning."}, {"id": 55, "string": "Verbal Shifters While the inclusion of shifting and scalar semantics in semantic representations is not limited to lexical items of particular parts-of-speech -we also find shifter adjectives (e.g."}, {"id": 56, "string": "devoid) and adverbs (e.g."}, {"id": 57, "string": "barely) -we limit our work to verbal shifters for several reasons."}, {"id": 58, "string": "As shown by the work of Schneider et al."}, {"id": 59, "string": "(2016) , verbs, together with nouns, are the most important minimal semantic units in text and thus are prime candidates for being tackled first."}, {"id": 60, "string": "Verbs are usually the main syntactic predicates of clauses and sentences and thus verbal shifters can be expected to project far-reaching scopes."}, {"id": 61, "string": "Most nominal shifters (e.g."}, {"id": 62, "string": "failure, loss), on the other hand, have morphologically related verbs (e.g."}, {"id": 63, "string": "fail, lose) and we expect that this connection can be exploited to spread shifter classification from verbs to nouns in the future."}, {"id": 64, "string": "Related to this, the grammar of verbs, for instance with respect to the diversity of scope types, is more complex than that of nouns and so we expect it to be easier to project from verbs to nouns rather than in the opposite direction."}, {"id": 65, "string": "Related Work Existing lexicons and corpora that cover polarity shifting focus almost exclusively on negation words."}, {"id": 66, "string": "The most complex negation lexicon for sentiment analysis (Wilson et al., 2005) includes a mere 12 verbal shifters."}, {"id": 67, "string": "In contrast, our resource covers over 1200 verbal shifter lemmas."}, {"id": 68, "string": "Corpora used as training data for negation processing, such as the Sentiment Treebank (Socher et al., 2013) or the BioScope corpus (Szarvas et al., 2008) , are fairly small datasets, so only the most frequent negation words appear."}, {"id": 69, "string": "The BioScope corpus, for example, contains only 6 verbal shifters (Morante, 2010) ."}, {"id": 70, "string": "Schulder et al."}, {"id": 71, "string": "(2017) show that state-of-the-art systems trained on such data do not reliably detect polarity shifting and should profit from explicit knowledge of verbal shifters."}, {"id": 72, "string": "The only work to date that covers a larger number of verbal shifters is Schulder et al."}, {"id": 73, "string": "(2017) , who annotate a sample of the English verbs found in WordNet for whether they exhibit polarity shifting."}, {"id": 74, "string": "They start by manually annotating an initial 2000 verbs."}, {"id": 75, "string": "These verbs are used to train an SVM classifier using linguistic features and common language resources."}, {"id": 76, "string": "The classifier is then run on the remaining WordNet verbs to bootstrap a list of additional likely shifters."}, {"id": 77, "string": "This list is then checked by a human annotator to detect false positives."}, {"id": 78, "string": "Combining the initial annotation and the result of the bootstrapping process, they create a list of 3043 verbs."}, {"id": 79, "string": "While the lexicon by Schulder et al."}, {"id": 80, "string": "(2017) is an important step towards full coverage of verbal polarity shifters, there are several aspects that we seek to improve upon."}, {"id": 81, "string": "First of all, their lexicon covers less than a third of the verbs found in WordNet, likely missing a number of verbal shifters."}, {"id": 82, "string": "Schulder et al."}, {"id": 83, "string": "(2017) argue that their bootstrap process should cover the majority of shifters, however, this would mean that only 9% of all verbs are shifters."}, {"id": 84, "string": "3 Their initial annotation of 2000 randomly selected verbs puts the shifter ratio at 15% instead."}, {"id": 85, "string": "Another issue with their lexicon is that it only labels lemma forms, but does not differentiate between word senses."}, {"id": 86, "string": "Many verbs do not actually exhibit shifting in all of their senses, so this information will be important for contextual classification."}, {"id": 87, "string": "Lastly, they forgo the question of shifter scope, i.e."}, {"id": 88, "string": "which argument of a verb can be affected by its polarity shift."}, {"id": 89, "string": "Data We treat this annotation effort as a binary labelling task where a word can either cause polarites to shift or not."}, {"id": 90, "string": "However, instead of assigning a single label to an entire verb lemma, as Schulder et al."}, {"id": 91, "string": "(2017) did, we label individual word senses."}, {"id": 92, "string": "We outline the rationale for this in §3.1."}, {"id": 93, "string": "In addition we explicitly specify the syntactic scope of the shifting."}, {"id": 94, "string": "This is motivated and explained in §3.2."}, {"id": 95, "string": "§3.3."}, {"id": 96, "string": "describes the annotation process."}, {"id": 97, "string": "§3.4."}, {"id": 98, "string": "describes the data format of our main lexicon."}, {"id": 99, "string": "Based on this main lexicon we also derive two auxiliary lexicons in §3.5., providing complete labelled lists of all WordNet verb lemmas and all WordNet verb synsets respectively."}, {"id": 100, "string": "Word Senses Many words that shift polarities only do so for some of their word senses."}, {"id": 101, "string": "For example, mark down acts as a shifter in (5) , where it has the sense of \"reducing the value of something\", but the sense of \"writing something down to have a record of it\" in (6) causes no shifting."}, {"id": 102, "string": "In our work we found that among shifter lemmas with multiple word senses, only 23% caused shifting in each of their senses."}, {"id": 103, "string": "An annotation on the basis of individual word senses is therefore required."}, {"id": 104, "string": "To differentiate the senses of a verb, we use its synset affiliations found in WordNet."}, {"id": 105, "string": "Words within the same synset share a shifter label."}, {"id": 106, "string": "Shifter scope, on the other hand, can differ among words of the same synset (see §3.2.)."}, {"id": 107, "string": "The annotation introduced in §3.3."}, {"id": 108, "string": "is therefore applied to individual lemma-sense pairs to capture the best of both worlds."}, {"id": 109, "string": "Shifter Scope A verbal shifter usually only affects the parts of a sentence that are syntactically governed by the verb through its valency."}, {"id": 110, "string": "However, not every argument of a verbal shifter is subject to polarity shifting."}, {"id": 111, "string": "Which argument is affected by polarity shifting depends on the verb in question."}, {"id": 112, "string": "In (7) , surrender shifts only the polarity of its subject, but does not affect the object."}, {"id": 113, "string": "Conversely, defeat only shifts its object in (8)."}, {"id": 114, "string": "The polarity of the subject of defeat does not play a role in this, as can be seen in (9)."}, {"id": 115, "string": "The given scopes assume that verb phrases are in their active form."}, {"id": 116, "string": "In passive phrases, subject and object roles are inverted."}, {"id": 117, "string": "To avoid this issue, sentence structure normalization should be performed before computing shifter scope."}, {"id": 118, "string": "Synsets in WordNet only capture the semantic similarity of words, but almost no syntactic properties (Ruppenhofer and Brandes, 2015) ."}, {"id": 119, "string": "The shifter scope of a verb depends on its syntactic arguments, which can differ between verbs of the same synset."}, {"id": 120, "string": "For example, discard and dispose share the sense \"throw or cast away\", but while discard shifts its direct object (10), dispose requires a prepositional object (11)."}, {"id": 121, "string": "For this reason we annotate lemma-synset pairs individually, instead of assigning scope labels to an entire synset."}, {"id": 122, "string": "We also consider cases where a verbal shifter has more than one potential scope for the same lemma-sense pair."}, {"id": 123, "string": "For example, infringe can shift its direct object or various prepositional objects, as seen in (12) -(14) ."}, {"id": 124, "string": "Therefore, infringe receives the scope labels dobj, pobj on and pobj upon."}, {"id": 125, "string": "A verbal shifter will only ever shift the polarity of one of its scopes."}, {"id": 126, "string": "Which scope is affected by the shifting depends on the given sentence."}, {"id": 127, "string": "Annotation The entire dataset was labelled by an expert annotator with experience in linguistics and annotation work."}, {"id": 128, "string": "To measure inter-annotator agreement, a second annotator re-annotated 400 word senses for their shifter label."}, {"id": 129, "string": "They achieved an agreement of κ = 0.73, indicating substantial agreement (Landis and Koch, 1977) ."}, {"id": 130, "string": "The annotation progressed as follows: Given a complete list of WordNet verb lemmas, the annotator would inspect one lemma at a time."}, {"id": 131, "string": "For this lemma, all senses were looked up."}, {"id": 132, "string": "For each such lemma-sense pair, the annotator decided whether it is a shifter or not."}, {"id": 133, "string": "Decisions were based on the sense definition of the synset and whether sentences using  this sense of the lemma cause shifting."}, {"id": 134, "string": "If a word sense was labelled as a shifter, it was subsequently also annotated for its potential shifter scopes."}, {"id": 135, "string": "In cases where label conflicts between different lemmasense pairs of the same sense were encountered, these labels were reconsidered."}, {"id": 136, "string": "This introduced an additional robustness to the annotation as it let the annotator revisit challenging cases from a new perspective."}, {"id": 137, "string": "The resulting list of lemma-sense pairs provides more finegrained information than either an annotation for only word lemmas or only synsets could (see §3.1."}, {"id": 138, "string": "and §3.2.)."}, {"id": 139, "string": "Main Lexicon File Format We provide our main lexicon as a comma-separated value (csv) file in which each line represents a specific lemmasense-scope triple of a verbal shifter."}, {"id": 140, "string": "Each line follows the format \"LEMMA,SYNSET,SCOPE\"."}, {"id": 141, "string": "The fields are defined as follows: LEMMA: The lemma form of the verb."}, {"id": 142, "string": "SYNSET: The numeric identifier of the synset, commonly referred to as offset or database location."}, {"id": 143, "string": "It consists of 8 digits, including leading zeroes (e.g."}, {"id": 144, "string": "00334568)."}, {"id": 145, "string": "SCOPE: The scope of the shifting."}, {"id": 146, "string": "Given as subj for subject position, dobj for direct object position and comp for clausal complements."}, {"id": 147, "string": "Prepositional object positions are given as pobj * , where * is replaced by the preposition in question, e.g."}, {"id": 148, "string": "pobj from for objects with the preposition \"from\" or prep of for the preposition \"of\"."}, {"id": 149, "string": "When a lemma has multiple word senses, a separate entry is provided for each lemma-sense pair."}, {"id": 150, "string": "When a lemma-sense pair has multiple potential shifting scopes, a separate entry is provided for each scope."}, {"id": 151, "string": "Any combinations not provided are considered not to exhibit shifting."}, {"id": 152, "string": "Take, for example, the set of entries for \"blow out\": (15) blow out,00436247,subj blow out,02767855,dobj It tells us that blow out in the sense 00436247 (\"melt, break, or become otherwise unusable\") is a shifter that affects its subject."}, {"id": 153, "string": "The sense 02767855 (\"put out, as of fires, flames, or lights\") also exhibits shifting, but this time affects the direct object."}, {"id": 154, "string": "It is, however, not a shifter for sense 02766970 (\"erupt in an uncontrolled manner\")."}, {"id": 155, "string": "For an example of multiple scopes for the same word sense, consider cramp:  Its sense 00237139 (\"prevent the progress or free movement of\") can shift the polarity of either its direct object (e.g."}, {"id": 156, "string": "\"it cramped his progress\") or that of a prepositional object with the preposition \"in\" (e.g."}, {"id": 157, "string": "\"he was cramped in his progress\")."}, {"id": 158, "string": "The three other senses of cramp given by WordNet are not considered shifters."}, {"id": 159, "string": "Auxiliary Lexicons Our main lexicon is labelled at the lemma-sense pair level to provide the most fine-grained level of information possible."}, {"id": 160, "string": "It can, however, easily applied to more coarse-grained applications."}, {"id": 161, "string": "As a convenience, we provide lemma-and synset-level auxiliary lexicons that list all WordNet lemmas and all WordNet synsets, respectively, accompanied with their shifter label."}, {"id": 162, "string": "A lemma is labelled as a shifter if at least one of its senses is considered a shifter in our main lexicon."}, {"id": 163, "string": "Similarly, synsets are labelled as shifters if at least one of its lemma-realizations is a shifter."}, {"id": 164, "string": "Statistics In Table 1 we present the ratio of shifters among the verbs contained in WordNet."}, {"id": 165, "string": "While only about 10% of verbs are shifters, this still results in 1220 lemmas and 924 synsets, more than covered in any other resource (see §2.3.)."}, {"id": 166, "string": "49% of verbs in WordNet are polysemous, i.e."}, {"id": 167, "string": "they have multiple meanings."}, {"id": 168, "string": "Among verbal shifters, this ratio is considerably higher, reaching 73%."}, {"id": 169, "string": "Of these, only 23% are shifters in all of their word senses."}, {"id": 170, "string": "To get an idea of how common verbal shifters are in actual use, we computed lemma frequencies over the Amazon Product Review Data corpus (Jindal and Liu, 2008) , which comprises over 5.8 million reviews."}, {"id": 171, "string": "We found this corpus suitable due to its size, sentiment-related content and use in related tasks (Schulder et al., 2017) ."}, {"id": 172, "string": "We observe 1163 different verbal shifter lemmas with an overall total of 34 million occurrences."}, {"id": 173, "string": "Correcting for nonshifter senses of shifter lemmas 4 , we still estimate 13 million occurrences, accounting for 5% of all verb occurrences in the corpus."}, {"id": 174, "string": "To compare, the 15 negation words found in the valence shifter lexicon by Wilson et al."}, {"id": 175, "string": "(2005) occur 13 million times as well."}, {"id": 176, "string": "While the frequency of individual negation (function) words is unsurprisingly higher, the total number of verbal shifter occurrences highlights that verbal shifters are just as frequent and should not be ignored."}, {"id": 177, "string": "Statistics on the distribution of shifter scopes can be found in Table 2 ."}, {"id": 178, "string": "74% of verbal shifters have a direct object scope and 10% a prepositional object scope."}, {"id": 179, "string": "Among these, \"from\" is the most common preposition at 51%, followed by \"of\" with 22%."}, {"id": 180, "string": "19% shift the polarity of their subject and only 1.5% shift that of a clausal complement."}, {"id": 181, "string": "This distribution shows that shifting cannot be trivially assumed to always affect the direct object and that explicit knowledge of shifter scopes will be useful for judging the polarity of a phrase."}, {"id": 182, "string": "Conclusion We introduced a lexicon of verbal polarity shifters that covers the entire verb vocabulary of WordNet."}, {"id": 183, "string": "Our annotation labels each individual word sense of a verb, providing more fine-grained information than annotations on the lemmalevel would."}, {"id": 184, "string": "In addition, we also label the syntactic scopes of each verbal shifter that can be affected by the shifting."}, {"id": 185, "string": "This is a clear improvement over the list of verbal shifters provided by Schulder et al."}, {"id": 186, "string": "(2017) , which only provides labels at the lemma-level rather than for individual word senses and gives no information regarding shifting scope."}, {"id": 187, "string": "It also only has human expert annotation for 30% of the verb vocabulary of WordNet, as opposed to our full coverage."}, {"id": 188, "string": "We hope this resource will help improve fine-grained sentiment analysis systems by providing explicit information on where polarities may shift in a sentence."}, {"id": 189, "string": "We also hope our work will encourage the creation of similar polarity shifter lexicons for nouns and adjectives."}, {"id": 190, "string": "As they are more numerous than verbs (WordNet contains 20k adjectival and 110k nominal lemmas), creating such resources will come with its own challenges, especially in the case of nouns."}], "headers": [{"section": "Introduction", "n": "1.", "start": 0, "end": 25}, {"section": "Background", "n": "2.", "start": 26, "end": 28}, {"section": "Polarity Shifters", "n": "2.1.", "start": 29, "end": 54}, {"section": "Verbal Shifters", "n": "2.2.", "start": 55, "end": 64}, {"section": "Related Work", "n": "2.3.", "start": 65, "end": 88}, {"section": "Data", "n": "3.", "start": 89, "end": 99}, {"section": "Word Senses", "n": "3.1.", "start": 100, "end": 108}, {"section": "Shifter Scope", "n": "3.2.", "start": 109, "end": 126}, {"section": "Annotation", "n": "3.3.", "start": 127, "end": 138}, {"section": "Main Lexicon File Format", "n": "3.4.", "start": 139, "end": 158}, {"section": "Auxiliary Lexicons", "n": "3.5.", "start": 159, "end": 163}, {"section": "Statistics", "n": "4.", "start": 164, "end": 181}, {"section": "Conclusion", "n": "5.", "start": 182, "end": 190}], "figures": [{"filename": "../figure/image/1137-Table2-1.png", "caption": "Table 2: Distribution of shifting scopes for individual word senses. Total is higher than number of lemma-synset pairs (Table 1) as 4% of shifters have multiple potential scopes.", "page": 3, "bbox": {"x1": 305.76, "x2": 538.0799999999999, "y1": 68.64, "y2": 95.03999999999999}}, {"filename": "../figure/image/1137-Table1-1.png", "caption": "Table 1: The ratio of verbal shifters in WordNet. Lemmas are counted as shifters when at least one sense is a shifter. “LS Pairs” represents lemma-synset pairs.", "page": 3, "bbox": {"x1": 56.64, "x2": 283.2, "y1": 68.64, "y2": 131.04}}]}