{"title": "Do Neural Network Cross-Modal Mappings Really Bridge Modalities?", "abstract": "Feed-forward networks are widely used in cross-modal applications to bridge modalities by mapping distributed vectors of one modality to the other, or to a shared space. The predicted vectors are then used to perform e.g., retrieval or labeling. Thus, the success of the whole system relies on the ability of the mapping to make the neighborhood structure (i.e., the pairwise similarities) of the predicted vectors akin to that of the target vectors. However, whether this is achieved has not been investigated yet. Here, we propose a new similarity measure and two ad hoc experiments to shed light on this issue. In three cross-modal benchmarks we learn a large number of language-to-vision and visionto-language neural network mappings (up to five layers) using a rich diversity of image and text features and loss functions. Our results reveal that, surprisingly, the neighborhood structure of the predicted vectors consistently resembles more that of the input vectors than that of the target vectors. In a second experiment, we further show that untrained nets do not significantly disrupt the neighborhood (i.e., semantic) structure of the input vectors.", "text": [{"id": 0, "string": "Introduction Neural network mappings are widely used to bridge modalities or spaces in cross-modal retrieval (Qiao et al., 2017; Wang et al., 2016; Zhang et al., 2016) , zero-shot learning (Lazaridou et al., 2015b (Lazaridou et al., , 2014 Socher et al., 2013) in building multimodal representations (Collell et al., 2017) or in word translation (Lazaridou et al., 2015a) , to name a few."}, {"id": 1, "string": "Typically, a neural network is firstly trained to predict the distributed vectors of one modality (or space) from the other."}, {"id": 2, "string": "At test time, some operation such as retrieval or labeling is performed based on the nearest neighbors of the predicted (mapped) vectors."}, {"id": 3, "string": "For instance, in zero-shot image classification, image features are mapped to the text space and the label of the nearest neighbor word is assigned."}, {"id": 4, "string": "Thus, the success of such systems relies entirely on the ability of the map to make the predicted vectors similar to the target vectors in terms of semantic or neighborhood structure."}, {"id": 5, "string": "1 However, whether neural nets achieve this goal in general has not been investigated yet."}, {"id": 6, "string": "In fact, recent work evidences that considerable information about the input modality propagates into the predicted modality (Collell et al., 2017; Lazaridou et al., 2015b; Frome et al., 2013) ."}, {"id": 7, "string": "To shed light on these questions, we first introduce the (to the best of our knowledge) first existing measure to quantify similarity between the neighborhood structures of two sets of vectors."}, {"id": 8, "string": "Second, we perform extensive experiments in three benchmarks where we learn image-to-text and text-to-image neural net mappings using a rich variety of state-of-the-art text and image features and loss functions."}, {"id": 9, "string": "Our results reveal that, contrary to expectation, the semantic structure of the mapped vectors consistently resembles more that of the input vectors than that of the target vectors of interest."}, {"id": 10, "string": "In a second experiment, by using six concept similarity tasks we show that the semantic structure of the input vectors is preserved after mapping them with an untrained network, further evidencing that feed-forward nets naturally preserve semantic information about the input."}, {"id": 11, "string": "Overall, we uncover and rise awareness of a largely ignored phenomenon relevant to a wide range of cross-modal / cross-space applications such as retrieval, zero-shot learning or image annotation."}, {"id": 12, "string": "Ultimately, this paper aims at: (1) Encouraging the development of better architectures to bridge modalities / spaces; (2) Advocating for the use of semantic-based criteria to evaluate the quality of predicted vectors such as the neighborhood-based measure proposed here, instead of purely geometric measures such as mean squared error (MSE)."}, {"id": 13, "string": "Related Work and Motivation Neural network and linear mappings are popular tools to bridge modalities in cross-modal retrieval systems."}, {"id": 14, "string": "Lazaridou et al."}, {"id": 15, "string": "(2015b) leverage a text-to-image linear mapping to retrieve images given text queries."}, {"id": 16, "string": "Weston et al."}, {"id": 17, "string": "(2011) map label and image features into a shared space with a linear mapping to perform image annotation."}, {"id": 18, "string": "Alternatively, Frome et al."}, {"id": 19, "string": "(2013) , Lazaridou et al."}, {"id": 20, "string": "(2014) and Socher et al."}, {"id": 21, "string": "(2013) perform zero-shot image classification with an image-to-text neural network mapping."}, {"id": 22, "string": "Instead of mapping to latent features, Collell et al."}, {"id": 23, "string": "(2018) use a 2-layer feedforward network to map word embeddings directly to image pixels in order to visualize spatial arrangements of objects."}, {"id": 24, "string": "Neural networks are also popular in other cross-space applications such as cross-lingual tasks."}, {"id": 25, "string": "Lazaridou et al."}, {"id": 26, "string": "(2015a) learn a linear map from language A to language B and then translate new words by returning the nearest neighbor of the mapped vector in the B space."}, {"id": 27, "string": "In the context of zero-shot learning, shortcomings of cross-space neural mappings have also been identified."}, {"id": 28, "string": "For instance, \"hubness\" (Radovanović et al., 2010) and \"pollu-tion\" (Lazaridou et al., 2015a) relate to the highdimensionality of the feature spaces and to overfitting respectively."}, {"id": 29, "string": "Crucially, we do not assume that our cross-modal problem has any class labels, and we study the similarity between input and mapped vectors and between output and mapped vectors."}, {"id": 30, "string": "Recent work evidences that the predicted vectors of cross-modal neural net mappings are still largely informative about the input vectors."}, {"id": 31, "string": "Lazaridou et al."}, {"id": 32, "string": "(2015b) qualitatively observe that abstract textual concepts are grounded with the visual input modality."}, {"id": 33, "string": "Counterintuitively, Collell et al."}, {"id": 34, "string": "(2017) find that the vectors \"imagined\" from a language-to-vision neural map, outperform the original visual vectors in concept similarity tasks."}, {"id": 35, "string": "The paper argued that the reconstructed visual vectors become grounded with language because the map preserves topological properties of the input."}, {"id": 36, "string": "Here, we go one step further and show that the mapped vectors often resemble the input vectors more than the target vectors in semantic terms, which goes against the goal of a cross-modal map."}, {"id": 37, "string": "Well-known theoretical work shows that networks with as few as one hidden layer are able to approximate any function (Hornik et al., 1989) ."}, {"id": 38, "string": "However, this result does not reveal much neither about test performance nor about the semantic structure of the mapped vectors."}, {"id": 39, "string": "Instead, the phenomenon described is more closely tied to other properties of neural networks."}, {"id": 40, "string": "In particular, continuity guarantees that topological properties of the input, such as connectedness, are preserved (Armstrong, 2013)."}, {"id": 41, "string": "Furthermore, continuity in a topology induced by a metric also ensures that points that are close together are mapped close together."}, {"id": 42, "string": "As a toy example, Fig."}, {"id": 43, "string": "1 illustrates the distortion of a manifold after being mapped by a neural net."}, {"id": 44, "string": "2 In a noiseless world with fully statistically dependent modalities, the vectors of one modality could be perfectly predicted from those of the other."}, {"id": 45, "string": "However, in real-world problems this is unrealistic given the noise of the features and the fact that modalities encode complementary information (Collell and Moens, 2016) ."}, {"id": 46, "string": "Such unpredictability combined with continuity and topology-preserving properties of neural nets propel the phenomenon identified, namely mapped vectors resembling more the input than the target vectors, in nearest neighbors terms."}, {"id": 47, "string": "Proposed Approach To bridge modalities X and Y, we consider two popular cross-modal mappings f : X → Y."}, {"id": 48, "string": "(i) Linear mapping (lin): f (x) = W 0 x + b 0 with W 0 ∈ R dy×dx , b 0 ∈ R dy , where d x and d y are the input and output dimensions respectively."}, {"id": 49, "string": "(ii) Feed-forward neural network (nn): f (x) = W 1 σ(W 0 x + b 0 ) + b 1 with W 1 ∈ R dy×d h , W 0 ∈ R d h ×dx , b 0 ∈ R d h , b 1 ∈ R dy where d h is the number of hidden units and σ() the non-linearity (e.g., tanh or sigmoid)."}, {"id": 50, "string": "Although single hidden layer networks are already universal approximators (Hornik et al., 1989) , we explored whether deeper nets with 3 and 5 hidden layers could improve the fit (see Supplement)."}, {"id": 51, "string": "Loss: Our primary choice is the MSE: 1 2 f (x) − y 2 , where y is the target vector."}, {"id": 52, "string": "We also tested other losses such as the cosine: 1 − cos(f (x), y) and the max-margin: max{0, γ + f (x) − y − f (x) − y }, wherẽ x belongs to a different class than (x, y), and γ is the margin."}, {"id": 53, "string": "As in Lazaridou et al."}, {"id": 54, "string": "(2015a) and Weston et al."}, {"id": 55, "string": "(2011) , we choose the firstx that violates the constraint."}, {"id": 56, "string": "Notice that losses that do not require class labels such as MSE are suitable for a wider, more general set of tasks than discriminative losses (e.g., cross-entropy)."}, {"id": 57, "string": "In fact, cross-modal retrieval tasks often do not exhibit any class labels."}, {"id": 58, "string": "Additionally, our research question concerns the cross-space mapping problem in isolation (independently of class labels)."}, {"id": 59, "string": "Let us denote a set of N input and output vectors by X ∈ R N ×dx and Y ∈ R N ×dy respectively."}, {"id": 60, "string": "Each input vector x i is paired to the output vector y i of the same index (i = 1, · · · , N )."}, {"id": 61, "string": "Let us henceforth denote the mapped input vectors by f (X) ∈ R N ×dy ."}, {"id": 62, "string": "In order to explore the similarity between f (X) and X, and between f (X) and Y , we propose two ad hoc settings below."}, {"id": 63, "string": "Neighborhood Structure of Mapped Vectors (Experiment 1) To measure the similarity between the neighborhood structure of two sets of paired vectors V and Z, we propose the mean nearest neighbor overlap measure (mNNO K (V, Z))."}, {"id": 64, "string": "We define the nearest neighbor overlap NNO K (v i , z i ) as the number of K nearest neighbors that two paired vectors v i , z i share in their respective spaces."}, {"id": 65, "string": "E.g., if the 3 (= K) nearest neighbors of v cat in V are {v dog , v tiger , v lion } and those of z cat in Z are {z mouse , z tiger , z lion }, the NNO 3 (v cat , z cat ) is 2."}, {"id": 66, "string": "Definition 1 Let V = {v i } N i=1 and Z = {z i } N i=1 be two sets of N paired vectors."}, {"id": 67, "string": "We define: mNNO K (V, Z) = 1 KN N i=1 NNO K (v i , z i ) (1) with NNO K (v i , z i ) = |NN K (v i ) ∩ NN K (z i )|, where NN K (v i ) and NN K (z i ) are the indexes of the K nearest neighbors of v i and z i , respectively."}, {"id": 68, "string": "The normalizing constant K simply scales mNNO K (V, Z) between 0 and 1, making it independent of the choice of K. Thus, a mNNO K (V, Z) = 0.7 means that the vectors in V and Z share, on average, 70% of their nearest neighbors."}, {"id": 69, "string": "Notice that mNNO implicitly performs retrieval for some similarity measure (e.g., Euclidean or cosine), and quantifies how semantically similar two sets of paired vectors are."}, {"id": 70, "string": "Mapping with Untrained Networks (Experiment 2) To complement the setting above (Sect."}, {"id": 71, "string": "3.1), it is instructive to consider the limit case of an untrained network."}, {"id": 72, "string": "Concept similarity tasks provide a suitable setting to study the semantic structure of distributed representations (Pennington et al., 2014) ."}, {"id": 73, "string": "That is, semantically similar concepts should ideally be close together."}, {"id": 74, "string": "In particular, our interest is in comparing X with its projection f (X) through a mapping with random parameters, to understand the extent to which the mapping may disrupt or preserve the semantic structure of X."}, {"id": 75, "string": "4 Experimental Setup 4.1 Experiment 1 Datasets To test the generality of our claims, we select a rich diversity of cross-modal tasks involving texts at three levels: word level (ImageNet), sentence level (IAPR TC-12), and document level (Wiki)."}, {"id": 76, "string": "ImageNet (Russakovsky et al., 2015) ."}, {"id": 77, "string": "Consists of ∼14M images, covering ∼22K WordNet synsets (or meanings)."}, {"id": 78, "string": "Following Collell et al."}, {"id": 79, "string": "(2017) , we take the most relevant word for each synset and keep only synsets with more than 50 images."}, {"id": 80, "string": "This yields 9,251 different words (or instances)."}, {"id": 81, "string": "IAPR TC-12 (Grubinger et al., 2006 Hyperparameters and Implementation See the Supplement (Sect."}, {"id": 82, "string": "1) for details."}, {"id": 83, "string": "Image and Text Features To ensure that results are independent of the choice of image and text features, we use 5 (2 image + 3 text) features of varied dimensionality (64d, 128-d, 300-d, 2,048-d) and two directions, textto-image (T → I) and image-to-text (I → T )."}, {"id": 84, "string": "We make our extracted features publicly available."}, {"id": 85, "string": "3 Text."}, {"id": 86, "string": "In ImageNet we use 300-dimensional GloVe 4 (Pennington et al., 2014) and 300-d word2vec  word embeddings."}, {"id": 87, "string": "In IAPR TC-12 and Wiki, we employ stateof-the-art bidirectional gated recurrent unit (bi-GRU) features (Cho et al., 2014) that we learn with a classification task (see Sect."}, {"id": 88, "string": "2 of Supplement)."}, {"id": 89, "string": "Image."}, {"id": 90, "string": "For ImageNet, we use the publicly available 5 VGG-128 (Chatfield et al., 2014) and ResNet (He et al., 2015) visual features from Collell et al."}, {"id": 91, "string": "(2017) , where we obtained 128dimensional VGG-128 and 2,048-d ResNet features from the last layer (before the softmax) of the forward pass of each image."}, {"id": 92, "string": "The final representation for a word is the average feature vector (centroid) of all available images for this word."}, {"id": 93, "string": "In IAPR TC-12 and Wiki, features for individual images are obtained similarly from the last layer of a ResNet and a VGG-128 model."}, {"id": 94, "string": "Experiment 2 Datasets We include six benchmarks, comprising three types of concept similarity: (i) Semantic similarity: SemSim (Silberer and Lapata, 2014) , Sim-lex999 (Hill et al., 2015) and SimVerb-3500 (Gerz et al., 2016) ; (ii) Relatedness: MEN  and WordSim-353 (Finkelstein et al., 2001) ; (iii) Visual similarity: VisSim (Silberer and Lapata, 2014) which includes the same word pairs as SemSim, rated for visual similarity instead of semantic."}, {"id": 95, "string": "All six test sets contain human ratings of similarity for word pairs, e.g., ('cat','dog')."}, {"id": 96, "string": "Hyperparameters and Implementation The parameters in W 0 , W 1 are drawn from a random uniform distribution [−1, 1] and b 0 , b 1 are set to zero."}, {"id": 97, "string": "We use a tanh activation σ()."}, {"id": 98, "string": "6 The output dimension d y is set to 2,048 for all embeddings."}, {"id": 99, "string": "Image and Text Features Textual and visual features are the same as described in Sect."}, {"id": 100, "string": "4.1.3 for the ImageNet dataset."}, {"id": 101, "string": "Similarity Predictions We compute the prediction of similarity between two vectors z 1 , z 2 with both the cosine z 1 z 2 z 1 z 2 and the Euclidean similarity 1 1+ z 1 −z 2 ."}, {"id": 102, "string": "7 4.2."}, {"id": 103, "string": "Performance Metrics As is common practice, we evaluate the predictions of similarity of the embeddings (Sect."}, {"id": 104, "string": "4.2.4) against the human similarity ratings with the Spearman correlation ρ."}, {"id": 105, "string": "We report the average of 10 sets of randomly generated parameters."}, {"id": 106, "string": "Results and Discussion We test statistical significance with a two-sided Wilcoxon rank sum test adjusted with Bonferroni."}, {"id": 107, "string": "The null hypothesis is that a compared pair is equal."}, {"id": 108, "string": "In Tab."}, {"id": 109, "string": "1, * indicates that mNNO(X, f (X)) differs from mNNO(Y, f (X)) (p < 0.001) on the same mapping, embedding and direction."}, {"id": 110, "string": "In Tab."}, {"id": 111, "string": "2, * indicates that performance of mapped and input vectors differs (p < 0.05) in the 10 runs."}, {"id": 112, "string": "Experiment 1 Results below are with cosine neighbors and K = 10."}, {"id": 113, "string": "Euclidean neighbors yield similar results and are thus left to the Supplement."}, {"id": 114, "string": "Similarly, results in ImageNet with GloVe embeddings are shown below and word2vec results in the Supplement."}, {"id": 115, "string": "The choice of K = {5, 10, 30} had no visible effect on results."}, {"id": 116, "string": "Results with 3-and 5-layer nets did not show big differences with the results below (see Supplement)."}, {"id": 117, "string": "The cosine and max-margin losses performed slightly worse than MSE (see Supplement) ."}, {"id": 118, "string": "Although Lazaridou et al."}, {"id": 119, "string": "(2015a) and Weston et al."}, {"id": 120, "string": "(2011) find that max-margin performs the best in their tasks, we do not find our result entirely surprising given that max-margin focuses on inter-class differences while we look also at intraclass neighbors (in fact, we do not require classes)."}, {"id": 121, "string": "Tab."}, {"id": 122, "string": "1 shows our core finding, namely that the semantic structure of f (X) resembles more that of X than that of Y , for both lin and nn maps."}, {"id": 123, "string": "Table 1 : Test mean nearest neighbor overlap."}, {"id": 124, "string": "Boldface indicates the largest score at each mNNO 10 (X, f (X)) and mNNO 10 (Y, f (X)) pair, which are abbreviated by X, f (X) and Y, f (X)."}, {"id": 125, "string": "Fig."}, {"id": 126, "string": "2 is particularly revealing."}, {"id": 127, "string": "If we would only look at train performance (and allow train MSE to reach 0) then f (X) = Y and clearly train mNNO(f (X), Y ) = 1 while mNNO(f (X), X) can only be smaller than 1."}, {"id": 128, "string": "However, the interest is always on test samples, and (near-)perfect test prediction is unrealistic."}, {"id": 129, "string": "Notice in fact in Fig."}, {"id": 130, "string": "2 that even if we look at train fit, MSE needs to be close to 0 for mNNO(f (X), Y ) to be reasonably large."}, {"id": 131, "string": "In all the combinations from Tab."}, {"id": 132, "string": "1, the test mNNO(f (X), Y ) never surpasses test mNNO(f (X), X) for any number of epochs, even with an oracle (not shown)."}, {"id": 133, "string": "ResNet VGG-128 X, f (X) Y, f (X) X, f (X) Y, f (X) ImageNet I → T lin Experiment 2 Tab."}, {"id": 134, "string": "2 shows that untrained linear (f lin ) and neural net (f nn ) mappings preserve the semantic structure of the input X, complementing thus the findings of Experiment 1."}, {"id": 135, "string": "Experiment 1 concerns learning, while, by \"ablating\" the learning part and randomizing weights, Experiment 2 is revealing about the natural tendency of neural nets to preserve semantic information about the input, regardless of the choice of the target vectors and loss function."}, {"id": 136, "string": "WS-353 Men SemSim Conclusions Overall, we uncovered a phenomenon neglected so far, namely that neural net cross-modal mappings can produce mapped vectors more akin to the input vectors than the target vectors, in terms of semantic structure."}, {"id": 137, "string": "Such finding has been possible thanks to the proposed measure that explicitly quantifies similarity between the neighborhood structure of two sets of vectors."}, {"id": 138, "string": "While other measures such as mean squared error can be misleading, our measure provides a more realistic estimate of the semantic similarity between predicted and target vectors."}, {"id": 139, "string": "In fact, it is the semantic structure (or pairwise similarities) what ultimately matters in cross-modal applications."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 12}, {"section": "Related Work and Motivation", "n": "2", "start": 13, "end": 46}, {"section": "Proposed Approach", "n": "3", "start": 47, "end": 62}, {"section": "Neighborhood Structure of Mapped", "n": "3.1", "start": 63, "end": 69}, {"section": "Mapping with Untrained Networks (Experiment 2)", "n": "3.2", "start": 70, "end": 74}, {"section": "Datasets", "n": "4.1.1", "start": 75, "end": 79}, {"section": "Hyperparameters and Implementation", "n": "4.1.2", "start": 80, "end": 82}, {"section": "Image and Text Features", "n": "4.1.3", "start": 83, "end": 92}, {"section": "Datasets", "n": "4.2.1", "start": 93, "end": 95}, {"section": "Hyperparameters and Implementation", "n": "4.2.2", "start": 96, "end": 97}, {"section": "Image and Text Features", "n": "4.2.3", "start": 98, "end": 99}, {"section": "Similarity Predictions", "n": "4.2.4", "start": 100, "end": 102}, {"section": "Performance Metrics", "n": "5", "start": 103, "end": 105}, {"section": "Results and Discussion", "n": "5", "start": 106, "end": 111}, {"section": "Experiment 1", "n": "5.1", "start": 112, "end": 132}, {"section": "Experiment 2", "n": "5.2", "start": 133, "end": 135}, {"section": "Conclusions", "n": "6", "start": 136, "end": 139}], "figures": [{"filename": "../figure/image/1150-Table2-1.png", "caption": "Table 2: Spearman correlations between human ratings and the similarities (cosine or Euclidean) predicted from the embeddings. Boldface denotes best performance per input embedding type.", "page": 4, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 277.44, "y2": 471.35999999999996}}, {"filename": "../figure/image/1150-Table1-1.png", "caption": "Table 1: Test mean nearest neighbor overlap. Boldface indicates the largest score at each mNNO10(X, f(X)) and mNNO10(Y, f(X)) pair, which are abbreviated by X, f(X) and Y, f(X).", "page": 4, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 384.47999999999996, "y2": 568.3199999999999}}, {"filename": "../figure/image/1150-Figure2-1.png", "caption": "Figure 2: Learning a nn model in Wiki (left), IAPR TC-12 (middle) and ImageNet (right).", "page": 4, "bbox": {"x1": 73.92, "x2": 292.32, "y1": 66.24, "y2": 165.12}}, {"filename": "../figure/image/1150-Figure1-1.png", "caption": "Figure 1: Effect of applying a mapping f to a (disconnected) manifold M with three hypothetical classes ( , N and •).", "page": 1, "bbox": {"x1": 78.72, "x2": 283.2, "y1": 61.44, "y2": 187.68}}]}