{"title": "Disambiguating False-Alarm Hashtag Usages in Tweets for Irony Detection", "abstract": "The reliability of self-labeled data is an important issue when the data are regarded as ground-truth for training and testing learning-based models. This paper addresses the issue of false-alarm hashtags in the self-labeled data for irony detection. We analyze the ambiguity of hashtag usages and propose a novel neural networkbased model, which incorporates linguistic information from different aspects, to disambiguate the usage of three hashtags that are widely used to collect the training data for irony detection. Furthermore, we apply our model to prune the self-labeled training data. Experimental results show that the irony detection model trained on the less but cleaner training instances outperforms the models trained on all data.", "text": [{"id": 0, "string": "Introduction Self-labeled data available on the Internet are popular research materials in many NLP areas."}, {"id": 1, "string": "Metadata such as tags and emoticons given by users are considered as labels for training and testing learning-based models, which usually benefit from large amount of data."}, {"id": 2, "string": "One of the sources of self-labeled data widely used in the research community is Twitter, where the short-text messages tweets written by the crowd are publicly shared."}, {"id": 3, "string": "In a tweet, the author can tag the short text with some hashtags such as #excited, #happy, #UnbornLivesMatter, and #Hillary4President to express their emotion or opinion."}, {"id": 4, "string": "The tweets with a certain types of hashtags are collected as self-label data in a variety of research works including sentiment analysis (Qadir and Riloff, 2014) , stance detection (Mohammad et al., 2016; Sobhani et al., 2017) , fi-nancial opinion mining (Cortis et al., 2017) , and irony detection (Ghosh et al., 2015; Peled and Reichart, 2017; Hee et al., 2018) ."}, {"id": 5, "string": "In the case of irony detection, it is impractical to manually annotate the ironic sentences from randomly sampled data due to the relatively low occurrences of irony (Davidov et al., 2010) ."}, {"id": 6, "string": "Collecting the tweets with the hashtags like #sarcasm, #irony, and #not becomes the mainstream approach to dataset construction (Sulis et al., 2016) ."}, {"id": 7, "string": "As shown in (S1), the tweet with the hashtag #not is treated as a positive (ironic) instance by removing #not from the text."}, {"id": 8, "string": "(S1) @Anonymous doing a great job... #not What do I pay my extortionate council taxes for?"}, {"id": 9, "string": "#Disgrace #Ongo-ingProblem http://t.co/FQZUUwKSoN However, the reliability of the self-labeled data is an important issue."}, {"id": 10, "string": "As pointed out in the pioneering work, not all tweet writers know the definition of irony (Van Hee et al., 2016b) ."}, {"id": 11, "string": "For instance, (S2) is tagged with #irony by the writer, but it is just witty and amusing."}, {"id": 12, "string": "(S2) BestProAdvice @Anonymous More clean OR cleaner, never more cleaner."}, {"id": 13, "string": "#irony When the false-alarm instances like (S2) are collected and mixed in the training and test data, the models that learn from the unreliable data may be misled, and the evaluation is also suspicious."}, {"id": 14, "string": "The other kind of unreliable data comes from the hashtags not only functioning as metadata."}, {"id": 15, "string": "That is, a hashtag in a tweet may also function as a content word in its word form."}, {"id": 16, "string": "For example, the hashtag #irony in (S3) is a part of the sentence \"the irony of taking a break...\", in contrast to the hashtag #not in (S1), which can be removed without a change of meaning."}, {"id": 17, "string": "(S3) The #irony of taking a break from reading about #socialmedia to check my social media."}, {"id": 18, "string": "When the hashtag plays as a content word in a tweet, the tweet is not a good candidate of selflabeled ironic instances because the sentence will be incomplete once the hashtag is removed."}, {"id": 19, "string": "In this work, both kinds of unreliable data, the tweets with a misused hashtag and the tweets in which the hashtag serves as a content word, are our targets to remove from the training data."}, {"id": 20, "string": "Manual data cleaning is labor-intensive and inefficient (Van Hee et al., 2016a) ."}, {"id": 21, "string": "Compared to general training data cleaning approaches (Malik and Bhardwaj, 2011; Esuli and Sebastiani, 2013; Fukumoto and Suzuki, 2004) such as boostingbased learning, this work leverages the characteristics of hashtag usages in tweets."}, {"id": 22, "string": "With small amount of golden labeled data, we propose a neural network classifier for pruning the self-labeled tweets, and train an ironic detector on the less but cleaner instances."}, {"id": 23, "string": "This approach is easily to apply to other NLP tasks that rely on self-labeled data."}, {"id": 24, "string": "The contributions of this work are three-fold: (1) We make an empirically study on an issue that is potentially inherited in a number of research topics based on self-labeled data."}, {"id": 25, "string": "(2) We propose a model for hashtag disambiguation."}, {"id": 26, "string": "For this task, the human-verified ground-truth is quite limited."}, {"id": 27, "string": "To address the issue of sparsity, a novel neural network model for hashtag disambiguation is proposed."}, {"id": 28, "string": "(3) The data pruning method, in which our model is applied to select reliable self-labeled data, is capable of improving the performance of irony detection."}, {"id": 29, "string": "The rest of this paper is organized as follows."}, {"id": 30, "string": "Section 2 describes how we construct a dataset for disambiguating false-alarm hashtag usages based on Tweets."}, {"id": 31, "string": "In Section 3, our model for hashtag disambiguation is proposed."}, {"id": 32, "string": "Experimental results of hashtag disambiguation are shown in Section 4."}, {"id": 33, "string": "In addition, we apply our method to prune training data for irony detection."}, {"id": 34, "string": "The results are shown in Section 5."}, {"id": 35, "string": "Section 6 concludes this paper."}, {"id": 36, "string": "Dataset The tweets with indication hashtags such as #irony are usually collected as a dataset in previous works on irony detection."}, {"id": 37, "string": "As pointed out in Section 1, the hashtags are treated as ground-truth for training and testing."}, {"id": 38, "string": "To investigate the issue of false-alarm  self-labeled tweets, the tweets with human verification are indispensable."}, {"id": 39, "string": "In this study, we build the ground-truth based on the dataset released for SemEval 2018 Task 3, 1 which is targeted for finegrained irony detection (Hee et al., 2018) ."}, {"id": 40, "string": "In the SemEval dataset, the tweets with one of the three indication hashtags #not, #sarcasm, and #irony, are collected and human-annotated as one of four types: verbal irony by means of a polarity contrast, other verbal irony, situational irony, and non-ironic."}, {"id": 41, "string": "In other words, the false-alarm tweets, i.e., the non-ironic tweets with indication hashtags, are distinguished from the real ironic tweets in this dataset."}, {"id": 42, "string": "However, the hashtag itself has been removed in the SemEval dataset."}, {"id": 43, "string": "For example, the original tweet (S1) has been modified to (S4), where the hashtag #not disappears."}, {"id": 44, "string": "As a result, the hashtag information, the position and the word form of the hashtag (i.e., not, irony, or sarcasm), is missing from the SemEval dataset."}, {"id": 45, "string": "(S4) @Anonymous doing a great job... What do I pay my extortionate council taxes for?"}, {"id": 46, "string": "#Disgrace #OngoingProblem http://t.co/FQZUUwKSoN For hashtag disambiguation, the information of the hashtag in each tweet is mandatory."}, {"id": 47, "string": "Thus, we recover the original tweets by using Twitter search."}, {"id": 48, "string": "As shown in Table 1 , a total of 1,359 tweets with hashtags information are adopted as the ground-truth."}, {"id": 49, "string": "Note that more than 20% of selflabeled data are false-alarm, and this can be an issue when they are adopted as training or test data."}, {"id": 50, "string": "For performing the experiment of irony detection in Section 5, we reserve the other 1,072 tweets in the SemEval dataset that are annotated as real ironic as the test data."}, {"id": 51, "string": "In addition to the issue of hashtag disambiguation, the irony tweets without an indication hashtag, which are regarded as non-irony instances in previous work, are another kind of misleading data for irony detection."}, {"id": 52, "string": "Fortunately, the occurrence of such \"false-negative\" instances is insignificant due to the relatively low occurrence of irony (Davidov et al., 2010) ."}, {"id": 53, "string": "Disambiguation of Hashtags Figure 1 shows our model for distinguishing the real ironic tweets from the false-alarm ones."}, {"id": 54, "string": "Given an instance with the hashtag #irony is given, the preceding and the following word sequences of the hashtag are encoded by separate sub-networks, and both embeddings are concatenated with the handcrafted features and the probabilities of three kinds of part-of-speech (POS) tag sequences."}, {"id": 55, "string": "Finally, the sigmoid activation function decides whether the instance is real ironic or false-alarm."}, {"id": 56, "string": "The details of each component will be presented in the rest of this section."}, {"id": 57, "string": "Word Sequences: The word sequences of the context preceding and following the targeting hashtag are separately encoded by neural network sentence encoders."}, {"id": 58, "string": "The Penn Treebank Tokenizer provided by NLTK (Bird et al., 2009 ) is used for tokenization."}, {"id": 59, "string": "As a result, each of the left and the right word sequences is encoded as a embedding with a length of 50."}, {"id": 60, "string": "We experiments with convolution neural network (CNN) (Kim, 2014) , gated recurrent unit (GRU) (Cho et al., 2014) , and attentive-GRU for sentence encoding."}, {"id": 61, "string": "CNN for sentence classification has been shown effective in NLP applications such as sentiment analysis (Kim, 2014) ."}, {"id": 62, "string": "Classifiers based on recurrent neural network (RNN) have also been applied to NLP, especially for sequential modeling."}, {"id": 63, "string": "For irony detection, one of the state-of-the-art models is based on the attentive RNN (Huang et al., 2017) ."}, {"id": 64, "string": "The first layer of the CNN, the GRU, and the attenive-GRU model is the 300-dimensional word embedding that is initialized by using the vectors pre-trained on Google News dataset."}, {"id": 65, "string": "2 Handcrafted Features: We add the handcrafted features of the tweet in the one-hot representation."}, {"id": 66, "string": "The features taken into account are listed as follows."}, {"id": 67, "string": "(1) Lengths of the tweet in words and in characters."}, {"id": 68, "string": "(2) Type of the target hashtag (i.e."}, {"id": 69, "string": "#not, #sarcasm, or #irony)."}, {"id": 70, "string": "(3) Number of all hashtags in the tweet."}, {"id": 71, "string": "(4) Whether the targeting hashtag is the first token in the tweet."}, {"id": 72, "string": "(5) Whether the targeting hashtag is the last token in the tweet."}, {"id": 73, "string": "(6) Whether the targeting hashtag is the first hashtag in the tweet since a tweet may contain more than one hashtag."}, {"id": 74, "string": "(7) Whether the targeting hashtag is the last hashtag in the tweet."}, {"id": 75, "string": "(8) Position of the targeting hashtag in terms of tokens."}, {"id": 76, "string": "If the targeting hashtag is the ith token of the tweet with |w| tokens, and this feature is i |w| ."}, {"id": 77, "string": "(9) Position of the targeting hashtag in all hashtags in the tweet."}, {"id": 78, "string": "It is computed as j |h| where the targeting hashtag is the jth hashtag in the tweet that contains |h| hashtags."}, {"id": 79, "string": "Language Modeling of POS Sequences: As mentioned in Section 1, a kind of false-alarm hashtag usages is the case that the hashtag also functions as a content word."}, {"id": 80, "string": "In this paper, we attempt to measure the grammatical completeness of the tweet with and without the hashtag."}, {"id": 81, "string": "Therefore, language model on the level of POS tagging is used."}, {"id": 82, "string": "As shown in Figure 1 , POS tagging is performed on three versions of the tweet, and based on that three probabilities are measured and taken into account: 1) ph: the tweet with the whole hashtag removed."}, {"id": 83, "string": "2) ps: the tweet with the hash symbol # removed only."}, {"id": 84, "string": "3) p t : the original tweet."}, {"id": 85, "string": "Our idea is that a tweet will be more grammatical complete with only the hash symbol removed if the hashtag is also a content word."}, {"id": 86, "string": "On the other hand, the tweet will be more grammatical complete with the whole hashtag removed since the hashtag is a metadata."}, {"id": 87, "string": "To measure the probability of the POS tag sequence, we integrate a neural network-based language model of POS sequence into our model."}, {"id": 88, "string": "RNN-based language models are reportedly capa-ble of modeling the longer dependencies among the sequential tokens (Mikolov et al., 2011) ."}, {"id": 89, "string": "Two millions of English tweets that are entirely different from those in the training and test data described in Section 2 are collected and tagged with POS tags."}, {"id": 90, "string": "We train a GRU language model on the level of POS tags."}, {"id": 91, "string": "In this work, all the POS tagging is performed with the Stanford CoreNLP toolkit (Manning et al., 2014) ."}, {"id": 92, "string": "Experiments We compare our model with popular neural network-based sentence classifiers including CNN, GRU, and attentive GRU."}, {"id": 93, "string": "We also train a logistic regression (LR) classifier with the handcrafted features introduced in Section 3."}, {"id": 94, "string": "For the imbalance data, we assign class-weights inversely proportional to class frequencies."}, {"id": 95, "string": "Five-fold crossvalidation is performed."}, {"id": 96, "string": "Early-stop is employed with a patience of 5 epoches."}, {"id": 97, "string": "In each fold, we further keep 10% of training data for tuning the model."}, {"id": 98, "string": "The hidden dimension is 50, the batch size is 32, and the Adam optimizer is employed (Kingma and Ba, 2014) ."}, {"id": 99, "string": "Table 2 shows the experimental results reported in Precision (P), Recall (R), and F-score (F)."}, {"id": 100, "string": "Our goal is to select the real ironic tweets for training the irony detection model."}, {"id": 101, "string": "Thus, the real ironic tweets are regarded as positive, and the falsealarm ones are negative."}, {"id": 102, "string": "We apply t-test for significance testing."}, {"id": 103, "string": "The vanilla GRU and attentive GRU are slightly superior to the logistic regression model."}, {"id": 104, "string": "The CNN model performs the worst in this task because it suffers from over-fitting problem."}, {"id": 105, "string": "We explored a number of layouts and hyperparameters for the CNN model, and consistent results are observed."}, {"id": 106, "string": "Our method is evaluated with either CNN, GRU, or attentive GRU for encoding the context preceding and following the targeting hashtag."}, {"id": 107, "string": "By integrating various kinds of information, our method outperforms all baseline models no matter which encoder is used."}, {"id": 108, "string": "The best model is the one integrating the attentive GRU encoder, which is significantly superior to all baseline models (p < 0.05), achieves an F-score of 88.49%, To confirm the effectiveness of the language modeling of POS sequence, we also try to exclude the GRU language model from our best model."}, {"id": 109, "string": "Experimental results show that the addition of language model significantly improves the perfor-  mance (p < 0.05)."}, {"id": 110, "string": "As shown in the last row of Table 2 , the F-score is dropped to 84.17%."}, {"id": 111, "string": "From the data, we observe that the instances whose ps ph usually contain a indication hashtag function as a content word, and vice versa."}, {"id": 112, "string": "For instances, (S5) and (S6) show the instances with the highest and the lowest ps ph , respectively."}, {"id": 113, "string": "(S5) when your #sarcasm is so advanced people actually think you are #stupid .. (S6) #mtvstars justin bieber #net #not #fast 5 Irony Detection We employ our model to prune self-labeled data for irony detection."}, {"id": 114, "string": "As prior work did, we collect a set of tweets that contain indication hashtags as (pseudo) positive instances and also collect a set of tweets that do not contain indication hashtags as negative instances."}, {"id": 115, "string": "For each positive instance, our model is performed to predict whether it is a real ironic tweet or false-alarm ones, and the falsealarm ones are discarded."}, {"id": 116, "string": "After pruning, a set of 14,055 tweets containing indication hashtags have been reduced to 4,617 reliable positive instances according to our model."}, {"id": 117, "string": "We add an equal amount of negative instances randomly selected from the collection of the tweets that do not contain indication hashtags."}, {"id": 118, "string": "As a result, the prior-and the post-pruning training data, in the sizes of 28,110 and 9,234, respectively, are prepared for experiments."}, {"id": 119, "string": "The dataflow of the training data pruning is shown in Figure 2 ."}, {"id": 120, "string": "For evaluating the effectiveness of our pruning method, we implement a state-of-the-art irony detector (Huang et al., 2017) , which is based on attentive-RNN classifier, and train it on the priorand the post-pruned training data."}, {"id": 121, "string": "The test data is made by the procedure as follows."}, {"id": 122, "string": "The positive instances in the test data are taken from the 1,072 human-verified ironic tweets   that are reserved for irony detection as mentioned in Section 2."}, {"id": 123, "string": "The negative instances in the test data are obtained from the tweets that do not contain indication hashtags."}, {"id": 124, "string": "Note that the negative instances in the test data are isolated from those in the training data."}, {"id": 125, "string": "Experimental results confirm the benefit of pruning."}, {"id": 126, "string": "As shown in Table 3 , the irony detection model trained on the less, but cleaner data significantly outperforms the model that is trained on all data (p < 0.05)."}, {"id": 127, "string": "We compare our pruning method with an alternative approach that trains the irony detector on the human-verified data directly."}, {"id": 128, "string": "Under this circumstances, the 1,083 ironic instances for training our hashtag disambiguation model are currently mixed with an equal amount of randomly sampled negative instances, and employed to train the irony detector."}, {"id": 129, "string": "As shown in the last row of Table  3 , the irony detector trained on the small data does not compete with the models that are trained on larger amount of self-labeled data."}, {"id": 130, "string": "In other words, our data pruning strategy forms a semi-supervised learning that benefits from both self-labeled data and human annotation."}, {"id": 131, "string": "Note that this task and the dataset are different from those of the official evaluation of SemEval 2018 Task 3, so the experimental results cannot be directly compared."}, {"id": 132, "string": "The calibrated confidence output by the sigmoid layer of our hashtag disambiguation model can be regarded as a measurement of the reliability of an instance (Niculescu-Mizil and Caruana, 2005; Guo et al., 2017) ."}, {"id": 133, "string": "Thus, we can sort all self-labeled data by their calibrated confidence and control the size of training set by adjusting the threshold."}, {"id": 134, "string": "The higher the threshold value is set, the less the training instances remain."}, {"id": 135, "string": "Figure 3 shows the performances of the irony detector trained on the data filtered with different threshold values."}, {"id": 136, "string": "For each threshold value, the bullet symbol (•) indicates the size of training data, and the bar indicates the F-score achieved by the irony detector trained on those data."}, {"id": 137, "string": "The best result achieved by the irony detector trained on the 9,234 data filtered by our model with the default threshold value (0.5)."}, {"id": 138, "string": "This confirms that our model is able to select useful training instances in a strict manner."}, {"id": 139, "string": "Conclusion Self-labeled data is an accessible and economical resource for a variety of learning-based applications."}, {"id": 140, "string": "However, directly using the labels made by the crowd as ground-truth for training and testing may lead to inaccurate performance due to the reliability issue."}, {"id": 141, "string": "This paper addresses this issue in the case of irony detection by proposing a model to remove two kinds of false-alarm tweets from the training data."}, {"id": 142, "string": "Experimental results confirm that the irony detection model benefits from the less, but cleaner training data."}, {"id": 143, "string": "Our approach can be applied to other topics that rely on self-labeled data."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 35}, {"section": "Dataset", "n": "2", "start": 36, "end": 52}, {"section": "Disambiguation of Hashtags", "n": "3", "start": 53, "end": 91}, {"section": "Experiments", "n": "4", "start": 92, "end": 138}, {"section": "Conclusion", "n": "6", "start": 139, "end": 143}], "figures": [{"filename": "../figure/image/1153-Figure1-1.png", "caption": "Figure 1: Overview of Our Model for Hashtag Disambiguation.", "page": 2, "bbox": {"x1": 72.0, "x2": 285.12, "y1": 61.44, "y2": 284.15999999999997}}, {"filename": "../figure/image/1153-Figure3-1.png", "caption": "Figure 3: Performance of Irony Detection with Different Threshold Values for Data Pruning.", "page": 4, "bbox": {"x1": 312.0, "x2": 520.8, "y1": 63.839999999999996, "y2": 222.23999999999998}}, {"filename": "../figure/image/1153-Table3-1.png", "caption": "Table 3: Performance of Irony Detection.", "page": 4, "bbox": {"x1": 72.0, "x2": 297.12, "y1": 245.76, "y2": 288.96}}, {"filename": "../figure/image/1153-Figure2-1.png", "caption": "Figure 2: Dataflow of the Training Data Pruning for Irony Detection.", "page": 4, "bbox": {"x1": 72.0, "x2": 285.12, "y1": 61.44, "y2": 193.92}}, {"filename": "../figure/image/1153-Table1-1.png", "caption": "Table 1: Statistics of the Ground-Truth Data.", "page": 1, "bbox": {"x1": 330.71999999999997, "x2": 502.08, "y1": 62.879999999999995, "y2": 115.19999999999999}}, {"filename": "../figure/image/1153-Table2-1.png", "caption": "Table 2: Results of Hashtag Disambiguation.", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 527.04, "y1": 62.879999999999995, "y2": 155.04}}]}