{"title": "Forecasting Word Model: Twitter-based Influenza Surveillance and Prediction", "abstract": "Because of the increasing popularity of social media, much information has been shared on the internet, enabling social media users to understand various real world events. Particularly, social media-based infectious disease surveillance has attracted increasing attention. In this work, we specifically examine influenza: a common topic of communication on social media. The fundamental theory of this work is that several words, such as symptom words (fever, headache, etc.), appear in advance of flu epidemic occurrence. Consequently, past word occurrence can contribute to estimation of the number of current patients. To employ such forecasting words, one can first estimate the optimal time lag for each word based on their cross correlation. Then one can build a linear model consisting of word frequencies at different time points for nowcasting and for forecasting influenza epidemics. Experimentally obtained results (using 7.7 million tweets of August 2012 -January 2016), the proposed model achieved the best nowcasting performance to date (correlation ratio 0.93) and practically sufficient forecasting performance (correlation ratio 0.91 in 1-week future prediction, and correlation ratio 0.77 in 3-weeks future prediction). This report reveals the effectiveness of the word time shift to predict of future epidemics using Twitter.", "text": [{"id": 0, "string": "Introduction The increased use of social media platforms has led to wide sharing of personal information."}, {"id": 1, "string": "Especially Twitter, a micro-blogging platform that enables users to communicate by updating their status using 140 or fewer characters, has attracted great attention of researchers and service developers because Twitter can be a valuable personal information resource."}, {"id": 2, "string": "The feasibility of such approaches, known as social sensors, has been demonstrated in various event detection systems such as earthquakes (Sakaki et al., 2010) , outbreaks of disease (Chew and Eysenbach, 2010) , and stock market fluctuations (Bollen et al., 2011) ."}, {"id": 3, "string": "Among the applications mentioned above, this study particularly examines detection of seasonal influenza epidemics because the influenza detection is a popular application of Twitter."}, {"id": 4, "string": "To date, more than 30 Twitter-based influenza detection and prediction systems have been developed worldwide (Charles-Smith et al., 2015) ."}, {"id": 5, "string": "Although the detailed functions of these systems differ, they share the underlying assumption that the flu spreading in the real world is immediately reflected to the tweets."}, {"id": 6, "string": "Therefore, most systems have simply aggregated counts of daily flu-related tweets to obtain the current patient status (Aramaki et al., 2011; Collier et al., 2011; Chew and Eysenbach, 2010; Lampos and Cristianini, 2010; Culotta, 2013; Paul et al., 2014) ."}, {"id": 7, "string": "Their typical materials are presented as shown below."}, {"id": 8, "string": "• I got a flu I can not go to school for the rest of the week • I was diagnosed with a high fever."}, {"id": 9, "string": "Maybe flu :( Although the former tweet is described by an actual influenza patient, the latter one merely expresses a suspicion of flu."}, {"id": 10, "string": "From a practical (clinical) perspective, these differences have great importance because the latter is noise that impedes precise influenza surveillance."}, {"id": 11, "string": "Therefore, earlier studies (Aramaki et al., 2011; Kanouchi et al., 2015; SUN et al., 2014) have devoted great efforts to removal of such noise (suspicion, negation, news wired, and so on)."}, {"id": 12, "string": "This study employs such noisy tweets."}, {"id": 13, "string": "We assume that a word, \"fever\" presents a clue to an upcoming influenza outbreak."}, {"id": 14, "string": "Inferring that people are frequently afflicted by symptoms such as \"fever\" and \"headache\" immediately before the onset and diagnosis of influenza, we designate such words as forecasting words."}, {"id": 15, "string": "More concrete examples of forecasting words are presented in Figure 1a ."}, {"id": 16, "string": "The figure reveals that an approximately 16-day time lag exists between the frequency of \"fever\" (blue line) and the number of patients (red line)."}, {"id": 17, "string": "If this time lag was known in advance, one could obtain a good approximation of the number of patients (red line) by a 16-day time shift operation (green line)."}, {"id": 18, "string": "Similarly, flu prevention words such as \"shot\" and \"injection\" have previously been used to describe outbreaks."}, {"id": 19, "string": "• I took a flu shot today • I don't wanna get a flu injection cuz it hurts me In the latter case as shown in Figure 1b , we can find much longer time lag (55 days) between tweets (frequency of \"injection\") and the reality (number of patients)."}, {"id": 20, "string": "Presuming that each word has its own time lag, then the problems to be solved are two-fold: (1) estimating the optimal time lag for each forecasting word and (2) incorporating these time lags into the model."}, {"id": 21, "string": "For the first problem, the suitable time lag for each word is measured by calculating the cross correlation between the word frequency and the patient number."}, {"id": 22, "string": "For the second problem, we construct a word frequency matrix that consists of a shifted word frequency timeline (Sec."}, {"id": 23, "string": "3)."}, {"id": 24, "string": "Next, a linear model called nowcasting model is constructed from the modified word matrix, for which the parameters are estimated using several regularization models, Lasso and Elastic Net (Sec."}, {"id": 25, "string": "4)."}, {"id": 26, "string": "Moreover, the nowcasting model can be extended easily to a predictive model called a forecasting model."}, {"id": 27, "string": "In the forecasting model (∆f days future), only forecasting words that have more than n day time lag are used (Sec."}, {"id": 28, "string": "5)."}, {"id": 29, "string": "Nowcasting models can dramatically boost the current patient number estimation capability (correlation ratio 0.93; +0.10 point)."}, {"id": 30, "string": "Forecasting models have demonstrated successful prediction performance (the correlation ratio 0.91 in 1-week future prediction, and the correlation ratio 0.77 in 3-weeks future prediction)."}, {"id": 31, "string": "This performance goes beyond the practical baseline (over 0.75 correlation)."}, {"id": 32, "string": "Our contributions are summarized as presented below."}, {"id": 33, "string": "• We discover that forecasting words have a time lag between the virtual world (number of tweets in Twitter) and the real world (number of patients)."}, {"id": 34, "string": "• We propose a method to build time-shifted features using cross correlation measures."}, {"id": 35, "string": "• We realize nowcasting model and its extended one, forecasting model, based on the time shift with parameter estimation."}, {"id": 36, "string": "This report is the first of the relevant literature describing a successful model enabling the prediction of future epidemics over the practical baseline."}, {"id": 37, "string": "We make code and data publicly available."}, {"id": 38, "string": "1 2 Dataset Influenza Corpus We collected 7.7 million influenza related tweets, starting from August 2012 to January 2016, via Twitter API 2 ."}, {"id": 39, "string": "Then, we filtered noises (removed retweets including the word, RT, and tweets linked to other web pages including the word, http from the collected tweet data)."}, {"id": 40, "string": "In the case of just counting influenzarelated tweets, we should only consider unique users to avoid to count more than ones the tweets of the same patients."}, {"id": 41, "string": "However, we didn't filter out the users which posted influenza-related tweets multiple times because we provide the different word for the different role even if these tweets were posted by the same patients."}, {"id": 42, "string": "For example, the word, \"fever\" for nowcasting, and the word, \"injection\" for forecasting."}, {"id": 43, "string": "To analyze a word, we applied a Japanese morphological parser (JUMAN 3 ) and obtained the stem forms."}, {"id": 44, "string": "As a result, 27,588 words were extracted."}, {"id": 45, "string": "Then, we investigated the word frequency per day to build a word matrix (days × words) as shown in Figure 2a ."}, {"id": 46, "string": "IDSC report In Japan, the Infectious Disease Surveillance Center (IDSC) announces the number of influenza patients once a week during an influenza epidemic season (typically during November-May in Japan)."}, {"id": 47, "string": "In fact, IDSC reports tend to delay around a week likewise the U.S. Centers for Disease Control and Prevention (CDC) (Paul et al., 2014) , but even if we consider such time delay, twitter stream attains the peak faster than the real world."}, {"id": 48, "string": "To use the IDSC reports for evaluation, we divided the data into the following three periods: 2012/12/01-2013/05/31 (Season 1), 2013/12/01-2014/05/31 (Season 2), and 2014/12/01-2015/05/24 (Season 3)."}, {"id": 49, "string": "We prepared a buffer time (60 day maximum time shift) immediately preceding the experimental periods to secure the time shift width."}, {"id": 50, "string": "Method To estimate the current influenza epidemics (nowcast) and forecast the future ones, the number of influenza patients was derived from the following linear model."}, {"id": 51, "string": "y (t) = x (t−τ 1 ) 1β 1 + x (t−τ 2 ) 2β 2 + · · · + x (t−τ |V | ) |V |β |V | Therein,ŷ (t) shows the estimated number of influenza patients at time t, x (t) v stands for the count of a word v at time t, andβ represents a weight estimated in the training phase,τ v denotes a suitable time shift parameter for word v decided in the training phase, and |V | denotes the size of vocabulary."}, {"id": 52, "string": "This section first provides methods to explore the most suitable time shift widthτ v for each word v (Sec."}, {"id": 53, "string": "3.1)."}, {"id": 54, "string": "Then, the parameter estimation method is described (Sec."}, {"id": 55, "string": "3.2)."}, {"id": 56, "string": "Finally, the model of future prediction based on the original model is explained (Sec."}, {"id": 57, "string": "3.3)."}, {"id": 58, "string": "IDSC report Time Shift Estimation The first problem to be solved is finding the optimal time shift width that achieves the best fit to the target influenza timeline."}, {"id": 59, "string": "Given the IDSC reports and wider range of tweets, Cross Correlation is used to search for the most suitable time shift width for each word frequency as r xv,y (τ ) = T t=1 (x (t−τ ) v −x (t−τ ) v )(y (t) − y) T t=1 (x (t−τ ) v −x (t−τ ) v ) 2 T t=1 (y (t) −ȳ) 2 , where τ is a time shift parameter (time shift width) 4 ."}, {"id": 60, "string": "The cross correlation r xv,y (τ ) measures the similarity between (τ days) time shift variable x v and objective y."}, {"id": 61, "string": "In this study, x (t−τ ) v is the count of word v with time shift width τ days earlier from t and y = [y (1) , ."}, {"id": 62, "string": "."}, {"id": 63, "string": "."}, {"id": 64, "string": ", y (T ) ] is the number of patients from the IDSC reports."}, {"id": 65, "string": "It is formulated asτ v = argmax τ r xv,y ."}, {"id": 66, "string": "Next, we construct a matrix, X ∈ N T ×V , where T stands for the timeline and V represents the vocabulary, according to the Algorithm 1."}, {"id": 67, "string": "Algorithm 1: Time-shifted word matrix for nowcasting."}, {"id": 68, "string": "Set the maximum shift parameter τmax for v ← 1 to |V | do for τ ← 0 to τmax do Calculate Cross Correlation rx v ,y (τ ) end τv = argmax τ ∈{0,...,τmax} rx v ,y (τ ) Shift the word vector to maximize Cross Correlationxv ← [x (1−τv ) v , x (2−τv ) v , ."}, {"id": 69, "string": "."}, {"id": 70, "string": "."}, {"id": 71, "string": ", x (T −τv ) v ] end return Shifted Word Matrix X = [x1, ."}, {"id": 72, "string": "."}, {"id": 73, "string": "."}, {"id": 74, "string": ",x |V | ] The algorithm decides the optimal time shift width (τ xv,y ) based on the cross correlation for each word."}, {"id": 75, "string": "After time shifts for all words, a shifted word matrix X is constructed."}, {"id": 76, "string": "Figure 2a presents the initial (original) word matrix (τ = 0 for all words) of 50 words (randomly selected)."}, {"id": 77, "string": "This matrix includes several low-correlated words, making several vertically irregular lines."}, {"id": 78, "string": "In contrast, the time shift operation arranges the irregular words to match the IDSC reports, producing a beautiful horizontal line, as shown in Figure 2b ."}, {"id": 79, "string": "Nowcasting To construct the linear model (called nowcasting model), the parameter β is estimated as minimizing the squared error."}, {"id": 80, "string": "For this study, the vocabulary size |V | is of much larger order than sample size T so that the ordinary least squares estimator is not unique."}, {"id": 81, "string": "It heavily overfits the data."}, {"id": 82, "string": "According to the previous study's manner, parameters with a penalty are estimated as shown below."}, {"id": 83, "string": "β = argmax β y − Xβ 2 2 + P(β, λ) In that equation, P(β, λ) is the penalty term."}, {"id": 84, "string": "In the case of P lasso (β, λ) = λ β 1 , the regularization method called the Least Absolute Shrinkage and Selection Operator (Lasso) is a well-known method for selecting and estimating the parameters simultaneously (Tibshirani, 1994) ."}, {"id": 85, "string": "In earlier studies, Lasso was employed to model influenza epidemics by Lampos and Cristianini (2010) ."}, {"id": 86, "string": "However, in the case of vocabulary size |V |, which is much larger order than sample size T , it has been observed empirically that the prediction performance of l 1 -penalized regression, the Lasso is dominated by the l 2 -penalized one."}, {"id": 87, "string": "Therefore, we employ the Elastic Net (Zou and Hastie, 2005) , which combines the l 1 -penalty and l 2 -penalty P enet = λ(α β 1 + (1 − α) β 2 2 ), where α is called l 1 ratio."}, {"id": 88, "string": "The Elastic Net was already employed for nowcasting influenza-like illness rates using search query log, not Twitter (Lampos et al., 2015) ."}, {"id": 89, "string": "In the case of α = 1, Elastic Net is exactly the same as Lasso and α = 0, Ridge (l 2 regularization)."}, {"id": 90, "string": "Similarly to Lasso, the Elastic Net simultaneously does automatic variable selection and continuous shrinkage."}, {"id": 91, "string": "It has a l-2 regularization advantage that selects groups of correlated variables."}, {"id": 92, "string": "Elastic Net, as the generalized method of Lasso and Ridge, estimates with equal or better performance compared to both."}, {"id": 93, "string": "Forecasting Our nowcasting model can be extended naturally to forecasting model."}, {"id": 94, "string": "To predict the number of future patients ∆f days after, we force to shift the word frequency at least ∆f days."}, {"id": 95, "string": "To do so, a setting of the nowcasting model in Algorithm 1 is just changed to τ min = ∆f , as shown in Algorithm 2."}, {"id": 96, "string": "It enables forecasting of future epidemics, demonstrating a widely applicable methodology of the proposed approach."}, {"id": 97, "string": "Experiment 1: Nowcasting To assess the nowcasting performance, we used the actual influenza reports provided by the Japanese IDSC."}, {"id": 98, "string": "Comparable Methods We compared four linear methods for nowcasting as shown below: • Lasso: l 1 -regularization method (Tibshirani, 1994; Lampos and Cristianini, 2010) , • Lasso+: Lasso and time shift combined method, • ENet: Elastic-Net, which combines l 1 -, l 2 -regularization (Zou and Hastie, 2005) , • ENet+: Elastic-Net and time shift combined method."}, {"id": 99, "string": "All hyperparameters were tuned via five-fold cross validation in the training dataset."}, {"id": 100, "string": "Dataset and Evaluation Metric The detailed dataset is described in Sec."}, {"id": 101, "string": "2."}, {"id": 102, "string": "To construct the time-shifted word matrix, we set τ max = 60."}, {"id": 103, "string": "Our tweet corpus had a dropout period, so that we did not calculate the cross correlation with more than a 60-day shift."}, {"id": 104, "string": "We employed each season's data as training data and others as test data."}, {"id": 105, "string": "The evaluation metric is based on correlation (Pearson correlation) between the estimated value and the value of the IDSC reports."}, {"id": 106, "string": "Result Results of modeling accuracy are presented in Table 1 ."}, {"id": 107, "string": "Correlations of our baselines, Lasso and Enet, were lower than those of previous studies."}, {"id": 108, "string": "Results suggest that our dataset is more difficult than those used in earlier studies."}, {"id": 109, "string": "In contrast, time-shifted models (Lasso+, Enet+) demonstrated about 0.1 point improvement than their baseline models, indicating the contribution of time shift features."}, {"id": 110, "string": "It is noteworthy that Lasso type model and Enet type one did not differ so much."}, {"id": 111, "string": "The whole trained model chose l 1 ratio parameter that is nearly equal to 1, so that the Enet type model became almost identical as Lasso type model."}, {"id": 112, "string": "Overestimation Results showed that values in Figure 3a were overestimated in mid-May."}, {"id": 113, "string": "One reason is that tweets related to news such as \"Scientists create hybrid flu that can go airborne\" 5 were popular in social media."}, {"id": 114, "string": "Although tweets linked to web pages were removed during preprocessing, many tweets without links to web pages were posted by many people worried about the news."}, {"id": 115, "string": "An example of such tweets is the following: • What?"}, {"id": 116, "string": "In an attempt to make a vaccine for bird flu and swine flu had created a new strain of influenza virus?"}, {"id": 117, "string": "What are you doing?"}, {"id": 118, "string": "In addition, the model trained in Season 2 included the word \"bird\" as one feature."}, {"id": 119, "string": "This word's time shift was 15 days."}, {"id": 120, "string": "Consequently, this peak occurred."}, {"id": 121, "string": "In most cases, these kinds of outlier words are not selected through model selection, but preprocessing will play an crucial role to prevent these kinds of outlier."}, {"id": 122, "string": "Experiment 2: Forecasting We evaluate the forecasting performance described in Sec 3.3."}, {"id": 123, "string": "Comparable methods Lasso and Enet have no features for predicting future values."}, {"id": 124, "string": "Therefore, we use Lasso+ and Enet+ for forecasting."}, {"id": 125, "string": "Additionally, we employ the following baseline model of BaseLine:ŷ (t) test = y (t) train for comparison with our proposed models."}, {"id": 126, "string": "Dataset and Evaluation Metric To evaluate the forecasting performance, we used the same dataset and evaluation metric as Experiment 1, except that we set the minimum time shift τ min from 1 day to 30 days."}, {"id": 127, "string": "Result Results of forecasting accuracy are presented in Figure 4 ."}, {"id": 128, "string": "In both models, the accuracy was superior to the baseline until around 3 weeks into the future."}, {"id": 129, "string": "In addition, the accuracy for prediction one week into the future was almost identical to that in the case of τ min = 0."}, {"id": 130, "string": "That result might occur because the accuracy about one week future was nearly the same as that for the current state."}, {"id": 131, "string": "In addition, there were many highly correlated features by shifting around 10 days into the future."}, {"id": 132, "string": "Consequently, our model demonstrated equivalent performance up to 10 days into the future."}, {"id": 133, "string": "Furthermore, the forecasting performance decreased dramatically along with the increase of τ min , as shown in Figure 4e ."}, {"id": 134, "string": "We discuss that point further in Sec."}, {"id": 135, "string": "6."}, {"id": 136, "string": "Figure 5 presents timeline plots of examples."}, {"id": 137, "string": "From Figure 5a to Figure 5d are shown the values estimated by the forecasting models trained in Season 2 and tested in Season 1 for τ min ∈ {7, 14, 21, 28}."}, {"id": 138, "string": "The estimated values showed a consistently similar shape to that of the IDSC report."}, {"id": 139, "string": "In Figure 5c , the same word, \"bird\", occurred as described in Sec."}, {"id": 140, "string": "4.3."}, {"id": 141, "string": "In contrast, the weight for \"bird\" decreased in Figure 5d for that reason, the forecasting accuracy increased."}, {"id": 142, "string": "Then, from Figure 5e to Figure 5h show the values estimated by the forecasting models trained in Season 3 and tested in Season 2 for the same τ min ."}, {"id": 143, "string": "Our models overestimated before outbreaks and underestimated after the peak of influenza epidemics."}, {"id": 144, "string": "For τ min = 28, this phenomenon was widely evident."}, {"id": 145, "string": "We discuss that point further in Sec."}, {"id": 146, "string": "6."}, {"id": 147, "string": "Discussion In general, the proposed approach (time shift operation) fitted the IDSC reports, demonstrating the basic feasibility."}, {"id": 148, "string": "However, exceptions were apparent, as for the model trained in Season 3."}, {"id": 149, "string": "One reason is that a gap exists in the suitable time shift widths between the train (Season 3) and the other (Seasons 1 and 2)."}, {"id": 150, "string": "Lasso+ model trained in Season 3 selected the words, \"fever\" withτ fever = 16, \"vaccination\" witĥ τ vaccination = 55, \"absent\" withτ absent = 10, and others as features."}, {"id": 151, "string": "These words have high correlations only in Season 3, with poor correlation in other seasons."}, {"id": 152, "string": "The most drastic example is \"vaccination\" witĥ τ vaccination , (over 0.849 correlation in Season 3)."}, {"id": 153, "string": "This word is adversely affected by other seasons (0.313 correlation in Season 1 and 0.04 correlation in Season 2)."}, {"id": 154, "string": "The reason for the lost correlation was that τ vaccination in Season 3 differed from that of other seasons."}, {"id": 155, "string": "This phenomenon suggests that \"vaccination\" is just an annually cycling word."}, {"id": 156, "string": "Neither the cycle of \"vaccination\" nor that of influenza is fixed, bringing us different time lags."}, {"id": 157, "string": "Figure 4 : Correlation between estimated values using the two methods for forecasting."}, {"id": 158, "string": "Figure 5 : Timelines of values estimated using the two methods for forecasting and the IDSC reports in each τ min ."}, {"id": 159, "string": "This inconsistency of time shifts also affected the forecasting performance directly."}, {"id": 160, "string": "As shown in Figure 4e , the forecasting performance was decreased dramatically against the increase of τ min ."}, {"id": 161, "string": "In spite of the word \"shot\" is the largest weighted feature in the case of τ min = 21 and Train in Season 3, these word correlations were 0.310 in Season 1 and 0.03 in Season 2."}, {"id": 162, "string": "Consequently, it caused a considerable decrease of the forecasting accuracy."}, {"id": 163, "string": "In contrast, some words, such as \"fever\" and \"symptom\", showed consistently similar time shifts."}, {"id": 164, "string": "A technique to distinguish actual forecasting words such as \"fever\", and noises (simple year cycle words), \"vaccination\" is highly anticipated for use in the near future."}, {"id": 165, "string": "If multiple-year training sets were available, one could filter out such noisy words."}, {"id": 166, "string": "Although some room for improvement remains, the basic feasibility of the proposed approach has been demonstrated."}, {"id": 167, "string": "The time shift was effective for social media based surveillance."}, {"id": 168, "string": "In addition, the model enables prediction."}, {"id": 169, "string": "Related Work To date, numerous web based surveillance systems have been proposed, targeting the common cold (Kitagawa et al., 2015) , drug side effects (Bian et al., 2012) , cholera (Chunara et al., 2012) , E. Coli (Diaz-Aviles et al., 2012) , problem drinking (MA et al., 2012) , smoking (Prier et al., 2011) , campylobacteriosis (Chester et al., 2011) , dengue fever (Gomide et al., 2011) , and HIV/AIDS (Ku et al., 2010) ."}, {"id": 170, "string": "Influenza has especially drawn much attention from earlier studies (Ginsberg et al., 2009; Polgreen et al., 2009 Hulth et al., 2009; Corley et al., 2010) to current Twitter-based studies (Aramaki et al., 2011; Collier et al., 2011; Chew and Eysenbach, 2010; Lampos and Cristianini, 2010; Culotta, 2013) ."}, {"id": 171, "string": "Because of great variance in data resources and evaluation manner (region, year, only winter or all seasons), a precise comparison would be difficult and meaningless, Culotta (Culotta, 2013) and Ginsberg (Ginsberg et al., 2009) are apparently better than the others in US (correlation ratios = 0.96 and 0.94, respectively)."}, {"id": 172, "string": "Aramaki et al."}, {"id": 173, "string": "(2011) achieved the best score for Japan (correlation ratio = 0.89)."}, {"id": 174, "string": "This study also examined Twitter data in Japan, and achieved competitive results for nowcasting."}, {"id": 175, "string": "Another aspect of reviews of related studies is the manner of tweet counting."}, {"id": 176, "string": "In earlier studies, a simple word counting, the direct number of tweets, is considered an index of the degree of disease epidemics."}, {"id": 177, "string": "However, such a simple method is adversely affected by the huge numbers of noisy tweets."}, {"id": 178, "string": "Currently, counting approaches of two types have been developed: (1) a classification approach (Kanouchi et al., 2015; SUN et al., 2014; Aramaki et al., 2011) aimed at extracting only tweets including patient information, and (2) a regression approach (Lamb et al., 2013; Culotta, 2010; Lampos and Cristianini, 2010; Paul and Dredze, 2011 ) that handles multiple words to build a precise regression model."}, {"id": 179, "string": "The proposed study fundamentally belongs among regression approaches, which explore optimal weight perimeters for each word."}, {"id": 180, "string": "An important difference is that this study handles one more parameter for each word: time shift (days)."}, {"id": 181, "string": "To handle many parameters, we first ascertain the best time shift widths."}, {"id": 182, "string": "Then we explore weight parameters using L1 or elastic net."}, {"id": 183, "string": "It is noteworthy that this study does not employ any classification method, engaging a room to improve by incorporation with classification techniques."}, {"id": 184, "string": "Conclusions This study proposed a novel social media based influenza surveillance system using forecasting words that appear in Twitter usage before main epidemics occur."}, {"id": 185, "string": "First, for each word, the optimal time lag was explored, which maximized the cross correlation to influenza epidemics."}, {"id": 186, "string": "Then, we shifted a matrix consisting of word frequencies at different time points by each optimal time lag."}, {"id": 187, "string": "Using the time-shifted word matrix, this study produced and evaluated a nowcasting model and forecasting model designed to predict the number of influenza patients."}, {"id": 188, "string": "In the experimentally obtained results, the proposed model achieved the best nowcasting performance to date (correlation ratio 0.93) and practically sufficient forecasting performance (correlation ratio 0.91 in the 1-week future prediction, and correlation ratio 0.77 in 3-week future prediction)."}, {"id": 189, "string": "This report is the first of the relevant literature describing a model that enables prediction of future epidemics."}, {"id": 190, "string": "Furthermore, the model has much room for potential application to prediction of other events."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 37}, {"section": "Influenza Corpus", "n": "2.1", "start": 38, "end": 45}, {"section": "IDSC report", "n": "2.2", "start": 46, "end": 49}, {"section": "Method", "n": "3", "start": 50, "end": 57}, {"section": "Time Shift Estimation", "n": "3.1", "start": 58, "end": 78}, {"section": "Nowcasting", "n": "3.2", "start": 79, "end": 92}, {"section": "Forecasting", "n": "3.3", "start": 93, "end": 94}, {"section": "Experiment 1: Nowcasting", "n": "4", "start": 95, "end": 97}, {"section": "Comparable Methods", "n": "4.1", "start": 98, "end": 99}, {"section": "Dataset and Evaluation Metric", "n": "4.2", "start": 100, "end": 105}, {"section": "Result", "n": "4.3", "start": 106, "end": 121}, {"section": "Experiment 2: Forecasting", "n": "5", "start": 122, "end": 122}, {"section": "Comparable methods", "n": "5.1", "start": 123, "end": 125}, {"section": "Dataset and Evaluation Metric", "n": "5.2", "start": 126, "end": 126}, {"section": "Result", "n": "5.3", "start": 127, "end": 146}, {"section": "Discussion", "n": "6", "start": 147, "end": 168}, {"section": "Related Work", "n": "7", "start": 169, "end": 183}, {"section": "Conclusions", "n": "8", "start": 184, "end": 190}], "figures": [{"filename": "../figure/image/1161-Table1-1.png", "caption": "Table 1: Correlation between estimated values and the IDSC reports.", "page": 5, "bbox": {"x1": 123.83999999999999, "x2": 473.28, "y1": 62.4, "y2": 153.12}}, {"filename": "../figure/image/1161-Figure3-1.png", "caption": "Figure 3: Timelines of estimated values obtained using the four methods for nowcasting.", "page": 5, "bbox": {"x1": 68.16, "x2": 522.24, "y1": 184.32, "y2": 401.76}}, {"filename": "../figure/image/1161-Figure1-1.png", "caption": "Figure 1: Motivating examples: The time lag of the frequency of a word enables one to obtain a good approximation to the number of patients. The blue line shows the word frequency. The green line shows the word frequency shifted time lag days. The red line shows the number of patients.", "page": 1, "bbox": {"x1": 89.28, "x2": 499.2, "y1": 187.2, "y2": 222.72}}, {"filename": "../figure/image/1161-Figure4-1.png", "caption": "Figure 4: Correlation between estimated values using the two methods for forecasting.", "page": 7, "bbox": {"x1": 74.88, "x2": 522.24, "y1": 70.08, "y2": 287.52}}, {"filename": "../figure/image/1161-Figure5-1.png", "caption": "Figure 5: Timelines of values estimated using the two methods for forecasting and the IDSC reports in each τmin.", "page": 7, "bbox": {"x1": 78.24, "x2": 509.28, "y1": 311.03999999999996, "y2": 473.28}}, {"filename": "../figure/image/1161-Figure2-1.png", "caption": "Figure 2: Word matrix transformation. The Y -axis shows a timeline. The X-axis shows words with the IDSC reports (right side).", "page": 3, "bbox": {"x1": 75.36, "x2": 522.24, "y1": 65.28, "y2": 208.32}}, {"filename": "../figure/image/1161-Figure6-1.png", "caption": "Figure 6: Frequencies of “Shot” in respective seasons.", "page": 8, "bbox": {"x1": 74.88, "x2": 511.2, "y1": 71.52, "y2": 176.64}}]}