{"title": "Probabilistic FastText for Multi-Sense Word Embeddings", "abstract": "We introduce Probabilistic FastText, a new model for word embeddings that can capture multiple word senses, sub-word structure, and uncertainty information. In particular, we represent each word with a Gaussian mixture density, where the mean of a mixture component is given by the sum of n-grams. This representation allows the model to share statistical strength across sub-word structures (e.g. Latin roots), producing accurate representations of rare, misspelt, or even unseen words. Moreover, each component of the mixture can capture a different word sense. Probabilistic FastText outperforms both FASTTEXT, which has no probabilistic model, and dictionary-level probabilistic embeddings, which do not incorporate subword structures, on several word-similarity benchmarks, including English RareWord and foreign language datasets. We also achieve state-ofart performance on benchmarks that measure ability to discern different meanings. Thus, the proposed model is the first to achieve multi-sense representations while having enriched semantics on rare words.", "text": [{"id": 0, "string": "Introduction Word embeddings are foundational to natural language processing."}, {"id": 1, "string": "In order to model language, we need word representations to contain as much semantic information as possible."}, {"id": 2, "string": "Most research has focused on vector word embeddings, such as WORD2VEC (Mikolov et al., 2013a) , where words with similar meanings are mapped to nearby points in a vector space."}, {"id": 3, "string": "Following the * Work done partly during internship at Amazon."}, {"id": 4, "string": "seminal work of Mikolov et al."}, {"id": 5, "string": "(2013a) , there have been numerous works looking to learn efficient word embeddings."}, {"id": 6, "string": "One shortcoming with the above approaches to word embedding that are based on a predefined dictionary (termed as dictionary-based embeddings) is their inability to learn representations of rare words."}, {"id": 7, "string": "To overcome this limitation, character-level word embeddings have been proposed."}, {"id": 8, "string": "FASTTEXT (Bojanowski et al., 2016) is the state-of-the-art character-level approach to embeddings."}, {"id": 9, "string": "In FASTTEXT, each word is modeled by a sum of vectors, with each vector representing an n-gram."}, {"id": 10, "string": "The benefit of this approach is that the training process can then share strength across words composed of common roots."}, {"id": 11, "string": "For example, with individual representations for \"circum\" and \"navigation\", we can construct an informative representation for \"circumnavigation\", which would otherwise appear too infrequently to learn a dictionary-level embedding."}, {"id": 12, "string": "In addition to effectively modelling rare words, character-level embeddings can also represent slang or misspelled words, such as \"dogz\", and can share strength across different languages that share roots, e.g."}, {"id": 13, "string": "Romance languages share latent roots."}, {"id": 14, "string": "A different promising direction involves representing words with probability distributions, instead of point vectors."}, {"id": 15, "string": "For example, Vilnis and McCallum (2014) represents words with Gaussian distributions, which can capture uncertainty information."}, {"id": 16, "string": "Athiwaratkun and Wilson (2017) generalizes this approach to multimodal probability distributions, which can naturally represent words with different meanings."}, {"id": 17, "string": "For example, the distribution for \"rock\" could have mass near the word \"jazz\" and \"pop\", but also \"stone\" and \"basalt\"."}, {"id": 18, "string": "Athiwaratkun and Wilson (2018) further developed this approach to learn hierarchical word representations: for example, the word \"music\" can be learned to have a broad distribution, which encapsulates the distributions for \"jazz\" and \"rock\"."}, {"id": 19, "string": "In this paper, we propose Probabilistic Fast-Text (PFT), which provides probabilistic characterlevel representations of words."}, {"id": 20, "string": "The resulting word embeddings are highly expressive, yet straightforward and interpretable, with simple, efficient, and intuitive training procedures."}, {"id": 21, "string": "PFT can model rare words, uncertainty information, hierarchical representations, and multiple word senses."}, {"id": 22, "string": "In particular, we represent each word with a Gaussian or a Gaussian mixture density, which we name PFT-G and PFT-GM respectively."}, {"id": 23, "string": "Each component of the mixture can represent different word senses, and the mean vectors of each component decompose into vectors of n-grams, to capture character-level information."}, {"id": 24, "string": "We also derive an efficient energybased max-margin training procedure for PFT."}, {"id": 25, "string": "We perform comparison with FASTTEXT as well as existing density word embeddings W2G (Gaussian) and W2GM (Gaussian mixture)."}, {"id": 26, "string": "Our models extract high-quality semantics based on multiple word-similarity benchmarks, including the rare word dataset."}, {"id": 27, "string": "We obtain an average weighted improvement of 3.7% over FASTTEXT (Bojanowski et al., 2016) and 3.1% over the dictionary-level density-based models."}, {"id": 28, "string": "We also observe meaningful nearest neighbors, particularly in the multimodal density case, where each mode captures a distinct meaning."}, {"id": 29, "string": "Our models are also directly portable to foreign languages without any hyperparameter modification, where we observe strong performance, outperforming FAST-TEXT on many foreign word similarity datasets."}, {"id": 30, "string": "Our multimodal word representation can also disentangle meanings, and is able to separate different senses in foreign polysemies."}, {"id": 31, "string": "In particular, our models attain state-of-the-art performance on SCWS, a benchmark to measure the ability to separate different word meanings, achieving 1.0% improvement over a recent density embedding model W2GM (Athiwaratkun and Wilson, 2017) ."}, {"id": 32, "string": "To the best of our knowledge, we are the first to develop multi-sense embeddings with high semantic quality for rare words."}, {"id": 33, "string": "Our code and embeddings are publicly available."}, {"id": 34, "string": "1 Related Work Early word embeddings which capture semantic information include Bengio et al."}, {"id": 35, "string": "(2003) , Col-1 https://github.com/benathi/multisense-prob-fasttext lobert and Weston (2008 ), and Mikolov et al."}, {"id": 36, "string": "(2011 )."}, {"id": 37, "string": "Later, Mikolov et al."}, {"id": 38, "string": "(2013a developed the popular WORD2VEC method, which proposes a log-linear model and negative sampling approach that efficiently extracts rich semantics from text."}, {"id": 39, "string": "Another popular approach GLOVE learns word embeddings by factorizing co-occurrence matrices (Pennington et al., 2014) ."}, {"id": 40, "string": "Recently there has been a surge of interest in making dictionary-based word embeddings more flexible."}, {"id": 41, "string": "This flexibility has valuable applications in many end-tasks such as language modeling (Kim et al., 2016) , named entity recognition (Kuru et al., 2016) , and machine translation (Zhao and Zhang, 2016; Lee et al., 2017) , where unseen words are frequent and proper handling of these words can greatly improve the performance."}, {"id": 42, "string": "These works focus on modeling subword information in neural networks for tasks such as language modeling."}, {"id": 43, "string": "Besides vector embeddings, there is recent work on multi-prototype embeddings where each word is represented by multiple vectors."}, {"id": 44, "string": "The learning approach involves using a cluster centroid of context vectors (Huang et al., 2012) , or adapting the skip-gram model to learn multiple latent representations (Tian et al., 2014) ."}, {"id": 45, "string": "Neelakantan et al."}, {"id": 46, "string": "(2014) furthers adapts skip-gram with a non-parametric approach to learn the embeddings with an arbitrary number of senses per word."}, {"id": 47, "string": "incorporates an external dataset WORDNET to learn sense vectors."}, {"id": 48, "string": "We compare these models with our multimodal embeddings in Section 4."}, {"id": 49, "string": "Probabilistic FastText We introduce Probabilistic FastText, which combines a probabilistic word representation with the ability to capture subword structure."}, {"id": 50, "string": "We describe the probabilistic subword representation in Section 3.1."}, {"id": 51, "string": "We then describe the similarity measure and the loss function used to train the embeddings in Sections 3.2 and 3.3."}, {"id": 52, "string": "We conclude by briefly presenting a simplified version of the energy function for isotropic Gaussian representations (Section 3.4), and the negative sampling scheme we use in training (Section 3.5)."}, {"id": 53, "string": "Probabilistic Subword Representation We represent each word with a Gaussian mixture with K Gaussian components."}, {"id": 54, "string": "That is, a word w is associated with a density function f ( x) = K i=1 p w,i N (x; µ w,i , Σ w,i ) where {µ w,i } K k=1 are the mean vectors and {Σ w,i } are the covariance matrices, and {p w,i } K k=1 are the component probabilities which sum to 1."}, {"id": 55, "string": "The mean vectors of Gaussian components hold much of the semantic information in density embeddings."}, {"id": 56, "string": "While these models are successful based on word similarity and entailment benchmarks (Vilnis and McCallum, 2014; Athiwaratkun and Wilson, 2017) , the mean vectors are often dictionary-level, which can lead to poor semantic estimates for rare words, or the inability to handle words outside the training corpus."}, {"id": 57, "string": "We propose using subword structures to estimate the mean vectors."}, {"id": 58, "string": "We outline the formulation below."}, {"id": 59, "string": "For word w, we estimate the mean vector µ w with the average over n-gram vectors and its dictionary-level vector."}, {"id": 60, "string": "That is, µ w = 1 |N G w | + 1   v w + g∈N Gw z g   (1) where z g is a vector associated with an n-gram g, v w is the dictionary representation of word w, and N G w is a set of n-grams of word w. Examples of 3,4-grams for a word \"beautiful\", including the beginning-of-word character ' ' and end-of-word character ' ', are: • 3-grams: be, bea, eau, aut, uti, tif, ful, ul • 4-grams: bea, beau .., iful ,ful This structure is similar to that of FASTTEXT (Bojanowski et al., 2016) ; however, we note that FASTTEXT uses single-prototype deterministic embeddings as well as a training approach that maximizes the negative log-likelihood, whereas we use a multi-prototype probabilistic embedding and for training we maximize the similarity between the words' probability densities, as described in Sections 3.2 and 3.3 Figure 1a depicts the subword structure for the mean vector."}, {"id": 61, "string": "Figure 1b and 1c depict our models, Gaussian probabilistic FASTTEXT (PFT-G) and Gaussian mixture probabilistic FASTTEXT (PFT-GM)."}, {"id": 62, "string": "In the Gaussian case, we represent each mean vector with a subword estimation."}, {"id": 63, "string": "For the Gaussian mixture case, we represent one Gaussian component's mean vector with the subword structure whereas other components' mean vectors are dictionary-based."}, {"id": 64, "string": "This model choice to use dictionary-based mean vectors for other components is to reduce to constraint imposed by the subword structure and promote independence for meaning discovery."}, {"id": 65, "string": "Similarity Measure between Words Traditionally, if words are represented by vectors, a common similarity metric is a dot product."}, {"id": 66, "string": "In the case where words are represented by distribution functions, we use the generalized dot product in Hilbert space ·, · L 2 , which is called the expected likelihood kernel (Jebara et al., 2004) ."}, {"id": 67, "string": "We define the energy E(f, g) between two words f and g to be E(f, g) = log f, g L 2 = log f (x)g(x) dx."}, {"id": 68, "string": "With Gaussian mixtures f (x) = K i=1 p i N (x; µ f,i , Σ f,i ) and g(x) = K i=1 q i N (x; µ g,i , Σ g,i ), K i=1 p i = 1, and K i=1 q i = 1 , the energy has a closed form: E(f, g) = log K j=1 K i=1 p i q j e ξ i,j (2) where ξ j,j is the partial energy which corresponds to the similarity between component i of the first word f and component j of the second word g. 2 ξ i,j ≡ log N (0; µ f,i − µ g,j , Σ f,i + Σ g,j ) = − 1 2 log det(Σ f,i + Σ g,j ) − D 2 log(2π) − 1 2 ( µ f,i − µ g,j ) (Σ f,i + Σ g,j ) −1 ( µ f,i − µ g,j ) (3) Figure 2 demonstrates the partial energies among the Gaussian components of two words."}, {"id": 69, "string": "Interaction between GM components rock:0 pop:0 pop:1 rock:1 ⇠ 0,1 ⇠ 0,0 ⇠ 1,1 ⇠ 1, Loss Function The model parameters that we seek to learn are v w for each word w and z g for each n-gram g. We train the model by pushing the energy of a true context pair w and c to be higher than the negative context pair w and n by a margin m. We use Adagrad (Duchi et al., 2011) to minimize the following loss to achieve this outcome: L(f, g) = max [0, m − E(f, g) + E(f, n)] ."}, {"id": 70, "string": "(4) We describe how to sample words as well as its positive and negative contexts in Section 3.5."}, {"id": 71, "string": "This loss function together with the Gaussian mixture model with K > 1 has the ability to extract multiple senses of words."}, {"id": 72, "string": "That is, for a word with multiple meanings, we can observe each mode to represent a distinct meaning."}, {"id": 73, "string": "For instance, one density mode of \"star\" is close to the densities of \"celebrity\" and \"hollywood\" whereas another mode of \"star\" is near the densities of \"constellation\" and \"galaxy\"."}, {"id": 74, "string": "Energy Simplification In theory, it can be beneficial to have covariance matrices as learnable parameters."}, {"id": 75, "string": "In practice, Athiwaratkun and Wilson (2017) observe that spherical covariances often perform on par with diagonal covariances with much less computational resources."}, {"id": 76, "string": "Using spherical covariances for each component, we can further simplify the energy function as follows: ξ i,j = − α 2 · ||µ f,i − µ g,j || 2 , (5) where the hyperparameter α is the scale of the inverse covariance term in Equation 3."}, {"id": 77, "string": "We note that Equation 5 is equivalent to Equation 3 up to an additive constant given that the covariance matrices are spherical and the same for all components."}, {"id": 78, "string": "Word Sampling To generate a context word c of a given word w, we pick a nearby word within a context window of a fixed length ."}, {"id": 79, "string": "We also use a word sampling technique similar to Mikolov et al."}, {"id": 80, "string": "(2013b) ."}, {"id": 81, "string": "This subsampling procedure selects words for training with lower probabilities if they appear frequently."}, {"id": 82, "string": "This technique has an effect of reducing the importance of words such as 'the', 'a', 'to' which can be predominant in a text corpus but are not as meaningful as other less frequent words such as 'city', 'capital', 'animal', etc."}, {"id": 83, "string": "In particular, word w has probability P (w) = 1 − t/f (w) where f (w) is the frequency of word w in the corpus and t is the frequency threshold."}, {"id": 84, "string": "A negative context word is selected using a distribution P n (w) ∝ U (w) 3/4 where U (w) is a unigram probability of word w. The exponent 3/4 also diminishes the importance of frequent words and shifts the training focus to other less frequent words."}, {"id": 85, "string": "Experiments We have proposed a probabilistic FASTTEXT model which combines the flexibility of subword structure with the density embedding approach."}, {"id": 86, "string": "In this section, we show that our probabilistic representation with subword mean vectors with the simplified energy function outperforms many word similarity baselines and provides disentangled meanings for polysemies."}, {"id": 87, "string": "First, we describe the training details in Section 4.1."}, {"id": 88, "string": "We provide qualitative evaluation in Section 4.2, showing meaningful nearest neighbors for the Gaussian embeddings, as well as the ability to capture multiple meanings by Gaussian mixtures."}, {"id": 89, "string": "Our quantitative evaluation in Section 4.3 demonstrates strong performance against the baseline models FASTTEXT (Bojanowski et al., 2016) and the dictionary-level Gaussian (W2G) (Vilnis and McCallum, 2014) and Gaussian mixture embeddings (Athiwaratkun and Wilson, 2017) (W2GM)."}, {"id": 90, "string": "We train our models on foreign language corpuses and show competitive results on foreign word similarity benchmarks in Section 4.4."}, {"id": 91, "string": "Finally, we explain the importance of the n-gram structures for semantic sharing in Section 4.5."}, {"id": 92, "string": "Training Details We train our models on both English and foreign language datasets."}, {"id": 93, "string": "For English, we use the concatenation of UKWAC and WACKYPEDIA (Baroni et al., 2009) which consists of 3.376 billion words."}, {"id": 94, "string": "We filter out word types that occur fewer than 5 times which results in a vocabulary size of 2,677,466."}, {"id": 95, "string": "For foreign languages, we demonstrate the training of our model on French, German, and Italian text corpuses."}, {"id": 96, "string": "We note that our model should be applicable for other languages as well."}, {"id": 97, "string": "We use FRWAC (French), DEWAC (German), ITWAC (Italian) datasets (Baroni et al., 2009 ) for text corpuses, consisting of 1.634, 1.716 and 1.955 billion words respectively."}, {"id": 98, "string": "We use the same threshold, filtering out words that occur less than 5 times in each corpus."}, {"id": 99, "string": "We have dictionary sizes of 1.3, 2.7, and 1.4 million words for FRWAC, DEWAC, and ITWAC."}, {"id": 100, "string": "We adjust the hyperparameters on the English corpus and use them for foreign languages."}, {"id": 101, "string": "Note that the adjustable parameters for our models are the loss margin m in Equation 4 and the scale α in Equation 5."}, {"id": 102, "string": "We search for the optimal hyperparameters in a grid m ∈ {0.01, 0.1, 1, 10, 100} and α ∈ { 1 5×10 −3 , 1 10 −3 , 1 2×10 −4 , 1 1×10 −4 } on our English corpus."}, {"id": 103, "string": "The hyperpameter α affects the scale of the loss function; therefore, we adjust the learning rate appropriately for each α."}, {"id": 104, "string": "In particular, the learning rates used are γ = {10 −4 , 10 −5 , 10 −6 } for the respective α values."}, {"id": 105, "string": "Other fixed hyperparameters include the number of Gaussian components K = 2, the context window length = 10 and the subsampling threshold t = 10 −5 ."}, {"id": 106, "string": "Similar to the setup in FAST-TEXT, we use n-grams where n = 3, 4, 5, 6 to estimate the mean vectors."}, {"id": 107, "string": "Qualitative Evaluation -Nearest neighbors We show that our embeddings learn the word semantics well by demonstrating meaningful nearest neighbors."}, {"id": 108, "string": "Table 1 shows examples of polysemous words such as rock, star, and cell."}, {"id": 109, "string": "Table 1 shows the nearest neighbors of polysemous words."}, {"id": 110, "string": "We note that subword embeddings prefer words with overlapping characters as nearest neighbors."}, {"id": 111, "string": "For instance, \"rock-y\", \"rockn\", and \"rock\" are both close to the word \"rock\"."}, {"id": 112, "string": "For the purpose of demonstration, we only show words with meaningful variations and omit words with small character-based variations previously mentioned."}, {"id": 113, "string": "However, all words shown are in the top-100 nearest words."}, {"id": 114, "string": "We observe the separation in meanings for the multi-component case; for instance, one component of the word \"bank\" corresponds to a financial bank whereas the other component corresponds to a river bank."}, {"id": 115, "string": "The single-component case also has interesting behavior."}, {"id": 116, "string": "We observe that the subword embeddings of polysemous words can represent both meanings."}, {"id": 117, "string": "For instance, both \"lava-rock\" and \"rock-pop\" are among the closest words to \"rock\"."}, {"id": 118, "string": "Word Similarity Evaluation We evaluate our embeddings on several standard word similarity datasets, namely, SL-999 (Hill et al., 2014) , WS-353 (Finkelstein et al., 2002) , MEN-3k (Bruni et al., 2014) , MC-30 (Miller and Charles, 1991) , RG-65 (Rubenstein and Goodenough, 1965) , YP-130 (Yang and Powers, 2006) , MTurk(-287,-771) (Radinsky et al., 2011; Halawi et al., 2012) , and RW-2k (Luong et al., 2013) ."}, {"id": 119, "string": "Each dataset contains a list of word pairs with a human score of how related or similar the two words are."}, {"id": 120, "string": "We use the notation DATASET-NUM to denote the number of word pairs NUM in each evaluation set."}, {"id": 121, "string": "We note that the dataset RW focuses more on infrequent words and SimLex-999 focuses on the similarity of words rather than relatedness."}, {"id": 122, "string": "We also compare PFT-GM with other multi-prototype embeddings in the literature using SCWS (Huang et al., 2012) , a word similarity dataset that is aimed to measure the ability of embeddings to discern multiple meanings."}, {"id": 123, "string": "We calculate the Spearman correlation (Spearman, 1904) between the labels and our scores gen-Word Co."}, {"id": 124, "string": "Nearest Neighbors rock 0 rock:0, rocks:0, rocky:0, mudrock:0, rockscape:0, boulders:0 , coutcrops:0, rock 1 rock:1, punk:0, punk-rock:0, indie:0, pop-rock:0, pop-punk:0, indie-rock:0, band:1 bank 0 bank:0, banks:0, banker:0, bankers:0, bankcard:0, Citibank:0, debits:0 bank 1 bank:1, banks:1, river:0, riverbank:0, embanking:0, banks:0, confluence:1 star 0 stars:0, stellar:0, nebula:0, starspot:0, stars."}, {"id": 125, "string": ":0, stellas:0, constellation:1 star 1 star:1, stars:1, star-star:0, 5-stars:0, movie-star:0, mega-star:0, super-star:0 cell 0 cell:0, cellular:0, acellular:0, lymphocytes:0, T-cells:0, cytes:0, leukocytes:0 cell 1 cell:1, cells:1, cellular:0, cellular-phone:0, cellphone:0, transcellular:0 left 0 left:0, right:1, left-hand:0, right-left:0, left-right-left:0, right-hand:0, leftwards:0 left 1 left:1, leaving:0, leavings:0, remained:0, leave:1, enmained:0, leaving-age:0, sadly-departed:0 Word Nearest Neighbors rock rock, rock-y, rockn, rock-, rock-funk, rock/, lava-rock, nu-rock, rock-pop, rock/ice, coral-rock bank bank-, bank/, bank-account, bank., banky, bank-to-bank, banking, Bank, bank/cash, banks."}, {"id": 126, "string": "** star movie-stars, star-planet, starsailor, Star, starsign, cell/tumour, left/joined, leaving, left, right, right, left) and, leftsided, lefted, leftside  erated by the embeddings."}, {"id": 127, "string": "The Spearman correlation is a rank-based correlation measure that assesses how well the scores describe the true labels."}, {"id": 128, "string": "The scores we use are cosine-similarity scores between the mean vectors."}, {"id": 129, "string": "In the case of Gaussian mixtures, we use the pairwise maximum score: s(f, g) = max i∈1,...,K max j∈1,...,K µ f,i · µ g,j ||µ f,i || · ||µ g,j || ."}, {"id": 130, "string": "(6) The pair (i, j) that achieves the maximum cosine similarity corresponds to the Gaussian component pair that is the closest in meanings."}, {"id": 131, "string": "Therefore, this similarity score yields the most related senses of a given word pair."}, {"id": 132, "string": "This score reduces to a cosine similarity in the Gaussian case (K = 1)."}, {"id": 133, "string": "Comparison Against Dictionary-Level Density Embeddings and FASTTEXT We compare our models against the dictionarylevel Gaussian and Gaussian mixture embeddings in Table 2 , with 50-dimensional and 300dimensional mean vectors."}, {"id": 134, "string": "The 50-dimensional results for W2G and W2GM are obtained directly from Athiwaratkun and Wilson (2017) ."}, {"id": 135, "string": "For comparison, we use the public code 3 to train the 300dimensional W2G and W2GM models and the publicly available FASTTEXT model 4 ."}, {"id": 136, "string": "We calculate Spearman's correlations for each of the word similarity datasets."}, {"id": 137, "string": "These datasets vary greatly in the number of word pairs; therefore, we mark each dataset with its size for visibil-ity."}, {"id": 138, "string": "For a fair and objective comparison, we calculate a weighted average of the correlation scores for each model."}, {"id": 139, "string": "Our PFT-GM achieves the highest average score among all competing models, outperforming both FASTTEXT and the dictionary-level embeddings W2G and W2GM."}, {"id": 140, "string": "Our unimodal model PFT-G also outperforms the dictionary-level counterpart W2G and FASTTEXT."}, {"id": 141, "string": "We note that the model W2GM appears quite strong according to Table 2 , beating PFT-GM on many word similarity datasets."}, {"id": 142, "string": "However, the datasets that W2GM performs better than PFT-GM often have small sizes such as MC-30 or RG-65, where the Spearman's correlations are more subject to noise."}, {"id": 143, "string": "Overall, PFT-GM outperforms W2GM by 3.1% and 8.7% in 300 and 50 dimensional models."}, {"id": 144, "string": "In addition, PFT-G and PFT-GM also outperform FASTTEXT by 1.2% and 3.7% respectively."}, {"id": 145, "string": "Comparison Against Multi-Prototype Models In Table 3 , we compare 50 and 300 dimensional PFT-GM models against the multi-prototype embeddings described in Section 2 and the existing multimodal density embeddings W2GM."}, {"id": 146, "string": "We use the word similarity dataset SCWS (Huang et al., 2012) which contains words with potentially many meanings, and is a benchmark for distinguishing senses."}, {"id": 147, "string": "We use the maximum similarity score (Equation 6), denoted as MAXSIM."}, {"id": 148, "string": "AVESIM denotes the average of the similarity scores, rather than the maximum."}, {"id": 149, "string": "We outperform the dictionary-based density embeddings W2GM in both 50 and 300 dimensions, demonstrating the benefits of subword information."}, {"id": 150, "string": "Our model achieves state-of-the-art results, similar to that of Neelakantan et al."}, {"id": 151, "string": "(2014) ."}, {"id": 152, "string": "Evaluation on Foreign Language Embeddings We evaluate the foreign-language embeddings on word similarity datasets in respective languages."}, {"id": 153, "string": "We use Italian WORDSIM353 and Italian SIMLEX-999 (Leviant and Reichart, 2015) for Italian models, GUR350 and GUR65 (Gurevych, 2005) for German models, and French WORD-SIM353 (Finkelstein et al., 2002) for French models."}, {"id": 154, "string": "For datasets GUR350 and GUR65, we use the results reported in the FASTTEXT publication (Bojanowski et al., 2016) ."}, {"id": 155, "string": "For other datasets, we train FASTTEXT models for comparison using the  public code 5 on our text corpuses."}, {"id": 156, "string": "We also train dictionary-level models W2G, and W2GM for comparison."}, {"id": 157, "string": "Table 4 shows the Spearman's correlation results of our models."}, {"id": 158, "string": "We outperform FASTTEXT on many word similarity benchmarks."}, {"id": 159, "string": "Our results are also significantly better than the dictionary-based models, W2G and W2GM."}, {"id": 160, "string": "We hypothesize that W2G and W2GM can perform better than the current reported results given proper pre-processing of words due to special characters such as accents."}, {"id": 161, "string": "We investigate the nearest neighbors of polysemies in foreign languages and also observe clear sense separation."}, {"id": 162, "string": "For example, piano in Italian can mean \"floor\" or \"slow\"."}, {"id": 163, "string": "These two meanings are reflected in the nearest neighbors where one component is close to piano-piano, pianod which mean \"slowly\" whereas the other component is close to piani (floors), istrutturazione (renovation) or infrastruttre (infrastructure)."}, {"id": 164, "string": "Table 5 shows additional results, demonstrating that the disentangled semantics can be observed in multiple languages."}, {"id": 165, "string": "Qualitative Evaluation -Subword Decomposition One of the motivations for using subword information is the ability to handle out-of-vocabulary words."}, {"id": 166, "string": "Another benefit is the ability to help improve the semantics of rare words via subword sharing."}, {"id": 167, "string": "Due to an observation that text corpuses follow Zipf's power law (Zipf, 1949) , words at the tail of the occurrence distribution appears much   less frequently."}, {"id": 168, "string": "Training these words to have a good semantic representation is challenging if done at the word level alone."}, {"id": 169, "string": "However, an ngram such as 'abnorm' is trained during both occurrences of \"abnormal\" and \"abnormality\" in the corpus, hence further augments both words's semantics."}, {"id": 170, "string": "Figure 3 shows the contribution of n-grams to the final representation."}, {"id": 171, "string": "We filter out to show only the n-grams with the top-5 and bottom-5 similarity scores."}, {"id": 172, "string": "We observe that the final representations of both words align with n-grams \"abno\", \"bnor\", \"abnorm\", \"anbnor\", \"<abn\"."}, {"id": 173, "string": "In fact, both \"abnormal\" and \"abnormality\" share the same top-5 n-grams."}, {"id": 174, "string": "Due to the fact that many rare words such as \"autobiographer\", \"circumnavigations\", or \"hypersensitivity\" are composed from many common sub-words, the n-gram structure can help improve the representation quality."}, {"id": 175, "string": "Numbers of Components It is possible to train our approach with K > 2 mixture components; however, Athiwaratkun and Wilson (2017) observe that dictionary-level Gaussian mixtures with K = 3 do not overall improve word similarity results, even though these mixtures can discover 3 distinct senses for certain words."}, {"id": 176, "string": "Indeed, while K > 2 in principle allows for greater flexibility than K = 2, most words can be very flexibly modelled with a mixture of two Gaussians, leading to K = 2 representing a good balance between flexibility and Occam's razor."}, {"id": 177, "string": "Even for words with single meanings, our PFT model with K = 2 often learns richer representations than a K = 1 model."}, {"id": 178, "string": "For example, the two mixture components can learn to cluster to-gether to form a more heavy tailed unimodal distribution which captures a word with one dominant meaning but with close relationships to a wide range of other words."}, {"id": 179, "string": "In addition, we observe that our model with K components can capture more than K meanings."}, {"id": 180, "string": "For instance, in K = 1 model, the word pairs (\"cell\", \"jail\") and (\"cell\", \"biology\") and (\"cell\", \"phone\") will all have positive similarity scores based on K = 1 model."}, {"id": 181, "string": "In general, if a word has multiple meanings, these meanings are usually compressed into the linear substructure of the embeddings (Arora et al., 2016) ."}, {"id": 182, "string": "However, the pairs of non-dominant words often have lower similarity scores, which might not accurately reflect their true similarities."}, {"id": 183, "string": "Conclusion and Future Work We have proposed models for probabilistic word representations equipped with flexible sub-word structures, suitable for rare and out-of-vocabulary words."}, {"id": 184, "string": "The proposed probabilistic formulation incorporates uncertainty information and naturally allows one to uncover multiple meanings with multimodal density representations."}, {"id": 185, "string": "Our models offer better semantic quality, outperforming competing models on word similarity benchmarks."}, {"id": 186, "string": "Moreover, our multimodal density models can provide interpretable and disentangled representations, and are the first multi-prototype embeddings that can handle rare words."}, {"id": 187, "string": "Future work includes an investigation into the trade-off between learning full covariance matrices for each word distribution, computational complexity, and performance."}, {"id": 188, "string": "This direction can potentially have a great impact on tasks where the variance information is crucial, such as for hierarchical modeling with probability distributions (Athiwaratkun and Wilson, 2018) ."}, {"id": 189, "string": "Other future work involves co-training PFT on many languages."}, {"id": 190, "string": "Currently, existing work on multi-lingual embeddings align the word semantics on pre-trained vectors (Smith et al., 2017) , which can be suboptimal due to polysemies."}, {"id": 191, "string": "We envision that the multi-prototype nature can help disambiguate words with multiple meanings and facilitate semantic alignment."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 33}, {"section": "Related Work", "n": "2", "start": 34, "end": 48}, {"section": "Probabilistic FastText", "n": "3", "start": 49, "end": 52}, {"section": "Probabilistic Subword Representation", "n": "3.1", "start": 53, "end": 64}, {"section": "Similarity Measure between Words", "n": "3.2", "start": 65, "end": 68}, {"section": "Loss Function", "n": "3.3", "start": 69, "end": 73}, {"section": "Energy Simplification", "n": "3.4", "start": 74, "end": 77}, {"section": "Word Sampling", "n": "3.5", "start": 78, "end": 84}, {"section": "Experiments", "n": "4", "start": 85, "end": 91}, {"section": "Training Details", "n": "4.1", "start": 92, "end": 106}, {"section": "Qualitative Evaluation -Nearest neighbors", "n": "4.2", "start": 107, "end": 117}, {"section": "Word Similarity Evaluation", "n": "4.3", "start": 118, "end": 132}, {"section": "Comparison Against Dictionary-Level Density Embeddings and FASTTEXT", "n": "4.3.1", "start": 133, "end": 144}, {"section": "Comparison Against Multi-Prototype Models", "n": "4.3.2", "start": 145, "end": 151}, {"section": "Evaluation on Foreign Language Embeddings", "n": "4.4", "start": 152, "end": 164}, {"section": "Qualitative Evaluation -Subword Decomposition", "n": "4.5", "start": 165, "end": 174}, {"section": "Numbers of Components", "n": "5", "start": 175, "end": 182}, {"section": "Conclusion and Future Work", "n": "6", "start": 183, "end": 191}], "figures": [{"filename": "../figure/image/1163-Table1-1.png", "caption": "Table 1: Nearest neighbors of PFT-GM (top) and PFT-G (bottom). The notation w:i denotes the ith mixture component of the word w.", "page": 5, "bbox": {"x1": 96.0, "x2": 502.08, "y1": 62.4, "y2": 261.12}}, {"filename": "../figure/image/1163-Table2-1.png", "caption": "Table 2: Spearman’s Correlation ρ× 100 on Word Similarity Datasets.", "page": 5, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 313.44, "y2": 484.32}}, {"filename": "../figure/image/1163-Table3-1.png", "caption": "Table 3: Spearman’s Correlation ρ× 100 on word similarity dataset SCWS.", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 512.16, "y1": 62.4, "y2": 235.2}}, {"filename": "../figure/image/1163-Figure1-1.png", "caption": "Figure 1: (1a) a Gaussian component and its subword structure. The bold arrow represents the final mean vector, estimated from averaging the grey n-gram vectors. (1b) PFT-G model: Each Gaussian component’s mean vector is a subword vector. (1c) PFT-GM model: For each Gaussian mixture distribution, one component’s mean vector is estimated by a subword structure whereas other components are dictionary-based vectors.", "page": 2, "bbox": {"x1": 78.72, "x2": 245.28, "y1": 63.839999999999996, "y2": 241.92}}, {"filename": "../figure/image/1163-Table4-1.png", "caption": "Table 4: Word similarity evaluation on foreign languages.", "page": 7, "bbox": {"x1": 144.0, "x2": 453.12, "y1": 62.879999999999995, "y2": 145.92}}, {"filename": "../figure/image/1163-Figure3-1.png", "caption": "Figure 3: Contribution of each n-gram vector to the final representation for word “abnormal” (top) and “abnormality” (bottom). The x-axis is the cosine similarity between each n-gram vector z(w)g and the final vector µw.", "page": 7, "bbox": {"x1": 339.84, "x2": 493.44, "y1": 351.84, "y2": 561.12}}, {"filename": "../figure/image/1163-Table5-1.png", "caption": "Table 5: Nearest neighbors of polysemies based on our foreign language PFT-GM models.", "page": 7, "bbox": {"x1": 72.0, "x2": 544.3199999999999, "y1": 181.44, "y2": 304.32}}]}