{"title": "Modelling Valence and Arousal in Facebook posts", "abstract": "Access to expressions of subjective personal posts increased with the popularity of Social Media. However, most of the work in sentiment analysis focuses on predicting only valence from text and usually targeted at a product, rather than affective states. In this paper, we introduce a new data set of 2895 Social Media posts rated by two psychologicallytrained annotators on two separate ordinal nine-point scales. These scales represent valence (or sentiment) and arousal (or intensity), which defines each post's position on the circumplex model of affect, a well-established system for describing emotional states (Russell, 1980; Posner et al., 2005) . The data set is used to train prediction models for each of the two dimensions from text which achieve high predictive accuracy -correlated at r = .65 with valence and r = .85 with arousal annotations. Our data set offers a building block to a deeper study of personal affect as expressed in social media. This can be used in applications such as mental illness detection or in automated large-scale psychological studies.", "text": [{"id": 0, "string": "Introduction Sentiment analysis is a very active research area that aims to identify, extract and analyze subjective information from text (Pang and Lee, 2008) ."}, {"id": 1, "string": "This generally includes identifying if a piece of text is subjective or objective, what sentiment it expresses (positive or negative; often referred to as valence), what emotion it conveys (Strapparava and Mihalcea, 2007 ) and towards which entity or aspect of the text i.e., aspect based sentiment analysis (Brody and Elhadad, 2010) ."}, {"id": 2, "string": "Downstream applications are mostly interested in automatically inferring public opinion about products or actions."}, {"id": 3, "string": "Besides expressing attitudes towards other objects, texts can also express the emotions of the ones writing them, most common recently with the rise of Social Media usage (Rosenthal et al., 2015) ."}, {"id": 4, "string": "This study focuses on presenting a gold standard data set as well as a model trained on this data in order to drive research in learning about the affective norms of people posting subjective messages."}, {"id": 5, "string": "This is of great interest to applications in social science which study text at a large scale and with orders of magnitude more users than traditional studies."}, {"id": 6, "string": "Emotion classification is a widely debated topic in psychology (Gendron and Barrett, 2009) ."}, {"id": 7, "string": "Two main theories about emotions exist: the first posits a discrete and finite set of emotions, while the second suggests that emotions are a combination of different scales."}, {"id": 8, "string": "Research in Natural Language Processing (NLP) has been focused mostly on Ekman's model of emotion (Ekman, 1992) which posits the existence of six basic emotions: anger, disgust, fear, joy, sadness and surprise (Strapparava and Valitutti, 2004; Strapparava and Mihalcea, 2008; Calvo and D'Mello, 2010) ."}, {"id": 9, "string": "In this study, we focus on the most popular dimensional model of emotion: the circumplex model introduced in (Russell, 1980) ."}, {"id": 10, "string": "This model suggests that all affective 9 states are represented in a two-dimensional space with two independent neurophysiological systems: valence (or sentiment) and arousal."}, {"id": 11, "string": "Any affective experience is a linear combination of these two independent systems, which is then interpreted as representing a particular emotion."}, {"id": 12, "string": "For example, fear is a state involving the combination of negative valence and high arousal (Posner et al., 2005) ."}, {"id": 13, "string": "Previous research in NLP focused mostly on valence or sentiment, either binary or having a strength component coupled with sentiment (Wilson et al., 2005; Thelwall et al., 2010; Thelwall et al., 2012) ."}, {"id": 14, "string": "In this paper we build a new data set consisting of 2895 anonymized Facebook posts labeled with both valence and arousal by two annotators with psychology training."}, {"id": 15, "string": "The ratings are made on two independent nine point scales, reaching a high agreement correlations of .768 for valence and .827 for arousal."}, {"id": 16, "string": "Data set statistics suggest that while the dimensions of valence and arousal are associated, they present distinct information, especially in posts with a clear positive or negative valence."}, {"id": 17, "string": "Further, we train a bag-of-words linear regression model to predict ratings of new messages."}, {"id": 18, "string": "This model achieves high correlation with actual mean ratings, reaching Pearson r = .85 correlation on the arousal dimension and r = .65 on the valence dimension without using any other sentiment analysis resources."}, {"id": 19, "string": "Comparing our method to other established lexicons for valence and arousal and methods from sentiment analysis, we demonstrate that these methods are not able to handle well the type of posts present in our data set."}, {"id": 20, "string": "We further illustrate the most correlated words with both dimensions and identify opportunities for improvement."}, {"id": 21, "string": "The data set and annotations are freely available online."}, {"id": 22, "string": "1 Data set We create a new data set with annotations on two independent scales: • Valence (or sentiment) represents the polarity of the affective content t in a post, rated on a nine point scale from 1 (very negative) to 5 (neutral/objective) to 9 (very positive); • Arousal (or intensity) represents the intensity of the affective content, rated on a nine point scale from 1 (neutral/objective post) to 9 (very high)."}, {"id": 23, "string": "Our corpus is comprised of Facebook status updates shared by participants as part of the MyPersonality Facebook application (Kosinski et al., 2013) , in which they also took a variety of questionnaires."}, {"id": 24, "string": "All authors have explicitly given permission to include their information in a corpus for research purposes."}, {"id": 25, "string": "We have manually anonymized the entire corpus by removing any references to other names of persons, addresses, telephone numbers, emails and URLs, and replaced them with placeholders."}, {"id": 26, "string": "In order to reduce biases due our participant demographics, the data set sample was stratified by gender and age and we have not rated more than two messages written by the same person."}, {"id": 27, "string": "Research is inconclusive about whether females express more emotions in general (Wester et al., 2002) ."}, {"id": 28, "string": "With regards to age, an age positivity bias has been found, where positive emotion expression increases with age (Mather and Carstensen, 2005; Kern et al., 2014) ."}, {"id": 29, "string": "The data originally consisted of 3120 posts."}, {"id": 30, "string": "All of these posts were annotated by the same two independent raters with a training in psychology."}, {"id": 31, "string": "The raters performed the coding in a similar environment without any distractions (e.g., no listening to music, no watching TV/videos) as these could have influenced the emotions of raters, and therefore the coding."}, {"id": 32, "string": "The annotators were instructed to sparingly rate messages as un-ratable when they were written in other languages than English or that offered no cues for a accurate rating (only characters with no meaning)."}, {"id": 33, "string": "The annotators were instructed to rate a message if they could judge at least a part of the message."}, {"id": 34, "string": "Then, the raters were asked to rate the two dimensions, valence and arousal, after they have explicitly been briefed that these should be independent of each other."}, {"id": 35, "string": "The raters were provided with anchors with specified valence and arousal and were instructed to rate neutral messages at the middle of the scale in terms of valence and 1 if they lacked arousal."}, {"id": 36, "string": "10   In total, 2895 messages were rated by both users in both dimensions."}, {"id": 37, "string": "Table 1 shows examples of posts rated in all quadrants of the circumplex model."}, {"id": 38, "string": "Dimension R1 µ ± σ R2 µ ± σ IA The correlation between the raters and the mean and standard deviation for each rater are presented in Table 2 ."}, {"id": 39, "string": "The inter-annotator agreement on deciding un-ratable posts is measured by Cohen's Kappa of κ = .93."}, {"id": 40, "string": "The histograms of ratings are presented in Figure 1 ."}, {"id": 41, "string": "The data set is released with the scores of both individual raters."}, {"id": 42, "string": "We study the correlation between the valence and arousal scores for posts in Table 3 ."}, {"id": 43, "string": "We chose to split values based on different valence thresholds in order to remove posts rated as neutral in valence (5) from the analysis, as they are expected to be low in intensity (1)."}, {"id": 44, "string": "We observed an overall correlation between the valence and arousal ratings, which holds for both positive and negative valence tweets when the neutral posts are removed (.222, .226 correlation)."}, {"id": 45, "string": "However, when the posts are both more positive and negative in valence, arousal is only mildly correlated (.047 and .085)."}, {"id": 46, "string": "This highlights that the Valence of posts 1-9 1-3.5 1-4 6-9 6.5-9 Correlation to arousal ."}, {"id": 47, "string": "presence of either positive and negative valence is correlated with a arousal score different than 1, but this correlation is weaker when the positive or negative valence passes a certain threshold (i.e."}, {"id": 48, "string": "3.5 and 6.5 respectively)."}, {"id": 49, "string": "We also note that the high overall correlation is also due to higher mean arousal for positive valence posts compared to negative posts (4.68 cf."}, {"id": 50, "string": "3.85) Figure 2 displays the relationship between the age of the user at posting time and the valence and arousal of their posts in our data set, and further divided by gender."}, {"id": 51, "string": "We notice some patterns emerge in our data."}, {"id": 52, "string": "Valence increases with age for both genders, especially at the start and end of our age intervals (13-16 and 30-35), confirming the aging positivity bias (Mather and Carstensen, 2005) ."}, {"id": 53, "string": "Valence is higher for females across almost the entire age range."}, {"id": 54, "string": "Posts written by females are also significantly higher in arousal for all age groups."}, {"id": 55, "string": "Age does not play a significant effect in post arousal, although there is a slight increase with age especially for females."}, {"id": 56, "string": "Overall, these figures again illustrate the importance of age and gender as factors to be considered in these types of application (Volkova et al., 2013; Hovy, 2015) ."}, {"id": 57, "string": "Predicting Valence and Arousal To study the linguistic differences of both dimensions, we build a bag-of-words prediction model of valence and arousal from our corpus."}, {"id": 58, "string": "2 We train two linear regression models with 2 regularisation on the posts and test their predictive power in a 10fold cross-validation setup."}, {"id": 59, "string": "Results for predicting the two scores are presented in Table 4 ."}, {"id": 60, "string": "We compare to a number of different existing general purpose lexicons."}, {"id": 61, "string": "First, we use the ANEW (Bradley and Lang, 1999) weighted dictionary to compute a valence and arousal score as the weighted sum of individual word valence and arousal scores."}, {"id": 62, "string": "Similarly, we use the affective norms  of words obtained by extending ANEW with human ratings for ∼14000 words (Warriner et al., 2013) ."}, {"id": 63, "string": "We also benchmark with standard methods for estimating valence from sentiment analysis."}, {"id": 64, "string": "First, we use the MPQA lexicon (Wilson et al., 2005) , which contains 7629 words rated for positive or negative sentiment, to obtain a score based on the difference between positive and negative words in the post."}, {"id": 65, "string": "Second, we use the NRC Hashtag Sentiment Lexicon (Mohammad et al., 2013) , which obtained the best performance on the Semeval Twitter Sentiment Analysis tasks."}, {"id": 66, "string": "3 Our method achieves very high correlations with the target score."}, {"id": 67, "string": "Arousal is easier to predict, reaching r = 0.85 correlation between predicted and rater score."}, {"id": 68, "string": "ANEW obtains significant correlations with both of our ratings, however these are significantly lower than our model."}, {"id": 69, "string": "The extended list of affective norms obtains, perhaps surprisingly, lower correlation for valence, but stronger correlation with arousal than ANEW."}, {"id": 70, "string": "For valence, both sentiment analysis lexicons provide better performance Table 4 : Prediction results for valence and arousal of posts reported in Pearson correlation on 10-fold cross-validation for the BOW model."}, {"id": 71, "string": "than the affective norms lexicons, albeit lower than our model trained on parts of the same data set."}, {"id": 72, "string": "The performance improvement is most likely driven by the domain of the data set."}, {"id": 73, "string": "While our method is trained on held-out data from the same domain in a cross-validation setup, the other methods suffer from lack of adaptation to this domain."}, {"id": 74, "string": "The NRC lexicon, trained for predicting sentiment on Twitter, obtains the highest performance of the established models, due to the fact that is trained on a more similar domain."}, {"id": 75, "string": "The lower performance of the existing models can also be explained by the fact that they predict a score used for classification into positive vs. negative, while our target score repre-12 sents the strength of the positive or negative expression."}, {"id": 76, "string": "Moreover, the affective norms scores are handcrafted dictionaries where the weights assigned to words are derived in isolation of context, contain no adaptations to new words, spellings and to the language use from Facebook."}, {"id": 77, "string": "Qualitative Analysis In this section we highlight the most important unigram features for each dimension as well as the qualitative difference between the two dimensions of valence and arousal."}, {"id": 78, "string": "To this end, we show the words with the highest univariate Pearson correlation with either of the two dimensions in Table 5 ."}, {"id": 79, "string": "Each score is represented by the mean of the two ratings."}, {"id": 80, "string": "The results show that both dimensions have similar top features as well as distinct ones."}, {"id": 81, "string": "Tokens such as '!"}, {"id": 82, "string": "', 'Happy', 'Birthday', 'Thanks', 'Wishes' are indicative of both positive valence and arousal, while tokens like 'Bored' and '...' are indicative of both negative valence and low arousal."}, {"id": 83, "string": "We notice however tokens that are only indicative of positive valence ('Wonderful', 'Love'), positive arousal ('Sunday', 'Yay'), negative valence ('Why', 'Stupid') or negative arousal ('Life', 'Every', 'People')."}, {"id": 84, "string": "The question mark is correlated to negative valence, together with the word 'Why', showing that questions on Facebook are usually negative in valence."}, {"id": 85, "string": "Also in terms of punctuation, positive valence and arousal is expressed through exclamation marks, while negative valence and especially arousal is expressed through repeated periods."}, {"id": 86, "string": "This behavior is specific to Social Media and which standard emotion lexicons usually does not capture."}, {"id": 87, "string": "Emoticons also exhibit an interesting pattern across the two dimensions."}, {"id": 88, "string": "The smiley :) is the second most correlated feature with valence, but is not in the top 10 for arousal."}, {"id": 89, "string": "Similarly, the frown emoticons (:(, :'() are amongst the top 10 features correlated with negative valence, but have no relationship with arousal."}, {"id": 90, "string": "The only emoticon correlated highly with low arousal is the undecided emoticon (:/ )."}, {"id": 91, "string": "Conclusion In this work, we introduced a new corpus of Social Media posts mapped to the circumplex model of affect."}, {"id": 92, "string": "Each post is annotated by two annotators with a background in psychology on two independent nine point scales of valence and arousal, who were calibrated before rating the statuses."}, {"id": 93, "string": "We described our annotation process and reviewed the annotation guidelines."}, {"id": 94, "string": "In total, we annotated 2895 Facebook posts, discarding the un-ratable ones."}, {"id": 95, "string": "The corpus and our valence and arousal bag-of-words prediction models are publicly available."}, {"id": 96, "string": "The results of the annotations have very high agreement."}, {"id": 97, "string": "A linear regression model using a bag of words representation trained on this data achieves high correlations with the outcome annotations, especially when predicting arousal."}, {"id": 98, "string": "Standard sentiment analysis lexicons predicted both dimensions with lower accuracies."}, {"id": 99, "string": "Our system can be further improved by leveraging the vast amount of available data for Twitter sentiment analysis."}, {"id": 100, "string": "We consider this model extremely useful for computational social science research that aims to measure individual user valence and arousal, its relationship to demographic traits and its changes over time or in relation to certain life events."}, {"id": 101, "string": "13"}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 21}, {"section": "Data set", "n": "2", "start": 22, "end": 56}, {"section": "Predicting Valence and Arousal", "n": "3", "start": 57, "end": 76}, {"section": "Qualitative Analysis", "n": "4", "start": 77, "end": 90}, {"section": "Conclusion", "n": "5", "start": 91, "end": 101}], "figures": [{"filename": "../figure/image/1173-Table2-1.png", "caption": "Table 2: Individual rater mean and standard deviation and inter-annotator correlation (IA Corr).", "page": 2, "bbox": {"x1": 73.92, "x2": 297.12, "y1": 72.96, "y2": 109.44}}, {"filename": "../figure/image/1173-Table3-1.png", "caption": "Table 3: Correlation with arousal and mean arousal values for different posts grouped by valence.", "page": 2, "bbox": {"x1": 314.88, "x2": 538.0799999999999, "y1": 72.0, "y2": 106.08}}, {"filename": "../figure/image/1173-Figure2-1.png", "caption": "Figure 2: Variation in valence and arousal with age in our data set using a LOESS fit. Data is split by gender: Male (coral orange) and Female (mint green).", "page": 2, "bbox": {"x1": 74.39999999999999, "x2": 297.12, "y1": 158.88, "y2": 338.88}}, {"filename": "../figure/image/1173-Table5-1.png", "caption": "Table 5: Words most correlated positively and negatively with the two dimensions.", "page": 4, "bbox": {"x1": 73.92, "x2": 297.12, "y1": 294.71999999999997, "y2": 566.4}}, {"filename": "../figure/image/1173-Table1-1.png", "caption": "Table 1: Example of posts annotated with average valence (V) and arousal (A) ratings.", "page": 3, "bbox": {"x1": 75.84, "x2": 536.16, "y1": 72.0, "y2": 141.12}}, {"filename": "../figure/image/1173-Table4-1.png", "caption": "Table 4: Prediction results for valence and arousal of posts reported in Pearson correlation on 10-fold cross-validation for the BOW model.", "page": 3, "bbox": {"x1": 342.71999999999997, "x2": 511.2, "y1": 385.91999999999996, "y2": 470.4}}, {"filename": "../figure/image/1173-Figure1-1.png", "caption": "Figure 1: Histrograms of average rating scores.", "page": 3, "bbox": {"x1": 98.39999999999999, "x2": 501.59999999999997, "y1": 187.68, "y2": 348.0}}]}