{"title": "Cross-Target Stance Classification with Self-Attention Networks", "abstract": "In stance classification, the target on which the stance is made defines the boundary of the task, and a classifier is usually trained for prediction on the same target. In this work, we explore the potential for generalizing classifiers between different targets, and propose a neural model that can apply what has been learned from a source target to a destination target. We show that our model can find useful information shared between relevant targets which improves generalization in certain scenarios.", "text": [{"id": 0, "string": "Introduction Stance classification is the task of automatically identifying users' positions about a specific target from text (Mohammad et al., 2017) ."}, {"id": 1, "string": "Table 1 shows an example of this task, where the stance of the sentence is recognized as favorable on the target climate change is concern."}, {"id": 2, "string": "Traditionally, this task is approached by learning a target-specific classifier that is trained for prediction on the same target of interest (Hasan and Ng, 2013; Mohammad et al., 2016; Ebrahimi et al., 2016) ."}, {"id": 3, "string": "This implies that a new classifier has to be built from scratch on a well-prepared set of ground-truth data whenever predictions are needed for an unseen target."}, {"id": 4, "string": "An alternative to this approach is to conduct a cross-target classification, where the classifier is adapted from different but related targets (Augenstein et al., 2016) , which allows benefiting from the knowledge of existing targets."}, {"id": 5, "string": "For example, in our project we are interested in online users' stances on the approvals of particular mining projects in the country."}, {"id": 6, "string": "It might be useful to start with a classifier that is adapted from a related target such as climate change is concern (presumably available and annotated), as in both cases Sentence: We need to protect our islands and stop the destruction of coral reef."}, {"id": 7, "string": "Target: Climate Change is Concern Stance: Favor Table 1 : An example of stance classification task."}, {"id": 8, "string": "users could discuss the impacts from the targets to some common issues, such as the environment or communities."}, {"id": 9, "string": "Cross-target stance classification is a more challenging task simply because the language models may not be compatible between different targets."}, {"id": 10, "string": "However, for some targets that can be recognized as being related to the same and more general domains, it could be possible to generalize through certain aspects of the domains that reflect users' major concerns."}, {"id": 11, "string": "For example, from the following sentence, whose stance is against the approval of a mining project, \"Environmentalists warn the $16 billion coal facility will damage the Great Barrier Reef\", it can be seen that both this sentence and the one in Table 1 mention the same aspect \"reef destruction/damage\", which is closely related to the \"environment\" domain."}, {"id": 12, "string": "In this paper, we focus on cross-target stance classification and explore the limits of generalizing models between different but domain-related targets 1 ."}, {"id": 13, "string": "The basic idea is to learn a set of domainspecific aspects from a source target, and then apply them to prediction on a destination target."}, {"id": 14, "string": "To this end, we propose CrossNet, a novel neural model that implements the above idea based on the self-attention mechanism."}, {"id": 15, "string": "Our preliminary analysis shows that the proposed model can find useful domain-specific information from a stancebearing sentence and that the classification performance is improved in certain domains."}, {"id": 16, "string": "Model In this section, we introduce the proposed model, CrossNet, for cross-target stance classification."}, {"id": 17, "string": "Figure 1 shows the architecture of CrossNet."}, {"id": 18, "string": "It consists of four layers from the Embedding Layer (bottom) to the Prediction Layer (top)."}, {"id": 19, "string": "It works by taking a stance-bearing sentence and a target as input and yielding the predicted stance label as output."}, {"id": 20, "string": "In the following, we present the implementation of each layer in CrossNet."}, {"id": 21, "string": "Embedding Layer There are two inputs in CrossNet: a stance-bearing sentence P and a descriptive target T (e.g, climate change is concern in Table 1)."}, {"id": 22, "string": "We use word embeddings (Mikolov et al., 2013) to represent each word in the input as a dense vector."}, {"id": 23, "string": "The output of this layer are two sequences of vectors P = {p 1 , ..., p |P | } and T = {t 1 , ..., t |T | }, where p, t are word vectors."}, {"id": 24, "string": "Context Encoding Layer In this layer, we encode the contextual information in the input sentence and target."}, {"id": 25, "string": "We use a bi-directional Long Short-Term Memory Network (BiLSTM) (Hochreiter and Schmidhuber, 1997) to capture the left and right contexts of each word in the input."}, {"id": 26, "string": "Moreover, to account for the impact of the target on stance inference, we borrow the idea of conditional encoding (Augenstein et al., 2016) to model the dependency of the sentence on the target."}, {"id": 27, "string": "Formally, we first use a BiLSTM T to encode the target: [ − → h T i − → c T i ] = − −−− → LSTM T (t i , − → h T i−1 , − → c T i−1 ) [ ← − h T i ← − c T i ] = ← −−− − LSTM T (t i , ← − h T i+1 , ← − c T i+1 ) (1) where h ∈ R h and c ∈ R h are the hidden state and cell state of LSTM."}, {"id": 28, "string": "The symbol − →(← −) indicates the forward (backward) pass."}, {"id": 29, "string": "t i is the input word vector at time step i."}, {"id": 30, "string": "Then, we learn a conditional encoding of the sentence P , by initializing BiLSTM P (a different BiLSTM) with the final states of BiLSTM T : [ − → h P 1 − → c P 1 ] = − −−− → LSTM P (p 1 , − → h T |T | , − → c T |T | ) [ ← − h P |P | ← − c P |P | ] = ← −−− − LSTM P (p |P | , ← − h T 1 , ← − c T 1 ) (2) It can be seen that the initialization is done by aligning the forward (backward) pass of the two BiLSTMs."}, {"id": 31, "string": "The output is a contextually-encoded sequence, H P = {h P 1 , ..., h P |P | }, where h = [ − → h ; ← − h ] ∈ R 2h with [; ] as the vector concatenation operation."}, {"id": 32, "string": "Aspect Attention Layer In this layer, we implement the idea of discovering domain-specific aspects for cross-target stance inference."}, {"id": 33, "string": "In particular, the key observation we make is that the domain aspects that reflect users' major concerns are usually the core of understanding their stances, and could be mentioned by multiple users in a discussion."}, {"id": 34, "string": "For example, we find that many users in our corpus mention the aspect \"reef\" to express their concerns about the impact of a mining project on the Great Barrier Reef."}, {"id": 35, "string": "Based on this observation, the perception of the domain aspects can be boiled down to finding the sentence parts that not only carry the core idea of a stance-bearing sentence but also tend to be recurring in the corpus."}, {"id": 36, "string": "First, to capture the recurrences of the domain aspects, a simple way is to make every input sentence be consumed by this layer (see Figure 1 ), so that the layer parameters are shared across the corpus for being stimulated by all appearances of the domain aspects."}, {"id": 37, "string": "Then, we utilize self-attention to signal the core parts of a stance-bearing sentence."}, {"id": 38, "string": "Self-attention is an attention mechanism for selecting specific parts of a sequence by relating its elements at different positions (Vaswani et al., 2017; Cheng et al., 2016) ."}, {"id": 39, "string": "In our case, the self-attention process is based on the assumption that the core parts of a sentence are those that are compatible with the semantics of the entire sentence."}, {"id": 40, "string": "To this end, we introduce a compatibility function to score the semantic compatibility between the encoded se-quence H P and each of its hidden states h P : c i = w 2 σ(W 1 h P i + b 1 ) + b 2 (3) where W 1 ∈ R d×2h , w 2 ∈ R d , b 1 ∈ R d , and b 2 ∈ R are trainable parameters, and σ is the activation function."}, {"id": 41, "string": "Note that all the above parameters are shared by every hidden state in H P ."}, {"id": 42, "string": "Next, we compute the attention weight a i for each h P i based on its compatibility score via softmax operation: a i = exp(c i ) |P | j=1 exp(c j ) (4) Finally, we can obtain the domain aspect encoded representation based on the attention weights: A P = |P | i=1 a i h P i (5) where A P ∈ R 2h is the domain aspect encoding for sentence P and also the output of this layer."}, {"id": 43, "string": "Prediction Layer We predict the stance label of the sentence based on its domain aspect encoding: y = softmax(MLP(A P )) (6) where we use a multilayer perceptron (MLP) to consume the domain aspect encoding A P and apply the softmax to get the predicted probability for each of the C classes,ŷ = {y 1 , ..., y C }."}, {"id": 44, "string": "Model Training For model training, we use multi-class crossentropy loss, J (θ) = − N i C j y (i) j logŷ (i) j + λ Θ (7) where N is the size of training set."}, {"id": 45, "string": "y is the groundtruth label indicator for each class, andŷ is the predicted probability."}, {"id": 46, "string": "λ is the coefficient for L 2regularization."}, {"id": 47, "string": "Θ denotes the set of all trainable parameters in our model."}, {"id": 48, "string": "Experiments This section reports the results of quantitative and qualitative evaluations of the proposed model."}, {"id": 49, "string": "Table 2 ."}, {"id": 50, "string": "Tweets on an Australian mining project (AM): the second is our collection of tweets on a mining project in Australia obtained using Twitter API."}, {"id": 51, "string": "It includes 220,067 tweets posted from January 2016 to June 2017 that contain the project name in the text."}, {"id": 52, "string": "We remove all URL-only tweets and duplicate tweets, and obtain a set of 40,852 (unlabeled) tweets."}, {"id": 53, "string": "Due to the lack of annotation, this dataset is only used for our qualitative evaluation."}, {"id": 54, "string": "To align with our scenario, the above targets can be categorized into three different domains: Women's Rights (FM, LA), American Politics (HC, DT), and Environments (CC, AM)."}, {"id": 55, "string": "Metric We use F1-score to measure the classification performance."}, {"id": 56, "string": "Due to the imbalanced class distributions of the SemEval dataset, we compute both micro-averaged (large classes dominate) and macro-averaged (small classes dominate) F1scores (Manning et al., 2008) , and use their average as the metric, i.e., F = 1 2 (F micro + F macro )."}, {"id": 57, "string": "To evaluate the effectiveness of target adaptation, we use the metric transfer ratio (Glorot et al., 2011) to compare the cross-target and in-target performance of a model: D) is the cross-target F1-score of a model trained on the source target S and tested on the destination target D, and F b (D, D) is the in-target F1-score of a baseline model trained and tested on the same target D, which serves as the performance calibration for target adaptation."}, {"id": 58, "string": "Q = F (S,D) F b (D,D) , where F (S, Training setup The word embeddings are initialized with the pretrained 200d GloVe word vectors on the 27B Twitter corpus (Pennington et al., 2014) , and fixed during training."}, {"id": 59, "string": "The model is trained (90%) and validated (10%) on a source target, and tested on a destination target."}, {"id": 60, "string": "The following model settings are selected based on a small grid search on the validation set: the LSTM hidden size of 60, the MLP layer size of 60, and dropout 0.1."}, {"id": 61, "string": "The L2-regularization coefficient λ in the loss is 0.01."}, {"id": 62, "string": "ADAM (Kingma and Ba, 2014) is used as the optimizer, with a learning rate of 10 −3 ."}, {"id": 63, "string": "Stratified 10-fold cross-validation is conducted to produce averaged results."}, {"id": 64, "string": "Classification Performance This section reports the results of our model and two baseline approaches on cross-target stance classification."}, {"id": 65, "string": "BiLSTM: this is a base model for our task."}, {"id": 66, "string": "It has two BiLSTMs for encoding the sentence and target separately."}, {"id": 67, "string": "Then, the concatenation of the resulting encodings is fed into the final Prediction Layer to generate predicted stance labels."}, {"id": 68, "string": "In our evaluation, this model is treated as the baseline model for deriving the in-target performance calibration F b (D, D)."}, {"id": 69, "string": "MITRE (Augenstein et al., 2016) best system in SemEval-2016 Task 6."}, {"id": 70, "string": "It utilizes the conditional encoding to learn a targetdependent representation for the input sentence."}, {"id": 71, "string": "The conditional encoding is realized in the same way as the Context Encoding Layer does in our model, namely by using the hidden states of the target-encoding BiLSTM to initialize the sentence-encoding BiLSTM."}, {"id": 72, "string": "Table 3 shows the results (in-target and crosstarget) on the two domains: Women's Rights and American Politics."}, {"id": 73, "string": "First, it is observed that MITRE outperforms BiLSTM over all target configurations, suggesting that, compared to simple concatenation, the conditional encoding of the target information could be more helpful to capture the dependency of the sentence on the target."}, {"id": 74, "string": "Second, our model is shown to achieve better results than the two baselines in almost all cases (only slightly worse than MITRE on LA under the in-target setting, and the difference is not statistically significant), which implies that the aspect attention mechanism adopted in our model could benefit target-level generalization while it does not hurt the in-target performance."}, {"id": 75, "string": "Moreover, by comparing the performance of our model under different target configurations, we see that the improvements brought by our model are more significant on the cross-target task than they are on the intarget task, with an average improvement of 6.6% (cross-target) vs. 3.0% (in-target) over MITRE in F1-score, which demonstrates a greater advantage of our model in the cross-target task."}, {"id": 76, "string": "Finally, according to the transfer ratio results, the general drop from the in-target to cross-target performance (26% averaged over all cases) could imply that while the target-independent information (i.e., the domain-specific aspects) is shown to benefit generalization, it could be important to also consider the information that is specific to the destination target for model building (which has not yet been explored in this work)."}, {"id": 77, "string": "Visualization of Attention To show that our model can select sentence parts that are related to domain aspects, we visualize the self-attention results on some tweet examples that are correctly classified by our model in Table 4 ."}, {"id": 78, "string": "We can see that the most highlighted parts in each example are relevant to the respective domain."}, {"id": 79, "string": "For example, \"feminist\", \"rights\", and \"equality\" are commonly used when talking about women's rights, and \"president\" and \"dreams\" of-   ten appear in text about politics."}, {"id": 80, "string": "It is also interesting to note that words that are specific to the destination target may not be captured by the model learned from the source target, such as \"abortion\" in sentence 1 and \"trumps\" in sentence 3."}, {"id": 81, "string": "This makes sense because those words are rare in the source target corpus and thus not well noticed by the model."}, {"id": 82, "string": "Finally, for our project, we can see from the last two sentences that the model learned from climate change is concern is able to concentrate on words that are central to understanding the authors' stances on the approval of the mining project, such as \"reef\", \"destroy\", \"environmental\", and \"disaster\"."}, {"id": 83, "string": "Overall, the above visualization demonstrates that our model could benefit stance inference across related targets through capturing domain-specific information."}, {"id": 84, "string": "Learned Domain-Specific Aspects Finally, it is also possible to show the learned domain aspects by extracting all sentence parts in a corpus that are highly attended by our model."}, {"id": 85, "string": "Table 5 presents a number of samples from the intersections between the sets of highly-attended words on the respective targets in the three domains."}, {"id": 86, "string": "Again, we see that these highly-attended words are specific to the respective domains."}, {"id": 87, "string": "We also notice that besides the domain-aspect words, our model can find words that carry sentiments as well, such as \"great\", \"crazy\", and \"beautiful\", which contribute to stance prediction."}, {"id": 88, "string": "Conclusion and Future Work In this work, we study cross-target stance classification and propose a novel self-attention neural model that can extract target-independent information for model generalization."}, {"id": 89, "string": "Experimental results show that the proposed model can perceive high-level domain-specific information in a sentence and achieves superior results over a number of baselines in certain domains."}, {"id": 90, "string": "In the future, there are several ways of extending our model."}, {"id": 91, "string": "First, selecting the effective source targets to generalize from is crucial for achieving satisfying results on the destination targets."}, {"id": 92, "string": "One possibility could be to learn certain correlations between target closeness and generalization performance, which could further be used for guiding the target selection process."}, {"id": 93, "string": "Second, our current model for identifying users' stances on mining projects only generalizes from one source target (i.e., Climate Change is Concern)."}, {"id": 94, "string": "However, a mining project in general could affect other aspects of our society such as community and economics."}, {"id": 95, "string": "It could be useful to also consider other related sources for knowledge transfer."}, {"id": 96, "string": "Finally, it would be interesting to evaluate our model in a multilingual scenario (Taulé et al., 2017) , in order to examine its generalization ability (whether it can attend to useful domain-specific information in a new language) and multilingual scope."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Model", "n": "2", "start": 16, "end": 20}, {"section": "Embedding Layer", "n": "2.1", "start": 21, "end": 23}, {"section": "Context Encoding Layer", "n": "2.2", "start": 24, "end": 31}, {"section": "Aspect Attention Layer", "n": "2.3", "start": 32, "end": 42}, {"section": "Prediction Layer", "n": "2.4", "start": 43, "end": 43}, {"section": "Model Training", "n": "2.5", "start": 44, "end": 47}, {"section": "Experiments", "n": "3", "start": 48, "end": 54}, {"section": "Metric", "n": "3.2", "start": 55, "end": 57}, {"section": "Training setup", "n": "3.3", "start": 58, "end": 63}, {"section": "Classification Performance", "n": "3.4", "start": 64, "end": 76}, {"section": "Visualization of Attention", "n": "3.5", "start": 77, "end": 83}, {"section": "Learned Domain-Specific Aspects", "n": "3.6", "start": 84, "end": 87}, {"section": "Conclusion and Future Work", "n": "4", "start": 88, "end": 96}], "figures": [{"filename": "../figure/image/1175-Table1-1.png", "caption": "Table 1: An example of stance classification task.", "page": 0, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 221.76, "y2": 259.2}}, {"filename": "../figure/image/1175-Figure1-1.png", "caption": "Figure 1: The Architecture of CrossNet.", "page": 1, "bbox": {"x1": 75.84, "x2": 286.08, "y1": 61.44, "y2": 235.2}}, {"filename": "../figure/image/1175-Table2-1.png", "caption": "Table 2: SemEval-2016 Task 6 Tweet Stance Detection dataset used in our evaluation.", "page": 2, "bbox": {"x1": 314.88, "x2": 518.4, "y1": 62.4, "y2": 132.0}}, {"filename": "../figure/image/1175-Table3-1.png", "caption": "Table 3: Classification performance of our model and other baselines on 4 targets: Feminist Movement (FM), Hillary Clinton (HC), Legalization of Abortion (LA), and Donald Trump (DT).", "page": 3, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 480.47999999999996, "y2": 700.3199999999999}}, {"filename": "../figure/image/1175-Table4-1.png", "caption": "Table 4: The heatmap of the attention weights assigned by the Aspect Attention Layer to the tweets with stance labels favor (F) and against (A). “[N]” denotes the mining project’s name of interest.", "page": 4, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 70.08, "y2": 171.35999999999999}}, {"filename": "../figure/image/1175-Table5-1.png", "caption": "Table 5: Samples of the learned domain aspects.", "page": 4, "bbox": {"x1": 80.64, "x2": 281.28, "y1": 213.6, "y2": 354.24}}]}