{"title": "Results of the fifth edition of the BioASQ Challenge", "abstract": "The goal of the BioASQ challenge is to engage researchers into creating cuttingedge biomedical information systems. Specifically, it aims at the promotion of systems and methodologies that are able to deal with a plethora of different tasks in the biomedical domain. This is achieved through the organization of challenges. The fifth challenge consisted of three tasks: semantic indexing, question answering and a new task on information extraction. In total, 29 teams with more than 95 systems participated in the challenge. Overall, as in previous years, the best systems were able to outperform the strong baselines. This suggests that stateof-the art systems are continuously improving, pushing the frontier of research.", "text": [{"id": 0, "string": "Introduction The aim of this paper is twofold."}, {"id": 1, "string": "First, we aim to give an overview of the data issued during the BioASQ challenge in 2017."}, {"id": 2, "string": "In addition, we aim to present the systems that participated in the challenge and evaluate their performance."}, {"id": 3, "string": "To achieve these goals, we begin by giving a brief overview of the tasks, which took place from February to May 2017, and the challenge's data."}, {"id": 4, "string": "Thereafter, we provide an overview of the systems that participated in the challenge."}, {"id": 5, "string": "Detailed descriptions of some of the systems are given in workshop proceedings."}, {"id": 6, "string": "The evaluation of the systems, which was carried out using state-of-the-art measures or manual assessment, is the last focal point of this paper, with remarks regarding the results of each task."}, {"id": 7, "string": "The conclusions sum up this year's challenge."}, {"id": 8, "string": "Overview of the Tasks The challenge comprised three tasks: (1) a largescale semantic indexing task (Task 5a), (2) a ques-tion answering task (Task 5b) and (3) a funding information extraction task (Task 5c), described in more detail in the following sections."}, {"id": 9, "string": "Large-scale semantic indexing -5a In Task 5a the goal is to classify documents from the PubMed digital library into concepts of the MeSH hierarchy."}, {"id": 10, "string": "Here, new PubMed articles that are not yet annotated by MEDLINE indexers are collected and used as test sets for the evaluation of the participating systems."}, {"id": 11, "string": "In contrast to previous years, articles from all journals were included in the test data sets of task 5a."}, {"id": 12, "string": "As soon as the annotations are available from the MEDLINE indexers, the performance of each system is calculated using standard flat information retrieval measures, as well as, hierarchical ones."}, {"id": 13, "string": "As in previous years, an on-line and large-scale scenario was provided, dividing the task into three independent batches of 5 weekly test sets each."}, {"id": 14, "string": "Participants had 21 hours to provide their answers for each test set."}, {"id": 15, "string": "Table  1 shows the number of articles in each test set of each batch of the challenge."}, {"id": 16, "string": "12,834,585 articles with 27,773 labels were provided as training data to the participants."}, {"id": 17, "string": "Biomedical semantic QA -5b The goal of Task 5b was to provide a largescale question answering challenge where the systems had to cope with all the stages of a question answering task for four types of biomedical questions: yes/no, factoid, list and summary questions (Balikas et al., 2013) ."}, {"id": 18, "string": "As in previous years, the task comprised two phases: In phase A, BioASQ released 100 questions and participants were asked to respond with relevant elements from specific resources, including relevant MEDLINE articles, relevant snippets extracted from the articles, relevant concepts and relevant RDF triples."}, {"id": 19, "string": "In phase B, the released questions were enhanced with relevant articles and snippets selected manu- ally and the participants had to respond with exact answers, as well as with summaries in natural language (dubbed ideal answers)."}, {"id": 20, "string": "The task was split into five independent batches and the two phases for each batch were run with a time gap of 24 hours."}, {"id": 21, "string": "In each phase, the participants received 100 questions and had 24 hours to submit their answers."}, {"id": 22, "string": "Funding information extraction -5c Task 5c was introduced for the first time this year and the challenge at hand was to extract grant in-formation from Biomedical articles."}, {"id": 23, "string": "Funding information can be very useful; in order to estimate, for example, the impact of an agency's funding in the biomedical scientific literature or to identify agencies actively supporting specific directions in research."}, {"id": 24, "string": "MEDLINE citations are annotated with information about funding from specified agencies 1 ."}, {"id": 25, "string": "This funding information is either provided by the author manuscript submission systems or extracted manually from the full text of articles during the indexing process."}, {"id": 26, "string": "In particular, NLM human indexers identify the grant ID and the funding agencies can be extracted from the string of the grant ID 2 ."}, {"id": 27, "string": "In some cases, only the funding agency is mentioned in the article, without the grant ID."}, {"id": 28, "string": "In this task funding information from MED-LINE was used, as golden data, in order to train and evaluate systems."}, {"id": 29, "string": "The systems were asked to extract grant information mentioned in the full text, but author-provided information is not necessarily mentioned in the article."}, {"id": 30, "string": "Therefore, grant IDs not mentioned in the article were filtered out."}, {"id": 31, "string": "This filtering also excluded grant IDs deviating from NLM's general policy of storing grant IDs as published, without any normalization."}, {"id": 32, "string": "When an agency was mentioned in the text without a grant ID, it was kept only if it appeared in the list of agencies and abbreviations provided by NLM."}, {"id": 33, "string": "Cases of misspellings or alternative naming of agencies were removed."}, {"id": 34, "string": "In addition, information for funding agencies that are no longer indexed by NLM was omitted."}, {"id": 35, "string": "Consequently, the golden data used in the task consisted of a subset of all funding information mentioned in the articles."}, {"id": 36, "string": "During the challenge, a training and a test dataset were prepared."}, {"id": 37, "string": "The test set of MED-LINE documents with their full-text available in PubMed Central was released and the participants were asked to extract grant IDs and grant agencies mentioned in each test article."}, {"id": 38, "string": "The participating systems were evaluated on (a) the extraction of grant IDs, (b) the extraction of grant agencies and (c) full-grant extraction, i.e."}, {"id": 39, "string": "the combination of grant ID and the corresponding funding agency."}, {"id": 40, "string": "For this task, 10 teams participated and results from 31 different systems were submitted."}, {"id": 41, "string": "In the following paragraphs we describe those systems for which a description was obtained, stressing their key characteristics."}, {"id": 42, "string": "An overview of the systems and their approaches can be seen in Table 4 ."}, {"id": 43, "string": "Table 4 : Systems and approaches for Task 5a."}, {"id": 44, "string": "Systems for which no description was available at the time of writing are omitted."}, {"id": 45, "string": "The \"Search system\" and its variants were developed as a UIMA-based text and data mining workflow, where different search strategies were adopted to automatically annotate documents with MeSH terms."}, {"id": 46, "string": "On the other hand, the \"MZ\" systems applied Binary Relevance (BR) classification, using TF-IDF features, and Latent Dirichlet allocation (LDA) models with label frequencies per journal as prior frequencies, using regression for threshold prediction."}, {"id": 47, "string": "A different approach is adopted by the \"Sequencer\" systems, developed by the team from the Technical University of Darmstadt, that considers the task as a sequenceto-sequence prediction problem and use recurrent neural networks based algorithm to cope with it."}, {"id": 48, "string": "The \"DeepMeSH\" systems implement document to vector (d2v) and tf-idf feature embeddings (Peng et al., 2016) , alongside the MESHLabeler system (Liu et al., 2015) that achieved the best scores overall, integrating multiple evidence using learning to rank (LTR)."}, {"id": 49, "string": "A similar approach, with regards to the d2v and tf-idf representations of the text, is followed by the \"AUTH\" team."}, {"id": 50, "string": "Regarding the learning algorithms they've extended their previous system (Papagiannopoulou et al., 2016) , improving the Labeled LDA and SVM base models, as well as introducing a new ensemble methodology based on label frequencies and multi-label stacking."}, {"id": 51, "string": "Last but not least, the team from the University of Vigo developed the \"Iria\" systems."}, {"id": 52, "string": "Building upon their previous approach (Ribadas et al., 2014) that uses an Apache Lucene Index to provide most similar citations, they developed two systems that follow a multilabel k-NN approach."}, {"id": 53, "string": "They also incorporated token bigrams and PMI scores to capture relevant multiword terms through a voting ensemble scheme and the ConceptMapper annotator tool, from the Apache UIMA project (Tanenblatt et al., 2010) , to match subject headings with the citation's abstract text."}, {"id": 54, "string": "Baselines: During the challenge, two systems served as baselines."}, {"id": 55, "string": "The first baseline is a stateof-the-art method called Medical Text Indexer (MTI) (Mork et al., 2014) with recent improvements incorporated as described in (Zavorin et al., 2016) ."}, {"id": 56, "string": "MTI is developed by the National Library of Medicine (NLM) and serves as a classification system for articles of MEDLINE, assisting the indexers in the annotation process."}, {"id": 57, "string": "The second baseline is an extension of the system MTI, incorporating features of the winning system of the first BioASQ challenge (Tsoumakas et al., 2013) ."}, {"id": 58, "string": "Task 5b The question answering task was tackled by 51 different systems, developed by 17 teams."}, {"id": 59, "string": "In the first phase, which concerns the retrieval of information required to answer a question, 9 teams with 25 systems participated."}, {"id": 60, "string": "In the second phase, where teams are requested to submit exact and ideal answers, 10 teams with 29 different systems participated."}, {"id": 61, "string": "Two of the teams participated in both phases."}, {"id": 62, "string": "An overview of the technologies employed by each team can be seen in Table 5 ."}, {"id": 63, "string": "The \"Basic QA pipeline\" approach is one of the two that participated in both Phases."}, {"id": 64, "string": "It uses MetaMap for query expansion, taking into account  the text and the title of each article, and the BM25 probabilistic model (Robertson et al., 1995) in order to match questions with documents, snippets etc."}, {"id": 65, "string": "The same goes for phase B, except for the exact answers, where stop words were removed and the top-k most frequent words were selected."}, {"id": 66, "string": "\"Olelo\" is the second approach that tackles both phases of task B."}, {"id": 67, "string": "It is built on top of the SAP HANA database and uses various NLP components, such as question processing, document and passage retrieval, answer processing and multidocument summarization based on previous approaches (Schulze et al., 2016) to develop a comprehensive system that retrieves relevant information and provides both exact and ideal answers for biomedical questions."}, {"id": 68, "string": "Semantic role labeling (SRL) based extensions were also investigated."}, {"id": 69, "string": "One of the teams that participated only in phase A, is \"USTB\" who combined different strategies to enrich query terms."}, {"id": 70, "string": "Specifically, sequential dependence models (Metzler and Croft, 2005) , pseudorelevance feedback models, fielded sequential dependence models and divergence from random-ness models are used on the training data to create better search queries."}, {"id": 71, "string": "The \"fdu\" systems, as in previous years , use a language model in order to retrieve relevant documents and keyword scoring with word similarity for snippet extraction."}, {"id": 72, "string": "The \"UNCC\" team on the other hand, focused mainly on the retrieval of relevant concepts and articles using the Stanford Parser (Chen and Manning, 2014) and semantic indexing."}, {"id": 73, "string": "In Phase B, the Macquarie University (MQU) team focused on ideal answers (Molla, 2017), submitting different models ranging from a \"trivial baseline\" of relevant snippets to deep learning under regression settings (Malakasiotis et al., 2015) and neural networks with word embeddings."}, {"id": 74, "string": "The Carnegie Mellon University team (\"OAQA\"), focused also on ideal answer generation, building upon previous versions of the \"OAQA\" system."}, {"id": 75, "string": "They used extractive summarization techniques and experimented with different biomedical ontologies and algorithms including agglomerative clustering, Maximum Marginal Relevance and sentence compression."}, {"id": 76, "string": "They also introduced a novel similarity metric that incorporates both semantic information (using word embeddings) and tf-idf statistics for each sentence/question."}, {"id": 77, "string": "Many systems used a modular approach breaking the problem down to question analysis, candidate answer generation and answer ranking."}, {"id": 78, "string": "The \"LabZhu\" systems, followed this approach, based on previous years' methodologies ."}, {"id": 79, "string": "In particular, they applied rule-based question type analysis and used Standford POS tool and PubTator for candidate answer generation."}, {"id": 80, "string": "They also used word frequencies for candidate answer ranking."}, {"id": 81, "string": "The \"DeepQA\" systems focused on factoid and list questions, using an extractive QA model, restricting the system to output substrings of the provided text snippets."}, {"id": 82, "string": "At the core of their system stands a state-of-the-art neural QA system, namely FastQA (Weissenborn et al., 2017) , extended with biomedical word embeddings."}, {"id": 83, "string": "The model was pre-trained on a large-scale opendomain QA dataset, SQuAD (Rajpurkar et al., 2016) , and then the parameters were fine-tuned on the BioASQ training set."}, {"id": 84, "string": "Finally, the \"sarrouti\" system, from Morocco's USMBA, uses among others a dictionary approach, term frequencies of UMLS metathesaurus' concepts and the BM25 model."}, {"id": 85, "string": "Baselines: For this challenge the open source OAQA system proposed by (Yang et al., 2016) for BioASQ4 was used as a strong baseline."}, {"id": 86, "string": "This system, as well as its previous version (Yang et al., 2015) for BioASQ3, had achieved top performance in producing exact answers."}, {"id": 87, "string": "The system uses an UIMA based framework to combine different components."}, {"id": 88, "string": "Question and snippet parsing is based on ClearNLP."}, {"id": 89, "string": "MetaMap, TmTool, C-Value and LingPipe are used for concept identification and UMLS Terminology Services (UTS) for concept retrieval."}, {"id": 90, "string": "In addition, identification of concept, document and snippet relevance is based on classifier components and scoring, ranking and reranking techniques are also applied in the final steps."}, {"id": 91, "string": "Task 5c In this inaugural year for task c, 3 teams participated with a total of 11 systems."}, {"id": 92, "string": "A brief outline of the techniques used by the participating systems is provided in table 6."}, {"id": 93, "string": "Systems Approach Simple regions of interest, SVM, regular expressions, hand-made rules, char-distances, ensemble DZG regions of interest, SVM, tf-idf of bigrams, HMMs, MaxEnt, CRFs, ensemble AUTH regions of interest, regular expressions Table 6 : Overview of the methodologies used by the participating systems in Task 5c."}, {"id": 94, "string": "The Fudan University team, participated with a series of similar systems (\"Simple\" systems) as well as their ensemble."}, {"id": 95, "string": "The general approach included the following steps: First, the articles were parsed and some sections, such as affiliation or references, were removed."}, {"id": 96, "string": "Then, using NLP techniques, alongside pre-defined rules, each paragraph was split into sentences."}, {"id": 97, "string": "These sentences were classified as positive (i.e."}, {"id": 98, "string": "containing grant information) or not, using a linear SVM."}, {"id": 99, "string": "The positive sentences were scanned for grant IDs and agencies through the use of regular expressions and hand-made rules."}, {"id": 100, "string": "Finally, multiple classifiers were trained in order to merge grant IDs and agencies into suitable pairs, based on a wide range of features, such as character-level features of the grant ID, the agency in the sentence and the distance between the grant ID and the agency in the sentence."}, {"id": 101, "string": "The \"DZG\" systems followed a similar methodology, in order to classify snippets of text as possible grant information sources, implementing a linear SVM with tf-idf vectors of bigrams as input features."}, {"id": 102, "string": "However, their methodology differed from that of Fudan in two ways."}, {"id": 103, "string": "Firstly, they used an in-house-created dataset consisting of more than 1,600 articles with grant information in order to train their systems."}, {"id": 104, "string": "Secondly, the systems deployed were based on a variety of sequential learning models namely conditional random fields (Finkel et al., 2005) , hidden markov models (Collins, 2002) and maximum entropy models (Ratnaparkhi, 1998 )."}, {"id": 105, "string": "The final system deployed was a pooling ensemble of these three approaches, in order to maximize recall and exploit complementarity between predictions of different models."}, {"id": 106, "string": "Likewise, the AUTH team, with systems \"Asclepius\", \"Gallen\" and \"Hippocrates\" emphasized on specific sections of the text that could contain grant support information and extracted grant IDs and agencies using regular expressions."}, {"id": 107, "string": "Baselines: For this challenge a baseline was provided by NLM (\"BioASQ Filtering\") which is based on a two-step procedure."}, {"id": 108, "string": "First, the system classifies snippets from the full-text, as possible grant support \"zones\" based on the average probability ratio, generated separately by Naive Bayes (Zhang et al., 2009 ) and SVM (Kim et al., 2009) ."}, {"id": 109, "string": "Then, the system identified grant IDs and agencies in these selected grant support \"zones\", using mainly heuristic rules, such as regular expressions, especially for detecting uncommon and irregularly formatted grant IDs."}, {"id": 110, "string": "Results Task 5a Each of the three batches of task 5a was evaluated independently."}, {"id": 111, "string": "The classification performance of the systems was measured using flat and hierarchical evaluation measures (Balikas et al., 2013) ."}, {"id": 112, "string": "The micro F-measure (MiF) and the Lowest Common Ancestor F-measure (LCA-F) were used to choose the winners for each batch (Kosmopoulos et al., 2013) ."}, {"id": 113, "string": "According to (Demsar, 2006) the appropriate way to compare multiple classification systems over multiple datasets is based on their average rank across all the datasets."}, {"id": 114, "string": "On each dataset the system with the best performance gets rank 1.0, Table 7 : Average system ranks across the batches of the Task 5a."}, {"id": 115, "string": "A hyphenation symbol (-) is used whenever the system participated in fewer than 4 tests in the batch."}, {"id": 116, "string": "Systems with fewer than 4 participations in all batches are omitted."}, {"id": 117, "string": "the second best rank 2.0 and so on."}, {"id": 118, "string": "In case two or more systems tie, they all receive the average rank."}, {"id": 119, "string": "Table 7 presents the average rank (according to MiF and LCA-F) of each system over all the test sets for the corresponding batches."}, {"id": 120, "string": "Note, that the average ranks are calculated for the 4 best results of each system in the batch according to the rules of the challenge."}, {"id": 121, "string": "On both test batches and for both flat and hierarchical measures, the DeepMeSH systems (Peng et al., 2016) and the AUTH systems outperform the strong baselines, indicating the importance of the methodologies proposed, including d2v and tf-idf transformations to generate feature embeddings, for semantic indexing."}, {"id": 122, "string": "More detailed results can be found in the online results page 3 ."}, {"id": 123, "string": "3 http://participants-area.bioasq.org/ results/5a/ Task 5b Phase A: For phase A and for each of the four types of annotations: documents, concepts, snippets and RDF triples, we rank the systems according to the Mean Average Precision (MAP) measure."}, {"id": 124, "string": "The final ranking for each batch is calculated as the average of the individual rankings in the different categories."}, {"id": 125, "string": "In tables 8 and 9 some indicative results from batch 3 are presented."}, {"id": 126, "string": "Full results are available in the online results page of task 5b, phase A 4 ."}, {"id": 127, "string": "It is worth noting that document and snippet retrieval for the given questions were the most popular part of the task."}, {"id": 128, "string": "Moreover, for different evaluation metrics, there are different systems performing best, indicating that different approaches to the task may be preferable depending on the target Table 9 : Results for document retrieval in batch 3 of phase A of Task 5b."}, {"id": 129, "string": "outcome."}, {"id": 130, "string": "For example, one can see that the UNCC System 1 performed the best on some unordered measures, namely mean precision and f-measure, however using MAP or GMAP to consider the order of retrieved elements, it is out preformed by other systems, such as the ustb-prir."}, {"id": 131, "string": "Additionally, the combination of some of these approaches seem like a promising direction for future research."}, {"id": 132, "string": "Phase B: In phase B of Task 5b the systems were asked to produce exact and ideal answers."}, {"id": 133, "string": "For ideal answers, the systems will eventually be ranked according to manual evaluation by the BioASQ experts (Balikas et al., 2013) ."}, {"id": 134, "string": "Regarding exact answers 5 , the systems were ranked according to accuracy for the yes/no questions, mean reciprocal rank (MRR) for the factoids and mean  F-measure for the list questions."}, {"id": 135, "string": "Table 10 shows the results for exact answers for the fourth batch of task 5b."}, {"id": 136, "string": "The symbol (-) is used when systems don't provide exact answers for a particular type of question."}, {"id": 137, "string": "The full results of phase B of task 5b are available online 6 ."}, {"id": 138, "string": "From the results presented in Table 10 , it can be seen that systems achieve high scores in the yes/no questions."}, {"id": 139, "string": "This was especially in the first batches, where a high imbalance in yes-no classes leaded to trivial baseline solutions being very strong."}, {"id": 140, "string": "This was amended in the later batches, as shown in the table for batch 4, where the best systems outper-6 http://participants-area.bioasq.org/ results/5b/phaseB/ form baseline approaches."}, {"id": 141, "string": "On the other hand, the performance in factoid and list questions indicates that there is more room for improvement in these types of answer."}, {"id": 142, "string": "Task 5c Regarding the evaluation of Task 5c and taking into account the fact that only a subset of grant IDs and agencies mentioned in the full text were included in the ground truth data sets, both for training and testing, micro-recall was the evaluation measure used for all three sub-tasks."}, {"id": 143, "string": "This means that each system was assigned a micro-recall score for grant IDs, agencies and full-grants independently and the top-two contenders for each sub-  task were selected as winners."}, {"id": 144, "string": "The results of the participating systems can be seen in Table 11 ."}, {"id": 145, "string": "Firstly, it can be seen that the grant ID extraction task is harder compared to the agency extraction."}, {"id": 146, "string": "Moreover, the overall performance of the participants was very good, and certainly better than the baseline system."}, {"id": 147, "string": "This indicates that the currently deployed techniques can be improved and as discussed in section 3.3, this can be done through the use of multiple methodologies."}, {"id": 148, "string": "Finally, these results, despite being obtained on a filtered subset of the data available, could serve as a springboard to enhance and redeploy the currently implemented systems."}, {"id": 149, "string": "Conclusion In this paper, an overview of the fifth BioASQ challenge is presented."}, {"id": 150, "string": "The challenge consisted of three tasks: semantic indexing, question answering and funding information extraction."}, {"id": 151, "string": "Overall, as in previous years, the best systems were able to outperform the strong baselines provided by the organizers."}, {"id": 152, "string": "This suggests that advances over the state of the art were achieved through the BioASQ challenge but also that the benchmark in itself is challenging."}, {"id": 153, "string": "Consequently, we believe that the challenge is successfully towards pushing the research frontier in on biomedical information systems."}, {"id": 154, "string": "In future editions of the challenge, we aim to provide even more benchmark data derived from a community-driven acquisition process and design a multi-batch scenario for Task 5c similar to the other tasks."}, {"id": 155, "string": "Finally, as a concluding remark, it is worth mentioning that the increase in challenge participation this year 7 highlights the healthy growth of the BioASQ community, gathering attention from different teams around the globe and constituting a reference point for biomedical semantic indexing and question answering."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 6}, {"section": "Overview of the Tasks", "n": "2", "start": 7, "end": 8}, {"section": "Large-scale semantic indexing -5a", "n": "2.1", "start": 9, "end": 16}, {"section": "Biomedical semantic QA -5b", "n": "2.2", "start": 17, "end": 21}, {"section": "Funding information extraction -5c", "n": "2.3", "start": 22, "end": 57}, {"section": "Task 5b", "n": "3.2", "start": 58, "end": 89}, {"section": "Task 5c", "n": "3.3", "start": 90, "end": 109}, {"section": "Task 5a", "n": "4.1", "start": 110, "end": 122}, {"section": "Task 5b", "n": "4.2", "start": 123, "end": 141}, {"section": "Task 5c", "n": "4.3", "start": 142, "end": 148}, {"section": "Conclusion", "n": "5", "start": 149, "end": 155}], "figures": [{"filename": "../figure/image/1201-Table7-1.png", "caption": "Table 7: Average system ranks across the batches of the Task 5a. A hyphenation symbol (-) is used whenever the system participated in fewer than 4 tests in the batch. Systems with fewer than 4 participations in all batches are omitted.", "page": 5, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 64.8, "y2": 431.03999999999996}}, {"filename": "../figure/image/1201-Table1-1.png", "caption": "Table 1: Statistics on test datasets for Task 5a.", "page": 1, "bbox": {"x1": 77.75999999999999, "x2": 284.15999999999997, "y1": 62.879999999999995, "y2": 352.32}}, {"filename": "../figure/image/1201-Table2-1.png", "caption": "Table 2: Statistics on the training and test datasets of Task 5b. All the numbers for the documents and snippets refer to averages.", "page": 1, "bbox": {"x1": 75.84, "x2": 286.08, "y1": 536.64, "y2": 647.04}}, {"filename": "../figure/image/1201-Table8-1.png", "caption": "Table 8: Results for snippet retrieval in batch 3 of phase A of Task 5b.", "page": 6, "bbox": {"x1": 73.92, "x2": 523.1999999999999, "y1": 65.28, "y2": 281.28}}, {"filename": "../figure/image/1201-Table9-1.png", "caption": "Table 9: Results for document retrieval in batch 3 of phase A of Task 5b.", "page": 6, "bbox": {"x1": 73.92, "x2": 523.1999999999999, "y1": 313.44, "y2": 600.0}}, {"filename": "../figure/image/1201-Table4-1.png", "caption": "Table 4: Systems and approaches for Task 5a. Systems for which no description was available at the time of writing are omitted.", "page": 2, "bbox": {"x1": 80.64, "x2": 281.28, "y1": 293.76, "y2": 474.24}}, {"filename": "../figure/image/1201-Table10-1.png", "caption": "Table 10: Results for batch 4 for exact answers in phase B of Task 5b.", "page": 7, "bbox": {"x1": 76.8, "x2": 521.28, "y1": 64.8, "y2": 512.16}}, {"filename": "../figure/image/1201-Table5-1.png", "caption": "Table 5: Systems and approaches for Task 5b. Systems for which no information was available at the time of writing are omitted.", "page": 3, "bbox": {"x1": 74.88, "x2": 287.03999999999996, "y1": 62.879999999999995, "y2": 380.15999999999997}}, {"filename": "../figure/image/1201-Table11-1.png", "caption": "Table 11: Micro Recall (MR) results on the test set of Task 5c.", "page": 8, "bbox": {"x1": 74.88, "x2": 523.1999999999999, "y1": 64.8, "y2": 240.95999999999998}}, {"filename": "../figure/image/1201-Table6-1.png", "caption": "Table 6: Overview of the methodologies used by the participating systems in Task 5c.", "page": 4, "bbox": {"x1": 72.0, "x2": 293.28, "y1": 362.88, "y2": 474.24}}]}