{"title": "Breaking NLI Systems with Sentences that Require Simple Lexical Inferences", "abstract": "We create a new NLI test set that shows the deficiency of state-of-the-art models in inferences that require lexical and world knowledge. The new examples are simpler than the SNLI test set, containing sentences that differ by at most one word from sentences in the training set. Yet, the performance on the new test set is substantially worse across systems trained on SNLI, demonstrating that these systems are limited in their generalization ability, failing to capture many simple inferences. Introduction Recognizing textual entailment (RTE) (Dagan et al., 2013) , recently framed as natural language inference (NLI) (Bowman et al., 2015) is a task concerned with identifying whether a premise sentence entails, contradicts or is neutral with the hypothesis sentence. Following the release of the large-scale SNLI dataset (Bowman et al., 2015) , many end-to-end neural models have been developed for the task, achieving high accuracy on the test set. As opposed to previous-generation methods, which relied heavily on lexical resources, neural models only make use of pre-trained word embeddings. The few efforts to incorporate external lexical knowledge resulted in negligible performance gain (Chen et al., 2018) . This raises the question whether (1) neural methods are inherently stronger, obviating the need of external lexical knowledge; (2) large-scale training data allows for implicit learning of previously explicit lexical knowledge; or (3) the NLI datasets are simpler than early RTE datasets, requiring less knowledge. 1  The contradiction example follows the assumption in Bowman et al. (2015) that the premise contains the most prominent information in the event, hence the premise can't describe the event of a man holding both instruments.", "text": [{"id": 0, "string": "Premise/Hypothesis Label The man is holding a saxophone contradiction 1 The man is holding an electric guitar A little girl is very sad."}, {"id": 1, "string": "entailment A little girl is very unhappy."}, {"id": 2, "string": "A couple drinking wine neutral A couple drinking champagne In this paper we show that state-of-the-art NLI systems are limited in their generalization ability, and fail to capture many simple inferences that require lexical and world knowledge."}, {"id": 3, "string": "Inspired by the work of Jia and Liang (2017) on reading comprehension, we create a new NLI test set with examples that capture various kinds of lexical knowledge (Table 1 )."}, {"id": 4, "string": "For example, that champagne is a type of wine (hypernymy), and that saxophone and electric guitar are different musical instruments (co-hyponyms)."}, {"id": 5, "string": "To isolate lexical knowledge aspects, our constructed examples contain only words that appear both in the training set and in pre-trained embeddings, and differ by a single word from sentences in the training set."}, {"id": 6, "string": "The performance on the new test set is substantially worse across systems, demonstrating that the SNLI test set alone is not a sufficient measure of language understanding capabilities."}, {"id": 7, "string": "Our results are in line with Gururangan et al."}, {"id": 8, "string": "(2018) and Poliak et al."}, {"id": 9, "string": "(2018) , who showed that the label can be identified by looking only at the hypothesis and exploiting annotation artifacts such as word choice and sentence length."}, {"id": 10, "string": "Further investigation shows that what mostly affects the systems' ability to correctly predict a test example is the amount of similar examples found in the training set."}, {"id": 11, "string": "Given that training data will always be limited, this is a rather inefficient way to learn lexical inferences, stressing the need to develop methods that do this more effectively."}, {"id": 12, "string": "Our test set can be used to evaluate such models' ability to recognize lexical inferences, and it is available at https://github."}, {"id": 13, "string": "com/BIU-NLP/Breaking_NLI."}, {"id": 14, "string": "2 Background NLI Datasets."}, {"id": 15, "string": "The SNLI dataset (Stanford Natural Language Inference, Bowman et al., 2015) consists of 570k sentence-pairs manually labeled as entailment, contradiction, and neutral."}, {"id": 16, "string": "Premises are image captions from Young et al."}, {"id": 17, "string": "(2014) , while hypotheses were generated by crowd-sourced workers who were shown a premise and asked to generate entailing, contradicting, and neutral sentences."}, {"id": 18, "string": "Workers were instructed to judge the relation between sentences given that they describe the same event."}, {"id": 19, "string": "Hence, sentences that differ by a single mutually-exclusive term should be considered contradicting, as in \"The president visited Alabama\" and \"The president visited Mississippi\"."}, {"id": 20, "string": "This differs from traditional RTE datasets, which do not assume event coreference, and in which such sentence-pairs would be considered neutral."}, {"id": 21, "string": "Following criticism on the simplicity of the dataset, stemming mostly from its narrow domain, two additional datasets have been collected."}, {"id": 22, "string": "The MultiNLI dataset (Multi-Genre Natural Language Inference, Williams et al., 2018) was collected similarly to SNLI, though covering a wider range of genres, and supporting a cross-genre evaluation."}, {"id": 23, "string": "The SciTail dataset (Khot et al., 2018) , created from science exams, is somewhat different from the two datasets, being smaller (27,026 examples), and labeled only as entailment or neutral."}, {"id": 24, "string": "The domain makes this dataset different in nature from the other two datasets, and it consists of more factual sentences rather than scene descriptions."}, {"id": 25, "string": "Neural Approaches for NLI."}, {"id": 26, "string": "Following the release of SNLI, there has been tremendous interest in the task, and many end-to-end neural models were developed, achieving promising results."}, {"id": 27, "string": "2 Methods are divided into two main approaches."}, {"id": 28, "string": "Sentence-encoding models (e.g."}, {"id": 29, "string": "Bowman et al., 2015 Bowman et al., , 2016 Nie and Bansal, 2017; Shen et al., 2018) encode the premise and hypothesis individually, while attention-based models align words in the premise with similar words in the hypothesis, encoding the two sentences together (e.g."}, {"id": 30, "string": "Rocktäschel et al., 2016; Chen et al., 2017) ."}, {"id": 31, "string": "External Lexical Knowledge."}, {"id": 32, "string": "Traditional RTE methods typically relied on resources such as WordNet (Fellbaum, 1998) to identify lexical inferences."}, {"id": 33, "string": "Conversely, neural methods rely solely on pre-trained word embeddings, yet, they achieve high accuracy on SNLI."}, {"id": 34, "string": "The only neural model to date that incorporates external lexical knowledge (from WordNet) is KIM (Chen et al., 2018) , however, gaining only a small addition of 0.6 points in accuracy on the SNLI test set."}, {"id": 35, "string": "This raises the question whether the small performance gap is a result of the model not capturing lexical knowledge well, or the SNLI test set not requiring this knowledge in the first place."}, {"id": 36, "string": "Data Collection We construct a test set with the goal of evaluating the ability of state-of-the-art NLI models to make inferences that require simple lexical knowledge."}, {"id": 37, "string": "We automatically generate sentence pairs ( §3.1) which are then manually verified ( §3.2)."}, {"id": 38, "string": "Generating Adversarial Examples In order to isolate the lexical knowledge aspects, the premises are taken from the SNLI training set."}, {"id": 39, "string": "For each premise we generate several hypotheses by replacing a single word within the premise by a different word."}, {"id": 40, "string": "We also allow some multi-word noun phrases (\"electric guitar\") and adapt determiners and prepositions when needed."}, {"id": 41, "string": "We focus on generating only entailment and contradiction examples, while neutral examples may be generated as a by-product."}, {"id": 42, "string": "Entailment examples are generated by replacing a word with its synonym or hypernym, while contradiction examples are created by replacing words with mutually exclusive co-hyponyms and antonyms (see Table 1 )."}, {"id": 43, "string": "The generation steps are detailed below."}, {"id": 44, "string": "Replacement Words."}, {"id": 45, "string": "We collected the replacement words using online resources for English learning."}, {"id": 46, "string": "3 The newly introduced words are all present in the SNLI training set: from occurrence in a single training example (\"Portugal\") up to 248,051 examples (\"man\"), with a mean of 3,663.1 and a median of 149.5."}, {"id": 47, "string": "The words are also available in the pre-trained embeddings vocabulary."}, {"id": 48, "string": "The goal of this constraint is to isolate lexical knowledge aspects, and evaluate the models' ability to generalize and make new inferences for known words."}, {"id": 49, "string": "Table 2 : Statistics of the test sets."}, {"id": 50, "string": "9,815 is the number of samples with majority agreement in the SNLI test set, whose full size is 9,824."}, {"id": 51, "string": "Replacement words are divided into topical categories detailed in Table 4 ."}, {"id": 52, "string": "In several categories we applied additional processing to ensure that examples are indeed mutually-exclusive, topicallysimilar, and interchangeable in context."}, {"id": 53, "string": "We included WordNet antonyms with the same part-ofspeech and with a cosine similarity score above a threshold, using GloVe (Pennington et al., 2014) ."}, {"id": 54, "string": "In nationalities and countries we focused on countries which are related geographically (Japan, China) or culturally (Argentina, Spain)."}, {"id": 55, "string": "Sentence-Pairs."}, {"id": 56, "string": "To avoid introducing new information not present in the training data, we sampled premises from the SNLI training set that contain words from our lists, and generated hypotheses by replacing the selected word with its replacement."}, {"id": 57, "string": "Some of the generated sentences may be ungrammatical or nonsensical, for instance, when replacing Jordan with Syria in sentences discussing Michael Jordan."}, {"id": 58, "string": "We used Wikipedia bigrams 4 to discard sentences in which the replaced word created a bigram with less than 10 occurrences."}, {"id": 59, "string": "Manual Verification We manually verify the correctness of the automatically constructed examples using crowdsourced workers in Amazon Mechanical Turk."}, {"id": 60, "string": "To ensure the quality of workers, we applied a qualification test and required a 99% approval rate for at least 1,000 prior tasks."}, {"id": 61, "string": "We assigned each annotation to 3 workers."}, {"id": 62, "string": "Following the SNLI guidelines, we instructed the workers to consider the sentences as describing the same event, but we simplified the annotation process into answering 3 simple yes/no questions: We then discarded any sentence-pair in which at least one worker answered the third question positively."}, {"id": 63, "string": "If the answer to the first question was negative, we considered the label as contradiction."}, {"id": 64, "string": "Otherwise, we considered the label as entailment if the answer to the second question was negative and neutral if it was positive."}, {"id": 65, "string": "We used the majority vote to determine the gold label."}, {"id": 66, "string": "The annotations yielded substantial agreement, with Fleiss' Kappa κ = 0.61 (Landis and Koch, 1977) ."}, {"id": 67, "string": "We estimate human performance to 94.1%, using the method described in Gong et al."}, {"id": 68, "string": "(2018) , showing that the new test set is substantially easier to humans than SNLI."}, {"id": 69, "string": "Table 2 provides additional statistics on the test set."}, {"id": 70, "string": "5 Evaluation Models Without External Knowledge."}, {"id": 71, "string": "We chose 3 representative models in different approaches (sentence encoding and/or attention): RESIDUAL-STACKED-ENCODER (Nie and Bansal, 2017) is a biLSTM-based single sentence-encoding model without attention."}, {"id": 72, "string": "As opposed to traditional multilayer biLSTMs, the input to each next layer is the concatenation of the word embedding and the summation of outputs from previous layers."}, {"id": 73, "string": "ESIM (Enhanced Sequential Inference Model, Chen et al., 2017 ) is a hybrid TreeLSTM-based and biLSTM-based model."}, {"id": 74, "string": "We use the biL-STM model, which uses an inter-sentence attention mechanism to align words across sentences."}, {"id": 75, "string": "Finally, DECOMPOSABLE ATTENTION (Parikh et al., 2016) performs soft alignment of words from the premise to words in the hypothesis using attention mechanism, and decomposes the task into comparison of aligned words."}, {"id": 76, "string": "Lexical-level decisions are merged to produce the final classification."}, {"id": 77, "string": "We use the AllenNLP re-implementation, 6 which does not implement the optional intrasentence attention, and achieves an accuracy of 84.7% on the SNLI test set, comparable to 86.3% by the original system."}, {"id": 78, "string": "We chose models which are amongst the best performing within their approaches (excluding ensembles) and have available code."}, {"id": 79, "string": "All models are based on pre-trained GloVe embeddings (Pennington et al., 2014) , which are either fine-tuned during training (RESIDUAL-STACKED-ENCODER and ESIM) or stay fixed (DECOMPOSABLE AT-TENTION)."}, {"id": 80, "string": "All models predict the label using a concatenation of features derived from the sentence representations (e.g."}, {"id": 81, "string": "maximum, mean), for example as in Mou et al."}, {"id": 82, "string": "(2016) ."}, {"id": 83, "string": "We use the recommended hyper-parameters for each model, as they appear in the provided code."}, {"id": 84, "string": "With External Knowledge."}, {"id": 85, "string": "We provide a simple WORDNET BASELINE, in which we classify a sentence-pair according to the WordNet relation that holds between the original word w p and the replaced word w h ."}, {"id": 86, "string": "We predict entailment if w p is a hyponym of w h or if they are synonyms, neutral if w p is a hypernym of w h , and contradiction if w p and w h are antonyms or if they share a common hypernym ancestor (up to 2 edges)."}, {"id": 87, "string": "Word pairs with no WordNet relations are classified as other."}, {"id": 88, "string": "We also report the performance of KIM (Knowledge-based Inference Model, Chen et al., 2018) , an extension of ESIM with external knowledge from WordNet, which was kindly provided to us by Qian Chen."}, {"id": 89, "string": "KIM improves the attention mechanism by taking into account the existence of WordNet relations between the words."}, {"id": 90, "string": "The lexical inference component, operating over pairs of aligned words, is enriched with a vector encoding the specific WordNet relations between the words."}, {"id": 91, "string": "Experimental Settings We trained each model on 3 different datasets: (1) SNLI train set, (2) a union of the SNLI train set and the MultiNLI train set, and (3) a union of the SNLI train set and the SciTail train set."}, {"id": 92, "string": "The motivation is that while SNLI might lack the training data needed to learn the required lexical knowledge, it may be available in the other datasets, which are presumably richer."}, {"id": 93, "string": "Table 3 displays the results for all the models on the original SNLI test set and the new test set."}, {"id": 94, "string": "Despite the task being considerably simpler, the drop in performance is substantial, ranging from 11 to 33 points in accuracy."}, {"id": 95, "string": "Adding MultiNLI to the training data somewhat mitigates this drop in accuracy, thanks to almost doubling the amount of training data."}, {"id": 96, "string": "We note that adding SciTail to the training data did not similarly improve the performance; we conjecture that this stems from the differences between the datasets."}, {"id": 97, "string": "Results KIM substantially outperforms the other neural models, demonstrating that lexical knowledge is the only requirement for good performance on the new test set, and stressing the inability of the other models to learn it."}, {"id": 98, "string": "Both WordNet-informed models leave room for improvement: possibly due to limited WordNet coverage and the implications of applying lexical inferences within context."}, {"id": 99, "string": "Analysis We take a deeper look into the predictions of the models that don't employ external knowledge, focusing on the models trained on SNLI."}, {"id": 100, "string": "on categories such as planets, which rarely occur in SNLI."}, {"id": 101, "string": "These models perform better than the WordNet baseline on entailment examples (synonyms), suggesting that they do so due to high lexical overlap between the premise and the hypothesis rather than recognizing synonymy."}, {"id": 102, "string": "We therefore focus the rest of the discussion on contradiction examples."}, {"id": 103, "string": "Accuracy by Category Accuracy by Word Similarity The accuracies for ordinals, nationalities and countries are especially low."}, {"id": 104, "string": "We conjecture that this stems from the proximity of the contradicting words in the embedding space."}, {"id": 105, "string": "Indeed, the Decomposable Attention model-which does not update its embeddings during training-seems to suffer the most."}, {"id": 106, "string": "Grouping its prediction accuracy by the cosine similarity between the contradicting words reveals a clear trend that the model errs more on contradicting pairs with similar pre-trained vectors: 7 Similarity 0.5-0.6 0.6-0.7 0.7-0.8 0.8-0.9 0.9-1.0 Accuracy 46.2% 42.3% 37.5% 29.7% 20.2% Accuracy by Frequency in Training Models that fine-tune the word embeddings may benefit from training examples consisting of test replacement pairs."}, {"id": 107, "string": "Namely, for a given replacement pair (w p , w h ), if many training examples labeled as contradiction contain w p in the premise and w h in the hypothesis, the model may update their embeddings to optimize predicting contradiction."}, {"id": 108, "string": "Indeed, we show that the ESIM accuracy on test pairs increases with the frequency in which 7 We ignore multi-word replacements in §5.2 and §5.3."}, {"id": 109, "string": "their replacement words appear in contradiction examples in the training data: Frequency 0 1-4 5-9 10-49 50-99 100+ Accuracy 40.2% 70.6% 91.4% 92.1% 97.5% 98.5% This demonstrates that the model is capable of learning lexical knowledge when sufficient training data is given, but relying on explicit training examples is a very inefficient way of obtaining simple lexical knowledge."}, {"id": 110, "string": "Conclusion We created a new NLI test set with the goal of evaluating systems' ability to make inferences that require simple lexical knowledge."}, {"id": 111, "string": "Although the test set is constructed to be much simpler than SNLI, and does not introduce new vocabulary, the state-of-the-art systems perform poorly on it, suggesting that they are limited in their generalization ability."}, {"id": 112, "string": "The test set can be used in the future to assess the lexical inference abilities of NLI systems and to tease apart the performance of otherwise very similarly-performing systems."}], "headers": [{"section": "Introduction", "n": "1", "start": 33, "end": 35}, {"section": "Data Collection", "n": "3", "start": 36, "end": 37}, {"section": "Generating Adversarial Examples", "n": "3.1", "start": 38, "end": 58}, {"section": "Manual Verification", "n": "3.2", "start": 59, "end": 69}, {"section": "Models", "n": "4.1", "start": 70, "end": 90}, {"section": "Experimental Settings", "n": "4.2", "start": 91, "end": 96}, {"section": "Results", "n": "4.3", "start": 97, "end": 98}, {"section": "Analysis", "n": "5", "start": 99, "end": 102}, {"section": "Accuracy by Word Similarity", "n": "5.2", "start": 103, "end": 105}, {"section": "Accuracy by Frequency in Training", "n": "5.3", "start": 106, "end": 108}, {"section": "Conclusion", "n": "6", "start": 109, "end": 112}], "figures": [{"filename": "../figure/image/1204-Table2-1.png", "caption": "Table 2: Statistics of the test sets. 9,815 is the number of samples with majority agreement in the SNLI test set, whose full size is 9,824.", "page": 2, "bbox": {"x1": 87.84, "x2": 270.24, "y1": 62.4, "y2": 205.92}}, {"filename": "../figure/image/1204-Table4-1.png", "caption": "Table 4: The number of instances and accuracy per category achieved by each model.", "page": 4, "bbox": {"x1": 58.559999999999995, "x2": 531.36, "y1": 65.75999999999999, "y2": 255.35999999999999}}, {"filename": "../figure/image/1204-Table3-1.png", "caption": "Table 3: Accuracy of various models trained on SNLI or a union of SNLI with another dataset (MultiNLI, SciTail), and tested on the original SNLI test set and the new test set.", "page": 3, "bbox": {"x1": 132.0, "x2": 466.08, "y1": 62.4, "y2": 211.2}}, {"filename": "../figure/image/1204-Table1-1.png", "caption": "Table 1: Examples from the new test set.", "page": 0, "bbox": {"x1": 309.59999999999997, "x2": 518.4, "y1": 222.23999999999998, "y2": 316.32}}]}