{"title": "Examining Temporality in Document Classification", "abstract": "Many corpora span broad periods of time. Language processing models trained during one time period may not work well in future time periods, and the best model may depend on specific times of year (e.g., people might describe hotels differently in reviews during the winter versus the summer). This study investigates how document classifiers trained on documents from certain time intervals perform on documents from other time intervals, considering both seasonal intervals (intervals that repeat across years, e.g., winter) and non-seasonal intervals (e.g., specific years). We show experimentally that classification performance varies over time, and that performance can be improved by using a standard domain adaptation approach to adjust for changes in time.", "text": [{"id": 0, "string": "Introduction Language, and therefore data derived from language, changes over time (Ullmann, 1962) ."}, {"id": 1, "string": "Word senses can shift over long periods of time (Wilkins, 1993; Wijaya and Yeniterzi, 2011; Hamilton et al., 2016) , and written language can change rapidly in online platforms (Eisenstein et al., 2014; Goel et al., 2016) ."}, {"id": 2, "string": "However, little is known about how shifts in text over time affect the performance of language processing systems."}, {"id": 3, "string": "This paper focuses on a standard text processing task, document classification, to provide insight into how classification performance varies with time."}, {"id": 4, "string": "We consider both long-term variations in text over time and seasonal variations which change throughout a year but repeat across years."}, {"id": 5, "string": "Our empirical study considers corpora contain-ing formal text spanning decades as well as usergenerated content spanning only a few years."}, {"id": 6, "string": "After describing the datasets and experiment design, this paper has two main sections, respectively addressing the following research questions: 1."}, {"id": 7, "string": "In what ways does document classification depend on the timestamps of the documents?"}, {"id": 8, "string": "2."}, {"id": 9, "string": "Can document classifiers be adapted to perform better in time-varying corpora?"}, {"id": 10, "string": "To address question 1, we train and test on data from different time periods, to understand how performance varies with time."}, {"id": 11, "string": "To address question 2, we apply a domain adaptation approach, treating time intervals as domains."}, {"id": 12, "string": "We show that in most cases this approach can lead to improvements in classification performance, even on future time intervals."}, {"id": 13, "string": "Related Work Time is implicitly embedded in the classification process: classifiers are often built to be applied to future data that doesn't yet exist, and performance on held-out data is measured to estimate performance on future data whose distribution may have changed."}, {"id": 14, "string": "Methods exist to adjust for changes in the data distribution (covariate shift) (Shimodaira, 2000; Bickel et al., 2009 ), but time is not typically incorporated into such methods explicitly."}, {"id": 15, "string": "One line of work that explicitly studies the relationship between time and the distribution of data is work on classifying the time period in which a document was written (document dating) (Kanhabua and Nørvåg, 2008; Chambers, 2012; Kotsakos et al., 2014 )."}, {"id": 16, "string": "However, this task is directed differently from our work: predicting timestamps given documents, rather than predicting information about documents given timestamps."}, {"id": 17, "string": "Dataset Time intervals (non-seasonal) Time intervals (seasonal) Size Reviews (music) 1997-99, 2000-02, 2003-05, 2006-08, 2009-11, 2012-14 Jan-Mar, Apr-Jun, Jul-Sep, Oct-Dec 653K Reviews (hotels) 2005-08, 2009-11, 2012-14, 2015-17 Jan-Mar, Apr-Jun, Jul-Sep, Oct-Dec 78.6K Reviews (restaurants) 2005-08, 2009-11, 2012-14, 2015-17 Jan-Mar, Apr-Jun, Jul-Sep, Oct-Dec 1.16M News (economy) 1950-70, 1971-85, 1986-2000, 2001-14 Jan-Mar, Apr-Jun, Jul-Sep, Oct-Dec 6.29K Politics (platforms) 1948 (platforms) -56, 1960 (platforms) -68, 1972 (platforms) -80, 1984 (platforms) -92, 1996 (platforms) -2004 (platforms) , 2008 (platforms) -16 n/a 35.8K Twitter (vaccines) 2013 (platforms) , 2014 (platforms) , 2015 (platforms) , 2016 Jan-Mar, Apr-Jun, Jul-Sep, Oct-Dec 9.83K Table 1 : Descriptions of corpora spanning multiple time intervals."}, {"id": 18, "string": "Size is the number of documents."}, {"id": 19, "string": "Datasets and Experimental Setup Our study experiments with six corpora: • Reviews: Three corpora containing reviews labeled with sentiment: music reviews from Amazon (He and McAuley, 2016) , and hotel reviews and restaurant reviews from Yelp."}, {"id": 20, "string": "1 We discarded reviews that had fewer than 10 tokens or a helpfulness/usefulness score of zero."}, {"id": 21, "string": "The reviews with neutral scores were removed."}, {"id": 22, "string": "• Twitter: Tweets labeled with whether they indicate that the user received an influenza vaccination (i.e., a flu shot) (Huang et al., 2017) ."}, {"id": 23, "string": "Our experiments require documents to be grouped into time intervals."}, {"id": 24, "string": "Table 1 shows the intervals for each corpus."}, {"id": 25, "string": "Documents that fall outside of these time intervals were removed."}, {"id": 26, "string": "We grouped documents into two types of intervals: • Seasonal: Time intervals within a year (e.g., January through March) that may be repeated across years."}, {"id": 27, "string": "• Non-seasonal: Time intervals that do not repeat (e.g., 1997-1999) ."}, {"id": 28, "string": "For each dataset, we performed binary classification, implemented in sklearn (Pedregosa et al., 2011) ."}, {"id": 29, "string": "We built logistic regression classifiers with TF-IDF weighted n-gram features (n ∈ {1, 2, 3}), removing features that appeared in less than 2 documents."}, {"id": 30, "string": "Except when otherwise specified, we held out a random 10% of documents as validation data for each dataset."}, {"id": 31, "string": "We used Elastic Net (combined 1 and 2 ) regularization (Zou and Hastie, 2005) , and tuned the regularization parameters to maximize performance on the validation data."}, {"id": 32, "string": "We evaluated the performance using weighted F1 scores."}, {"id": 33, "string": "How Does Classification Performance Vary with Time?"}, {"id": 34, "string": "We first conduct an analysis of how classifier performance depends on the time intervals in which it is trained and applied."}, {"id": 35, "string": "For each corpus, we train the classifier on each time interval and test on each time interval."}, {"id": 36, "string": "We downsampled the training data within each time interval to match the number of documents in the smallest interval, so that differences in performance are not due to the size of the training data."}, {"id": 37, "string": "In all experiments, we train a classifier on a partition of 80% of the documents in the time interval, and repeat this five times on different partitions, averaging the five F1 scores to produce the final estimate."}, {"id": 38, "string": "When training and testing on the same interval, we test on the held-out 20% of documents in that interval (standard cross-validation)."}, {"id": 39, "string": "When testing on different time intervals, we test on all documents, since they are all held-out from the training interval; however, we still train on five subsets of 80% of documents, so that the training data is identical across all experiments."}, {"id": 40, "string": "Finally, to understand why performance varies, we also qualitatively examined how the distribution of content changes across time intervals."}, {"id": 41, "string": "To measure the distribution of content, we trained a topic model with 20 topics using gensim (Řehůřek and Sojka, 2010) with default parameters."}, {"id": 42, "string": "We associated each document with one topic (the most probable topic in the document), and then calculated the proportion of each topic within a time period as the proportion of documents in that time period assigned to that topic."}, {"id": 43, "string": "We can then visualize the extent to which the distribution of 20 topics varies by time."}, {"id": 44, "string": "Seasonal Variability The top row of Figure 1 shows the test scores from training and testing on each pair of seasonal time intervals for four of the datasets."}, {"id": 45, "string": "We observe very strong seasonal variations in the economic news corpus, with a drop in F1 score on the order of 10 when there is a mismatch in the season between training and testing."}, {"id": 46, "string": "There is a similar, but weaker, effect on performance in the music reviews from Amazon and the vaccine tweets."}, {"id": 47, "string": "There was virtually no difference in performance in any of the pairs in both review corpora from Yelp (restaurants, not pictured, and hotels)."}, {"id": 48, "string": "To help understand why the performance varies, Figure 2 (left) shows the distribution of topics in each seasonal interval for two corpora: Amazon music reviews and Twitter."}, {"id": 49, "string": "We observe very little variation in the topic distribution across seasons in the Amazon corpus, but some variation in the Twitter corpus, which may explain the large performance differences when testing on held-out seasons in the Twitter data as compared to the Amazon corpus."}, {"id": 50, "string": "For space, we do not show the descriptions of the topics, but instead only the shape of the distributions to show the degree of variability."}, {"id": 51, "string": "We did qualitatively examine the differences in word features across the time periods, but had difficulty interpreting the observations and were unable to draw clear conclusions."}, {"id": 52, "string": "Thus, characterizing the ways in which content distributions vary over time, and why this affects performance, is still an open question."}, {"id": 53, "string": "Non-seasonal Variability The bottom row of Figure 1 shows the test scores from training and testing on each pair of nonseasonal time intervals."}, {"id": 54, "string": "A strong pattern emerges in the political parties corpus: F1 scores can drop by as much as 40 points when testing on different time intervals."}, {"id": 55, "string": "This is perhaps unsurprising, as this collection spans decades, and US party positions have substantially changed over time."}, {"id": 56, "string": "The performance declines more when testing on time intervals that are further away in time from the training interval, suggesting that changes in party platforms shift gradually over time."}, {"id": 57, "string": "In contrast, while there was a performance drop when testing outside the training interval in the economic news corpus, the drop was not gradual."}, {"id": 58, "string": "In the Twitter dataset (not pictured), F1 dropped by an average of 4.9 points outside the training interval."}, {"id": 59, "string": "We observe an intriguing non-seasonal pattern that is consistent in both of the review corpora from Yelp, but not in the music review corpus from Amazon (not pictured), which is that the classification performance fairly consistently increases over time."}, {"id": 60, "string": "Since we sampled the dataset so that the time intervals have the same number of reviews, this suggests something else changed over time about the way reviews are written that makes the sentiment easier to detect."}, {"id": 61, "string": "The right side of Figure 2 shows the topic distribution in the Amazon and Twitter datasets across non-seasonal intervals."}, {"id": 62, "string": "We observe higher levels of variability across time in the non-seasonal intervals as compared to the seasonal intervals."}, {"id": 63, "string": "Discussion Overall, it is clear that classifiers generally perform best when applied to the same time interval they were trained."}, {"id": 64, "string": "Performance diminishes when applied to different time intervals, although different corpora exhibit differ patterns in the way in which the performance diminishes."}, {"id": 65, "string": "This kind of analysis can be applied to any corpus and could provide insights into characteristics of the corpus that may be helpful when designing a classifier."}, {"id": 66, "string": "Making Classification Robust to Temporality We now consider how to improve classifiers when working with datasets that span different time intervals."}, {"id": 67, "string": "We propose to treat this as a domain adaptation problem."}, {"id": 68, "string": "In domain adaptation, any partition of data that is expected to have a different distribution of features can be treated as a domain (Joshi et al., 2013) ."}, {"id": 69, "string": "Traditionally, domain adaptation is used to adapt models to a common task across rather different sets of data, e.g., a sentiment classifier for different types of products (Blitzer et al., 2007) ."}, {"id": 70, "string": "Recent work has also applied domain adaptation to adjust for potentially more subtle differences in data, such as adapting for differences in the demographics of authors (Volkova et al., 2013; Lynn et al., 2017) ."}, {"id": 71, "string": "We follow the same approach, treating time intervals as domains."}, {"id": 72, "string": "In our experiments, we use the feature augmentation approach of Daumé III (2007) to perform domain adaptation."}, {"id": 73, "string": "Each feature is duplicated to have a specific version of the feature for every domain, as well as a domain-independent version of the feature."}, {"id": 74, "string": "In each instance, the domainindependent feature and the domain-specific feature for that instance's domain have the same feature value, while the value is zeroed out for the domain-specific features for the other domains."}, {"id": 75, "string": "Data (Seasonal) Baseline Adaptation Reviews (music) .901 .919 Reviews (hotels) .867 .881 Reviews (restaurants) .874 .898 News (economy) .782 .782 Twitter (vaccines) .881 .880 Table 2 : F1 scores when treating each seasonal time interval as a domain and applying domain adaptation compared to using no adaptation."}, {"id": 76, "string": "This is equivalent to a model where the feature weights are domain specific but share a Gaussian prior across domains (Finkel and Manning, 2009 )."}, {"id": 77, "string": "This approach is widely used due to its simplicity, and derivatives of this approach have been used in similar work (e.g., (Lynn et al., 2017) )."}, {"id": 78, "string": "Following Finkel and Manning (2009) , we separately adjust the regularization strength for the domain-independent feature weights and the domain-specific feature weights."}, {"id": 79, "string": "Seasonal Adaptation We first examine classification performance on the datasets when grouping the seasonal time intervals (January-March, April-June, July-August, September-December) as domains and applying the feature augmentation approach for domain adaptation."}, {"id": 80, "string": "As a baseline comparison, we apply the same classifier, but without domain adaptation."}, {"id": 81, "string": "Results are shown in Table 2 ."}, {"id": 82, "string": "We see that applying domain adaptation provides a small boost in three of the datasets, and has no effect on two of the datasets."}, {"id": 83, "string": "If this pattern holds in other corpora, then this suggests that it does not hurt performance to apply domain adaptation across different times of year, and in some cases can lead to a small performance boost."}, {"id": 84, "string": "Data (Non-seasonal) Baseline Adaptation Adapt.+seasons Reviews (music) .895 .924 .910 Reviews (hotels) .886 .892 .920 Reviews (restaurants) ."}, {"id": 85, "string": "831 .879 .889 News (economy) ."}, {"id": 86, "string": "763 .780 .859 Politics (platforms) .661 .665 n/a Twitter (vaccines) .910 .903 .920 Table 3 : F1 scores when testing on the final time interval after training on all previous intervals."}, {"id": 87, "string": "Non-seasonal Adaptation We now consider the non-seasonal time intervals (spans of years)."}, {"id": 88, "string": "In particular, we consider the scenario when one wants to apply a classifier trained on older data to future data."}, {"id": 89, "string": "This requires a modification to the domain adaptation approach, because future data includes domains that did not exist in the training data, and thus we cannot learn domain-specific feature weights."}, {"id": 90, "string": "To solve this, we train in the usual way, but when testing on future data, we only include the domain-independent features."}, {"id": 91, "string": "The intuition is that the domain-independent parameters should be applicable to all domains, and so using only these features should lead to better generalizability to new domains."}, {"id": 92, "string": "We test this hypothesis by training the classifiers on all but the last time interval, and testing on the final interval."}, {"id": 93, "string": "For hyperparameter tuning, we used the final time interval of the training data (i.e., the penultimate interval) as the validation set."}, {"id": 94, "string": "The intuition is that the penultimate interval is the closest to the test data and thus is expected to be most similar to it."}, {"id": 95, "string": "Results are shown in the first three columns of Table 3 ."}, {"id": 96, "string": "We see that this approach leads to a small performance boost in all cases except the Twitter dataset."}, {"id": 97, "string": "This means that this simple feature augmentation approach has the potential to make classifiers more robust to future changes in data."}, {"id": 98, "string": "How to apply the feature augmentation technique to unseen domains is not well understood."}, {"id": 99, "string": "By removing the domain-specific features, as we did here, the prediction model has changed, and so its behavior may be hard to predict."}, {"id": 100, "string": "Nonetheless, this appears to be a successful approach."}, {"id": 101, "string": "Adding Seasonal Features We also experimented with including the seasonal features when performing non-seasonal adaptation."}, {"id": 102, "string": "In this setting, we train the models with two domain-specific features in addition to the domain-independent features: one for the season, and one for the non-seasonal interval."}, {"id": 103, "string": "As above, we remove the non-seasonal features at test time; however, we retain the season-specific features in addition to the domain-independent features, as they can be reused in future years."}, {"id": 104, "string": "The results of this approach are shown in the last column of Table 3 ."}, {"id": 105, "string": "We find that combining seasonal and non-seasonal features together leads to an additional performance gain in most cases."}, {"id": 106, "string": "Conclusion Our experiments suggest that time can substantially affect the performance of document classification, and practitioners should be cognizant of this variable when developing classifiers."}, {"id": 107, "string": "A simple analysis comparing pairs of time intervals can provide insights into how performance varies with time, which could be a good practice to do when initially working with a corpus."}, {"id": 108, "string": "Our experiments also suggest that simple domain adaptation techniques can help account for this variation."}, {"id": 109, "string": "4 We make two practical recommendations following the insights from this work."}, {"id": 110, "string": "First, evaluation will be most accurate if the test data is as similar as possible to whatever future data the classifier will be applied to, and one way to achieve this is to select test data from the chronological end of the corpus, rather than randomly sampling data without regard to time."}, {"id": 111, "string": "Second, we observed that performance on future data tends to increase when hyperparameter tuning is conducted on later data; thus, we also recommend sampling validation data from the chronological end of the corpus."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 12}, {"section": "Related Work", "n": "1.1", "start": 13, "end": 18}, {"section": "Datasets and Experimental Setup", "n": "2", "start": 19, "end": 32}, {"section": "How Does Classification Performance", "n": "3", "start": 33, "end": 43}, {"section": "Seasonal Variability", "n": "3.1", "start": 44, "end": 52}, {"section": "Non-seasonal Variability", "n": "3.2", "start": 53, "end": 62}, {"section": "Discussion", "n": "3.3", "start": 63, "end": 65}, {"section": "Making Classification Robust to Temporality", "n": "4", "start": 66, "end": 78}, {"section": "Seasonal Adaptation", "n": "4.1", "start": 79, "end": 86}, {"section": "Non-seasonal Adaptation", "n": "4.2", "start": 87, "end": 100}, {"section": "Adding Seasonal Features", "n": "4.2.1", "start": 101, "end": 105}, {"section": "Conclusion", "n": "5", "start": 106, "end": 111}], "figures": [{"filename": "../figure/image/1205-Table3-1.png", "caption": "Table 3: F1 scores when testing on the final time interval after training on all previous intervals.", "page": 4, "bbox": {"x1": 144.96, "x2": 452.15999999999997, "y1": 62.879999999999995, "y2": 159.35999999999999}}, {"filename": "../figure/image/1205-Table1-1.png", "caption": "Table 1: Descriptions of corpora spanning multiple time intervals. Size is the number of documents.", "page": 1, "bbox": {"x1": 73.92, "x2": 524.16, "y1": 62.879999999999995, "y2": 137.28}}, {"filename": "../figure/image/1205-Table2-1.png", "caption": "Table 2: F1 scores when treating each seasonal time interval as a domain and applying domain adaptation compared to using no adaptation.", "page": 3, "bbox": {"x1": 308.64, "x2": 523.1999999999999, "y1": 227.51999999999998, "y2": 308.15999999999997}}, {"filename": "../figure/image/1205-Figure2-1.png", "caption": "Figure 2: Topic distributions in each time of year (left) and each span of years (right). Topic models are trained independently in the seasonal vs. non-seasonal settings and are not aligned.", "page": 3, "bbox": {"x1": 82.08, "x2": 517.4399999999999, "y1": 62.4, "y2": 168.95999999999998}}]}