{"title": "Encoding of phonology in a recurrent neural model of grounded speech", "abstract": "We study the representation and encoding of phonemes in a recurrent neural network model of grounded speech. We use a model which processes images and their spoken descriptions, and projects the visual and auditory representations into the same semantic space. We perform a number of analyses on how information about individual phonemes is encoded in the MFCC features extracted from the speech signal, and the activations of the layers of the model. Via experiments with phoneme decoding and phoneme discrimination we show that phoneme representations are most salient in the lower layers of the model, where low-level signals are processed at a fine-grained level, although a large amount of phonological information is retain at the top recurrent layer. We further find out that the attention mechanism following the top recurrent layer significantly attenuates encoding of phonology and makes the utterance embeddings much more invariant to synonymy. Moreover, a hierarchical clustering of phoneme representations learned by the network shows an organizational structure of phonemes similar to those proposed in linguistics.", "text": [{"id": 0, "string": "Introduction Spoken language is a universal human means of communication."}, {"id": 1, "string": "As such, its acquisition and representation in the brain is an essential topic in the study of the cognition of our species."}, {"id": 2, "string": "In the field of neuroscience there has been a long-standing interest in the understanding of neural representations of linguistic input in human brains, most commonly via the analysis of neuro-imaging data of participants exposed to simplified, highly controlled inputs."}, {"id": 3, "string": "More recently, naturalistic data has been used and patterns in the brain have been correlated with patterns in the input (e.g."}, {"id": 4, "string": "Wehbe et al., 2014; Khalighinejad et al., 2017) ."}, {"id": 5, "string": "This type of approach is relevant also when the goal is the understanding of the dynamics in complex neural network models of speech understanding."}, {"id": 6, "string": "Firstly because similar techniques are often applicable, but more importantly because the knowledge of how the workings of artificial and biological neural networks are similar or different is valuable for the general enterprise of cognitive science."}, {"id": 7, "string": "Recent studies have implemented models which learn to understand speech in a weakly and indirectly supervised fashion from correlated audio and visual signal: Harwath et al."}, {"id": 8, "string": "(2016) ; Harwath and Glass (2017); Chrupała et al."}, {"id": 9, "string": "(2017a) ."}, {"id": 10, "string": "This is a departure from typical Automatic Speech Recognition (ASR) systems which rely on large amounts of transcribed speech, and these recent models come closer to the way humans acquire language in a grounded setting."}, {"id": 11, "string": "It is thus especially interesting to investigate to what extent the traditional levels of linguistic analysis such as phonology, morphology, syntax and semantics are encoded in the activations of the hidden layers of these models."}, {"id": 12, "string": "There are a small number of studies which focus on the syntax and/or semantics in the context of neural models of written language (e.g."}, {"id": 13, "string": "Elman, 1991; Frank et al., 2013; Kádár et al., 2016; Li et al., 2016a; Adi et al., 2016; Li et al., 2016b; Linzen et al., 2016) ."}, {"id": 14, "string": "Taking it a step further, Gelderloos and Chrupała (2016) and Chrupała et al."}, {"id": 15, "string": "(2017a) investigate the levels of representations in models which learn language from phonetic transcriptions and from the speech signal, respectively."}, {"id": 16, "string": "Neither of these tackles the representation of phonology in any great depth."}, {"id": 17, "string": "Instead they work with relatively coarse-grained distinctions between form and meaning."}, {"id": 18, "string": "In the current work we use controlled synthetic stimuli, as well as alignment between the audio signal and phonetic transcription of spoken utterances to extract phoneme representation vectors based on the activations on the hidden layers of a model of grounded speech perception."}, {"id": 19, "string": "We use these representations to carry out analyses of the representation of phonemes at a fine-grained level."}, {"id": 20, "string": "In a series of experiments, we show that the lower layers of the model encode accurate representations of the phonemes which can be used in phoneme identification and classification with high accuracy."}, {"id": 21, "string": "We further investigate how the phoneme inventory is organised in the activation space of the model."}, {"id": 22, "string": "Finally, we tackle the general issue of the representation of phonological form versus meaning with a controlled task of synonym discrimination."}, {"id": 23, "string": "Our results show that the bottom layers in the multi-layer recurrent neural network learn invariances which enable it to encode phonemes independently of co-articulatory context, and that they represent phonemic categories closely matching usual classifications from linguistics."}, {"id": 24, "string": "Phonological form becomes harder to detect in higher layers of the network, which increasingly focus on representing meaning over form, but encoding of phonology persists to a significant degree up to the top recurrent layer."}, {"id": 25, "string": "We make the data and open-source code to reproduce our results publicly available at github.com/gchrupala/encoding-of-phonology."}, {"id": 26, "string": "Related Work Research on encoding of phonology has been carried out from a psycholinguistics as well as computational modeling perspectives."}, {"id": 27, "string": "Below we review both types of work."}, {"id": 28, "string": "Phoneme perception Co-articulation and interspeaker variability make it impossible to define unique acoustic patterns for each phoneme."}, {"id": 29, "string": "In an early experiment, Liberman et al."}, {"id": 30, "string": "(1967) analyzed the acoustic properties of the /d/ sound in the two syllables /di/ and /du/."}, {"id": 31, "string": "They found that while humans easily noticed differences between the two instances when /d/ was played in isolation, they perceived the /d/ as be-ing the same when listening to the complete syllables."}, {"id": 32, "string": "This phenomenon is often referred to as categorical perception: acoustically different stimuli are perceived as the same."}, {"id": 33, "string": "In another experiment Lisker and Abramson (1967) used the two syllables /ba/ and /pa/ which only differ in their voice onset time (VOT), and created a continuum moving from syllables with short VOT to syllables with increasingly longer VOT."}, {"id": 34, "string": "Participants identified all consonants with VOT below 25 msec as being /b/ and all consonant with VOT above 25 msec as being /p/."}, {"id": 35, "string": "There was no grey area in which both interpretations of the sound were equally likely, which suggests that the phonemes were perceived categorically."}, {"id": 36, "string": "Supporting findings also come from discrimination experiments: when one consonant has a VOT below 25 msec and the other above, people perceive the two syllables as being different (/ba/ and /pa/ respectively), but they do not notice any differences in the acoustic signal when both syllables have a VOT below or above 25 msec (even when these sounds are physically further away from each other than two sounds that cross the 25 msec dividing line)."}, {"id": 37, "string": "Evidence from infant speech perception studies suggests that infants also perceive phonemes categorically (Eimas et al., 1971) : one-and fourmonth old infants were presented with multiple syllables from the continuum of /ba/ to /pa/ sounds described above."}, {"id": 38, "string": "As long as the syllables all came from above or below the 25 msec line, the infants showed no change in behavior (measured by their amount of sucking), but when presented with a syllable crossing that line, the infants reacted differently."}, {"id": 39, "string": "This suggests that infants, just like adults, perceive speech sounds as belonging to discrete categories."}, {"id": 40, "string": "Dehaene-Lambertz and Gliga (2004) also showed that the same neural systems are activated for both infants and adults when performing this task."}, {"id": 41, "string": "Importantly, languages differ in their phoneme inventories; for example English distinguishes /r/ from /l/ while Japanese does not, and children have to learn which categories to use."}, {"id": 42, "string": "Experimental evidence suggests that infants can discriminate both native and nonnative speech sound differences up to 8 months of age, but have difficulty discriminating acoustically similar nonnative contrasts by 10-12 months of age (Werker and Hensch, 2015) ."}, {"id": 43, "string": "These findings suggest that by their first birthday, they have learned to focus only on those contrasts that are relevant for their native language and to neglect those which are not."}, {"id": 44, "string": "Psycholinguistic theories assume that children learn the categories of their native language by keeping track of the frequency distribution of acoustic sounds in their input."}, {"id": 45, "string": "The forms around peaks in this distribution are then perceived as being a distinct category."}, {"id": 46, "string": "Recent computational models showed that infant-directed speech contains sufficiently clear peaks for such a distributional learning mechanism to succeed and also that top-down processes like semantic knowledge and visual information play a role in phonetic category learning (ter Schure et al., 2016) ."}, {"id": 47, "string": "From the machine learning perspective categorical perception corresponds to the notion of learning invariances to certain properties of the input."}, {"id": 48, "string": "With the experiments in Section 4 we attempt to gain some insight into this issue."}, {"id": 49, "string": "Computational models There is a sizeable body of work on using recurrent neural (and other) networks to detect phonemes or phonetic features as a subcomponent of an ASR system."}, {"id": 50, "string": "King and Taylor (2000) train recurrent neural networks to extract phonological features from framewise cepstral representation of speech in the TIMIT speaker-independent database."}, {"id": 51, "string": "Frankel et al."}, {"id": 52, "string": "(2007) introduce a dynamic Bayesian network for articulatory (phonetic) feature recognition as a component of an ASR system."}, {"id": 53, "string": "Siniscalchi et al."}, {"id": 54, "string": "(2013) show that a multilayer perceptron can successfully classify phonological features and contribute to the accuracy of a downstream ASR system."}, {"id": 55, "string": "Mohamed et al."}, {"id": 56, "string": "(2012) use a Deep Belief Network (DBN) for acoustic modeling and phone recognition on human speech."}, {"id": 57, "string": "They analyze the impact of the number of layers on phone recognition error rate, and visualize the MFCC vectors as well as the learned activation vectors of the hidden layers of the model."}, {"id": 58, "string": "They show that the representations learned by the model are more speakerinvariant than the MFCC features."}, {"id": 59, "string": "These works directly supervise the networks to recognize phonological information."}, {"id": 60, "string": "Another supervised but multimodal approach is taken by Sun (2016) , which uses grounded speech for improving a supervised model of transcribing utterances from spoken description of images."}, {"id": 61, "string": "We on the other hand are more interested in understand-ing how the phonological level of representation emerges from weak supervision via correlated signal from the visual modality."}, {"id": 62, "string": "There are some existing models which learn language representations from sensory input in such a weakly supervised fashion."}, {"id": 63, "string": "For example Roy and Pentland (2002) use spoken utterances paired with images of objects, and search for segments of speech that reliably co-occur with visual shapes."}, {"id": 64, "string": "Yu and Ballard (2004) use a similar approach but also include non-verbal cues such as gaze and gesture into the input for unsupervised learning of words and their visual meaning."}, {"id": 65, "string": "These language learning models use rich input signals, but are very limited in scale and variation."}, {"id": 66, "string": "A separate line of research has used neural networks for modeling phonology from a (neuro)cognitive perspective."}, {"id": 67, "string": "Burgess and Hitch (1999) implement a connectionist model of the so-called phonological loop, i.e."}, {"id": 68, "string": "the posited working memory which makes phonological forms available for recall (Baddeley and Hitch, 1974) ."}, {"id": 69, "string": "Gasser and Lee (1989) show that Simple Recurrent Networks are capable of acquiring phonological constraints such as vowel harmony or phonological alterations at morpheme boundaries."}, {"id": 70, "string": "Touretzky and Wheeler (1989) present a connectionist architecture which performs multiple simultaneous insertion, deletion, and mutation operations on sequences of phonemes."}, {"id": 71, "string": "In this body of work the input to the network is at the level of phonemes or phonetic features, not acoustic features, and it is thus more concerned with the rules governing phonology and does not address how representations of phonemes arise from exposure to speech in the first place."}, {"id": 72, "string": "Moreover, the early connectionist work deals with constrained, toy datasets."}, {"id": 73, "string": "Current neural network architectures and hardware enable us to use much more realistic inputs with the potential to lead to qualitatively different results."}, {"id": 74, "string": "Model As our model of language acquisition from grounded speech signal we adopt the Recurrent Highway Network-based model of Chrupała et al."}, {"id": 75, "string": "(2017a) ."}, {"id": 76, "string": "This model has two desirable properties: firstly, thanks to the analyses carried in that work, we understand roughly how the hidden layers differ in terms of the level of linguistic representation they encode."}, {"id": 77, "string": "Secondly, the model is trained on clean synthetic speech which makes it appropri-ate to use for the controlled experiments in Section 5.2."}, {"id": 78, "string": "We refer the reader to Chrupała et al."}, {"id": 79, "string": "(2017a) for a detailed description of the model architecture."}, {"id": 80, "string": "Here we give a brief overview."}, {"id": 81, "string": "The model exploits correlations between two modalities, i.e."}, {"id": 82, "string": "speech and vision, as a source of weak supervision for learning to understand speech; in other words it implements language acquisition from the speech signal grounded in visual perception."}, {"id": 83, "string": "The architecture is a bi-modal network whose learning objective is to project spoken utterances and images to a joint semantic space, such that corresponding pairs (u, i) (i.e."}, {"id": 84, "string": "an utterance and the image it describes) are close in this space, while unrelated pairs are far away, by a margin α: (1) u,i u max[0, α + d(u, i) − d(u , i)] + i max[0, α + d(u, i) − d(u, i )] where d(u, i) is the cosine distance between the encoded utterance u and encoded image i."}, {"id": 85, "string": "The image encoder part of the model uses image vectors from a pretrained object classification model, VGG-16 (Simonyan and Zisserman, 2014) , and uses a linear transform to directly project these to the joint space."}, {"id": 86, "string": "The utterance encoder takes Mel-frequency Cepstral Coefficients (MFCC) as input, and transforms it successively according to: enc u (u) = unit(Attn(RHN k,L (Conv s,d,z (u)))) (2) The first layer Conv s,d,z is a one-dimensional convolution of size s which subsamples the input with stride z, and projects it to d dimensions."}, {"id": 87, "string": "It is followed by RHN k,L which consists of k residualized recurrent layers."}, {"id": 88, "string": "Specifically these are Recurrent Highway Network layers (Zilly et al., 2016) , which are closely related to GRU networks, with the crucial difference that they increase the depth of the transform between timesteps; this is the recurrence depth L. The output of the final recurrent layer is passed through an attention-like lookback operator Attn which takes a weighted average of the activations across time steps."}, {"id": 89, "string": "Finally, both utterance and image projections are L2-normalized."}, {"id": 90, "string": "See Section 4.1 for details of the model configuration."}, {"id": 91, "string": "Vowels i I U u e E @ Ä OI O o aI ae 2 A aU Approximants j ô l w Nasals m n N Plosives p b t d k g Fricatives f v T D s z S Z h Affricates Ù Ã Experimental data and setup The phoneme representations in each layer are calculated as the activations averaged over the duration of the phoneme occurrence in the input."}, {"id": 92, "string": "The average input vectors are similarly calculated as the MFCC vectors averaged over the time course of the articulation of the phoneme occurrence."}, {"id": 93, "string": "When we need to represent a phoneme type we do so by averaging the vectors of all its occurrences in the validation set."}, {"id": 94, "string": "Table 1 shows the phoneme inventory we work with; this is also the inventory used by Gentle/Kaldi (see Section 4.3)."}, {"id": 95, "string": "Model settings We use the pre-trained version of the COCO Speech model, implemented in Theano (Bastien et al., 2012) , provided by Chrupała et al."}, {"id": 96, "string": "dataset (Lin et al., 2014) where speech was synthesized for the original image descriptions, using high-quality speech synthesis provided by gTTS."}, {"id": 97, "string": "2 Forced alignment We aligned the speech signal to the corresponding phonemic transcription with the Gentle toolkit, 3 which in turn is based on Kaldi (Povey et al., 2011) ."}, {"id": 98, "string": "It uses a speech recognition model for English to transcribe the input audio signal, and then finds the optimal alignment of the transcription to the signal."}, {"id": 99, "string": "This fails for a small number of utterances, which we remove from the data."}, {"id": 100, "string": "In the next step we extract MFCC features from the audio signal and pass them through the COCO Speech utterance encoder, and record the activations for the convolutional layer as well as all the recurrent layers."}, {"id": 101, "string": "For each utterance the representations (i.e."}, {"id": 102, "string": "MFCC features and activations) are stored in a t r × D r matrix, where t r and D r are the number of times steps and the dimensionality, respectively, for each representation r. Given the alignment of each phoneme token to the underlying audio, we then infer the slice of the representation matrix corresponding to it."}, {"id": 103, "string": "Experiments In this section we report on four experiments which we designed to elucidate to what extent information about phonology is represented in the activations of the layers of the COCO Speech model."}, {"id": 104, "string": "In Section 5.1 we quantify how easy it is to decode phoneme identity from activations."}, {"id": 105, "string": "In Section 5.2 we determine phoneme discriminability in a controlled task with minimal pair stimuli."}, {"id": 106, "string": "Section 5.3 shows how the phoneme inventory is organized in the activation space of the model."}, {"id": 107, "string": "Finally, in Section 5.4 we tackle the general issue of the representation of phonological form versus meaning with the controlled task of synonym discrimination."}, {"id": 108, "string": "Phoneme decoding In this section we quantify to what extent phoneme identity can be decoded from the input MFCC features as compared to the representations extracted from the COCO speech."}, {"id": 109, "string": "As explained in Section 4.3, we use phonemic transcriptions aligned to the corresponding audio in order to segment the signal into chunks corresponding to individual phonemes."}, {"id": 110, "string": "We take a sample of 5000 utterances from the validation set of Synthetically Spoken COCO, and extract the force-aligned representations from the Speech COCO model."}, {"id": 111, "string": "We split this data into 2 3 training and 1 3 heldout portions, and use supervised classification in order to quantify the recoverability of phoneme identities from the representations."}, {"id": 112, "string": "Each phoneme slice is averaged over time, so that it becomes a D r -dimensional vector."}, {"id": 113, "string": "For each representation we then train L2-penalized logistic regression (with the fixed penalty weight 1.0) on the training data and measure classification error rate on the heldout portion."}, {"id": 114, "string": "Figure 1 shows the results."}, {"id": 115, "string": "As can be seen from this plot, phoneme recoverability is poor for the representations based on MFCC and the convolutional layer activations, but improves markedly for the recurrent layers."}, {"id": 116, "string": "Phonemes are easiest recovered from the activations at recurrent layers 1 and 2, and the accuracy decreases thereafter."}, {"id": 117, "string": "This suggests that the bottom recurrent layers of the model specialize in recognizing this type of low-level phonological information."}, {"id": 118, "string": "It is notable however that even the last recurrent layer encodes phoneme identity to a substantial degree."}, {"id": 119, "string": "The MFCC features do much better than majority baseline (89% error rate) but poorly reltive to the the recurrent layers."}, {"id": 120, "string": "Averaging across phoneme durations may be hurting performance, but interestingly, the network can overcome this and form more robust phoneme representations in the activation patterns."}, {"id": 121, "string": "data."}, {"id": 122, "string": "They propose a set of tasks called Minimal-Pair ABX tasks that allow to make linguistically precise comparisons between syllable pairs that only differ by one phoneme."}, {"id": 123, "string": "They use variants of this task to study phoneme discrimination across talkers and phonetic contexts as well as talker discrimination across phonemes."}, {"id": 124, "string": "Phoneme discrimination Here we evaluate the COCO Speech model on the Phoneme across Context (PaC) task of Schatz et al."}, {"id": 125, "string": "(2013) ."}, {"id": 126, "string": "This task consists of presenting a series of equal-length tuples (A, B, X) to the model, where A and B differ by one phoneme (either a vowel or a consonant), as do B and X, but A and X are not minimal pairs."}, {"id": 127, "string": "For example, in the tuple (be /bi/, me /mi/, my /maI/), the task is to identify which of the two syllables /bi/ or /mi/ is closer to /maI/."}, {"id": 128, "string": "The goal is to measure context invariance in phoneme discrimination by evaluating how often the model recognizes X as the syllable closer to B than to A."}, {"id": 129, "string": "We used a list of all attested consonant-vowel (CV) syllables of American English according to the syllabification method described in Gorman (2013) ."}, {"id": 130, "string": "We excluded the ones which could not be unambiguously represented using English spelling for input to the TTS system (e.g."}, {"id": 131, "string": "/baU/)."}, {"id": 132, "string": "We then compiled a list of all possible (A, B, X) tuples from this list where (A, B) and (B, X) are minimal pairs, but (A, X) are not."}, {"id": 133, "string": "This resulted in 34,288 tuples in total."}, {"id": 134, "string": "For each tuple, we measure sign(dist(A, X) − dist(B, X)), where dist(i, j) is the euclidean distance between the vector rep- Figure 2 : Accuracies for the ABX CV task for the cases where the target and the distractor belong to the same phoneme class."}, {"id": 135, "string": "Shaded area extends ±1 standard error from the mean."}, {"id": 136, "string": "resentations of syllables i and j."}, {"id": 137, "string": "These representations are either the audio feature vectors or the layer activation vectors."}, {"id": 138, "string": "A positive value for a tuple means that the model has correctly discriminated the phonemes that are shared or different across the syllables."}, {"id": 139, "string": "Table 3 shows the discrimination accuracy in this task using various representations."}, {"id": 140, "string": "The pattern is similar to what we observed in the phoneme identification task: best accuracy is achieved using representation vectors from recurrent layers 1 and 2, and it drops as we move further up in the model."}, {"id": 141, "string": "The accuracy is lowest when final embedding features are used for this task."}, {"id": 142, "string": "However, the PaC task is most meaningful and  challenging where the target and the distractor phonemes belong to the same phoneme class."}, {"id": 143, "string": "Figure 2 shows the accuracies for this subset of cases, broken down by class."}, {"id": 144, "string": "As can be seen, the model can discriminate between phonemes with high accuracy across all the layers, and the layer activations are more informative for this task than the MFCC features."}, {"id": 145, "string": "Again, most phoneme classes seem to be represented more accurately in the lower layers (1-3), and the performance of the model in this task drops as we move towards higher hidden layers."}, {"id": 146, "string": "There are also clear differences in the pattern of discriminability for the phoneme classes."}, {"id": 147, "string": "The vowels are especially easy to tell apart, but accuracy on vowels drops most acutely in the higher layers."}, {"id": 148, "string": "Meanwhile the accuracy on fricatives and approximants starts low, but improves rapidly and peaks around recurrent layer 2."}, {"id": 149, "string": "The somewhat erratic pattern for nasals and affricates is most likely due to small sample size for these classes, as evident from the wide standard error."}, {"id": 150, "string": "Organization of phonemes In this section we take a closer look at the underlying organization of phonemes in the model."}, {"id": 151, "string": "Our experiment is inspired by Khalighinejad et al."}, {"id": 152, "string": "(2017) who study how the speech signal is represented in the brain at different stages of the auditory pathway by collecting and analyzing electroencephalography responses from participants listening to continuous speech, and show that brain responses to different phoneme categories turn out to be organized by phonetic features."}, {"id": 153, "string": "We carry out an analogous experiment by analyzing the hidden layer activations of our model in response to each phoneme in the input."}, {"id": 154, "string": "First, we generated a distance matrix for every pair of phonemes by calculating the Euclidean distance between the phoneme pair's activation vectors for each layer separately, as well as a distance matrix for all phoneme pairs based on their MFCC features."}, {"id": 155, "string": "Similar to what Khalighinejad et al."}, {"id": 156, "string": "(2017) report, we observe that the phoneme activations on all layers significantly correlate with the phoneme representations in the speech signal, and these correlations are strongest for the lower layers of the model."}, {"id": 157, "string": "Figure 3 shows the results."}, {"id": 158, "string": "We then performed agglomerative hierarchical clustering on phoneme type MFCC and activation vectors, using Euclidean distance as the distance metric and the Ward linkage criterion (Ward Jr, 1963) ."}, {"id": 159, "string": "Figure 5 shows the clustering results for the activation vectors on the first hidden layer."}, {"id": 160, "string": "The leaf nodes are color-coded according to phoneme classes as specified in Table 1 ."}, {"id": 161, "string": "There is substantial degree of matching between the classes and the structure of the hierarchy, but also some mixing between rounded back vowels and voiced plosives /b/ and /g/, which share articulatory features such as lip movement or tongue position."}, {"id": 162, "string": "We measured the adjusted Rand Index for the match between the hierarchy induced from each representation against phoneme classes, which were obtained by cutting the tree to divide the cluster into the same number of classes as there are phoneme classes."}, {"id": 163, "string": "There is a notable drop between the match from MFCC to the activation of the convolutional layer."}, {"id": 164, "string": "We suspect this may be explained by the loss of information caused by averaging over phoneme instances combined with the lower temporal resolution of the activations compared to MFCC."}, {"id": 165, "string": "The match improves markedly at recurrent layer 1."}, {"id": 166, "string": "Synonym discrimination Next we simulate the task of distinguishing between pairs of synonyms, i.e."}, {"id": 167, "string": "words with different acoustic forms but the same meaning."}, {"id": 168, "string": "With a representation encoding phonological form, our expectation is that the task would be easy; in contrast, with a representation which is invariant to phonological form in order to encode meaning, the task would be hard."}, {"id": 169, "string": "We generate a list of synonyms for each noun, verb and adjective in the validation data using Wordnet (Miller, 1995) synset membership as a criterion."}, {"id": 170, "string": "Out of these generated word pairs, we select synonyms for the experiment based on the following criteria: • both forms clearly are synonyms in the sense that one word can be replaced by the other without changing the meaning of a sentence, • both forms appear more than 20 times in the validation data, • the words differ clearly in form (i.e."}, {"id": 171, "string": "they are not simply variant spellings like donut/doughnut, grey/gray), • the more frequent form constitutes less than 95% of the occurrences."}, {"id": 172, "string": "This gives us 2 verb, 2 adjective and 21 noun pairs."}, {"id": 173, "string": "For each synonym pair, we select the sentences in the validation set in which one of the two forms appears."}, {"id": 174, "string": "We use the POS-tagging feature of NLTK (Bird, 2006) to ensure that only those sentences are selected in which the word appears in the correct word category (e.g."}, {"id": 175, "string": "play and show are synonyms when used as nouns, but not when used as verbs)."}, {"id": 176, "string": "We then generate spoken utterances in which the original word is replaced by its synonym, resulting in the same amount of utterances for both words of each synonym pair."}, {"id": 177, "string": "For each pair we generate a binary classification task using the MFCC features, the average activations in the convolutional layer, the average unit   activations per recurrent layer, and the sentence embeddings as input features."}, {"id": 178, "string": "For every type of input, we run 10-fold cross validation using Logistic Regression to predict which of the two words the utterance contains."}, {"id": 179, "string": "We used an average of 672 (minimum 96; maximum 2282) utterances for training the classifiers."}, {"id": 180, "string": "Figure 6 shows the error rate in this classification task for each layer and each synonym pair."}, {"id": 181, "string": "Recurrent layer activations are more informative for this task than MFCC features or activations of the convolutional layer."}, {"id": 182, "string": "Across all the recurrent layers the error rate is small, showing that some form of phonological information is present throughout this part of the model."}, {"id": 183, "string": "However, sentence embeddings give relatively high error rates suggesting that the attention layer acts to focus on semantic information and to filter out much of phonological form."}, {"id": 184, "string": "Discussion Understanding distributed representations learned by neural networks is important but has the reputation of being hard or even impossible."}, {"id": 185, "string": "In this work we focus on making progress on this problem for a particular domain: representations of phonology in a multilayer recurrent neural network trained on grounded speech signal."}, {"id": 186, "string": "We believe it is important to carry out multiple analyses using diverse methodology: any single experiment may be misleading as it depends on analytical choices such as the type of supervised model used for decoding, the algorithm used for clustering, or the similarity metric for representational similarity analysis."}, {"id": 187, "string": "To the extent that more than one experiment points to the same conclusion our confidence in the reliability of the insights gained will be increased."}, {"id": 188, "string": "Earlier work (Chrupała et al., 2017a) shows that encoding of semantics in our RNN model of grounded speech becomes stronger in higher layers, while encoding of form becomes weaker."}, {"id": 189, "string": "The main high-level results of our study confirm this pattern by showing that the representation of phonological knowledge is most accurate in the lower layers of the model."}, {"id": 190, "string": "This general pattern is to be expected as the objective of the utterance encoder is to transform the input acoustic features in such a way that it can be matched to its counterpart in a completely separate modality."}, {"id": 191, "string": "Many of the details of how this happens, however, are far from obvious: perhaps most surprisingly we found that a large amount of phonological information is still available up to the top recurrent layer."}, {"id": 192, "string": "Evidence for this pattern emerges from the phoneme decoding task, the ABX task and the synonym discrimination task."}, {"id": 193, "string": "The last one also shows that the attention layer filters out and significantly attenuates encoding of phonology and makes the utterance embeddings much more invariant to synonymy."}, {"id": 194, "string": "Our model is trained on synthetic speech, which is easier to process than natural human-generated speech."}, {"id": 195, "string": "While small-scale databases of natural speech and image are available (e.g."}, {"id": 196, "string": "the Flickr8k Audio Caption Corpus, Harwath and Glass, 2015) , they are not large enough to reliably train models such as ours."}, {"id": 197, "string": "In future we would like to collect more data and apply our methodology to grounded human speech and investigate whether context and speaker-invariant phoneme representations can be learned from natural, noisy input."}, {"id": 198, "string": "We would also like to make comparisons to the results that emerge from similar analyses applied to neuroimaging data."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 25}, {"section": "Related Work", "n": "2", "start": 26, "end": 27}, {"section": "Phoneme perception", "n": "2.1", "start": 28, "end": 48}, {"section": "Computational models", "n": "2.2", "start": 49, "end": 73}, {"section": "Model", "n": "3", "start": 74, "end": 90}, {"section": "Experimental data and setup", "n": "4", "start": 91, "end": 93}, {"section": "Model settings", "n": "4.1", "start": 94, "end": 96}, {"section": "Forced alignment", "n": "4.3", "start": 97, "end": 102}, {"section": "Experiments", "n": "5", "start": 103, "end": 107}, {"section": "Phoneme decoding", "n": "5.1", "start": 108, "end": 123}, {"section": "Phoneme discrimination", "n": "5.2", "start": 124, "end": 149}, {"section": "Organization of phonemes", "n": "5.3", "start": 150, "end": 165}, {"section": "Synonym discrimination", "n": "5.4", "start": 166, "end": 183}, {"section": "Discussion", "n": "6", "start": 184, "end": 198}], "figures": [{"filename": "../figure/image/1212-Figure1-1.png", "caption": "Figure 1: Accuracy of phoneme decoding with input MFCC features and COCO Speech model activations. The boxplot shows error rates bootstrapped with 1000 resamples.", "page": 5, "bbox": {"x1": 74.39999999999999, "x2": 288.0, "y1": 68.64, "y2": 229.92}}, {"filename": "../figure/image/1212-Table3-1.png", "caption": "Table 3: Accuracy of choosing the correct target in an ABX task using different representations.", "page": 5, "bbox": {"x1": 348.96, "x2": 484.32, "y1": 628.8, "y2": 763.1999999999999}}, {"filename": "../figure/image/1212-Figure2-1.png", "caption": "Figure 2: Accuracies for the ABX CV task for the cases where the target and the distractor belong to the same phoneme class. Shaded area extends ±1 standard error from the mean.", "page": 5, "bbox": {"x1": 331.68, "x2": 502.08, "y1": 68.64, "y2": 251.04}}, {"filename": "../figure/image/1212-Figure4-1.png", "caption": "Figure 4: Adjusted Rand Index for the comparison of the phoneme type hierarchy induced from representations against phoneme classes.", "page": 6, "bbox": {"x1": 310.08, "x2": 523.1999999999999, "y1": 362.88, "y2": 440.64}}, {"filename": "../figure/image/1212-Figure3-1.png", "caption": "Figure 3: Pearson’s correlation coefficients r between the distance matrix of MFCCs and distance matrices on activation vectors.", "page": 6, "bbox": {"x1": 81.6, "x2": 281.28, "y1": 65.75999999999999, "y2": 140.16}}, {"filename": "../figure/image/1212-Figure5-1.png", "caption": "Figure 5: Hierarchical clustering of phoneme activation vectors on the first hidden layer.", "page": 7, "bbox": {"x1": 120.0, "x2": 477.12, "y1": 61.44, "y2": 240.95999999999998}}, {"filename": "../figure/image/1212-Figure6-1.png", "caption": "Figure 6: Synonym discrimination error rates, per representation and synonym pair.", "page": 7, "bbox": {"x1": 326.88, "x2": 506.4, "y1": 286.56, "y2": 543.36}}, {"filename": "../figure/image/1212-Table1-1.png", "caption": "Table 1: Phonemes of General American English.", "page": 3, "bbox": {"x1": 347.03999999999996, "x2": 485.76, "y1": 61.44, "y2": 172.32}}, {"filename": "../figure/image/1212-Table2-1.png", "caption": "Table 2: COCO Speech utterance encoder architecture.", "page": 4, "bbox": {"x1": 85.92, "x2": 276.0, "y1": 62.879999999999995, "y2": 178.07999999999998}}]}