{"title": "A Study of Reuse and Plagiarism in Speech and Natural Language Processing papers", "abstract": "The aim of this experiment is to present an easy way to compare fragments of texts in order to detect (supposed) results of copy & paste operations between articles in the domain of Natural Language Processing, including Speech Processing (NLP). The search space of the comparisons is a corpus labelled as NLP4NLP, which includes 34 different sources and gathers a large part of the publications in the NLP field over the past 50 years. This study considers the similarity between the papers of each individual source and the complete set of papers in the whole corpus, according to four different types of relationship (self-reuse, self-plagiarism, reuse and plagiarism) and in both directions: a source paper borrowing a fragment of text from another paper of the collection, or in the reverse direction, fragments of text from the source paper being borrowed and inserted in another paper of the collection.", "text": [{"id": 0, "string": "Introduction Everything starts with a copy & paste and, of course the flood of documents that we see today could not exist without the practical ease of copy & paste."}, {"id": 1, "string": "This is not new but what is new is that the availability of archives allows us to study a vast amount of papers in our domain (i.e."}, {"id": 2, "string": "Natural Language Processing, NLP, both for written and spoken materials) and to figure out the level of reuse and plagiarism in this area."}, {"id": 3, "string": "Context Our work comes after the various studies initiated in the Workshop entitled: \"Rediscovering 50 Years of Discoveries in Natural Language Processing\" on the occasion of ACL's 50th anniversary in 2012 [Radev et al 2013] where a group of researchers studied the content of the corpus recorded in the ACL Anthology [Bird et al 2008] ."}, {"id": 4, "string": "Among these studies, one was devoted to reuse and it is worth quoting Gupta and Rosso [Gupta et al 2012]: \"It becomes essential to check the authenticity and the novelty of the submitted text before the acceptance."}, {"id": 5, "string": "It becomes nearly impossible for a human judge (reviewer) to discover the source of the submitted work, if any, unless the source is already known."}, {"id": 6, "string": "Automatic plagiarism detection applications identify such potential sources for the submitted work and based on it a human judge can easily take the decision\"."}, {"id": 7, "string": "Let's add that this subject is a specific and active domain ruled yearly by the PAN international plagiarism detection competition 1 ."}, {"id": 8, "string": "On our side, we also conducted a specific study of reuse and plagiarism in the papers published at the Language Resources and Evaluation conference (LREC), from 1998 to 2014 [Francopoulo et al 2016]."}, {"id": 9, "string": "Objectives Our aim is not to present the state-of-art or to compare the various metrics and algorithms for reuse and plagiarism detection, see [Hoad et al 2003] [HaCohen-Kerner et al 2010] for instance."}, {"id": 10, "string": "We position our work as an extrinsic detection, the aim of which is to find near-matches between texts, as opposed to intrinsic detection whose aim is to show that different parts of a presumably single-author text could not have been written by the In contrast, our main objective is to deal with the entry level of the detection."}, {"id": 11, "string": "The main question is: Is there a meaningful difference in taking the verbatim raw strings compared with the result of a linguistic parsing?"}, {"id": 12, "string": "A secondary objective is to present and study a series of ascertainments about the practices of our specific field."}, {"id": 13, "string": "The corpus: NLP4NLP The corpus is a large content of our own research field, i.e."}, {"id": 14, "string": "NLP, covering both written and spoken language processing sub-domains and extended to a limited number of corpora, for which Information Retrieval and NLP activities intersect."}, {"id": 15, "string": "This corpus was collected at IMMI-CNRS and LIMSI-CNRS (France) and is named NLP4NLP 2 ."}, {"id": 16, "string": "It currently contains 65,003 documents coming from various conferences and journals with either public or restricted access."}, {"id": 17, "string": "This is a large part of the existing published articles in our field, apart from the workshop proceedings and the published books."}, {"id": 18, "string": "The time period spans 50 years from 1965 to 2015."}, {"id": 19, "string": "Broadly speaking, and aside from the small corpora, one third comes from the ACL Anthology 3 , one third from the ISCA Archive 4 and one third from IEEE 5 A phase of preprocessing has been applied to represent the various sources in a common format."}, {"id": 20, "string": "This format follows the organization of the ACL Anthology with two parts in parallel for each document: the metadata and the content."}, {"id": 21, "string": "Each document is labeled with a unique identifier, for instance \"lrec2000_1\" is reified on the hard disk as two files: \"lrec2000_1.bib\" and \"lrec2000_1.pdf\"."}, {"id": 22, "string": "For the metadata, we faced four different types of sources with different flavors and character encodings: BibTeX (e.g."}, {"id": 23, "string": "ACL Anthology), custom XML (e.g."}, {"id": 24, "string": "TALN), database downloads (e.g."}, {"id": 25, "string": "IEEE) or HTML program of the conference (e.g."}, {"id": 26, "string": "TREC)."}, {"id": 27, "string": "We wrote a series of small Java programs to transform these metadata into a common BibTeX format under UTF8."}, {"id": 28, "string": "Each file comprises the author names and the title."}, {"id": 29, "string": "The file is located in a directory which designates the year and the corpus."}, {"id": 30, "string": "Concerning the content, we faced different formats possibly for the same corpus, and the amount of documents being huge, we cannot designate the file type by hand individually."}, {"id": 31, "string": "To deal with this, we wrote a program to self-detect the type and sub-type as follows: A small amount of texts are in raw text: we keep them in this format."}, {"id": 32, "string": "The vast majority of the documents are in PDF format of different sub-types."}, {"id": 33, "string": "First, we used PDFBox 7 to determine the sub-type of the PDF content: when the content is a textual content, we use PDFBox 3 http://aclweb.org/anthology 4 www.isca-speech.org/iscaweb/index.php/archive/online-archive 5 https://www.ieee.org/index.html 6 In the case of a joint conference, the papers are counted twice."}, {"id": 34, "string": "This number reduces to 65,003, if we count only once duplicated papers."}, {"id": 35, "string": "Similarly, the number of venues is 577 when all venues are counted, but this number reduces to 558 when the 19 joint conferences are counted only once."}, {"id": 36, "string": "again to extract the text, possibly with the use of the \"Legion of the Bouncy Castle\" 8 to extract the encrypted content."}, {"id": 37, "string": "When the PDF is a text under the form of an image, we use PDFBox to extract the images and then Tesseract OCR 9 to transform the images into a textual content."}, {"id": 38, "string": "Then, and after some experiments, two filters are applied to avoid getting rubbish content: The content should be at least 900 characters."}, {"id": 39, "string": "The content should be of good quality."}, {"id": 40, "string": "In order to evaluate this quality, the content is analyzed by the morphological module of TagParser [Francopoulo 2007], a deep industrial parser based on a broad English lexicon and Global Atlas (a knowledge base containing more than one million words from 18 Wikipedias) [Francopoulo et al."}, {"id": 41, "string": "2013 ] to detect out-of-the-vocabulary (OOV) words."}, {"id": 42, "string": "Based on the hypothesis that rubbish strings are OOV words, we retain a text when the ratio OOV / number of words is less than 9%."}, {"id": 43, "string": "We then apply a set of symbolic rules to split the abstract, body and reference section."}, {"id": 44, "string": "The file is recorded in XML."}, {"id": 45, "string": "It should be noted that we made some experiments with other strategies, given the fact that we are able to compare them with respect to a quantitative evaluation of the quality, as explained before."}, {"id": 46, "string": "The first experiment was to use ParsCit 10 [Councill et al."}, {"id": 47, "string": "2008 ] but the evaluation of the quality was bad, specially when the content is not pure ASCII."}, {"id": 48, "string": "The result on accentuated Latin strings, or Arabic and Russian contents was awful."}, {"id": 49, "string": "We also tried Grobid 11 but we did not succeed to run it correctly on Windows."}, {"id": 50, "string": "A semi-automatic cleaning process was applied on the metadata in order to avoid false duplicates concerning middle names (for X Y Z, is Y a second given name or the first part of the family name?)"}, {"id": 51, "string": "and for this purpose, we use the specific BibTex format where the given name is separated from the family name with a comma."}, {"id": 52, "string": "Then typographic variants (e.g."}, {"id": 53, "string": "\"Jean-Luc\" versus \"Jean Luc\" or \"Herve\" versus \"Hervé\") were searched in a tedious process and false duplicates were normalized in order to be merged."}, {"id": 54, "string": "The resulting number of different authors is 48,894. for more details about the extraction process as well as the solutions for some tricky problems like joint conferences management or abstract / body / reference sections detection."}, {"id": 55, "string": "The majority (90%) of the documents come from conferences, the rest coming from journals."}, {"id": 56, "string": "The overall number of words is roughly 270M."}, {"id": 57, "string": "Initially, the texts are in four languages: English, French, German and Russian."}, {"id": 58, "string": "The number of texts in German and Russian is less than 0.5%."}, {"id": 59, "string": "They are detected automatically and are ignored."}, {"id": 60, "string": "The texts in French are a little bit more numerous (3%), and are kept with the same status as the English ones."}, {"id": 61, "string": "This is not a problem as our tool is able to process English and French."}, {"id": 62, "string": "The corpus is a collection of documents of a single technical domain, which is NLP in the broad sense, and of course, some conferences are specialized in certain topics like written language processing, spoken language processing, including signal processing, information retrieval or machine translation."}, {"id": 63, "string": "Definitions As the terminology is fuzzy and contradictory among the scientific literature, we need first to define four important terms in order to avoid any misunderstanding."}, {"id": 64, "string": "The term \"self-reuse\" is used for a copy & paste when the source of the copy has an author who belongs to the group of authors of the text of the paste and when the source is cited."}, {"id": 65, "string": "The term \"self-plagiarism\" is used for a copy & paste when the source of the copy has similarly an author who belongs to the group of authors of the text of the paste, but when the source is not cited."}, {"id": 66, "string": "The term \"reuse\" is used for a copy & paste when the source of the copy has no author in the group of authors of the paste and when the source is cited."}, {"id": 67, "string": "The term \"plagiarism\" is used for a copy & paste when the source of the copy has no author in the group of the paste and when the source is not cited."}, {"id": 68, "string": "Said in other words, the terms \"self-reuse\" and \"reuse\" qualify a situation with a proper source citation, on the contrary of \"self-plagiarism\" and \"plagiarism\"."}, {"id": 69, "string": "Let's note that in spite of the fact that the term \"self-plagiarism\" seems to be contradictory as authors should be free to use their own wordings, we use this term because it is the usual habit within the community of plagiarism detectionsome authors also use the term \"recycling\", for instance [HaCohen-Kerner et al 2010]."}, {"id": 70, "string": "Directions Another point to clarify concerns the expression \"source papers\"."}, {"id": 71, "string": "As a convention, we call \"focus\" the corpus corresponding to the source which is studied."}, {"id": 72, "string": "The whole NL4NLP collection is the \"search space\"."}, {"id": 73, "string": "We examine the copy & paste operations in both directions: we study the configuration with a source paper borrowing fragments of text from other papers of the NLP4NLP collection, in other words, a backward study, and we also study in the reverse direction the fragments of the source paper being borrowed by papers of the NLP4NLP collection, in other words, a forward study."}, {"id": 74, "string": "Algorithm Comparison of word sequences has proven to be an effective method for detection of copy For each document of the focus (the source corpus), all the sliding windows 12 of lemmas (typically 5 to 7, excluding punctuations) are built and recorded under the form of a character string key in an index locally to a document."}, {"id": 75, "string": "An index gathering all these local indexes is built and is called the \"focus index\"."}, {"id": 76, "string": "For each document apart from the focus (i.e."}, {"id": 77, "string": "outside the source corpus), all the sliding windows are built and only the windows contained in the focus index are recorded in an index locally to this document."}, {"id": 78, "string": "This filtering operation is done to optimize the comparison phase, as there is no need to compare the windows out of the focus index."}, {"id": 79, "string": "Then, the keys are compared to compute a similarity overlapping score [Lyon et al 2001] between documents D1 and D2, with the Jaccard distance: score(D1,D2) = shared windows# / union# (D1 windows, D2 windows)."}, {"id": 80, "string": "The pairs of documents D1 / D2 are then filtered according to a threshold in order to retain only significant similarity scoring situations."}, {"id": 81, "string": "Algorithm comments and evaluation In a first implementation, we compared the raw character strings with a segmentation based on space and punctuation."}, {"id": 82, "string": "But, due to the fact that the input is the result of PDF formatting, the texts may contain variable caesura for line endings or some little textual variations."}, {"id": 83, "string": "Our objective is to compare at a higher level than hyphen variation (there are different sorts of hyphens), caesura (the sequence X/-/endOfLine/Y needs to match an entry XY in the lexicon to distinguish from an hyphen binding a composition), upper/lower case variation, plural, orthographic variation (\"normalise\" versus \"normalize\"), spellchecking (particularly useful when the PDF is an image and when the extraction is of low quality) and abbreviation (\"NP\" versus \"Noun Phrase\" or \"HMM\" versus \"Hidden Markov Model\")."}, {"id": 84, "string": "Some rubbish sequence of characters (e.g."}, {"id": 85, "string": "a series of hyphens) were also detected and cleaned."}, {"id": 86, "string": "Given that a parser takes all these variations and cleanings into account, we decided to apply a full linguistic parsing, as a second strategy."}, {"id": 87, "string": "The syntactic structures and relations are ignored."}, {"id": 88, "string": "Then a module for entity linking is called in order to bind different names referring to the same entity, a process often labeled as \"entity linking\" ."}, {"id": 89, "string": "Thus \"British National Corpus\" is considered as possibly abbreviated to \"BNC\", as well as less regular names like \"ItalWordNet\" possibly abbreviated to \"IWN\"."}, {"id": 90, "string": "Each entry of the Knowledge Base has a canonical form, possibly associated with different variants: the aim is to normalize into a canonical form to neutralize proper noun obfuscations based on variant substitutions."}, {"id": 91, "string": "After this processing, only the sentences with at least a verb are considered."}, {"id": 92, "string": "We examined the differences between those two strategies concerning all types of copy & paste situations above the threshold, choosing the LREC source as the focus."}, {"id": 93, "string": "The results are presented in Table 2 , with the last column adding the two other columns without the duplicates produced by the couples of the same year."}, {"id": 94, "string": "The strategy based on linguistic processing provides more pairs (+158) and we examined these differences."}, {"id": 95, "string": "Among these pairs, the vast majority (80%) concerns caesura: this is normal because most conferences demand a double column format, so the authors frequently use caesura to save place 13 ."}, {"id": 96, "string": "The other differences (20%) are mainly caused by lexical variations and spellchecking."}, {"id": 97, "string": "Thus, the results show that using raw texts gives a more \"silent\" system."}, {"id": 98, "string": "The drawback is that the computation is much longer 14 , but we think that it is worth the value."}, {"id": 99, "string": "Tuning parameters There are three parameters that had to be tuned: the window size, the distance function and the threshold."}, {"id": 100, "string": "The main problem we had was that we did not have any gold standard to evaluate the quality specifically on our corpus and the burden to annotate a corpus was too heavy."}, {"id": 101, "string": "We therefore decided to start from the parameters presented in the articles related to the PAN contest."}, {"id": 102, "string": "We then computed the results, picked a random selection of pairs that we examined and tuned the parameters accordingly."}, {"id": 103, "string": "All experiments were conducted with LREC as the focus and NLP4NLP as the search space."}, {"id": 104, "string": "In the PAN related articles, different window sizes are used."}, {"id": 105, "string": "A window of five is the most frequent one [Kasprzak et al 2010], but our results show that a lot of common sequences like \"the linguistic unit is the\" overload the pairwise score."}, {"id": 106, "string": "After some trials, we decided to select a size of seven tokens, in agreement with [Citron and Ginsparg 2014]."}, {"id": 107, "string": "Concerning the distance function, the Jaccard distance is frequently used but let's note that other formulas are applicable and documented in the literature."}, {"id": 108, "string": "For instance, some authors use an approximation with the following formula: score(D1,D2) = shared windows# / min(D1 windows#, D2 windows#) [Clough et al 2009], which is faster to compute, because there is no need to compute the union."}, {"id": 109, "string": "Given that computation time is not a problem for us, we kept the most used function which is the Jaccard distance."}, {"id": 110, "string": "Concerning the threshold, we tried thresholds of 0.03 and 0.04 (3 to 4%) and we compared the results."}, {"id": 111, "string": "The last value gave more significant results, as it reduced noise, while still allowing to detect meaningful pairs of similar papers."}, {"id": 112, "string": "After running the first trials, we discovered that using the Jaccard distance resulted in considering as similar a set of two papers, one of them being of small content."}, {"id": 113, "string": "This may be the case for invited talks, for example, when the author only provide a short abstract."}, {"id": 114, "string": "In this case, a simple acknowledgement to the same institution may produce a similarity score higher than the threshold."}, {"id": 115, "string": "The same happens for some eldest papers when the OCR produced a truncated document."}, {"id": 116, "string": "In order to solve this problem, we added a second threshold on the minimum number of shared windows that we set at 50 after considering the corresponding erroneous cases."}, {"id": 117, "string": "Special considerations concerning authorship and citations As previously explained, our aim is to distinguish a copy & paste fragment associated with a citation compared to a fragment without any citation."}, {"id": 118, "string": "To this end, we proceed with an approximation: we do not bind exactly the anchor in the text, but we parse the reference section and consider that, globally to the text, the document cites (or not) the other document."}, {"id": 119, "string": "Due to the fact, that we have proper author identification for each document, the corpus forms a complex web of citations."}, {"id": 120, "string": "We are thus able to distinguish self-reuse versus self-plagiarism and reuse versus plagiarism."}, {"id": 121, "string": "We are in a situation slightly different from METER where the references are not Precision about the anteriority test Given the fact that some papers and drafts of papers can circulate among researchers before the official published date, it is impossible to verify exactly when a document is issued; moreover we do not have any more detailed time indication than the year, as we don't know the precise date of submission."}, {"id": 122, "string": "This is why we also consider the same year within the comparisons."}, {"id": 123, "string": "In this case, it is difficult to determine which are the borrowing and borrowed papers, and in some cases they may even have been written simultaneously."}, {"id": 124, "string": "However, if one paper cites a second one, while it is not cited by the second one, it may serve as a sign to consider it as being the borrowing paper."}, {"id": 125, "string": "Resulting files The program computes a detailed result for each individual source as an HTML page where all similar pairs of documents are listed with their similarity score, with the common fragments displayed as red highlighted snippets and HTML links back to the original 67,937 documents 15 ."}, {"id": 126, "string": "For each of the 4 categories (Self-reuse, Self-Plagiarism, Reuse and Plagiarism), the program produces the list of couples of \"similar\" papers according to our criteria, with their similarity score, and the global results in the form of matrices displaying the number of papers 14 It takes 25 hours instead of 3 hours on a mid-range mono-processor Xeon E3-1270 V2 with 32G of RAM."}, {"id": 127, "string": "15 But the space limitations do not allow to present these results in lengthy details."}, {"id": 128, "string": "Furthermore, we do not want to display personal results."}, {"id": 129, "string": "that are similar in each couple of the 34 sources, in the forward and backward directions (the using sources are on the X axis, while the used sources are on the Y axis)."}, {"id": 130, "string": "The total of used and using papers, and the difference between those totals, are presented, while the 7 (Table 3) or 5 (Table 4 ) top using or used sources are indicated in green."}, {"id": 131, "string": "We conducted a manual checking of the couples of papers showing a very high similarity: the 14 couples that showed a similarity of 1 were the duplication of a paper due to an error in editing the proceedings of a conference."}, {"id": 132, "string": "We also found after those first trials erroneous results of the OCR for some eldest papers which resulted in files containing several papers, in full or in fragments, or where blanks were inserted after each individual character."}, {"id": 133, "string": "We excluded those 86 documents from the corpus being considered."}, {"id": 134, "string": "Checking those results, we also mentioned several cases where the author was the same, but with a different spelling, or where references were properly quoted, but with a different wording, a different spelling (American English versus British English, for example) or an improper reference to the source."}, {"id": 135, "string": "We had to manually correct those cases, and move the corresponding couples of papers in the correct category (from reuse or plagiarism to self-reuse or self-plagiarism in the case of authors names, from plagiarism to reuse, in the case of references)."}, {"id": 136, "string": "Table 3 provides the results of merging self-reuse (authors reusing their own text while quoting the source paper) and self-plagiarism (authors reusing their own text without quoting the source paper)."}, {"id": 137, "string": "As we see, it is a rather frequent phenomenon, with a total of 12,493 documents (i.e."}, {"id": 138, "string": "18% of the 67,937 documents!)."}, {"id": 139, "string": "In 61% of the cases (7,650 self-plagiarisms over 12,493), the authors do not quote the source paper."}, {"id": 140, "string": "We found that 205 papers have exactly the same title, and that 130 papers have both the same title and the same list of authors!"}, {"id": 141, "string": "Also 3,560 papers have exactly the same list of authors."}, {"id": 142, "string": "Given the large number of documents, it is impossible to conduct a manual checking of all the couples."}, {"id": 143, "string": "We see that the most used sources are the large conferences: ISCA, IEEE-ICASSP, ACL, COLING, HLT, EMNLP and LREC."}, {"id": 144, "string": "The most using sources are not only those large conferences, but also the journals: IEEE-Transactions on Acoustics, Speech and Language Processing (and its various avatars) (TASLP), Computer Speech and Language (CSAL), Computational Linguistics (CL) and Speech Com."}, {"id": 145, "string": "If we consider the balance between the using and the used sources, we clearly see that the flow of papers goes from conferences to journals."}, {"id": 146, "string": "The largest flows of self-reuse and self-plagiarism concern ISCA and ICASSP, in both directions, but especially from ISCA to ICASSP, ICASSP and ISCA to TASLP (also in the reverse direction) and to CSAL, ISCA to Speech Com, ACL to Computational Linguistics, ISCA to LREC and EMNLP to ACL."}, {"id": 147, "string": "If we want to study the influence a given conference (or journal) has on another one, we must however recall that these figures are raw figures in terms of number of documents, and we must not forget that some conferences (or journals) are much bigger than others."}, {"id": 148, "string": "For instance, LREC is a conference with more than 4,500 documents compared to LRE which is a journal with only 308 documents."}, {"id": 149, "string": "If we relate the number of published papers that reuse another paper to the total number of published papers, we may see that 17% of the LRE papers (52 over 308) use content coming from the LREC conferences, without quoting them in 66% of the cases."}, {"id": 150, "string": "Also the frequency of the conferences (annual or biennial) and the calendar (date of the conference and of the submission deadline) may influence the flow of papers between the sources."}, {"id": 151, "string": "The similarity scores range from 4% to 97% (Fig."}, {"id": 152, "string": "1) ."}, {"id": 153, "string": "We see that about 4,500 couples of papers have a similarity score equal or superior to 10%; about 900 (1.3% of the total number of papers) have a score superior or equal to 30%."}, {"id": 154, "string": "Looking at the ones with the largest similarity score, we found a few examples of important variants in the spelling of the same authors' names, and cases of republishing the corrigendum of a previously published paper or of republishing a paper with a small difference in the title and one missing author in the authors' list."}, {"id": 155, "string": "In one case, the same research center is described by the same author in two different conferences with an overlapping of 90%."}, {"id": 156, "string": "In another case, the difference of the two papers is primarily in the name of the systems being presented, funded by the same project agency in two different contracts, while the description has a 45% overlap!"}, {"id": 157, "string": "1  501  1001  1501  2001  2501  3001  3501  4001  4501  5001  5501  6001  6501  7001  7501  8001  8501  9001  9501  10001  10501  11001  Used   Using  acl  acmtslp  alta  anlp  cath  cl  coling  conll  csal  eacl  emnlp  hlt  icassps  ijcnlp  inlg  isca  jep  lre  lrec  ltc  modulad  mts  muc  naacl  paclic  ranlp  sem  speechc  tacl  tal  taln  taslp  tipster  trec  Total used  Total using  Difference   acl  22  8  1  4  8 136 78 25 31 22 83 85  29 31  7  48  0 20 71  4  0 19  1 51  8  5 26  1  2  0  0  24  4  9  863  625  238 Table 3 ."}, {"id": 158, "string": "Self-reuse and Self-Plagiarism Matrix, with indication of the 7 most using and used sources."}, {"id": 159, "string": "Self-reuse and Self-Plagiarism Used Using  acl  acmtslp  alta  anlp  cath  cl  coling  conll  csal  eacl  emnlp  hlt  icassps  ijcnlp  inlg  isca  jep  lre  lrec  ltc  modulad  mts  muc  naacl  paclic  ranlp  sem  speechc  tacl  tal  taln  taslp  tipster  trec  Total used  Total using  Difference   acl  1  0  0  0  1  1  2  2  0  0  4  3  0  3 Table 4 provides the results of merging reuse (authors reusing fragments of the texts of other authors while quoting the source paper) and plagiarism (authors reusing fragments of the texts of other authors without quoting the source paper)."}, {"id": 160, "string": "As we see, there are very few cases altogether."}, {"id": 161, "string": "Only 261 papers (i.e."}, {"id": 162, "string": "less than 0.4% of the 67,937 documents) reuse a fragment of papers written by other authors that they quote."}, {"id": 163, "string": "In 60% of the cases (156 plagiarisms over 261), the authors do not quote the source paper, but these possible cases of plagiarism only represent 0.23% of the total number of papers."}, {"id": 164, "string": "Given those small numbers, we were able to conduct a manual checking of those couples."}, {"id": 165, "string": "Among the couple papers placed in the \"Reuse\" category, it appeared that 12 have a least one author in common, but with a somehow different spelling and should therefore be placed in the \"Self-reuse\" category."}, {"id": 166, "string": "Among the couples of papers placed in the \"Plagiarism\" category, 25 have a least one author in common, but with a somehow different spelling and should therefore be placed in the \"Self-plagiarism\" category and 14 correctly quote the source paper, but with variants in the spelling of the authors' names, of the paper's title or of the conference or journal source or forgetting to place the source paper in the references and should therefore be placed in the \"Reuse\" category."}, {"id": 167, "string": "It therefore resulted in 107 cases of \"reuse\" and 117 possible cases of plagiarism (0.17% of the papers) that we studied more closely."}, {"id": 168, "string": "We found the following explanations: The paper cites another reference from the same authors of the source paper (typically a previous reference, or a paper published in a Journal) (46 cases) Both papers use extracts of a third paper that they both cite (31 cases) The authors of the two papers are different, but from the same laboratory (typically in industrial laboratories or funding agencies) (11 cases) The authors previously co-authored papers (typically as supervisor and PhD student or postdoc) but are now in a different laboratory (11 cases) The authors of the papers are different, but collaborated in the same project which is presented in the two papers (2 cases) The two papers present the same short example, result or definition coming from another source (13 cases) If we exclude those cases, only 3 cases of possible plagiarism remain that correspond to the same paper which appears as a patchwork of 3 other papers, while sharing several references with them."}, {"id": 169, "string": "The similarity scores range from 4% to 42% (Fig."}, {"id": 170, "string": "2) ."}, {"id": 171, "string": "Only 34 couples of papers have a similarity score equal or higher than 10%."}, {"id": 172, "string": "For example, the couple showing the highest similarity score comprises a paper published in 1998 and a paper published in 2000 which both describe Chart parsing using the words of the initial paper published 20 years earlier in 1980, that they both properly quote."}, {"id": 173, "string": "Among the three remaining possible cases of plagiarism, the highest similarity score is 10%, with a shared window of 200 tokens."}, {"id": 174, "string": "Fig."}, {"id": 175, "string": "2 Similarity scores of the couples detected as reuse / plagiarism Time delay between publication and reuse We now consider the duration between the publication of a paper and its reuse (in all 4 categories) in another publication."}, {"id": 176, "string": "It appears that 38% of the similar papers were published on the same year, 71% within the next year, 83% over 2 years and 93% over 3 years (Figure 3 and 4 )."}, {"id": 177, "string": "Only 7% reuse material from an earlier period."}, {"id": 178, "string": "The average duration is 1.22 years."}, {"id": 179, "string": "30% of the similar papers published on the same year concern the couple of conferences ISCA-ICASSP."}, {"id": 180, "string": "We now consider the reuse of conference papers in journal papers ( Figures 5 and 6 )."}, {"id": 181, "string": "We observe here a similar time schedule, with a delay of one year: 12% of the reused papers were published on the same year, 41% within the next year, 68% over 2 years, 85% over 3 years and 93% over 4 years."}, {"id": 182, "string": "Only 7% reuse material from an earlier period."}, {"id": 183, "string": "The average duration is 2.07 years."}, {"id": 184, "string": "Discussion The first obvious ascertainment is that self-reusing is much more important than reusing the content of others."}, {"id": 185, "string": "With a comparable threshold of 0.04, when we consider the total of the two directions, there are 4843 self-reuse and 7650 self-plagiarism detected pairs, compared with 105 reuse and 156 plagiarism detected pairs."}, {"id": 186, "string": "Globally, the source papers are quoted only in 39% of the cases on average, a percentage which falls down from 39% to 23% if the papers are published on the same year."}, {"id": 187, "string": "Plagiarism may raise legal issues if it violates copyright, but the right to quote 16 exists in certain conditions: \"National legislations usually embody the Berne convention limits in one or more of the following requirements: the cited paragraphs are within a reasonable limit, clearly marked as quotations and fully referenced, the resulting new work is not just a collection of quotations, but constitutes a fully original work in itself\", we could also add that the cited paragraph must have a function in the goal of the citing paper."}, {"id": 188, "string": "Obviously, most of the cases reported in this paper comply with the right to quote."}, {"id": 189, "string": "The limits of the cited paragraph vary from country to country."}, {"id": 190, "string": "In France and Canada, for example, a limit of 10% of both the copying and copied texts seems to be acceptable."}, {"id": 191, "string": "As we've seen, we stay within those limits in all cases in NLP4NLP."}, {"id": 192, "string": "Self-reuse and self-plagiarism are of a different nature."}, {"id": 193, "string": "Let's recall that they concern papers that have at least one author in common."}, {"id": 194, "string": "Of course, a copy & paste operation is easy and frequent but there is another phenomena to take into account which is difficult to distinguish from copy & paste: this is the style of the author."}, {"id": 195, "string": "Everybody has habits to formulate its ideas, and, even on a long period, most authors seem to keep the same chunks of prepared words."}, {"id": 196, "string": "As we've seen, almost 40% of the cases concern papers that are published on the same year: authors submit two similar papers at two different conferences on the same year, and publish the two papers in both conferences if both are accepted."}, {"id": 197, "string": "It is very difficult to prevent those cases as none of the papers are published when the other is submitted."}, {"id": 198, "string": "Another frequent case is the publication of a paper in a journal after its publication in a conference."}, {"id": 199, "string": "Here also, it is a natural and usual process, sometimes even encouraged by the journal editors after a pre-selection of the best papers in a conference."}, {"id": 200, "string": "As a tentative to moderate these figures and to justify self-reuse and self-plagiarism of previously published material, it is worth quoting Pamela Samuelson [Samuelson 1994]: The previous work must be restated to lay the groundwork for a new contribution in the second work, Portions of the previous work must be repeated to deal with new evidence or arguments, The audience for each work is so different that publishing the same work in different places is necessary to get the message out, The authors think they said it so well the first time that it makes no sense to say it differently a second time."}, {"id": 201, "string": "She considers that 30% is an upper limit in the reuse of parts of a previously published paper."}, {"id": 202, "string": "We believe that following these two sets of principles regarding (self) reuse and plagiarism will help maintaining an ethical behavior in our community."}, {"id": 203, "string": "Further developments A limitation of our approach is that it fails to identify copy & paste when the original text has been strongly altered."}, {"id": 204, "string": "Our study of graphical variations of a common meaning is presently limited to geographical variants, technical abbreviations (e.g."}, {"id": 205, "string": "HMM versus Hidden Markov Model) and resource names aliases from the LRE Map."}, {"id": 206, "string": "We plan to deal with \"rogeting\" which is the practice of replacing words with supposedly synonymous alternatives in order to disguise plagiarism 17 Another direction of improvement is to isolate and ignore tables in order to reduce noise, but this is a complex task as documented in [Frey et al 2015]."}, {"id": 207, "string": "Let's note that this is not a big problem in our approach, as we ignore sentences without any verb and as verbs are not very frequent within a table."}, {"id": 208, "string": "More generally, we could also study the position and rhetorical structure of the copy & paste in order to identify and justify their function."}, {"id": 209, "string": "We may finally explore whether copy & paste is more common for non native English speakers, given that it is frequent that they publish first in their native language at a national conference and then in English in an international conference or an international journal, in order to broaden their audience."}, {"id": 210, "string": "Conclusions To our knowledge, this paper is the first which reports results on the study of copy & paste operations on corpora of NLP archives of this size."}, {"id": 211, "string": "Based on a simple method of n-gram comparison after text processing using NLP, this method is easy to implement."}, {"id": 212, "string": "Of course, this process makes a large number of pairwise comparisons (65,000*65,000), which still represents a practical computing limitation."}, {"id": 213, "string": "As our measures show, self-reuse and self-plagiarism are common practices."}, {"id": 214, "string": "This is not specific to our field and is certainly related to the current tendency which is called \"salami-slicing\" publication caused by the publishand-perish demand 18 ."}, {"id": 215, "string": "But we gladly notice that plagiarism is very uncommon in our community."}], "headers": [{"section": "Introduction", "n": "1.", "start": 0, "end": 2}, {"section": "Context", "n": "2.", "start": 3, "end": 8}, {"section": "Objectives", "n": "3.", "start": 9, "end": 12}, {"section": "The corpus: NLP4NLP", "n": "4.", "start": 13, "end": 62}, {"section": "Definitions", "n": "5.", "start": 63, "end": 69}, {"section": "Directions", "n": "6.", "start": 70, "end": 73}, {"section": "Algorithm", "n": "7.", "start": 74, "end": 80}, {"section": "Algorithm comments and evaluation", "n": "8.", "start": 81, "end": 98}, {"section": "Tuning parameters", "n": "9.", "start": 99, "end": 116}, {"section": "Special considerations concerning authorship and citations", "n": "10.", "start": 117, "end": 120}, {"section": "Precision about the anteriority test", "n": "11.", "start": 121, "end": 124}, {"section": "Resulting files", "n": "12.", "start": 125, "end": 158}, {"section": "Self-reuse and Self-Plagiarism", "n": "13.", "start": 159, "end": 174}, {"section": "Time delay between publication and reuse", "n": "15.", "start": 175, "end": 183}, {"section": "Discussion", "n": "16.", "start": 184, "end": 202}, {"section": "Further developments", "n": "17.", "start": 203, "end": 209}, {"section": "Conclusions", "n": "18.", "start": 210, "end": 215}], "figures": [{"filename": "../figure/image/1246-Figure1-1.png", "caption": "Fig. 1 Similarity scores of the couples detected as self-reuse / self-plagiarism", "page": 5, "bbox": {"x1": 191.51999999999998, "x2": 400.32, "y1": 636.0, "y2": 755.04}}, {"filename": "../figure/image/1246-Table1-1.png", "caption": "Table 1. Detail of NLP4NLP, with the convention that an asterisk indicates that the corpus is in the ACL Anthology.", "page": 1, "bbox": {"x1": 68.64, "x2": 526.0799999999999, "y1": 112.8, "y2": 504.47999999999996}}, {"filename": "../figure/image/1246-Table3-1.png", "caption": "Table 3. Self-reuse and Self-Plagiarism Matrix, with indication of the 7 most using and used sources.", "page": 6, "bbox": {"x1": 55.68, "x2": 774.24, "y1": 70.08, "y2": 438.24}}, {"filename": "../figure/image/1246-Table4-1.png", "caption": "Table 4. Reuse and Plagiarism Matrix, with indication of the 5 most using and used sources", "page": 7, "bbox": {"x1": 66.72, "x2": 774.24, "y1": 82.08, "y2": 443.52}}, {"filename": "../figure/image/1246-Table2-1.png", "caption": "Table 2. Comparison of the two strategies on the LREC corpus", "page": 3, "bbox": {"x1": 172.79999999999998, "x2": 422.4, "y1": 612.9599999999999, "y2": 670.0799999999999}}, {"filename": "../figure/image/1246-Figure2-1.png", "caption": "Fig. 2 Similarity scores of the couples detected as reuse / plagiarism", "page": 8, "bbox": {"x1": 149.76, "x2": 442.08, "y1": 504.0, "y2": 701.28}}]}