{"title": "Split and Rephrase: Better Evaluation and a Stronger Baseline", "abstract": "Splitting and rephrasing a complex sentence into several shorter sentences that convey the same meaning is a challenging problem in NLP. We show that while vanilla seq2seq models can reach high scores on the proposed benchmark (Narayan et al., 2017), they suffer from memorization of the training set which contains more than 89% of the unique simple sentences from the validation and test sets. To aid this, we present a new train-development-test data split and neural models augmented with a copymechanism, outperforming the best reported baseline by 8.68 BLEU and fostering further progress on the task.", "text": [{"id": 0, "string": "Introduction Processing long, complex sentences is challenging."}, {"id": 1, "string": "This is true either for humans in various circumstances (Inui et al., 2003; Watanabe et al., 2009; De Belder and Moens, 2010) or in NLP tasks like parsing (Tomita, 1986; McDonald and Nivre, 2011; Jelínek, 2014) and machine translation (Chandrasekar et al., 1996; Pouget-Abadie et al., 2014; Koehn and Knowles, 2017 )."}, {"id": 2, "string": "An automatic system capable of breaking a complex sentence into several simple sentences that convey the same meaning is very appealing."}, {"id": 3, "string": "A recent work by Narayan et al."}, {"id": 4, "string": "(2017) introduced a dataset, evaluation method and baseline systems for the task, naming it \"Split-and-Rephrase\"."}, {"id": 5, "string": "The dataset includes 1,066,115 instances mapping a single complex sentence to a sequence of sentences that express the same meaning, together with RDF triples that describe their semantics."}, {"id": 6, "string": "They considered two system setups: a text-to-text setup that does not use the accompany-ing RDF information, and a semantics-augmented setup that does."}, {"id": 7, "string": "They report a BLEU score of 48.9 for their best text-to-text system, and of 78.7 for the best RDF-aware one."}, {"id": 8, "string": "We focus on the text-totext setup, which we find to be more challenging and more natural."}, {"id": 9, "string": "We begin with vanilla SEQ2SEQ models with attention (Bahdanau et al., 2015) and reach an accuracy of 77.5 BLEU, substantially outperforming the text-to-text baseline of Narayan et al."}, {"id": 10, "string": "(2017) and approaching their best RDF-aware method."}, {"id": 11, "string": "However, manual inspection reveal many cases of unwanted behaviors in the resulting outputs: (1) many resulting sentences are unsupported by the input: they contain correct facts about relevant entities, but these facts were not mentioned in the input sentence; (2) some facts are repeated-the same fact is mentioned in multiple output sentences; and (3) some facts are missingmentioned in the input but omitted in the output."}, {"id": 12, "string": "The model learned to memorize entity-fact pairs instead of learning to split and rephrase."}, {"id": 13, "string": "Indeed, feeding the model with examples containing entities alone without any facts about them causes it to output perfectly phrased but unsupported facts (Table 3) ."}, {"id": 14, "string": "Digging further, we find that 99% of the simple sentences (more than 89% of the unique ones) in the validation and test sets also appear in the training set, which-coupled with the good memorization capabilities of SEQ2SEQ models and the relatively small number of distinct simple sentences-helps to explain the high BLEU score."}, {"id": 15, "string": "To aid further research on the task, we propose a more challenging split of the data."}, {"id": 16, "string": "We also establish a stronger baseline by extending the SEQ2SEQ approach with a copy mechanism, which was shown to be helpful in similar tasks (Gu et al., 2016; Merity et al., 2017; See et al., 2017) ."}, {"id": 17, "string": "On the original split, our models outperform the count  unique  RDF entities  32,186  925  RDF relations  16,093  172  complex sentences  1,066,115 5,544  simple sentences  5,320,716 9,552  train complex sentences 886,857  4,438  train simple sentences  4,451,959 8,840  dev complex sentences  97,950  554  dev simple sentences  475,337  3,765  test complex best baseline of Narayan et al."}, {"id": 18, "string": "(2017) by up to 8.68 BLEU, without using the RDF triples."}, {"id": 19, "string": "On the new split, the vanilla SEQ2SEQ models break completely, while the copy-augmented models perform better."}, {"id": 20, "string": "In parallel to our work, an updated version of the dataset was released (v1.0), which is larger and features a train/test split protocol which is similar to our proposal."}, {"id": 21, "string": "We report results on this dataset as well."}, {"id": 22, "string": "The code and data to reproduce our results are available on Github."}, {"id": 23, "string": "1 We encourage future work on the split-and-rephrase task to use our new data split or the v1.0 split instead of the original one."}, {"id": 24, "string": "Preliminary Experiments Task Definition In the split-and-rephrase task we are given a complex sentence C, and need to produce a sequence of simple sentences T 1 , ..., T n , n ≥ 2, such that the output sentences convey all and only the information in C. As additional supervision, the split-and-rephrase dataset associates each sentence with a set of RDF triples that describe the information in the sentence."}, {"id": 25, "string": "Note that the number of simple sentences to generate is not given as part of the input."}, {"id": 26, "string": "Experimental Details We focus on the task of splitting a complex sentence into several simple ones without access to the corresponding RDF triples in either train or test time."}, {"id": 27, "string": "For evaluation we follow Narayan et al."}, {"id": 28, "string": "(2017) and compute the averaged individual multi-reference BLEU score for each prediction."}, {"id": 29, "string": "2 We split each prediction to 1 https://github.com/biu-nlp/ sprp-acl2018 2 Note that this differs from \"normal\" multi-reference BLEU (as implemented in multi-bleu.pl) since the number of references differs among the instances in the test-  sentences 3 and report the average number of simple sentences in each prediction, and the average number of tokens for each simple sentence."}, {"id": 30, "string": "We train vanilla sequence-to-sequence models with attention (Bahdanau et al., 2015) as implemented in the OPENNMT-PY toolkit (Klein et al., 2017) ."}, {"id": 31, "string": "4 Our models only differ in the LSTM cell size (128, 256 and 512, respectively)."}, {"id": 32, "string": "See the supplementary material for training details and hyperparameters."}, {"id": 33, "string": "We compare our models to the baselines proposed in Narayan et al."}, {"id": 34, "string": "(2017) ."}, {"id": 35, "string": "HYBRIDSIMPL and SEQ2SEQ are text-to-text models, while the other reported baselines additionally use the RDF information."}, {"id": 36, "string": "Results As shown in Table 2 , our 3 models obtain higher BLEU scores then the SEQ2SEQ baseline, with up to 28.35 BLEU improvement, despite being single-layer models vs. the 3-layer models used in Narayan et al."}, {"id": 37, "string": "(2017) ."}, {"id": 38, "string": "A possible explanation for this discrepancy is the SEQ2SEQ baseline using a dropout rate of 0.8, while we use 0.3 and only apply it on the LSTM outputs."}, {"id": 39, "string": "Our results are also better than the MUL-TISEQ2SEQ and SPLIT-MULTISEQ2SEQ models, which use explicit RDF information."}, {"id": 40, "string": "We also present the macro-average 5 number of sim-   Analysis We begin analyzing the results by manually inspecting the model's predictions on the validation set."}, {"id": 41, "string": "This reveals three common kinds of mistakes as demonstrated in Table 3 : unsupported facts, repetitions, and missing facts."}, {"id": 42, "string": "All the unsupported facts seem to be related to entities mentioned in the source sentence."}, {"id": 43, "string": "Inspecting the attention weights (Figure 1 ) reveals a worrying trend: throughout the prediction, the model focuses heavily on the first word in of the first entity (\"A wizard of Mars\") while paying little attention to other cues like \"hardcover\", \"Diane\" and references of a specific complex sentence, and then average these numbers."}, {"id": 44, "string": "\"the ISBN number\"."}, {"id": 45, "string": "This explains the abundance of \"hallucinated\" unsupported facts: rather than learning to split and rephrase, the model learned to identify entities, and spit out a list of facts it had memorized about them."}, {"id": 46, "string": "To validate this assumption, we count the number of predicted sentences which appeared as-is in the training data."}, {"id": 47, "string": "We find that 1645 out of the 1693 (97.16%) predicted sentences appear verbatim in the training set."}, {"id": 48, "string": "Table  1 gives more detailed statistics on the WEBSPLIT dataset."}, {"id": 49, "string": "To further illustrate the model's recognize-andspit strategy, we compose inputs containing an entity string which is duplicated three times, as shown in the bottom two rows of Table 3 ."}, {"id": 50, "string": "As expected, the model predicted perfectly phrased and correct facts about the given entities, although these facts are clearly not supported by the input."}, {"id": 51, "string": "New Data-split The original data-split is not suitable for measuring generalization, as it is susceptible to \"cheating\" by fact memorization."}, {"id": 52, "string": "We construct a new train-development-test split to better reflect our expected behavior from a split-and-rephrase model."}, {"id": 53, "string": "We split the data into train, development and test sets by randomly dividing the 5,554 distinct complex sentences across the sets, while using the provided RDF information to ensure that: 1."}, {"id": 54, "string": "Every possible RDF relation (e.g., BORNIN, LOCATEDIN) is represented in the training set (and may appear also in the other sets)."}, {"id": 55, "string": "2."}, {"id": 56, "string": "Every RDF triplet (a complete fact) is represented only in one of the splits."}, {"id": 57, "string": "While the set of complex sentences is still divided roughly to 80%/10%/10% as in the original split, now there are nearly no simple sentences in  We believe this split strikes a good balance between challenge and feasibility: to succeed, a model needs to learn to identify relations in the complex sentence, link them to their arguments, and produce a rephrasing of them."}, {"id": 58, "string": "However, it is not required to generalize to unseen relations."}, {"id": 59, "string": "6 The data split and scripts for creating it are available on Github."}, {"id": 60, "string": "7 Statistics describing the data split are detailed in Table 4 ."}, {"id": 61, "string": "Copy-augmented Model To better suit the split-and-rephrase task, we augment the SEQ2SEQ models with a copy mechanism."}, {"id": 62, "string": "Such mechanisms have proven to be beneficial in similar tasks like abstractive summarization (Gu et al., 2016; See et al., 2017) and language modeling (Merity et al., 2017) ."}, {"id": 63, "string": "We hypothesize that biasing the model towards copying will improve performance, as many of the words in the simple sentences (mostly corresponding to entities) appear in the complex sentence, as evident by the relatively high BLEU scores for the SOURCE baseline in Table 2 ."}, {"id": 64, "string": "Copying is modeled using a \"copy switch\" probability p(z) computed by a sigmoid over a learned composition of the decoder state, the context vector and the last output embedding."}, {"id": 65, "string": "It interpolates the p sof tmax distribution over the target vocabulary and a copy distribution p copy over the source sentence tokens."}, {"id": 66, "string": "p copy is simply the computed attention weights."}, {"id": 67, "string": "Once the above distribu- 6 The updated dataset (v1.0, published by Narayan et al."}, {"id": 68, "string": "after this work was accepted) follows (2) above, but not (1)."}, {"id": 69, "string": "7 https://github.com/biu-nlp/ sprp-acl2018 p(w) = p(z = 1)p copy (w) + p(z = 0)p sof tmax (w) In case w is not present in the output vocabulary, we set p sof tmax (w) = 0."}, {"id": 70, "string": "We refer the reader to See et al."}, {"id": 71, "string": "(2017) for a detailed discussion regarding the copy mechanism."}, {"id": 72, "string": "Experiments and Results Models with larger capacities may have greater representation power, but also a stronger tendency to memorize the training data."}, {"id": 73, "string": "We therefore perform experiments with copy-enhanced models of varying LSTM widths (128, 256 and 512) ."}, {"id": 74, "string": "We train the models using the negative log likelihood of p(w) as the objective."}, {"id": 75, "string": "Other than the copy mechanism, we keep the settings identical to those in Section 2."}, {"id": 76, "string": "We train models on the original split, our proposed data split and the v1.0 split."}, {"id": 77, "string": "in spite of it being larger (1,331,515 vs. 886,857 examples) , indicating that merely adding data will not solve the task."}, {"id": 78, "string": "Results Analysis We inspect the models' predictions for the first 20 complex sentences of the original and new validation sets in Table 7 ."}, {"id": 79, "string": "We mark each simple sentence as being \"correct\" if it contains all and only relevant information, \"unsupported\" if it contains facts not present in the source, and \"repeated\" if it repeats information from a previous sentence."}, {"id": 80, "string": "We also count missing facts."}, {"id": 81, "string": "Figure  2 shows the attention weights of the COPY512 model for the same sentence in Figure 1 ."}, {"id": 82, "string": "Reassuringly, the attention is now distributed more evenly over the input symbols."}, {"id": 83, "string": "On the new splits, all models perform catastrophically."}, {"id": 84, "string": "Table 6 shows outputs from the COPY512 model when trained on the new split."}, {"id": 85, "string": "On the original split, while SEQ2SEQ128 mainly suffers from missing information, perhaps due to insufficient memorization capacity, SEQ2SEQ512 generated the most unsupported sentences, due to overfitting or memorization."}, {"id": 86, "string": "The overall number of issues is clearly reduced in the copy-augmented models."}, {"id": 87, "string": "Conclusions We demonstrated that a SEQ2SEQ model can obtain high scores on the original split-and-rephrase task while not actually learning to split-andrephrase."}, {"id": 88, "string": "We propose a new and more challenging data-split to remedy this, and demonstrate that the cheating SEQ2SEQ models fail miserably on the new split."}, {"id": 89, "string": "Augmenting the SEQ2SEQ models with a copy-mechanism improves performance on both data splits, establishing a new competitive baseline for the task."}, {"id": 90, "string": "Yet, the split-and-rephrase task (on the new split) is still far from being solved."}, {"id": 91, "string": "We strongly encourage future research to evaluate on our proposed split or on the recently released version 1.0 of the dataset, which is larger and also addresses the overlap issues mentioned here."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 23}, {"section": "Preliminary Experiments", "n": "2", "start": 24, "end": 50}, {"section": "New Data-split", "n": "3", "start": 51, "end": 60}, {"section": "Copy-augmented Model", "n": "4", "start": 61, "end": 71}, {"section": "Experiments and Results", "n": "5", "start": 72, "end": 86}, {"section": "Conclusions", "n": "6", "start": 87, "end": 91}], "figures": [{"filename": "../figure/image/1248-Figure1-1.png", "caption": "Figure 1: SEQ2SEQ512’s attention weights. Horizontal: input. Vertical: predictions.", "page": 2, "bbox": {"x1": 88.8, "x2": 274.08, "y1": 321.59999999999997, "y2": 528.96}}, {"filename": "../figure/image/1248-Table3-1.png", "caption": "Table 3: Predictions from a vanilla SEQ2SEQ model, illustrating unsupported facts, missing facts and repeated facts. The last two rows show inputs we composed to demonstrate that the models memorize entity-fact pairs.", "page": 2, "bbox": {"x1": 72.0, "x2": 523.1999999999999, "y1": 61.44, "y2": 178.07999999999998}}, {"filename": "../figure/image/1248-Table6-1.png", "caption": "Table 6: Predictions from the COPY512 model, trained on the new data split.", "page": 4, "bbox": {"x1": 72.0, "x2": 523.1999999999999, "y1": 61.44, "y2": 147.35999999999999}}, {"filename": "../figure/image/1248-Table7-1.png", "caption": "Table 7: Results of the manual analysis, showing the number of simple sentences with unsupported facts (unsup.), repeated facts, missing facts and correct facts, for 20 complex sentences from the original and new validation sets.", "page": 4, "bbox": {"x1": 307.68, "x2": 528.0, "y1": 179.51999999999998, "y2": 351.36}}, {"filename": "../figure/image/1248-Figure2-1.png", "caption": "Figure 2: Attention weights from the COPY512 model for the same input as in Figure 1.", "page": 4, "bbox": {"x1": 89.75999999999999, "x2": 275.03999999999996, "y1": 521.76, "y2": 728.16}}, {"filename": "../figure/image/1248-Table1-1.png", "caption": "Table 1: Statistics for the WEBSPLIT dataset.", "page": 1, "bbox": {"x1": 87.84, "x2": 272.15999999999997, "y1": 61.44, "y2": 214.07999999999998}}, {"filename": "../figure/image/1248-Table2-1.png", "caption": "Table 2: BLEU scores, simple sentences per complex sentence (#S/C) and tokens per simple sentence (#T/S), as computed over the test set. SOURCE are the complex sentences and REFERENCE are the reference rephrasings from the test set. Models marked with * use the semantic RDF triples.", "page": 1, "bbox": {"x1": 306.71999999999997, "x2": 510.24, "y1": 61.44, "y2": 193.92}}, {"filename": "../figure/image/1248-Table4-1.png", "caption": "Table 4: Statistics for the RDF-based data split", "page": 3, "bbox": {"x1": 86.88, "x2": 271.2, "y1": 61.44, "y2": 214.07999999999998}}, {"filename": "../figure/image/1248-Table5-1.png", "caption": "Table 5: Results over the test sets of the original, our proposed split and the v1.0 split", "page": 3, "bbox": {"x1": 325.44, "x2": 514.0799999999999, "y1": 61.44, "y2": 277.92}}]}