{"title": "Counterfactual Data Augmentation for Mitigating Gender Stereotypes in Languages with Rich Morphology", "abstract": "Gender stereotypes are manifest in most of the world's languages and are consequently propagated or amplified by NLP systems. Although research has focused on mitigating gender stereotypes in English, the approaches that are commonly employed produce ungrammatical sentences in morphologically rich languages. We present a novel approach for converting between masculine-inflected and feminineinflected sentences in such languages. For Spanish and Hebrew, our approach achieves F 1 scores of 82% and 73% at the level of tags and accuracies of 90% and 87% at the level of forms. By evaluating our approach using four different languages, we show that, on average, it reduces gender stereotyping by a factor of 2.5 without any sacrifice to grammaticality. Sebastian J. Mielke and Jason Eisner. 2018. Spell once, summon anywhere: A two-level open-vocabulary language model. CoRR, abs/1804.08205. Thomas Müller, Ryan Cotterell, Alexander Fraser, and Hinrich Schütze. 2015. Joint lemmatization and morphological tagging with lemming. In Proceed-", "text": [{"id": 0, "string": "Introduction One of the biggest challenges faced by modern natural language processing (NLP) systems is the inadvertent replication or amplification of societal biases."}, {"id": 1, "string": "This is because NLP systems depend on language corpora, which are inherently \"not objective; they are creations of human design\" (Crawford, 2013) ."}, {"id": 2, "string": "One type of societal bias that has received considerable attention from the NLP community is gender stereotyping (Garg et al., 2017; Rudinger et al., 2017; Sutton et al., 2018) ."}, {"id": 3, "string": "Gender stereotypes can manifest in language in overt ways."}, {"id": 4, "string": "For example, the sentence he is an engineer is more likely to appear in a corpus than she is an engineer due to the current gender disparity in engineering."}, {"id": 5, "string": "Consequently, any NLP system that is trained such a corpus will likely learn to associate engineer with men, but not with women (De-Arteaga et al., 2019) ."}, {"id": 6, "string": "To date, the NLP community has focused primarily on approaches for detecting and mitigating gender stereotypes in English (Bolukbasi et al., 2016; Dixon et al., 2018; Zhao et al., 2017 )."}, {"id": 7, "string": "Yet, gender stereotypes also exist in other languages  ."}, {"id": 8, "string": "We extract the properties of each word in the sentence."}, {"id": 9, "string": "We then fix a noun and its tags and infer the manner in which the remaining tags must be updated."}, {"id": 10, "string": "Finally, we reinflect the lemmata to their new forms."}, {"id": 11, "string": "because they are a function of society, not of grammar."}, {"id": 12, "string": "Moreover, because English does not mark grammatical gender, approaches developed for English are not transferable to morphologically rich languages that exhibit gender agreement (Corbett, 1991) ."}, {"id": 13, "string": "In these languages, the words in a sentence are marked with morphological endings that reflect the grammatical gender of the surrounding nouns."}, {"id": 14, "string": "This means that if the gender of one word changes, the others have to be updated to match."}, {"id": 15, "string": "As a result, simple heuristics, such as augmenting a corpus with additional sentences in which he and she have been swapped (Zhao et al., 2018) , will yield ungrammatical sentences."}, {"id": 16, "string": "Consider the Spanish phrase el ingeniero experto (the skilled engineer)."}, {"id": 17, "string": "Replacing ingeniero with ingeniera is insufficient-el must also be replaced with la and experto with experta."}, {"id": 18, "string": "In this paper, we present a new approach to counterfactual data augmentation (CDA; Lu et al., 2018) for mitigating gender stereotypes associated with animate 1 nouns (i.e., nouns that represent people) for morphologically rich languages."}, {"id": 19, "string": "We introduce a Markov random field with an optional neural parameterization that infers the manner in which a sentence must change when altering the grammatical gender of particular nouns."}, {"id": 20, "string": "We use this model as part of a four-step process, depicted in Fig."}, {"id": 21, "string": "1 , to reinflect entire sentences following an intervention on the grammatical gender of one word."}, {"id": 22, "string": "We intrinsically evaluate our approach using Spanish and Hebrew, achieving tag-level F 1 scores of 83% and 72% and form-level accuracies of 90% and 87%, respectively."}, {"id": 23, "string": "We also conduct an extrinsic evaluation using four languages."}, {"id": 24, "string": "Following Lu et al."}, {"id": 25, "string": "(2018) , we show that, on average, our approach reduces gender stereotyping in neural language models by a factor of 2.5 without sacrificing grammaticality."}, {"id": 26, "string": "Gender Stereotypes in Text Men and women are mentioned at different rates in text (Coates, 1987) ."}, {"id": 27, "string": "This problem is exacerbated in certain contexts."}, {"id": 28, "string": "For example, the sentence he is an engineer is more likely to appear in a corpus than she is an engineer due to the current gender disparity in engineering."}, {"id": 29, "string": "This imbalance in representation can have a dramatic downstream effect on NLP systems trained on such a corpus, such as giving preference to male engineers over female engineers in an automated resumé filtering system."}, {"id": 30, "string": "Gender stereotypes of this sort have been observed in word embeddings (Bolukbasi et al., 2016; Sutton et al., 2018) , contextual word embeddings (Zhao et al., 2019) , and co-reference resolution systems (Rudinger et al., 2018; Zhao et al., 2018) inter alia."}, {"id": 31, "string": "A quick fix: swapping gendered words."}, {"id": 32, "string": "One approach to mitigating such gender stereotypes is counterfactual data augmentation (CDA; Lu et al., 2018) ."}, {"id": 33, "string": "In English, this involves augmenting a corpus with additional sentences in which gendered words, such as he and she, have been swapped to yield a balanced representation."}, {"id": 34, "string": "Indeed, Zhao et al."}, {"id": 35, "string": "(2018) showed that this simple heuristic significantly reduces gender stereotyping in neural co-reference resolution systems, without harming system performance."}, {"id": 36, "string": "Unfortunately, this approach is only applicable to English and other languages with little morphological inflection."}, {"id": 37, "string": "When applied to morphologically rich languages that exhibit gender agreement, it yields ungrammatical sentences."}, {"id": 38, "string": "The problem: inflected languages."}, {"id": 39, "string": "Many languages, including Spanish and Hebrew, have gender inflections for nouns, verbs, and adjectivesi.e., the words in a sentence are marked with morphological endings that reflect the grammatical gender of the surrounding nouns."}, {"id": 40, "string": "2 This means that if the gender of one word changes, the others have to be updated to preserve morpho-syntactic agreement (Corbett, 2012) ."}, {"id": 41, "string": "Consider the following example from Spanish, where we wish to transform Sentence (1) to Sentence (2)."}, {"id": 42, "string": "(Parts of words that mark gender are depicted in bold.)"}, {"id": 43, "string": "This task is not as simple as replacing el with la-ingeniero and experto must also be reinflected."}, {"id": 44, "string": "Moreover, the changes required for one language are not the same as those required for another (e.g., verbs are marked with gender in Hebrew, but not in Spanish)."}, {"id": 45, "string": "( Our approach."}, {"id": 46, "string": "Our goal is to transform sentences like Sentence (1) to Sentence (2) and vice versa."}, {"id": 47, "string": "To the best of our knowledge, this task has not been studied previously."}, {"id": 48, "string": "Indeed, there is no existing annotated corpus of paired sentences that could be used to train a supervised model."}, {"id": 49, "string": "As a result, we take an unsupervised 3 approach using dependency trees, lemmata, part-of-speech (POS) tags, and morpho-syntactic tags from Universal Dependencies corpora (UD; Nivre et al., 2018) ."}, {"id": 50, "string": "Specifically, we propose the following four-step process: 1."}, {"id": 51, "string": "Analyze the sentence (including parsing, morphological analysis, and lemmatization)."}, {"id": 52, "string": "Figure 2 : Dependency tree for the sentence El ingeniero alemán es muy experto."}, {"id": 53, "string": "2."}, {"id": 54, "string": "Intervene on a gendered word."}, {"id": 55, "string": "3."}, {"id": 56, "string": "Infer the new morpho-syntactic tags."}, {"id": 57, "string": "Reinflect the lemmata to their new forms."}, {"id": 58, "string": "This process is depicted in Fig."}, {"id": 59, "string": "1 ."}, {"id": 60, "string": "The primary technical contribution is a novel Markov random field for performing step 3, described in the next section."}, {"id": 61, "string": "A Markov Random Field for Morpho-Syntactic Agreement In this section, we present a Markov random field (MRF; Koller and Friedman, 2009 ) for morphosyntactic agreement."}, {"id": 62, "string": "This model defines a joint distribution over sequences of morpho-syntactic tags, conditioned on a labeled dependency tree with associated part-of-speech tags."}, {"id": 63, "string": "Given an intervention on a gendered word, we can use this model to infer the manner in which the remaining tags must be updated to preserve morpho-syntactic agreement."}, {"id": 64, "string": "A dependency tree for a sentence (see Fig."}, {"id": 65, "string": "2 for an example) is a set of ordered triples (i, j, ), where i and j are positions in the sentence (or a distinguished root symbol) and ∈ L is the label of the edge i → j in the tree; each position occurs exactly once as the first element in a triple."}, {"id": 66, "string": "Each dependency tree T is associated with a sequence of morpho-syntactic tags m = m 1 , ."}, {"id": 67, "string": "."}, {"id": 68, "string": "."}, {"id": 69, "string": ", m |T | and a sequence of part-ofspeech (POS) tags p = p 1 , ."}, {"id": 70, "string": "."}, {"id": 71, "string": "."}, {"id": 72, "string": ", p |T | ."}, {"id": 73, "string": "For example, the tags m ∈ M and p ∈ P for ingeniero are [MSC; SG] and NOUN, respectively, because ingeniero is a masculine, singular noun."}, {"id": 74, "string": "For notational simplicity, we define M = M |T | to be the set of all length-|T | sequences of morpho-syntactic tags."}, {"id": 75, "string": "We define the probability of m given T and p as Pr(m | T, p) ∝ (i,j, )∈T φ i (m i ) · ψ(m i , m j | p i , p j , ), (1) where the binary factor ψ(·, · | ·, ·, ·) ≥ 0 scores how well the morpho-syntactic tags m i and m j agree given the POS tags p i and p j and the label ."}, {"id": 76, "string": "For example, consider the amod (adjectival modifier) edge from experto to ingeniero in Fig."}, {"id": 77, "string": "2 ."}, {"id": 78, "string": "The factor ψ(m i , m j | A, N, amod) returns a high score if the corresponding morpho-syntactic tags agree in gender and number (e.g., m i = [MSC; SG] and m j = [MSC; SG]) and a low score if they do not (e.g., m i = [MSC; SG] and m j = [FEM; PL])."}, {"id": 79, "string": "The unary factor φ i (·) ≥ 0 scores a morpho-syntactic tag m i outside the context of the dependency tree."}, {"id": 80, "string": "As we explain in §3.1, we use these unary factors to force or disallow particular tags when performing an intervention; we do not learn them."}, {"id": 81, "string": "Eq."}, {"id": 82, "string": "(1) is normalized by the following partition function: Z(T, p) = m ∈M (i,j, )∈T φ i (m i ) · ψ(m i , m j | p i , p j , )."}, {"id": 83, "string": "Z(T, p) can be calculated using belief propagation; we provide the update equations that we use in App."}, {"id": 84, "string": "A."}, {"id": 85, "string": "Our model is depicted in Fig."}, {"id": 86, "string": "3 ."}, {"id": 87, "string": "It is noteworthy that this model is delexicalized-i.e., it considers only the labeled dependency tree and the POS tags, not the actual words themselves."}, {"id": 88, "string": "Parameterization We consider a linear parameterization and a neural parameterization of the binary factor ψ(·, · | ·, ·, ·)."}, {"id": 89, "string": "Linear parameterization."}, {"id": 90, "string": "We define a matrix W (p i , p j , ) ∈ R c×c for each triple (p i , p j , ), where c is the number of morpho-syntactic subtags."}, {"id": 91, "string": "For example, [MSC; SG] has two subtags MSC and SG."}, {"id": 92, "string": "We then define ψ(·, · | ·, ·, ·) as follows: ψ(m i , m j | p i , p j , ) = exp (m i W (p i , p j , )m j ), where m i ∈ {0, 1} c is a multi-hot encoding of m i ."}, {"id": 93, "string": "Neural parameterization."}, {"id": 94, "string": "As an alternative, we also define a neural parameterization of W (p i , p j , ) to allow parameter sharing among El ingeniero alemán es muy experto edges with different parts of speech and labels: φ1(·) φ2(·) φ3(·) φ4(·) φ5(·) φ6(·) ψ(·, · | D, N, det) ψ(·, · | A, N, amod) ψ(·, · | N, V, cop) ψ(·, · | AV, A, advmod) ψ(·, · | A, N, amod) W (p i , p j , ) = exp (U tanh(V [e(p i ); e(p j ); e( )])) where U ∈ R c×c×n 1 , V ∈ R n 1 ×3n 2 , and n 1 and n 2 define the structure of the neural parameterization and each e(·) ∈ R n 2 is an embedding function."}, {"id": 95, "string": "Parameterization of φ i ."}, {"id": 96, "string": "We use the unary factors only to force or disallow particular tags when performing an intervention."}, {"id": 97, "string": "Specifically, we define φ i (m) = α if m = m i 1 otherwise, (2) where α > 1 is a strength parameter that determines the extent to which m i should remain unchanged following an intervention."}, {"id": 98, "string": "In the limit as α → ∞, all tags will remain unchanged except for the tag directly involved in the intervention."}, {"id": 99, "string": "4 Inference Because our MRF is acyclic and tree-shaped, we can use belief propagation (Pearl, 1988) to perform exact inference."}, {"id": 100, "string": "The algorithm is a generalization of the forward-backward algorithm for hidden Markov models (Rabiner and Juang, 1986 Parameter Estimation We use gradient-based optimization."}, {"id": 101, "string": "We treat the negative log-likelihood − log (Pr(m | T, p)) as the loss function for tree T and compute its gradient using automatic differentiation (Rall, 1981) ."}, {"id": 102, "string": "We learn the parameters of §3.1 by optimizing the negative log-likelihood using gradient descent."}, {"id": 103, "string": "Intervention As explained in §2, our goal is to transform sentences like Sentence (1) to Sentence (2) by intervening on a gendered word and then using our model to infer the manner in which the remaining tags must be updated to preserve morphosyntactic agreement."}, {"id": 104, "string": "For example, if we change the morpho-syntactic tag for ingeniero from [MSC;SG] to [FEM;SG], then we must also update the tags for el and experto, but do not need to update the tag for es, which should remain unchanged as [IN; PR; SG]."}, {"id": 105, "string": "If we intervene on the i th word in a sentence, changing its tag from m i to m i , then using our model to infer the manner in which the remaining tags must be updated means using Pr(m −i | m i , T, p) to identify high-probability tags for the remaining words."}, {"id": 106, "string": "Crucially, we wish to change as little as possible when intervening on a gendered word."}, {"id": 107, "string": "The unary factors φ i enable us to do exactly this."}, {"id": 108, "string": "As described in the previous section, the strength parameter α determines the extent to which m i should remain unchanged following an intervention-the larger the value, the less likely it is that m i will be changed."}, {"id": 109, "string": "Once the new tags have been inferred, the final step is to reinflect the lemmata to their new forms."}, {"id": 110, "string": "This task has received considerable attention from the NLP community (Cotterell et al., 2016 (Cotterell et al., , 2017 ."}, {"id": 111, "string": "We use the inflection model of ."}, {"id": 112, "string": "This model conditions on the lemma x and morphosyntactic tag m to form a distribution over possible inflections."}, {"id": 113, "string": "For example, given experto and [A; FEM; PL], the trained inflection model will assign a high probability to expertas."}, {"id": 114, "string": "We provide accuracies for the trained inflection model in Tab."}, {"id": 115, "string": "1."}, {"id": 116, "string": "Experiments We used the Adam optimizer (Kingma and Ba, 2014) to train both parameterizations of our model until the change in dev-loss was less than 10 −5 bits."}, {"id": 117, "string": "We set β = (0.9, 0.999) without tuning, and chose a learning rate of 0.005 and weight decay factor of 0.0001 after tuning."}, {"id": 118, "string": "We tuned log α in the set {0.5, 0.75, 1, 2, 5, 10} and chose log α = 1."}, {"id": 119, "string": "For the neural parameterization, we set n 1 = 9 and n 2 = 3 without any tuning."}, {"id": 120, "string": "Finally, we trained the inflection model using only gendered words."}, {"id": 121, "string": "We evaluate our approach both intrinsically and extrinsically."}, {"id": 122, "string": "For the intrinsic evaluation, we focus on whether our approach yields the correct morphosyntactic tags and the correct reinflections."}, {"id": 123, "string": "For the extrinsic evaluation, we assess the extent to which using the resulting transformed sentences reduces gender stereotyping in neural language models."}, {"id": 124, "string": "Intrinsic Evaluation To the best of our knowledge, this task has not been studied previously."}, {"id": 125, "string": "As a result, there is no existing annotated corpus of paired sentences that can be used as \"ground truth.\""}, {"id": 126, "string": "We therefore annotated Spanish and Hebrew sentences ourselves, with annotations made by native speakers of each language."}, {"id": 127, "string": "Specifically, for each language, we extracted sentences containing animate nouns from that language's UD treebank."}, {"id": 128, "string": "The average length of these extracted sentences was 37 words."}, {"id": 129, "string": "We then manually inspected each sentence, intervening on the gender of the animate noun and reinflecting the sentence accordingly."}, {"id": 130, "string": "We chose Spanish and Hebrew because gender agreement operates differ- Table 3 : Tag-level precision, recall, F 1 score, and accuracy and form-level accuracy for the baselines (\"-BASE\") and for our approach (\"-LIN\" is the linear parameterization, \"-NN\" is the neural parameterization)."}, {"id": 131, "string": "ently in each language."}, {"id": 132, "string": "We provide corpus statistics for both languages in the top two rows of Tab."}, {"id": 133, "string": "2."}, {"id": 134, "string": "We created a hard-coded ψ(·, · | ·, ·, ·) to serve as a baseline for each language."}, {"id": 135, "string": "For Spanish, we only activated, i.e."}, {"id": 136, "string": "set to a number greater than zero, values that relate adjectives and determiners to nouns; for Hebrew, we only activated values that relate adjectives and verbs to nouns."}, {"id": 137, "string": "We created two separate baselines because gender agreement operates differently in each language."}, {"id": 138, "string": "To evaluate our approach, we held all morphosyntactic subtags fixed except for gender."}, {"id": 139, "string": "For each annotated sentence, we intervened on the gender of the animate noun."}, {"id": 140, "string": "We then used our model to infer which of the remaining tags should be updated (updating a tag means swapping the gender subtag because all morpho-syntactic subtags were held fixed except for gender) and reinflected the lemmata."}, {"id": 141, "string": "Finally, we used the annotations to compute the taglevel F 1 score and the form-level accuracy, excluding the animate nouns on which we intervened."}, {"id": 142, "string": "Results."}, {"id": 143, "string": "We present the results in Tab."}, {"id": 144, "string": "3."}, {"id": 145, "string": "Recall is consistently significantly lower than precision."}, {"id": 146, "string": "As expected, the baselines have the highest precision (though not by much)."}, {"id": 147, "string": "This is because they reflect well-known rules for each language."}, {"id": 148, "string": "That said, they have lower recall than our approach because they fail to capture more subtle relationships."}, {"id": 149, "string": "For both languages, our approach struggles with conjunctions."}, {"id": 150, "string": "For example, consider the phraseél es un ingeniero y escritor (he is an engineer and a writer)."}, {"id": 151, "string": "Replacing ingeniero with ingeniera does not necessarily result in escritor being changed to escritora."}, {"id": 152, "string": "This is because two nouns do not normally need to have the same gender when they are conjoined."}, {"id": 153, "string": "Moreover, our MRF does not include co-reference information, so it cannot tell that, in this case, both nouns refer to the same person."}, {"id": 154, "string": "Note Figure 4 : Gender stereotyping (left) and grammaticality (right) using the original corpus, the corpus following CDA using naïve swapping of gendered words (\"Swap\"), and the corpus following CDA using our approach (\"MRF\")."}, {"id": 155, "string": "that including co-reference information in our MRF would create cycles and inference would no longer be exact."}, {"id": 156, "string": "Additionally, the lack of co-reference information means that, for Spanish, our approach fails to convert nouns that are noun-modifiers or indirect objects of verbs."}, {"id": 157, "string": "Somewhat surprisingly, the neural parameterization does not outperform the linear parameterization."}, {"id": 158, "string": "We proposed the neural parameterization to allow parameter sharing among edges with different parts of speech and labels; however, this parameter sharing does not seem to make a difference in practice, so the linear parameterization is sufficient."}, {"id": 159, "string": "Extrinsic Evaluation We extrinsically evaluate our approach by assessing the extent to which it reduces gender stereotyping."}, {"id": 160, "string": "Following Lu et al."}, {"id": 161, "string": "(2018) , focus on neural language models."}, {"id": 162, "string": "We choose language models over word embeddings because standard measures of gender stereotyping for word embeddings cannot be applied to morphologically rich languages."}, {"id": 163, "string": "As our measure of gender stereotyping, we compare the log ratio of the prefix probabilities under a language model P lm for gendered, animate nouns, such as ingeniero, combined with four adjectives: good, bad, smart, and beautiful."}, {"id": 164, "string": "The translations we use for these adjectives are given in App."}, {"id": 165, "string": "B."}, {"id": 166, "string": "We chose the first two adjectives because they should be used equally to describe men and women, and the latter two because we expect that they will reveal gender stereotypes."}, {"id": 167, "string": "For example, consider log x∈Σ * P lm (BOS El ingeniero bueno x) x∈Σ * P lm (BOS La ingeniera buena x) ."}, {"id": 168, "string": "If this log ratio is close to 0, then the language model is as likely to generate sentences that start with el ingeniero bueno (the good male engineer) as it is to generate sentences that start with la  ingeniera bueno (the good female engineer)."}, {"id": 169, "string": "If the log ratio is negative, then the language model is more likely to generate the feminine form than the masculine form, while the opposite is true if the log ratio is positive."}, {"id": 170, "string": "In practice, given the current gender disparity in engineering, we would expect the log ratio to be positive."}, {"id": 171, "string": "If, however, the language model were trained on a corpus to which our CDA approach had been applied, we would then expect the log ratio to be much closer to zero."}, {"id": 172, "string": "Because our approach is specifically intended to yield sentences that are grammatical, we additionally consider the following log ratio (i.e., the grammatical phrase over the ungrammatical phrase): log x∈Σ * P lm (BOS El ingeniero bueno x) x∈Σ * P lm (BOS El ingeniera bueno x) ."}, {"id": 173, "string": "We trained the linear parameterization using UD treebanks for Spanish, Hebrew, French, and Italian (see Tab."}, {"id": 174, "string": "2)."}, {"id": 175, "string": "For each of the four languages, we parsed one million sentences from Wikipedia (May 2018 dump) using Dozat and Manning (2016) 's parser and extracted taggings and lemmata using the method of Müller et al."}, {"id": 176, "string": "(2015) ."}, {"id": 177, "string": "We automatically extracted an animacy gazetteer from WordNet (Bond and Paik, 2012) and then manually filtered the output for correctness."}, {"id": 178, "string": "We provide the size of the languages' animacy gazetteers and the percentage of automatically parsed sentences that contain an animate noun in Tab."}, {"id": 179, "string": "4."}, {"id": 180, "string": "For each sentence containing a noun in our animacy gazetteer, we created a copy of the sentence, intervened on Figure 5 : Gender stereotyping for words that are stereotyped toward men or women in Spanish using the original corpus, the corpus following CDA using naïve swapping of gendered words (\"Swap\"), and the corpus following CDA using our approach (\"MRF\")."}, {"id": 181, "string": "the noun, and then used our approach to transform the sentence."}, {"id": 182, "string": "For sentences containing more than one animate noun, we generated a separate sentence for each possible combination of genders."}, {"id": 183, "string": "Choosing which sentences to duplicate is a difficult task."}, {"id": 184, "string": "For example, alemán in Spanish can refer to either a German man or the German language; however, we have no way of distinguishing between these two meanings without additional annotations."}, {"id": 185, "string": "Multilingual animacy detection (Jahan et al., 2018) might help with this challenge; co-reference information might additionally help."}, {"id": 186, "string": "For each language, we trained the BPE-RNNLM baseline open-vocabulary language model of Mielke and Eisner (2018) using the original corpus, the corpus following CDA using naïve swapping of gendered words, and the corpus following CDA using our approach."}, {"id": 187, "string": "We then computed gender stereotyping and grammaticality as described above."}, {"id": 188, "string": "We provide example phrases in Tab."}, {"id": 189, "string": "5; we provide a more extensive list of phrases in App."}, {"id": 190, "string": "C. Results Fig."}, {"id": 191, "string": "4 demonstrates depicts gender stereotyping and grammaticality for each language using the original corpus, the corpus following CDA using naïve swapping of gendered words, and the corpus following CDA using our approach."}, {"id": 192, "string": "It is immediately apparent that our approch reduces gender stereotyping."}, {"id": 193, "string": "On average, our approach reduces gender stereotyping by a factor of 2.5 (the lowest and highest factors are 1.2 (Ita) and 5.0 (Esp), respectively)."}, {"id": 194, "string": "We expected that naïve swapping of gendered words would also reduce gender stereotyping."}, {"id": 195, "string": "Indeed, we see that this simple heuristic reduces gender stereotyping for some but not all of the languages."}, {"id": 196, "string": "For Spanish, we also examine specific words that are stereotyped Table 5 : Prefix log-likelihoods of Spanish phrases using the original corpus, the corpus following CDA using naïve swapping of gendered words (\"Swap\"), and the corpus following CDA using our approach (\"MRF\")."}, {"id": 197, "string": "Phrases 1 and 2 are grammatical, while phrases 3 and 4 are not (dentoted by \"*\")."}, {"id": 198, "string": "Gender stereotyping is measured using phrases 1 and 2."}, {"id": 199, "string": "Grammaticality is measured using phrases 1 and 3 and using phrases 2 and 4; these scores are then averaged."}, {"id": 200, "string": "toward men or women."}, {"id": 201, "string": "We define a word to be stereotyped toward one gender if 75% of its occurrences are of that gender."}, {"id": 202, "string": "Fig."}, {"id": 203, "string": "5 suggests a clear reduction in gender stereotyping for specific words that are stereotyped toward men or women."}, {"id": 204, "string": "The grammaticality of the corpora following CDA differs between languages."}, {"id": 205, "string": "That said, with the exception of Hebrew, our approach either sacrifices less grammaticality than naïve swapping of gendered words and sometimes increases grammaticality over the original corpus."}, {"id": 206, "string": "Given that we know the model did not perform as accurately for Hebrew (see Tab."}, {"id": 207, "string": "3), this finding is not surprising."}, {"id": 208, "string": "Related Work In contrast to previous work, we focus on mitigating gender stereotypes in languages with rich morphology-specifically languages that exhibit gender agreement."}, {"id": 209, "string": "To date, the NLP community has focused on approaches for detecting and mitigating gender stereotypes in English."}, {"id": 210, "string": "For example, Bolukbasi et al."}, {"id": 211, "string": "(2016) proposed a way of mitigating gender stereotypes in word embeddings while preserving meanings; Lu et al."}, {"id": 212, "string": "(2018) studied gender stereotypes in language models; and Rudinger et al."}, {"id": 213, "string": "(2018) introduced a novel Winograd schema for evaluating gender stereotypes in co-reference resolution."}, {"id": 214, "string": "The most closely related work is that of Zhao et al."}, {"id": 215, "string": "(2018) , who used CDA to reduce gender stereotypes in co-reference resolution; however, their approach yields ungrammatical sentences in morphologically rich languages."}, {"id": 216, "string": "Our approach is specifically intended to yield grammatical sentences when applied to such languages."}, {"id": 217, "string": "Habash et al."}, {"id": 218, "string": "(2019) also focused on morphologically rich languages, specifically Arabic, but in the context of gender identification in machine translation."}, {"id": 219, "string": "Conclusion We presented a new approach for converting between masculine-inflected and feminine-inflected noun phrases in morphologically rich languages."}, {"id": 220, "string": "To do this, we introduced a Markov random field with an optional neural parameterization that infers the manner in which a sentence must change to preserve morpho-syntactic agreement when altering the grammatical gender of particular nouns."}, {"id": 221, "string": "To the best of our knowledge, this task has not been studied previously."}, {"id": 222, "string": "As a result, there is no existing annotated corpus of paired sentences that can be used as \"ground truth.\""}, {"id": 223, "string": "Despite this limitation, we evaluated our approach both intrinsically and extrinsically, achieving promising results."}, {"id": 224, "string": "For example, we demonstrated that our approach reduces gender stereotyping in neural language models."}, {"id": 225, "string": "Finally, we also identified avenues for future work, such as the inclusion of co-reference information."}, {"id": 226, "string": "A Belief Propagation Update Equations Our belief propagation update equations are µ i→f (m) = f ∈N (i)\\{f } µ f →i (m) (3) µ f i →i (m) = φ i (m) µ i→f i (m) (4) µ f ij →i (m) = m ∈M ψ(m , m | p i , p j , ) µ j→f ij (m ) (5) µ f ij →j (m) = m ∈M ψ(m, m | p i , p j , ) µ i→f ij (m ) (6) where N (i) returns the set of neighbouring nodes of node i."}, {"id": 227, "string": "The belief at any node is given by β(v) = f ∈N (v) µ f →v (m)."}, {"id": 228, "string": "(7) B Adjective Translations Tab."}, {"id": 229, "string": "6 and Tab."}, {"id": 230, "string": "7 contain the feminine and masculine translations of the four adjectives that we used."}, {"id": 231, "string": "C Extrinsic Evaluation Example Phrases For each noun in our animacy gazetteer, we generated sixteen phrases."}, {"id": 232, "string": "Consider the noun engineer as an example."}, {"id": 233, "string": "We created four phrases-one for each translation of The good engineer, The bad engineer, The smart engineer, and The beautiful engineer."}, {"id": 234, "string": "These phrases, as well as their prefix log-likelihoods are provided below in Tab."}, {"id": 235, "string": "8."}, {"id": 236, "string": "Table 8 : Prefix log-likelihoods of Spanish phrases using the original corpus, the corpus following CDA using naïve swapping of gendered words (\"Swap\"), and the corpus following CDA using our approach (\"MRF\")."}, {"id": 237, "string": "Ungrammatical phrases are denoted by \"*\"."}, {"id": 238, "string": "Phrase"}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 25}, {"section": "Gender Stereotypes in Text", "n": "2", "start": 26, "end": 57}, {"section": "Reinflect the lemmata to their new forms.", "n": "4.", "start": 58, "end": 60}, {"section": "A Markov Random Field for Morpho-Syntactic Agreement", "n": "3", "start": 61, "end": 87}, {"section": "Parameterization", "n": "3.1", "start": 88, "end": 97}, {"section": "Inference", "n": "3.2", "start": 98, "end": 99}, {"section": "Parameter Estimation", "n": "3.3", "start": 100, "end": 102}, {"section": "Intervention", "n": "4", "start": 103, "end": 115}, {"section": "Experiments", "n": "5", "start": 116, "end": 123}, {"section": "Intrinsic Evaluation", "n": "5.1", "start": 124, "end": 158}, {"section": "Extrinsic Evaluation", "n": "5.2", "start": 159, "end": 207}, {"section": "Related Work", "n": "6", "start": 208, "end": 218}, {"section": "Conclusion", "n": "7", "start": 219, "end": 238}], "figures": [{"filename": "../figure/image/1253-Figure1-1.png", "caption": "Figure 1: Transformation of Los ingenieros son expertos (i.e., The male engineers are skilled) to Las ingenieras son expertas (i.e., The female engineers are skilled). We extract the properties of each word in the sentence. We then fix a noun and its tags and infer the manner in which the remaining tags must be updated. Finally, we reinflect the lemmata to their new forms.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 203.51999999999998, "y2": 436.32}}, {"filename": "../figure/image/1253-Table4-1.png", "caption": "Table 4: Animate noun statistics.", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 228.48, "y2": 300.96}}, {"filename": "../figure/image/1253-Figure4-1.png", "caption": "Figure 4: Gender stereotyping (left) and grammaticality (right) using the original corpus, the corpus following CDA using naı̈ve swapping of gendered words (“Swap”), and the corpus following CDA using our approach (“MRF”).", "page": 5, "bbox": {"x1": 101.75999999999999, "x2": 499.2, "y1": 64.8, "y2": 176.64}}, {"filename": "../figure/image/1253-Table6-1.png", "caption": "Table 6: Feminine translations of good, bad, smart, beautiful in French, Hebrew, Italian, and Spanish", "page": 10, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 413.76, "y2": 476.15999999999997}}, {"filename": "../figure/image/1253-Table7-1.png", "caption": "Table 7: Masculine translations of good, bad, smart, beautiful in French, Hebrew, Italian, and Spanish", "page": 10, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 523.68, "y2": 586.0799999999999}}, {"filename": "../figure/image/1253-Table8-1.png", "caption": "Table 8: Prefix log-likelihoods of Spanish phrases using the original corpus, the corpus following CDA using naı̈ve swapping of gendered words (“Swap”), and the corpus following CDA using our approach (“MRF”). Ungrammatical phrases are denoted by “*”.", "page": 10, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 189.6, "y2": 372.0}}, {"filename": "../figure/image/1253-Figure5-1.png", "caption": "Figure 5: Gender stereotyping for words that are stereotyped toward men or women in Spanish using the original corpus, the corpus following CDA using naı̈ve swapping of gendered words (“Swap”), and the corpus following CDA using our approach (“MRF”).", "page": 6, "bbox": {"x1": 82.08, "x2": 283.2, "y1": 64.8, "y2": 181.44}}, {"filename": "../figure/image/1253-Table5-1.png", "caption": "Table 5: Prefix log-likelihoods of Spanish phrases using the original corpus, the corpus following CDA using naı̈ve swapping of gendered words (“Swap”), and the corpus following CDA using our approach (“MRF”). Phrases 1 and 2 are grammatical, while phrases 3 and 4 are not (dentoted by “*”). Gender stereotyping is measured using phrases 1 and 2. Grammaticality is measured using phrases 1 and 3 and using phrases 2 and 4; these scores are then averaged.", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 62.4, "y2": 150.23999999999998}}, {"filename": "../figure/image/1253-Figure2-1.png", "caption": "Figure 2: Dependency tree for the sentence El ingeniero alemán es muy experto.", "page": 2, "bbox": {"x1": 119.03999999999999, "x2": 478.56, "y1": 62.879999999999995, "y2": 152.64}}, {"filename": "../figure/image/1253-Table1-1.png", "caption": "Table 1: Morphological reinflection accuracies.", "page": 3, "bbox": {"x1": 321.59999999999997, "x2": 510.24, "y1": 229.44, "y2": 273.12}}, {"filename": "../figure/image/1253-Figure3-1.png", "caption": "Figure 3: Factor graph for the sentence El ingeniero alemán es muy experto.", "page": 3, "bbox": {"x1": 89.75999999999999, "x2": 507.35999999999996, "y1": 65.75999999999999, "y2": 195.35999999999999}}, {"filename": "../figure/image/1253-Table2-1.png", "caption": "Table 2: Language data.", "page": 4, "bbox": {"x1": 79.67999999999999, "x2": 282.24, "y1": 77.75999999999999, "y2": 130.07999999999998}}, {"filename": "../figure/image/1253-Table3-1.png", "caption": "Table 3: Tag-level precision, recall, F1 score, and accuracy and form-level accuracy for the baselines (“– BASE”) and for our approach (“–LIN” is the linear parameterization, “–NN” is the neural parameterization).", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 62.4, "y2": 166.07999999999998}}]}