{"title": "A Distributional and Orthographic Aggregation Model for English Derivational Morphology", "abstract": "Modeling derivational morphology to generate words with particular semantics is useful in many text generation tasks, such as machine translation or abstractive question answering. In this work, we tackle the task of derived word generation. That is, given the word \"run,\" we attempt to generate the word \"runner\" for \"someone who runs.\" We identify two key problems in generating derived words from root words and transformations: suffix ambiguity and orthographic irregularity. We contribute a novel aggregation model of derived word generation that learns derivational transformations both as orthographic functions using sequence-to-sequence models and as functions in distributional word embedding space. Our best open-vocabulary model, which can generate novel words, and our best closed-vocabulary model, show 22% and 37% relative error reductions over current state-of-the-art systems on the same dataset.", "text": [{"id": 0, "string": "Introduction The explicit modeling of morphology has been shown to improve a number of tasks (Seeker and Ç etinoglu, 2015; Luong et al., 2013) ."}, {"id": 1, "string": "In a large number of the world's languages, many words are composed through morphological operations on subword units."}, {"id": 2, "string": "Some languages are rich in inflectional morphology, characterized by syntactic transformations like pluralization."}, {"id": 3, "string": "Similarly, languages like English are rich in derivational morphology, where the semantics of words are composed from * These authors contributed equally; listed alphabetically."}, {"id": 4, "string": "smaller parts."}, {"id": 5, "string": "The AGENT derivational transformation, for example, answers the question, what is the word for 'someone who runs'?"}, {"id": 6, "string": "with the answer, a runner."}, {"id": 7, "string": "1 Here, AGENT is spelled out as suffixing -ner onto the root verb run."}, {"id": 8, "string": "We tackle the task of derived word generation."}, {"id": 9, "string": "In this task, a root word x and a derivational transformation t are given to the learner."}, {"id": 10, "string": "The learner's job is to produce the result of the transformation on the root word, called the derived word y."}, {"id": 11, "string": "Table  1 gives examples of these transformations."}, {"id": 12, "string": "Previous approaches to derived word generation model the task as a character-level sequenceto-sequence (seq2seq) problem (Cotterell et al., 2017b) ."}, {"id": 13, "string": "The letters from the root word and some encoding of the transformation are given as input to a neural encoder, and the decoder is trained to produce the derived word, one letter at a time."}, {"id": 14, "string": "We identify the following problems with these approaches: First, because these models are unconstrained, they can generate sequences of characters that do not form actual words."}, {"id": 15, "string": "We argue that requiring the model to generate a known word is a reasonable constraint in the special case of English derivational morphology, and doing so avoids a large number of common errors."}, {"id": 16, "string": "Second, sequence-based models can only generalize string manipulations (such as \"add -ment\") if they appear frequently in the training data."}, {"id": 17, "string": "Because of this, they are unable to generate derived words that do not follow typical patterns, such as generating truth as the nominative derivation of true."}, {"id": 18, "string": "We propose to learn a function for each transformation in a low dimensional vector space that corresponds to mapping from representations of the root word to the derived word."}, {"id": 19, "string": "This eliminates the reliance on orthographic information, unlike related approaches to distributional semantics, which operate at the suffix level (Gupta et al., 2017) ."}, {"id": 20, "string": "We contribute an aggregation model of derived word generation that produces hypotheses independently from two separate learned models: one from a seq2seq model with only orthographic information, and one from a feed-forward network using only distributional semantic information in the form of pretrained word vectors."}, {"id": 21, "string": "The model learns to choose between the hypotheses according to the relative confidence of each."}, {"id": 22, "string": "This system can be interpreted as learning to decide between positing an orthographically regular form or a semantically salient word."}, {"id": 23, "string": "See Figure 1 for a diagram of our model."}, {"id": 24, "string": "We show that this model helps with two open problems with current state-of-the-art seq2seq derived word generation systems, suffix ambiguity and orthographic irregularity (Section 2)."}, {"id": 25, "string": "We also improve the accuracy of seq2seq-only derived word systems by adding external information through constrained decoding and hypothesis rescoring."}, {"id": 26, "string": "These methods provide orthogonal gains to our main contribution."}, {"id": 27, "string": "We evaluate models in two categories: open vocabulary models that can generate novel words unattested in a preset vocabulary, and closedvocabulary models, which cannot."}, {"id": 28, "string": "Our best openvocabulary and closed-vocabulary models demonstrate 22% and 37% relative error reductions over the current state of the art."}, {"id": 29, "string": "Background: Derivational Morphology Derivational transformations generate novel words that are semantically composed from the root word and the transformation."}, {"id": 30, "string": "We identify two unsolved problems in derived word transformation, each of which we address in Sections 3 and 4."}, {"id": 31, "string": "First, many plausible choices of suffix for a single pair of root word and transformation."}, {"id": 32, "string": "For example, for the verb ground, the RESULT transformation could plausibly take as many forms as 2 (ground, RESULT) → grounding (ground, RESULT) → *groundation (ground, RESULT) → *groundment (ground, RESULT) → *groundal However, only one is correct, even though each suffix appears often in the RESULT transformation of other words."}, {"id": 33, "string": "We will refer to this problem as \"suffix ambiguity.\""}, {"id": 34, "string": "Second, many derived words seem to lack a generalizable orthographic relationship to their root words."}, {"id": 35, "string": "For example, the RESULT of the verb speak is speech."}, {"id": 36, "string": "It is unlikely, given an orthographically similar verb creak, that the RESULT be creech instead of, say, creaking."}, {"id": 37, "string": "Seq2seq models must grapple with the problem of derived words that are the result of unlikely or potentially unseen string transformations."}, {"id": 38, "string": "We refer to this problem as \"orthographic irregularity.\""}, {"id": 39, "string": "Sequence Models and Corpus Knowledge In this section, we introduce the prior state-of-theart model, which serves as our baseline system."}, {"id": 40, "string": "Then we build on top of this system by incorporating a dictionary constraint and rescoring the model's hypotheses with token frequency information to address the suffix ambiguity problem."}, {"id": 41, "string": "Baseline Architecture We begin by formalizing the problem and defining some notation."}, {"id": 42, "string": "For source word x = x 1 , x 2 , ."}, {"id": 43, "string": "."}, {"id": 44, "string": "."}, {"id": 45, "string": "x m , a derivational transformation t, and target word y = y 1 , y 2 , ."}, {"id": 46, "string": "."}, {"id": 47, "string": "."}, {"id": 48, "string": "y n , our goal is to learn some function from the pair (x, t) to y."}, {"id": 49, "string": "Here, x i and y j are the ith and jth characters of the input strings x and y."}, {"id": 50, "string": "We will sometimes use x 1:i to denote x 1 , x 2 , ."}, {"id": 51, "string": "."}, {"id": 52, "string": "."}, {"id": 53, "string": "x i , and similarly for y 1:j ."}, {"id": 54, "string": "The current state-of-the-art model for derivedform generation approaches this problem by learning a character-level encoder-decoder neural network with an attention mechanism (Cotterell et al., 2017b; Bahdanau et al., 2014) ."}, {"id": 55, "string": "The input to the bidirectional LSTM encoder (Hochreiter and Schmidhuber, 1997; Graves and Schmidhuber, 2005) is the sequence #, x 1 , x 2 , ."}, {"id": 56, "string": "."}, {"id": 57, "string": "."}, {"id": 58, "string": "x m , #, t, where # is a special symbol to denote the start and end of a word, and the encoding of the derivational transformation t is concatenated to the input characters."}, {"id": 59, "string": "The model is trained to minimize the cross entropy of the training data."}, {"id": 60, "string": "We refer to our reimplementation of this model as SEQ."}, {"id": 61, "string": "For a more detailed treatment of neural sequenceto-sequence models with attention, we direct the reader to Luong et al."}, {"id": 62, "string": "(2015) ."}, {"id": 63, "string": "Dictionary Constraint The suffix ambiguity problem poses challenges for models which rely exclusively on input characters for information."}, {"id": 64, "string": "As previously demonstrated, words derived via the same transformation may take different suffixes, and it is hard to select among them based on character information alone."}, {"id": 65, "string": "Here, we describe a process for restricting our inference procedure to only generate known English words, which we call a dictionary constraint."}, {"id": 66, "string": "We believe that for English morphology, a large enough corpus will contain the vast majority of derived forms, so while this approach is somewhat restricting, it removes a significant amount of ambiguity from the problem."}, {"id": 67, "string": "To describe how we implemented this dictionary constraint, it is useful first to discuss how decoding in a seq2seq model is equivalent to solving a shortest path problem."}, {"id": 68, "string": "The notation is specific to our model, but the argument is applicable to seq2seq models in general."}, {"id": 69, "string": "The goal of decoding is to find the most probable structureŷ conditioned on some observation x and transformation t. That is, the problem is to solvê y = arg max y∈Y p(y | x, t) (1) = arg min y∈Y − log p(y | x, t) (2) where Y is the set of valid structures."}, {"id": 70, "string": "Sequential models have a natural ordering y = y 1 , y 2 , ."}, {"id": 71, "string": "."}, {"id": 72, "string": "."}, {"id": 73, "string": "y n over which − log p(y | x, t) can be decomposed − log p(y | x, t) = n t=1 − log p(y t | y 1:t−1 , x, t) (3) Solving Equation 2 can be viewed as solving a shortest path problem from a special starting state to a special ending state via some path which uniquely represents y."}, {"id": 74, "string": "Each vertex in the graph represents some sequence y 1:i , and the weight of the edge from y 1:i to y 1:i+1 is given by − log p(y i+1 | y 1:i−1 , x, t) (4) The weight of the path from the start state to the end state via the unique path that describes y is exactly equal to Equation 3."}, {"id": 75, "string": "When the vocabulary size is too large, the exact shortest path is intractable, and approximate search methods, such as beam search, are used instead."}, {"id": 76, "string": "In derived word generation, Y is an infinite set of strings."}, {"id": 77, "string": "Since Y is unrestricted, almost all of the strings in Y are not valid words."}, {"id": 78, "string": "Given a dictionary Y D , the search space is restricted to only those words in the dictionary by searching over the trie induced from Y D , which is a subgraph of the unrestricted graph."}, {"id": 79, "string": "By limiting the search space to Y D , the decoder is guaranteed to generate some known word."}, {"id": 80, "string": "Models which use this dictionaryconstrained inference procedure will be labeled with +DICT."}, {"id": 81, "string": "Algorithm 1 has the pseudocode for our decoding procedure."}, {"id": 82, "string": "We discuss specific details of the search procedure and interesting observations of the search space in Section 6."}, {"id": 83, "string": "Section 5.2 describes how we obtained the dictionary of valid words."}, {"id": 84, "string": "Word Frequency Knowledge through Rescoring We also consider the inclusion of explicit word frequency information to help solve suffix ambiguity, using the intuition that \"real\" derived words are likely to be frequently attested."}, {"id": 85, "string": "This permits a high-recall, potentially noisy dictionary."}, {"id": 86, "string": "We are motivated by very high top-10 accuracy compared to top-1 accuracy, even among dictionary-constrained models."}, {"id": 87, "string": "By rescoring the hypotheses of a model using word frequency (a word-global signal) as a feature, attempt to recover a portion of this top-10 accuracy."}, {"id": 88, "string": "When a model has been trained, we query it for its top-10 most likely hypotheses."}, {"id": 89, "string": "The union of all hypotheses for a subset of the training observations forms the training set for a classifier that learns to predict whether a hypothesis generated by the model is correct."}, {"id": 90, "string": "Each hypothesis is labelled with its correctness, a value in {±1}."}, {"id": 91, "string": "We train a simple combination of two scores: the seq2seq model score for the hypothesis, and the log of the word frequency of the hypothesis."}, {"id": 92, "string": "To permit a nonlinear combination of word frequency and model score, we train a small multilayer perceptron with the model score and the frequency of a derived word hypothesis as features."}, {"id": 93, "string": "At testing time, the 10 hypotheses generated by a single seq2seq model for a single observation are rescored."}, {"id": 94, "string": "The new model top-1 hypothesis, then, is the argmax over the 10 hypotheses according to the rescorer."}, {"id": 95, "string": "In this way, we are able to incorporate word-global information, e.g."}, {"id": 96, "string": "word frequency, that is ill-suited for incorporation at each character prediction step of the seq2seq model."}, {"id": 97, "string": "We label models that are rescored in this way +FREQ."}, {"id": 98, "string": "Distributional Models So far, we have presented models that learn derivational transformations as orthographic operations."}, {"id": 99, "string": "Such models struggle by construction with the orthographic irregularity problem, as they are trained to generalize orthographic information."}, {"id": 100, "string": "However, the semantic relationships between root words and derived words are the same even when the orthography is dissimilar."}, {"id": 101, "string": "It is salient, for example, that irregular word speech is related to its root speak in about the same way as how exploration is related to the word explore."}, {"id": 102, "string": "We model distributional transformations as functions in dense distributional word embedding spaces, crucially learning a function per derivational transformation, not per suffix pair."}, {"id": 103, "string": "In this way, we aim to explicitly model the semantic transformation, not the othographic information."}, {"id": 104, "string": "Feed-forward derivational transformations For all source words x and all target words y, we look up static distributional embeddings v x , v y ∈ R d ."}, {"id": 105, "string": "For each derivational transformation t, we learn a function f t : R d → R d that maps v x to v y ."}, {"id": 106, "string": "f t is parametrized as two-layer perceptron, trained using a squared loss, L = b T b (5) b = f t (v x ) − v y (6) We perform inference by nearest neighbor search in the embedding space."}, {"id": 107, "string": "This inference strategy requires a subset of strings for our embedding dictionary, Y V ."}, {"id": 108, "string": "Upon receiving (x, t) at test time, we compute f t (v x ) and find the most similar embeddings in Y V ."}, {"id": 109, "string": "Specifically, we find the top-k most similar embeddings, and take the most similar derived word that starts with the same 4 letters as the root word, and is not identical to it."}, {"id": 110, "string": "This heuristic filters out highly implausible hypotheses."}, {"id": 111, "string": "We use the single-word subset of the Google News vectors (Mikolov et al., 2013) as Y V , so the size of the vocabulary is 929k words."}, {"id": 112, "string": "SEQ and DIST Aggregation The seq2seq and distributional models we have presented learn with disjoint information to solve separate problems."}, {"id": 113, "string": "We leverage this intuition to build a model that chooses, for each observation, whether to generate according to orthographic information via the SEQ model, or produce a potentially irregular form via the DIST model."}, {"id": 114, "string": "To train this model, we use a held-out portion of the training set, and filter it to only observations for which exactly one of the two models produces the correct derived form."}, {"id": 115, "string": "Finally, we make the strong assumption that the probability of a derived form being generated correctly according to 1 model as opposed to the other is dependent only on the unnormalized model score from each."}, {"id": 116, "string": "We model this as a logistic regression (t is omitted for clarity): P (·|y D , y S , x) = softmax(W e [DIST(y D |x); SEQ(y S |x)] + b e ) where W e and b e are learned parameters, y D and y S are the hypotheses of the distributional and seq2seq models, and DIST(·) and SEQ(·) are the models' likelihood functions."}, {"id": 117, "string": "We denote this aggregate AGGR in our results."}, {"id": 118, "string": "Datasets In this section we describe the derivational morphology dataset used in our experiments and how we collected the dictionary and token frequencies used in the dictionary constraint and rescorer."}, {"id": 119, "string": "Derivational Morphology In our experiments, we use the derived word generation derivational morphology dataset released in Cotterell et al."}, {"id": 120, "string": "(2017b) ."}, {"id": 121, "string": "The dataset, derived from NomBank (Meyers et al., 2004) , consists of 4,222 training, 905 validation, and 905 test triples of the form (x, t, y)."}, {"id": 122, "string": "The transformations are from the following categories: ADVERB (ADJ → ADV), RESULT (V → N), AGENT (V → N), and NOMI-NAL (ADJ → N)."}, {"id": 123, "string": "Examples from the dataset can be found in Table 1 ."}, {"id": 124, "string": "Dictionary and Token Frequency Statistics The dictionary and token frequency statistics used in the dictionary constraint and frequency reranking come from the Google Books NGram corpus (Michel et al., 2011) ."}, {"id": 125, "string": "The unigram frequency counts were aggregated across years, and any tokens which appear fewer than approximately 2,000 times, do not end in a known possible suffix, or contain a character outside of our vocabulary were removed."}, {"id": 126, "string": "The frequency threshold was determined using development data, optimizing for high recall."}, {"id": 127, "string": "We collect a set of known suffixes from the training data by removing the longest common prefix between the source and target words from the target word."}, {"id": 128, "string": "The result is a dictionary with frequency information for around 360k words, which covers 98% of the target words in the training data."}, {"id": 129, "string": "3 Inference Procedure Discussion In many sequence models where the vocabulary size is large, exact inference by finding the true shortest path in the graph discussed in Section 3.2 is intractable."}, {"id": 130, "string": "As a result, approximate inference techniques such as beam search are often used, or the size of the search space is reduced, for example, by using a Markov assumption."}, {"id": 131, "string": "We, however, observed that exact inference via a shortest path algorithm is not only tractable in our model, but 3 The remaining 2% is mostly words with hyphens or mistakes in the dataset."}, {"id": 132, "string": "Method Accuracy  only slightly more expensive than greedy search and significantly less expensive than beam search."}, {"id": 133, "string": "Avg."}, {"id": 134, "string": "To quantify this claim, we measured the accuracy and number of states explored by greedy search, beam search, and shortest path with and without a dictionary constraint on the development data."}, {"id": 135, "string": "Table 2 shows the results averaged over 30 runs."}, {"id": 136, "string": "As expected, beam search and shortest path have higher accuracies than greedy search and explore more of the search space."}, {"id": 137, "string": "Surprisingly, beam search and shortest path have nearly identical accuracies, but shortest path explores significantly fewer hypotheses."}, {"id": 138, "string": "At least two factors contribute to the tractability of exact search in our model."}, {"id": 139, "string": "First, our characterlevel sequence model has a vocabulary size of 63, which is significantly smaller than token-level models, in which a vocabulary of 50k words is not uncommon."}, {"id": 140, "string": "The search space of sequence models is dependent upon the size of the vocabulary, so the model's search space is dramatically smaller than for a token-level model."}, {"id": 141, "string": "Second, the inherent structure of the task makes it easy to eliminate large subgraphs of the search space."}, {"id": 142, "string": "The first several characters of the input word and output word are almost always the same, so the model assigns very low probability to any sequence with different starting characters than the input."}, {"id": 143, "string": "Then, the rest of the search procedure is dedicated to deciding between suffixes."}, {"id": 144, "string": "Any suffix which does not appear frequently in the training data receives a low score, leaving the search to decide between a handful of possible options."}, {"id": 145, "string": "The result is that the learned probability distribution is very spiked; it puts very high probability on just a few output sequences."}, {"id": 146, "string": "It is empirically true that the top few most probable sequences have significantly higher scores than the next most probable sequences, which supports this hypothesis."}, {"id": 147, "string": "In our subsequent experiments, we decode using Algorithm 1 The decoding procedure uses a shortest-path algorithm to find the most probable output sequence."}, {"id": 148, "string": "The dictionary constraint is (optionally) implemented on line 9 by only considering prefixes that are contained in some trie T ."}, {"id": 149, "string": "if y ∈ T then 10: s ← FORWARD(x, t, y ) 11: H.insert(s, y ) exact inference by running a shortest path algorithm (see Algorithm 1)."}, {"id": 150, "string": "For reranking models, instead of typically using a beam of size k, we use the top k most probable sequences."}, {"id": 151, "string": "Results In all of our experiments, we use the training, development, and testing splits provided by Cotterell et al."}, {"id": 152, "string": "(2017b) and average over 30 random restarts."}, {"id": 153, "string": "Table 3 displays the accuracies and average edit distances on the test set of each of the systems presented in this work and the state-of-the-art model from Cotterell et al."}, {"id": 154, "string": "(2017b) ."}, {"id": 155, "string": "First, we observed that SEQ outperforms the results reported in Cotterell et al."}, {"id": 156, "string": "(2017b) by a large margin, despite the fact that the model architectures are the same."}, {"id": 157, "string": "We attribute this difference to better hyperparameter settings and improved learning rate annealing."}, {"id": 158, "string": "Then, it is clear that the accuracy of the distributional model, DIST, is significantly lower than any seq2seq model."}, {"id": 159, "string": "We believe the orthographyinformed models perform better because most observations in the dataset are orthographically regular, providing low-hanging fruit."}, {"id": 160, "string": "depth analysis of the strengths of SEQ and DIST in Section 7.1."}, {"id": 161, "string": "Open-vocabulary models Closed-vocabulary models We now consider closed-vocabulary models that improve upon the seq2seq model in AGGR."}, {"id": 162, "string": "First, we see that restricting the decoder to only generate known words is extremely useful, with SEQ+DICT improving over SEQ by 6.2 points."}, {"id": 163, "string": "Qualitatively, we note that this constraint helps solve the suffix ambiguity problem, since orthographically plausible incorrect hypotheses are pruned as non-words."}, {"id": 164, "string": "See Table 6 for examples of this phenomenon."}, {"id": 165, "string": "Additionally, we observe that the dictionary-constrained model outperforms the unconstrained model according to top-10 accuracy (see Table 5 )."}, {"id": 166, "string": "Rescoring (+FREQ) provides further improvement of 0.8 points, showing that the decoding dictionary constraint provides a higher-quality beam that still has room for top-1 improvement."}, {"id": 167, "string": "All together, AGGR+FREQ+DICT provides a 4.4 point improvement over the best open-vocabulary model, AGGR."}, {"id": 168, "string": "This shows the disambiguating power of assuming a closed vocabulary."}, {"id": 169, "string": "Edit Distance One interesting side effect of the dictionary constraint appears when comparing AGGR+FREQ with and without the dictionary constraint."}, {"id": 170, "string": "Although the accuracy of the dictionaryconstrained model is better, the average edit distance is worse."}, {"id": 171, "string": "The unconstrained model is free to put invalid words which are orthographically similar to the target word in its top-k, however the constrained model can only choose valid words."}, {"id": 172, "string": "This means it is easier for the unconstrained model to generate words which have a low edit distance to the ground truth, whereas the constrained model  can only do that if such a word exists."}, {"id": 173, "string": "The result is a more accurate, yet more orthographically diverse, set of hypotheses."}, {"id": 174, "string": "Results by Transformation Next, we compare our best open vocabulary and closed vocabulary models to previous work across each derivational transformation."}, {"id": 175, "string": "These results are in Table 4 ."}, {"id": 176, "string": "The largest improvement over the baseline system is for NOMINAL transformations, in which the AGGR has a 49% reduction in error."}, {"id": 177, "string": "We attribute most of this gain to the difficulty of this particular transformation."}, {"id": 178, "string": "NOMINAL is challenging because there are several plausible endings (e.g."}, {"id": 179, "string": "-ity, -ness, -ence) which occur at roughly the same rate."}, {"id": 180, "string": "Additionally, NOMINAL examples are the least frequent transformation in the dataset, so it is challenging for a sequential model to learn to generalize."}, {"id": 181, "string": "The distributional model, which does not rely on suffix information, does not have this same weakness, so the aggregation AGGR model has better results."}, {"id": 182, "string": "The performance of AGGR+FREQ+DICT is worse than AGGR, however."}, {"id": 183, "string": "This is surprising because, in all other transformations, adding dictionary information improves the accuracies."}, {"id": 184, "string": "We believe this is due to the ambiguity of the ground truth: Many root words have seemingly multiple plausible nominal transformations, such as rigid → {rigidness, rigidity} and equivalent → {equivalence, equivalency}."}, {"id": 185, "string": "The dictionary constraint produces a better set of hypotheses to rescore, as demonstrated in Table 5 ."}, {"id": 186, "string": "Therefore, the dictionary-constrained model is likely to have more of these ambiguous cases, which makes the task more difficult."}, {"id": 187, "string": "Strengths of SEQ and DIST In this subsection we explore why AGGR improves consistently over SEQ even though it maintains an open vocabulary."}, {"id": 188, "string": "We have argued that DIST is able to correctly produce derived words that are Cotterell et al."}, {"id": 189, "string": "(2017b) Table 5 : The accuracies of the top-10 best outputs for the SEQ, SEQ+DICT, and prior work demonstrate that the dictionary constraint significantly improves the overall candidate quality."}, {"id": 190, "string": "Figure 2 : Aggregating across 30 random restarts, we tallied when SEQ and DIST correctly produced derived forms of each suffix."}, {"id": 191, "string": "The y-axis shows the logarithm of the difference, per suffix, between the tally for DIST and the tally for SEQ."}, {"id": 192, "string": "On the x-axis is the logarithm of the frequency of derived words with each suffix in the training data."}, {"id": 193, "string": "A linear regression line is plotted to show the relationship between log suffix frequency and log difference in correct predictions."}, {"id": 194, "string": "Suffixes that differ only by the first letter, as with -ger and -er, have been merged and represented by the more frequent of the two."}, {"id": 195, "string": "orthographically irregular or infrequent in the training data."}, {"id": 196, "string": "Figure 2 quantifies this phenomenon, analyzing the difference in accuracy between the two models, and plotting this in relationship to the frequency of the suffix in the training data."}, {"id": 197, "string": "The plot shows that SEQ excels at generating derived words ending in -ly, -ion, and other suffixes that appeared frequently in the training data."}, {"id": 198, "string": "DIST's improvements over SEQ are generally much less frequent in the training data, or as in the case of -ment, are less frequent than other suffixes for the same transformation (like -ion.)"}, {"id": 199, "string": "By producing derived words whose suffixes show up rarely in the training data, DIST helps solve the orthographic irregularity problem."}, {"id": 200, "string": "Prior Work There has been much work on the related task of inflected word generation (Durrett and DeNero, Table 6 : Sample output from a selection of models."}, {"id": 201, "string": "The words in bold mark the correct derivations."}, {"id": 202, "string": "\"Hindrance\" and \"vacancy\" are the expected derived words for the last two rows."}, {"id": 203, "string": "2013; Rastogi et al., 2016; Hulden et al., 2014) ."}, {"id": 204, "string": "It is a structurally similar task to ours, but does not have the same difficulty of challenges (Cotterell et al., 2017a,b) , which we have addressed in our work."}, {"id": 205, "string": "The paradigm completion for derivational morphology dataset we use in this work was introduced in Cotterell et al."}, {"id": 206, "string": "(2017b) ."}, {"id": 207, "string": "They apply the model that won the 2016 SIGMORPHON shared task on inflectional morphology to derivational morphology (Kann and Schütze, 2016; ."}, {"id": 208, "string": "We use this as our baseline."}, {"id": 209, "string": "Our implementation of the dictionary constraint is an example of a special constraint which can be directly incorporated into the inference algorithm at little additional cost."}, {"id": 210, "string": "Yih (2004, 2007) propose a general inference procedure that naturally incorporates constraints through recasting inference as solving an integer linear program."}, {"id": 211, "string": "Beam or hypothesis rescoring to incorporate an expensive or non-decomposable signal into search has a history in machine translation (Huang and Chiang, 2007) ."}, {"id": 212, "string": "In inflectional morphology, Nicolai et al."}, {"id": 213, "string": "(2015) use this idea to rerank hypotheses using orthographic features and Faruqui et al."}, {"id": 214, "string": "(2016) use a character-level language model."}, {"id": 215, "string": "Our approach is similar to Faruqui et al."}, {"id": 216, "string": "(2016) in that we use statistics from a raw corpus, but at the token level."}, {"id": 217, "string": "There have been several attempts to use distributional information in morphological generation and analysis."}, {"id": 218, "string": "Soricut and Och (2015) collect pairs of words related by any morphological change in an unsupervised manner, then select a vector offset which best explains their observations."}, {"id": 219, "string": "There has been subsequent work exploring the vector offset method, finding it unsuccessful in captur-ing derivational transformations (Gladkova et al., 2016) ."}, {"id": 220, "string": "However, we use more expressive, nonlinear functions to model derivational transformations and report positive results."}, {"id": 221, "string": "Gupta et al."}, {"id": 222, "string": "(2017) then learn a linear transformation per orthographic rule to solve a word analogy task."}, {"id": 223, "string": "Our distributional model learns a function per derivational transformation, not per orthographic rule, which allows it to generalize to unseen orthography."}, {"id": 224, "string": "Implementation Details Our models are implemented in Python using the DyNet deep learning library (Neubig et al., 2017) ."}, {"id": 225, "string": "The code is freely available for download."}, {"id": 226, "string": "4 Sequence Model The sequence-to-sequence model uses character embeddings of size 20, which are shared across the encoder and decoder, with a vocabulary size of 63."}, {"id": 227, "string": "The hidden states of the LSTMs are of size 40."}, {"id": 228, "string": "For training, we use Adam with an initial learning rate of 0.005, a batch size of 5, and train for a maximum of 30 epochs."}, {"id": 229, "string": "If after one epoch of the training data, the loss on the validation set does not decrease, we anneal the learning rate by half and revert to the previous best model."}, {"id": 230, "string": "During decoding, we find the top 1 most probable sequence as discussed in Section 6 unless rescoring is used, in which we use the top 10."}, {"id": 231, "string": "Rescorer The rescorer is a 1-hidden-layer perceptron with a tanh nonlinearity and 4 hidden units."}, {"id": 232, "string": "It is trained for a maximum of 5 epochs."}, {"id": 233, "string": "Distributional Model The DIST model is a 1hidden-layer perceptron with a tanh nonlinearity and 100 hidden units."}, {"id": 234, "string": "It is trained for a maximum of 25 epochs."}, {"id": 235, "string": "Conclusion In this work, we present a novel aggregation model for derived word generation."}, {"id": 236, "string": "This model learns to choose between the predictions of orthographicallyand distributionally-informed models."}, {"id": 237, "string": "This ameliorates suffix ambiguity and orthographic irregularity, the salient problems of the generation task."}, {"id": 238, "string": "Concurrently, we show that derivational transformations can be usefully modeled as nonlinear functions on distributional word embeddings."}, {"id": 239, "string": "The distributional and orthographic models aggregated contribute orthogonal information to the aggregate, as shown by substantial improvements over state-of-the-art results, and qualitative analysis."}, {"id": 240, "string": "Two ways of incorporating corpus knowledge -constrained decoding and rescoring -demonstrate further improvements to our main contribution."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 28}, {"section": "Background: Derivational Morphology", "n": "2", "start": 29, "end": 37}, {"section": "Sequence Models and Corpus Knowledge", "n": "3", "start": 38, "end": 40}, {"section": "Baseline Architecture", "n": "3.1", "start": 41, "end": 62}, {"section": "Dictionary Constraint", "n": "3.2", "start": 63, "end": 83}, {"section": "Word Frequency Knowledge through Rescoring", "n": "3.3", "start": 84, "end": 97}, {"section": "Distributional Models", "n": "4", "start": 98, "end": 103}, {"section": "Feed-forward derivational transformations", "n": "4.1", "start": 104, "end": 111}, {"section": "SEQ and DIST Aggregation", "n": "4.2", "start": 112, "end": 117}, {"section": "Datasets", "n": "5", "start": 118, "end": 118}, {"section": "Derivational Morphology", "n": "5.1", "start": 119, "end": 123}, {"section": "Dictionary and Token Frequency Statistics", "n": "5.2", "start": 124, "end": 128}, {"section": "Inference Procedure Discussion", "n": "6", "start": 129, "end": 150}, {"section": "Results", "n": "7", "start": 151, "end": 186}, {"section": "Strengths of SEQ and DIST", "n": "7.1", "start": 187, "end": 199}, {"section": "Prior Work", "n": "8", "start": 200, "end": 223}, {"section": "Implementation Details", "n": "9", "start": 224, "end": 234}, {"section": "Conclusion", "n": "10", "start": 235, "end": 240}], "figures": [{"filename": "../figure/image/1276-Figure1-1.png", "caption": "Figure 1: Diagram depicting the flow of our aggregation model. Two models generate a hypothesis according to orthogonal information; then one is chosen as the final model generation. Here, the hypothesis from the distributional model is chosen.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 221.76, "y2": 372.0}}, {"filename": "../figure/image/1276-Table3-1.png", "caption": "Table 3: The accuracies and edit distances of the models presented in this paper and prior work. For edit distance, lower is better. The dictionary-constrained models are on the lower half of the table.", "page": 5, "bbox": {"x1": 330.71999999999997, "x2": 502.08, "y1": 62.4, "y2": 196.32}}, {"filename": "../figure/image/1276-Table1-1.png", "caption": "Table 1: The goal of derived word generation is to produce the derived word, y, given both the root word, x, and the transformation t, as demonstrated here with examples from the dataset.", "page": 1, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 62.4, "y2": 208.32}}, {"filename": "../figure/image/1276-Table4-1.png", "caption": "Table 4: The accuracies and edit distances of our best open-vocabulary and closed-vocabulary models, AGGR and AGGR+FREQ+DICT compared to prior work, evaluated at the transformation level. For edit distance, lower is better.", "page": 6, "bbox": {"x1": 72.96, "x2": 289.44, "y1": 63.36, "y2": 144.0}}, {"filename": "../figure/image/1276-Table5-1.png", "caption": "Table 5: The accuracies of the top-10 best outputs for the SEQ, SEQ+DICT, and prior work demonstrate that the dictionary constraint significantly improves the overall candidate quality.", "page": 6, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 63.36, "y2": 152.16}}, {"filename": "../figure/image/1276-Figure2-1.png", "caption": "Figure 2: Aggregating across 30 random restarts, we tallied when SEQ and DIST correctly produced derived forms of each suffix. The y-axis shows the logarithm of the difference, per suffix, between the tally for DIST and the tally for SEQ. On the x-axis is the logarithm of the frequency of derived words with each suffix in the training data. A linear regression line is plotted to show the relationship between log suffix frequency and log difference in correct predictions. Suffixes that differ only by the first letter, as with -ger and -er, have been merged and represented by the more frequent of the two.", "page": 6, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 208.79999999999998, "y2": 372.0}}, {"filename": "../figure/image/1276-Table6-1.png", "caption": "Table 6: Sample output from a selection of models. The words in bold mark the correct derivations. “Hindrance” and “vacancy” are the expected derived words for the last two rows.", "page": 7, "bbox": {"x1": 96.96, "x2": 500.15999999999997, "y1": 62.4, "y2": 211.2}}, {"filename": "../figure/image/1276-Table2-1.png", "caption": "Table 2: The average accuracies and number of states explored in the search graph of 30 runs of the SEQ model with various search procedures. The BEAM models use a beam size of 10.", "page": 4, "bbox": {"x1": 324.0, "x2": 509.28, "y1": 62.4, "y2": 150.23999999999998}}]}