{"title": "Automatic Metric Validation for Grammatical Error Correction", "abstract": "Metric validation in Grammatical Error Correction (GEC) is currently done by observing the correlation between human and metric-induced rankings. However, such correlation studies are costly, methodologically troublesome, and suffer from low inter-rater agreement. We propose MAEGE, an automatic methodology for GEC metric validation, that overcomes many of the difficulties with existing practices. Experiments with MAEGE shed a new light on metric quality, showing for example that the standard M 2 metric fares poorly on corpus-level ranking. Moreover, we use MAEGE to perform a detailed analysis of metric behavior, showing that correcting some types of errors is consistently penalized by existing metrics.", "text": [{"id": 0, "string": "Introduction Much recent effort has been devoted to automatic evaluation, both within GEC (Napoles et al., 2015; Felice and Briscoe, 2015; Ng et al., 2014; Dahlmeier and Ng, 2012, see §2) , and more generally in text-to-text generation tasks."}, {"id": 1, "string": "Within Machine Translation (MT), an annual shared task is devoted to automatic metric development, accompanied by an extensive analysis of metric behavior (Bojar et al., 2017) ."}, {"id": 2, "string": "Metric validation is also raising interest in GEC, with several recent works on the subject (Grundkiewicz et al., 2015; Napoles et al., 2015 Napoles et al., , 2016b Sakaguchi et al., 2016) , all using correlation with human rankings (henceforth, CHR) as their methodology."}, {"id": 3, "string": "Human rankings are often considered as ground truth in text-to-text generation, but using them reliably can be challenging."}, {"id": 4, "string": "Other than the costs of compiling a sizable validation set, human rank-ings are known to yield poor inter-rater agreement in MT (Bojar et al., 2011; Lopez, 2012; Graham et al., 2012) , and to introduce a number of methodological problems that are difficult to overcome, notably the treatment of ties in the rankings and uncomparable sentences (see §3)."}, {"id": 5, "string": "These difficulties have motivated several proposals to alter the MT metric validation protocol (Koehn, 2012; Dras, 2015) , leading to a recent abandoning of evaluation by human rankings due to its unreliability (Graham et al., 2015; ."}, {"id": 6, "string": "These conclusions have not yet been implemented in GEC, despite their relevance."}, {"id": 7, "string": "In §3 we show that human rankings in GEC also suffer from low inter-rater agreement, motivating the development of alternative methodologies."}, {"id": 8, "string": "The main contribution of this paper is an automatic methodology for metric validation in GEC called MAEGE (Methodology for Automatic Evaluation of GEC Evaluation), which addresses these difficulties."}, {"id": 9, "string": "MAEGE requires no human rankings, and instead uses a corpus with gold standard GEC annotation to generate lattices of corrections with similar meanings but varying degrees of grammaticality."}, {"id": 10, "string": "For each such lattice, MAEGE generates a partial order of correction quality, a quality score for each correction, and the number and types of edits required to fully correct each."}, {"id": 11, "string": "It then computes the correlation of the induced partial order with the metric-induced rankings."}, {"id": 12, "string": "MAEGE addresses many of the problems with existing methodology: • Human rankings yield low inter-rater and intra-rater agreement ( §3)."}, {"id": 13, "string": "Indeed, Choshen and Abend (2018a) show that while annotators often generate different corrections given a sentence, they generally agree on whether a correction is valid or not."}, {"id": 14, "string": "Unlike CHR, MAEGE bases its scores on human corrections, rather than on rankings."}, {"id": 15, "string": "• CHR uses system outputs to obtain human rankings, which may be misleading, as systems may share similar biases, thus neglecting to evaluate some types of valid corrections ( §7)."}, {"id": 16, "string": "MAEGE addresses this issue by systematically traversing an inclusive space of corrections."}, {"id": 17, "string": "• The difficulty in handling ties is addressed by only evaluating correction pairs where one contains a sub-set of the errors of the other, and is therefore clearly better."}, {"id": 18, "string": "• MAEGE uses established statistical tests for determining the significance of its results, thereby avoiding ad-hoc methodologies used in CHR to tackle potential biases in human rankings ( §5, §6)."}, {"id": 19, "string": "In experiments on the standard NUCLE test set (Dahlmeier et al., 2013) , we find that MAEGE often disagrees with CHR as to the quality of existing metrics."}, {"id": 20, "string": "For example, we find that the standard GEC metric, M 2 , is a poor predictor of corpuslevel ranking, but a good predictor of sentencelevel pair-wise rankings."}, {"id": 21, "string": "The best predictor of corpus-level quality by MAEGE is the referenceless LT metric (Miłkowski, 2010; Napoles et al., 2016b) , while of the reference-based metrics, GLEU (Napoles et al., 2015) fares best."}, {"id": 22, "string": "In addition to measuring metric reliability, MAEGE can also be used to analyze the sensitivities of the metrics to corrections of different types, which to our knowledge is a novel contribution of this work."}, {"id": 23, "string": "Specifically, we find that not only are valid edits of some error types better rewarded than others, but that correcting certain error types is consistently penalized by existing metrics (Section 7)."}, {"id": 24, "string": "The importance of interpretability and detail in evaluation practices (as opposed to just providing bottom-line figures), has also been stressed in MT evaluation (e.g., Birch et al., 2016) ."}, {"id": 25, "string": "Examined Metrics We turn to presenting the metrics we experiment with."}, {"id": 26, "string": "The standard practice in GEC evaluation is to define differences between the source and a correction (or a reference) as a set of edits (Dale et al., 2012) ."}, {"id": 27, "string": "An edit is a contiguous span of tokens to be edited, a substitute string, and the corrected error type."}, {"id": 28, "string": "For example: \"I want book\" might have an edit (2-3, \"a book\", ArtOrDet); applying the edit results in \"I want a book\"."}, {"id": 29, "string": "Edits are defined (by the annotation guidelines) to be maximally independent, so that each edit can be applied independently of the others."}, {"id": 30, "string": "We denote the examined set of metrics with METRICS."}, {"id": 31, "string": "BLEU."}, {"id": 32, "string": "BLEU (Papineni et al., 2002) is a reference-based metric that averages the outputreference n-gram overlap precision values over different ns."}, {"id": 33, "string": "While commonly used in MT and other text generation tasks (Sennrich et al., 2017; Krishna et al., 2017; Yu et al., 2017) , BLEU was shown to be a problematic metric in monolingual translation tasks, in which much of the source sentence should remain unchanged (Xu et al., 2016) ."}, {"id": 34, "string": "We use the NLTK implementation of BLEU, using smoothing method 3 by Chen and Cherry (2014) ."}, {"id": 35, "string": "GLEU."}, {"id": 36, "string": "GLEU (Napoles et al., 2015) is a reference-based GEC metric inspired by BLEU."}, {"id": 37, "string": "Recently, it was updated to better address multiple references (Napoles et al., 2016a) ."}, {"id": 38, "string": "GLEU rewards n-gram overlap of the correction with the reference and penalizes unchanged n-grams in the correction that are changed in the reference."}, {"id": 39, "string": "iBLEU."}, {"id": 40, "string": "iBLEU (Sun and Zhou, 2012) was introduced to monolingual translation in order to balance BLEU, by averaging it with the BLEU score of the source and the output."}, {"id": 41, "string": "This yields a metric that rewards similarity to the source, and not only overlap with the reference: iBLEU (S, R, O) = αBLEU (O, R)−(1−α)BLEU (O, S) We set α = 0.8 as suggested by Sun and Zhou."}, {"id": 42, "string": "F -Score computes the overlap of edits to the source in the reference, and in the output."}, {"id": 43, "string": "As system edits can be constructed in multiple ways, the standard M 2 scorer (Dahlmeier and Ng, 2012) computes the set of edits that yields the maximum F -score."}, {"id": 44, "string": "As M 2 requires edits from the source to the reference, and as MAEGE generates new source sentences, we use an established protocol to automatically construct edits from pairs of strings (Felice et al., 2016; Bryant et al., 2017) ."}, {"id": 45, "string": "The protocol was shown to produce similar M 2 scores to those produced with manual edits."}, {"id": 46, "string": "Following common practice, we use the Precision-oriented F 0.5 ."}, {"id": 47, "string": "SARI."}, {"id": 48, "string": "SARI (Xu et al., 2016) is a referencebased metric proposed for sentence simplification."}, {"id": 49, "string": "SARI averages three scores, measuring the extent to which n-grams are correctly added to the source, deleted from it and retained in it."}, {"id": 50, "string": "Where multiple references are present, SARI's score is determined not as the maximum single-reference score, but some averaging over them."}, {"id": 51, "string": "As this may lead to an unintuitive case, where a correction which is identical to the output gets a score of less than 1, we experiment with an additional metric, MAX-SARI, which coincides with SARI for a single reference, and computes the maximum singlereference SARI score for multiple-references."}, {"id": 52, "string": "Levenshtein Distance."}, {"id": 53, "string": "We use the Levenshtein distance (Kruskal and Sankoff, 1983) , i.e., the number of character edits needed to convert one string to another, between the correction and its closest reference (M inLD O→R )."}, {"id": 54, "string": "To enrich the discussion, we also report results with a measure of conservatism, LD S→O , i.e., the Levenshtein distance between the correction and the source."}, {"id": 55, "string": "Both distances are normalized by the number of characters in the second string (R, O respectively)."}, {"id": 56, "string": "In order to convert these distance measures into measures of similarity, we report 1 − LD(c1,c2) len(c1) ."}, {"id": 57, "string": "Grammaticality is a reference-less metric, which uses grammatical error detection tools to assess the grammaticality of GEC system outputs."}, {"id": 58, "string": "We use LT (Miłkowski, 2010) , the best performing non-proprietary grammaticality metric (Napoles et al., 2016b) ."}, {"id": 59, "string": "The detection tool at the base of LT can be much improved."}, {"id": 60, "string": "Indeed, Napoles et al."}, {"id": 61, "string": "(2016b) reported that the proprietary tool they used detected 15 times more errors than LT. A sentence's score is defined to be 1 − #errors #tokens ."}, {"id": 62, "string": "See (Asano et al., 2017; Choshen and Abend, 2018b) for additional reference-less measures, published concurrently with this work."}, {"id": 63, "string": "I-Measure."}, {"id": 64, "string": "I-Measure (Felice and Briscoe, 2015) is a weighted accuracy metric over tokens."}, {"id": 65, "string": "I-measure rank determines whether a correction is better than the source and to what extent."}, {"id": 66, "string": "Unlike in this paper, I-measure assumes that every pair of intersecting edits (i.e., edits whose spans of tokens overlap) are alternating, and that non-intersecting edits are independent."}, {"id": 67, "string": "Consequently, where multiple references are present, it extends the set of references, by generating every possible combination of independent edits."}, {"id": 68, "string": "As the number of combinations is generally exponential in the number of references, the procedure can be severely inefficient."}, {"id": 69, "string": "Indeed, a sentence in the test set has 3.5 billion references on average, where the median is 512 (See Figure 1 )."}, {"id": 70, "string": "I-measure can also be run without generating new references, but despite parallelization efforts, this version did not terminate after 140 CPU days, while the cumulative CPU time of the rest of the metrics was less than 1.5 days."}, {"id": 71, "string": "Human Ranking Experiments Correlation with human rankings (CHR) is the standard methodology for assessing the validity of GEC metrics."}, {"id": 72, "string": "While informative, human rankings are costly to produce, present low inter-rater agreement (shown for MT evaluation in (Bojar et al., 2011; Dras, 2015) ), and introduce methodological difficulties that are hard to overcome."}, {"id": 73, "string": "We begin by showing that existing sets of human rankings produce inconsistent results with respect to the quality of different metrics, and proceed by proposing an improved protocol for computing this correlation in the future."}, {"id": 74, "string": "There are two existing sets of human rankings for GEC that were compiled concurrently: GJG15 by Grundkiewicz et al."}, {"id": 75, "string": "(2015) , and NSPT15 by Napoles et al."}, {"id": 76, "string": "(2015) ."}, {"id": 77, "string": "Both sets are based on system outputs from the CoNLL 2014 (Ng et al., 2014) shared task, using sentences from the NUCLE test set."}, {"id": 78, "string": "We compute CHR against each."}, {"id": 79, "string": "System-level correlations are computed by TrueSkill (Sakaguchi et al., 2014) , which adopts its methodology from MT."}, {"id": 80, "string": "1 Table 1 shows CHR with Spearman ρ (Pearson r shows similar trends)."}, {"id": 81, "string": "Results on the two datasets diverge considerably, despite their use of the same systems and corpus (albeit a different sub-set thereof)."}, {"id": 82, "string": "For example, BLEU receives a high positive correlation on GJG15, but a negative one on NSPT15; GLEU receives a correlation of 0.51 against GJG15 and 0.76 against NSPT15; and M 2 ranges between 0.4 (GJG15) and 0.7 (NSPT15)."}, {"id": 83, "string": "In fact, this variance is already apparent in the published correlations of GLEU, e.g., Napoles et al."}, {"id": 84, "string": "(2015) reported a ρ of 0.56 against NSPT15 and Napoles et al."}, {"id": 85, "string": "(2016b) reported a ρ of 0.85 against GJG15."}, {"id": 86, "string": "2 This variance in the metrics' scores is an example of the low agreement between human rankings, echoing similar findings in MT (Bojar et al., 2011; Lopez, 2012; Dras, 2015) ."}, {"id": 87, "string": "Another source of inconsistency in CHR is that the rankings are relative and sampled, so datasets rank different sets of outputs (Lopez, 2012) ."}, {"id": 88, "string": "For example, if a system is judged against the best systems more often then others, it may unjustly receive a lower score."}, {"id": 89, "string": "TrueSkill is the best known practice to tackle such issues (Bojar et al., 2014) , but it produces a probabilistic corpus-level score, which can vary between runs (Sakaguchi et al., 2016) ."}, {"id": 90, "string": "3 This makes CHR more difficult to interpret, compared to classic correlation coefficients."}, {"id": 91, "string": "We conclude by proposing a practice for reporting CHR in future work."}, {"id": 92, "string": "First, we combine both sets of human judgments to arrive at the statistically most powerful test."}, {"id": 93, "string": "Second, we compute the metrics' corpus-level rankings according to the same subset of sentences used for human rankings."}, {"id": 94, "string": "The current practice of allowing metrics to rank systems based on their output on the entire CoNLL test set (while human rankings are only collected for a sub-set thereof), may bias the results due to potential non-uniform system performance on the test set."}, {"id": 95, "string": "We report CHR according to the proposed protocol in Table 1 (left column)."}, {"id": 96, "string": "Constructing Lattices of Corrections In the following sections we present MAEGE an alternative methodology to CHR, which uses human corrections to induce more reliable and scalable rankings to compare metrics against."}, {"id": 97, "string": "We begin our presentation by detailing the method MAEGE 2 The difference between our results and previously reported ones is probably due to a recent update in GLEU to better tackles multiple references (Napoles et al., 2016a) ."}, {"id": 98, "string": "3 The standard deviation of the results is about 0.02.  j is the j-th perfect correction of Oi (i.e., the perfect correction that result from applying all the edits of the j-th annotation of Oi)."}, {"id": 99, "string": "R (1) 1 R (1) k · · · O 1 R (n) 1 R (n) k · · · · · · O n uses to generate source-correction pairs and a partial order between them."}, {"id": 100, "string": "MAEGE operates by using a corpus with gold annotation, given as edits, to generate lattices of corrections, each defined by a sub-set of the edits."}, {"id": 101, "string": "Within the lattice, every pair of sentences can be regarded as a potential source and a potential output."}, {"id": 102, "string": "We create sentence chains, in an increasing order of quality, taking a source sentence and applying edits in some order one after the other (see Figure 2 and 3)."}, {"id": 103, "string": "Formally, for each sentence s in the corpus and each annotation a, we have a set of typed edits edits(s, a) = {e (1) s,a , ."}, {"id": 104, "string": "."}, {"id": 105, "string": "."}, {"id": 106, "string": ", e (ns,a) s,a } of size n s,a ."}, {"id": 107, "string": "We call 2 edits(s,a) the corrections lattice, and denote it with E s,a ."}, {"id": 108, "string": "We call, s, the correction corresponding to ∅ the original."}, {"id": 109, "string": "We define a partial order relation between x, y ∈ E s,a such that x < y if x ⊂ y."}, {"id": 110, "string": "This order relation is assumed to be the gold standard ranking between the corrections."}, {"id": 111, "string": "For our experiments, we use the NUCLE test data (Ng et al., 2014) ."}, {"id": 112, "string": "Each sentence is paired with two annotations."}, {"id": 113, "string": "The other eight available  references, produced by Bryant and Ng (2015) , are used as references for the reference-based metrics."}, {"id": 114, "string": "Denote the set of references for s with R s ."}, {"id": 115, "string": "Sentences which require no correction according to at least one of the two annotations are discarded."}, {"id": 116, "string": "In 26 cases where two edit spans intersect in the same annotation (out of a total of about 40K edits), the edits are manually merged or split."}, {"id": 117, "string": "Corpus-level Analysis We conduct a corpus-level analysis, namely testing the ability of metrics to determine which corpus of corrections is of better quality."}, {"id": 118, "string": "In practice, this procedure is used to rank systems based on their outputs on the test corpus."}, {"id": 119, "string": "In order to compile corpora corresponding to systems of different quality levels, we define sev-eral corpus models, each applying a different expected number of edits to the original."}, {"id": 120, "string": "Models are denoted with the expected number of edits they apply to the original which is a positive number M ∈ R + ."}, {"id": 121, "string": "Given a corpus model M , we generate a corpus of corrections by traversing the original sentences, and for each sentence s uniformly sample an annotation a (i.e., a set of edits that results in a perfect correction), and the number of edits applied n edits , which is sampled from a clipped binomial probability with mean M and variance 0.9."}, {"id": 122, "string": "Given n edits , we uniformly sample from the lattice E s,a a sub-set of edits of size n edits , and apply this set of edits to s. The corpus of M = 0 is the set of originals."}, {"id": 123, "string": "The corpus of source sentences, against which all other corpora are compared, is sampled by traversing the original sentences, and for each sentence s, uniformly sample an annotation a, and given s, a, uniformly sample a sentence from E s,a ."}, {"id": 124, "string": "Given a metric m ∈ METRICS, we compute its score for each sampled corpus."}, {"id": 125, "string": "Where corpuslevel scores are not defined by the metrics themselves, we use the average sentence score instead."}, {"id": 126, "string": "We compare the rankings induced by the scores of m and the ranking of systems according to their corpus model (i.e., systems that have a higher M should be ranked higher), and report the correlation between these rankings."}, {"id": 127, "string": "Experiments Setup."}, {"id": 128, "string": "For each model, we sample one correction per NUCLE sentence, noting that it is possible to reduce the variance of the metrics' corpuslevel scores by sampling more."}, {"id": 129, "string": "Corpus models of integer values between 0 and 10 are taken."}, {"id": 130, "string": "We report Spearman ρ, commonly used for system-level rankings (Bojar et al., 2017)."}, {"id": 131, "string": "4 Results."}, {"id": 132, "string": "Results, presented in Table 2 (left part), shows that LT correlates best with the rankings induced by MAEGE, where GLEU is second."}, {"id": 133, "string": "M 2 's correlation is only 0.06."}, {"id": 134, "string": "We note that the LT requires a complementary metric to penalize grammatical outputs that diverge in meaning from the source (Napoles et al., 2016b) ."}, {"id": 135, "string": "See §8."}, {"id": 136, "string": "Comparing the metrics' quality in corpus-level evaluation with their quality according to CHR ( §3), we find they are often at odds."}, {"id": 137, "string": "Figure 4 plots the Spearman correlation of the different metrics according to the two validation methodologies, LT correlates best at the corpus level and has the highest sentence-level τ , while iBLEU has the highest sentence-level r. showing correlations are slightly correlated, but disagreements as to metric quality are frequent and substantial (e.g., with iBLEU or SARI)."}, {"id": 138, "string": "Sentence-level Analysis We proceed by presenting a method for assessing the correlation between metric-induced scores of corrections of the same sentence, and the scores given to these corrections by MAEGE."}, {"id": 139, "string": "Given a sentence s and an annotation a, we sample a random permutation over the edits in edits(s, a)."}, {"id": 140, "string": "We denote the permutation with σ ∈ S ns,a , where S ns,a is the permutation group over {1, · · · , n s,a }."}, {"id": 141, "string": "Given σ, we define a monotonic chain in E i,j as: For each chain, we uniformly sample one of its elements, mark it as the source, and denote it with src."}, {"id": 142, "string": "In order to generate a set of chains, MAEGE traverses the original sentences and annotations, and for each sentence-annotation pair, uniformly samples n ch chains without repetition."}, {"id": 143, "string": "It then uniformly samples a source sentence from each chain."}, {"id": 144, "string": "If the number of chains in E s,a is smaller than n ch , MAEGE selects all the chains."}, {"id": 145, "string": "Given a metric m ∈ METRICS, we compute its score for every correction in each sampled chain against the sampled source and available references."}, {"id": 146, "string": "We compute the sentence-level correlation of the rankings induced by the scores of m and the rankings induced by <."}, {"id": 147, "string": "For computing rank correlation (such as Spearman ρ or Kendall τ ), such a relative ranking is sufficient."}, {"id": 148, "string": "We report Kendall τ , which is only sensitive to the relative ranking of correction pairs within the same chain."}, {"id": 149, "string": "Kendall is minimalistic in its assumptions, as it does not require numerical scores, but only assuming that < is well-motivated, i.e., that applying a set of valid edits is better in quality than applying only a subset of it."}, {"id": 150, "string": "As < is a partial order, and as Kendall τ is standardly defined over total orders, some modification is required."}, {"id": 151, "string": "τ is a function of the number of compared pairs and of discongruent pairs (ordered differently in the compared rankings): τ = 1 − 2 |discongruent pairs| |all pairs| ."}, {"id": 152, "string": "To compute these quantities, we extract all unique pairs of corrections that can be compared with < (i.e., one applies a sub-set of the edits of the other), and count the number of discongruent ones between the metric's ranking and <."}, {"id": 153, "string": "Significance is modified accordingly."}, {"id": 154, "string": "5 Spearman ρ is less applicable in this setting, as it compares total orders whereas here we compare partial orders."}, {"id": 155, "string": "To compute linear correlation with Pearson r, we make the simplifying assumption that all edits contribute equally to the overall quality."}, {"id": 156, "string": "Specifically, we assume that a perfect correction (i.e., the top of a chain) receives a score of 1."}, {"id": 157, "string": "Each original sentence s (the bottom of a chain), for which there exists annotations a 1 , ."}, {"id": 158, "string": "."}, {"id": 159, "string": "."}, {"id": 160, "string": ", a n , receives a score of 1 − min i |edits(s, a i )| |tokens(s)| ."}, {"id": 161, "string": "The scores of partial (non-perfect) corrections in each chain are linearly spaced between the score of the perfect correction and that of the original."}, {"id": 162, "string": "This scoring system is well-defined, as a partial correction receives the same score according to all chains it is in, as all paths between a partial correction and the original have the same length."}, {"id": 163, "string": "Experiments Setup."}, {"id": 164, "string": "We experiment with n ch = 1, yielding 7936 sentences in 1312 chains (same as the number of original sentences in the NUCLE test set)."}, {"id": 165, "string": "We report the Pearson correlation over the scores of all sentences in all chains (r), and Kendall τ over all pairs of corrections within the same chain."}, {"id": 166, "string": "Results."}, {"id": 167, "string": "Results are presented in Table 2 (right  part) ."}, {"id": 168, "string": "No metric scores very high, neither according to Pearson r nor according to Kendall τ ."}, {"id": 169, "string": "iBLEU correlates best with < according to r, obtaining a correlation of 0.23, whereas LT fares best according to τ , obtaining 0.222."}, {"id": 170, "string": "Results show a discrepancy between the low corpus-level and sentence-level r correlations of M 2 and its high sentence-level τ ."}, {"id": 171, "string": "It seems that although M 2 orders pairs of corrections well, its scores are not a linear function of MAEGE's scores."}, {"id": 172, "string": "This may be due to M 2 's assignment of the minimal possible score to the source, regardless of its quality."}, {"id": 173, "string": "M 2 thus seems to predict well the relative quality of corrections of the same sentence, but to be less effective in yielding a globally coherent score (cf."}, {"id": 174, "string": "Felice and Briscoe (2015) )."}, {"id": 175, "string": "GLEU shows the inverse behaviour, failing to correctly order pairs of corrections of the same sentence, while managing to produce globally coherent scores."}, {"id": 176, "string": "We test this hypothesis by computing the average difference in GLEU score between all pairs in the sampled chains, and find it to be slightly negative (-0.00025), which is in line with GLEU's small negative τ ."}, {"id": 177, "string": "On the other hand, plotting the GLEU scores of the originals grouped by the number of errors they contain, we find they correlate well ( Figure 5 ), indicating that GLEU performs well in comparing the quality of corrections of different sentences."}, {"id": 178, "string": "Four sentences with considerably more errors than the others were considered outliers and removed."}, {"id": 179, "string": "Metric Sensitivity by Error Type MAEGE's lattice can be used to analyze how the examined metrics reward corrections of errors of different types."}, {"id": 180, "string": "For each edit type t, we denote with S t the set of correction pairs from the lattice that only differ in an edit of type t. For each such pair (c, c ) and for each metric m, we compute the difference in the score assigned by m to c and c ."}, {"id": 181, "string": "The average difference is denoted with ∆ m,t ."}, {"id": 182, "string": "∆ m,t = 1 |S t | (c,c )∈St m(src, c, R)−m(src, c , R) R is the corresponding reference set."}, {"id": 183, "string": "A negative (positive) ∆ m,t indicates that m penalizes (awards) valid corrections of type t. Experiments Setup."}, {"id": 184, "string": "We sample chains using the same sampling method as in §6, and uniformly sample a source from each chain."}, {"id": 185, "string": "For each edit type t, we detect all pairs of corrections in the sampled chains that only differ in an edit of type t, and use them to compute ∆ m,t ."}, {"id": 186, "string": "We use the set of 27 edit types given in the NUCLE corpus."}, {"id": 187, "string": "Results."}, {"id": 188, "string": "Table 3 presents the results, showing that under all metrics, some edits types are penalized and others rewarded."}, {"id": 189, "string": "iBLEU and LT penalize the least edit types, and GLEU penalizes the most, providing another perspective on GLEU's negative Kendall τ ( §6)."}, {"id": 190, "string": "Certain types are penalized by almost all metrics."}, {"id": 191, "string": "One such type is Vm, wrong verb modality (e.g., \"as they [∅ ; may] not want to know\")."}, {"id": 192, "string": "Another such type is Npos, a problem in noun possessive (e.g., \"their [facebook's ; Facebook] page\")."}, {"id": 193, "string": "Other types, such as Mec, mechanical (e.g., \"[real-life ; real life]\"), and V0, missing verb (e.g., \"'Privacy', this is the word that [∅ ; is] popular\"), are often rewarded by the metrics."}, {"id": 194, "string": "In general, the tendency of reference-based metrics (the vast majority of GEC metrics) to penalize edits of various types suggests that many edit Table 3 : Average change in metric score by metric and edit types (∆m,t; see text)."}, {"id": 195, "string": "Rows correspond to edit types (abbreviations in Dahlmeier et al."}, {"id": 196, "string": "(2013) ); columns correspond to metrics."}, {"id": 197, "string": "Some edit types are consistently penalized."}, {"id": 198, "string": "types are under-represented in available reference sets."}, {"id": 199, "string": "Automatic evaluation of systems that perform these edit types may, therefore, be unreliable."}, {"id": 200, "string": "Moreover, not addressing these biases in the metrics may hinder progress in GEC."}, {"id": 201, "string": "Indeed, M 2 and GLEU, two of the most commonly used metrics, only award a small sub-set of edit types, thus offering no incentive for systems to improve performance on such types."}, {"id": 202, "string": "6 Discussion We revisit the argument that using system outputs to perform metric validation poses a methodological difficulty."}, {"id": 203, "string": "Indeed, as GEC systems are developed, trained and tested using available metrics, and as metrics tend to reward some correction types and penalize others ( §7), it is possible that GEC development adjusts to the metrics, and neglects some error types."}, {"id": 204, "string": "Resulting tendencies in GEC systems would then yield biased sets of outputs for human rankings, which in turn would result in biases in the validation process."}, {"id": 205, "string": "To make this concrete, GEC systems are often precision-oriented: trained to prefer not to correct than to invalidly correct."}, {"id": 206, "string": "Indeed, Choshen and 6 LDS→O tends to award valid corrections of almost all types."}, {"id": 207, "string": "As source sentences are randomized across chains, this indicates that on average, corrections with more applied edits tend to be more similar to comparable corrections on the lattice."}, {"id": 208, "string": "This is also reflected by the slightly positive sentencelevel correlation of LDS→O ( §6)."}, {"id": 209, "string": "Abend (2018a) show that modern systems tend to be highly conservative, often performing an order of magnitude fewer changes to the source than references do."}, {"id": 210, "string": "Validating metrics on their ability to rank conservative system outputs (as is de facto the common practice) may produce a different picture of metric quality than when considering a more inclusive set of corrections."}, {"id": 211, "string": "We use MAEGE to mimic a setting of ranking against precision-oriented outputs."}, {"id": 212, "string": "To do so, we perform corpus-level and sentence-level analyses, but instead of randomly sampling a source, we invariably take the original sentence as the source."}, {"id": 213, "string": "We thereby create a setting where all edits applied are valid (but not all valid edits are applied)."}, {"id": 214, "string": "Comparing the results to the regular MAEGE correlation (Table 4) , we find that LT remains reliable, while M 2 , that assumes the source receives the worst possible score, gains from this unbalanced setting."}, {"id": 215, "string": "iBLEU drops, suggesting it may need to be retuned to this setting and give less weight to BLEU (O, S), thus becoming more like BLEU and GLEU."}, {"id": 216, "string": "The most drastic change we see is in SARI and MAX-SARI, which flip their sign and present strong performance."}, {"id": 217, "string": "Interestingly, the metrics that benefit from this precisionoriented setting in the corpus-level are the same metrics that perform better according to CHR than to MAEGE (Figure 4) ."}, {"id": 218, "string": "This indicates the different trends produced by MAEGE Table 4 : Corpus-level Spearman ρ, sentence-level Pearson r and Kendall τ correlations using origin as the source with the various metrics (left)."}, {"id": 219, "string": "Correlations using a random source are found in parenthesis."}, {"id": 220, "string": "† represents P − value < 0.001."}, {"id": 221, "string": "LT is the best corpus correlated, and has the best τ while iBLEU has the best r from the latter's use of precision-oriented outputs."}, {"id": 222, "string": "Drawbacks."}, {"id": 223, "string": "Like any methodology MAEGE has its simplifying assumptions and drawbacks; we wish to make them explicit."}, {"id": 224, "string": "First, any biases introduced in the generation of the test corpus are inherited by MAEGE (e.g., that edits are contiguous and independent of each other)."}, {"id": 225, "string": "Second, MAEGE does not include errors that a human will not perform but machines might, e.g., significantly altering the meaning of the source."}, {"id": 226, "string": "This partially explains why LT, which measures grammaticality but not meaning preservation, excels in our experiments."}, {"id": 227, "string": "Third, MAEGE's scoring system ( §6) assumes that all errors damage the score equally."}, {"id": 228, "string": "While this assumption is made by GEC metrics, we believe it should be refined in future work by collecting user information."}, {"id": 229, "string": "Conclusion In this paper, we show how to leverage existing annotation in GEC for performing validation reliably."}, {"id": 230, "string": "We propose a new automatic methodology, MAEGE, which overcomes many of the shortcomings of the existing methodology."}, {"id": 231, "string": "Experiments with MAEGE reveal a different picture of metric quality than previously reported."}, {"id": 232, "string": "Our analysis suggests that differences in observed metric quality are partly due to system outputs sharing consistent tendencies, notably their tendency to under-predict corrections."}, {"id": 233, "string": "As existing methodology ranks system outputs, these shared tendencies bias the validation process."}, {"id": 234, "string": "The difficulties in basing validation on system outputs may be applicable to other text-to-text generation tasks, a question we will explore in future work."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 24}, {"section": "Examined Metrics", "n": "2", "start": 25, "end": 70}, {"section": "Human Ranking Experiments", "n": "3", "start": 71, "end": 95}, {"section": "Constructing Lattices of Corrections", "n": "4", "start": 96, "end": 116}, {"section": "Corpus-level Analysis", "n": "5", "start": 117, "end": 126}, {"section": "Experiments", "n": "5.1", "start": 127, "end": 137}, {"section": "Sentence-level Analysis", "n": "6", "start": 138, "end": 162}, {"section": "Experiments", "n": "6.1", "start": 163, "end": 178}, {"section": "Metric Sensitivity by Error Type", "n": "7", "start": 179, "end": 183}, {"section": "Experiments", "n": "7.1", "start": 184, "end": 201}, {"section": "Discussion", "n": "8", "start": 202, "end": 228}, {"section": "Conclusion", "n": "9", "start": 229, "end": 234}], "figures": [{"filename": "../figure/image/1283-Table2-1.png", "caption": "Table 2: Corpus-level Spearman ρ, sentence-level Pearson r and Kendall τ with the metrics (left). † represents P-value< 0.001. LT correlates best at the corpus level and has the highest sentence-level τ , while iBLEU has the highest sentence-level r.", "page": 5, "bbox": {"x1": 171.84, "x2": 426.24, "y1": 72.48, "y2": 201.12}}, {"filename": "../figure/image/1283-Figure5-1.png", "caption": "Figure 5: Average GLEU score of originals (y-axis), plotted against the number of errors they contain (x-axis). Their substantial correlation indicates that GLEU is globally reliable.", "page": 5, "bbox": {"x1": 72.0, "x2": 269.28, "y1": 249.6, "y2": 397.91999999999996}}, {"filename": "../figure/image/1283-Figure1-1.png", "caption": "Figure 1: Histogram and rug plot of the log number of references under I-measure assumptions, i.e. overlapping edits alternate as valid corrections of the same error. There are billions of ways to combine 8 references on average.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 504.0, "y1": 61.44, "y2": 211.2}}, {"filename": "../figure/image/1283-Table3-1.png", "caption": "Table 3: Average change in metric score by metric and edit types (∆m,t; see text). Rows correspond to edit types (abbreviations in Dahlmeier et al. (2013)); columns correspond to metrics. Some edit types are consistently penalized.", "page": 7, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 71.52, "y2": 308.15999999999997}}, {"filename": "../figure/image/1283-Table1-1.png", "caption": "Table 1: Metrics correlation with human judgments. The Combined column presents the Spearman correlation coefficient (ρ) according to the combined set of human rankings, with its associated P-value. The GJG15 and NSPT15 columns present the Spearman correlation according to the two sets of human rankings, as well as the rank of the metric according to this correlation. Measures are ordered by their rank in the combined human judgments. The discrepancy between the ρ values obtained against GJG15 and NSPT15 demonstrate low inter-rater agreement in human rankings.", "page": 3, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 72.48, "y2": 181.92}}, {"filename": "../figure/image/1283-Figure2-1.png", "caption": "Figure 2: An illustration of the generated corrections lattices. The Ois are the original sentences, directed edges represent an application of an edit andR(i)j is the j-th perfect correction of Oi (i.e., the perfect correction that result from applying all the edits of the j-th annotation of Oi).", "page": 3, "bbox": {"x1": 315.84, "x2": 519.84, "y1": 306.24, "y2": 380.64}}, {"filename": "../figure/image/1283-Table4-1.png", "caption": "Table 4: Corpus-level Spearman ρ, sentence-level Pearson r and Kendall τ correlations using origin as the source with the various metrics (left). Correlations using a random source are found in parenthesis. † represents P − value < 0.001. LT is the best corpus correlated, and has the best τ while iBLEU has the best r", "page": 8, "bbox": {"x1": 123.83999999999999, "x2": 473.28, "y1": 72.48, "y2": 201.12}}, {"filename": "../figure/image/1283-Figure4-1.png", "caption": "Figure 4: A scatter plot of the corpus-level correlation of metrics according to the different methodologies. The x-axis corresponds to the correlation according to human rankings (Combined setting), and the y-axis corresponds to the correlation according to MAEGE. While some get similar correlation (e.g., GLEU), other metrics change drastically (e.g., SARI).", "page": 4, "bbox": {"x1": 72.0, "x2": 269.28, "y1": 289.44, "y2": 438.24}}, {"filename": "../figure/image/1283-Figure3-1.png", "caption": "Figure 3: An example chain from a corrections lattice – each sentence is the result of applying a single edit to the sentence below it. The top sentence is a perfect correction, while the bottom is the original.", "page": 4, "bbox": {"x1": 90.24, "x2": 275.52, "y1": 67.67999999999999, "y2": 220.79999999999998}}]}