{"title": "Did the Model Understand the Question?", "abstract": "We analyze state-of-the-art deep learning models for three tasks: question answering on (1) images, (2) tables, and (3) passages of text. Using the notion of attribution (word importance), we find that these deep networks often ignore important question terms. Leveraging such behavior, we perturb questions to craft a variety of adversarial examples. Our strongest attacks drop the accuracy of a visual question answering model from 61.1% to 19%, and that of a tabular question answering model from 33.5% to 3.3%. Additionally, we show how attributions can strengthen attacks proposed by Jia and Liang (2017) on paragraph comprehension models. Our results demonstrate that attributions can augment standard measures of accuracy and empower investigation of model performance. When a model is accurate but for the wrong reasons, attributions can surface erroneous logic in the model that indicates inadequacies in the test data.", "text": [{"id": 0, "string": "Introduction Recently, deep learning has been applied to a variety of question answering tasks."}, {"id": 1, "string": "For instance, to answer questions about images (e.g."}, {"id": 2, "string": "(Kazemi and Elqursh, 2017) ), tabular data (e.g."}, {"id": 3, "string": "(Neelakantan et al., 2017) ), and passages of text (e.g."}, {"id": 4, "string": "(Yu et al., 2018) )."}, {"id": 5, "string": "Developers, end-users, and reviewers (in academia) would all like to understand the capabilities of these models."}, {"id": 6, "string": "The standard way of measuring the goodness of a system is to evaluate its error on a test set."}, {"id": 7, "string": "High accuracy is indicative of a good model only if the test set is representative of the underlying realworld task."}, {"id": 8, "string": "Most tasks have large test and training sets, and it is hard to manually check that they are representative of the real world."}, {"id": 9, "string": "In this paper, we propose techniques to analyze the sensitivity of a deep learning model to question words."}, {"id": 10, "string": "We do this by applying attribution (as discussed in section 3), and generating adversarial questions."}, {"id": 11, "string": "Here is an illustrative example: recall Visual Question Answering (Agrawal et al., 2015) where the task is to answer questions about images."}, {"id": 12, "string": "Consider the question \"how symmetrical are the white bricks on either side of the building?\""}, {"id": 13, "string": "(corresponding image in Figure 1 )."}, {"id": 14, "string": "The system that we study gets the answer right (\"very\")."}, {"id": 15, "string": "But, we find (using an attribution approach) that the system relies on only a few of the words like \"how\" and \"bricks\"."}, {"id": 16, "string": "Indeed, we can construct adversarial questions about the same image that the system gets wrong."}, {"id": 17, "string": "For instance, \"how spherical are the white bricks on either side of the building?\""}, {"id": 18, "string": "returns the same answer (\"very\")."}, {"id": 19, "string": "A key premise of our work is that most humans have expertise in question answering."}, {"id": 20, "string": "Even if they cannot manually check that a dataset is representative of the real world, they can identify important question words, and anticipate their function in question answering."}, {"id": 21, "string": "Our Contributions We follow an analysis workflow to understand three question answering models."}, {"id": 22, "string": "There are two steps."}, {"id": 23, "string": "First, we apply Integrated Gradients (henceforth, IG) (Sundararajan et al., 2017) to attribute the systems' predictions to words in the questions."}, {"id": 24, "string": "We propose visualizations of attributions to make analysis easy."}, {"id": 25, "string": "Second, we identify weaknesses (e.g., relying on unimportant words) in the networks' logic as exposed by the attributions, and leverage them to craft adversarial questions."}, {"id": 26, "string": "A key contribution of this work is an overstability test for question answering networks."}, {"id": 27, "string": "Jia and Liang (2017) showed that reading comprehension networks are overly stable to semantics-altering edits to the passage."}, {"id": 28, "string": "In this work, we find that such overstability also applies to questions."}, {"id": 29, "string": "Furthermore, this behavior can be seen in visual and tabular question answering networks as well."}, {"id": 30, "string": "We use attributions to a define a general-purpose test for measuring the extent of the overstability (sections 4.3 and 5.3)."}, {"id": 31, "string": "It involves measuring how a network's accuracy changes as words are systematically dropped from questions."}, {"id": 32, "string": "We emphasize that, in contrast to modelindependent adversarial techniques such as that of Jia and Liang (2017) , our method exploits the strengths and weaknesses of the model(s) at hand."}, {"id": 33, "string": "This allows our attacks to have a high success rate."}, {"id": 34, "string": "Additionally, using insights derived from attributions we were able to improve the attack success rate of Jia and Liang (2017) (section 6.2)."}, {"id": 35, "string": "Such extensive use of attributions in crafting adversarial examples is novel to the best of our knowledge."}, {"id": 36, "string": "Next, we provide an overview of our results."}, {"id": 37, "string": "In each case, we evaluate a pre-trained model on new inputs."}, {"id": 38, "string": "We keep the networks' parameters intact."}, {"id": 39, "string": "Visual QA (section 4): The task is to answer questions about images."}, {"id": 40, "string": "We analyze the deep network in Kazemi and Elqursh (2017) ."}, {"id": 41, "string": "We find that the network ignores many question words, relying largely on the image to produce answers."}, {"id": 42, "string": "For instance, we show that the model retains more than 50% of its original accuracy even when every word that is not \"color\" is deleted from all questions in the validation set."}, {"id": 43, "string": "We also show that the model under-relies on important question words (e.g."}, {"id": 44, "string": "nouns) and attaching contentfree prefixes (e.g., \"in not many words, ."}, {"id": 45, "string": "."}, {"id": 46, "string": ".\")"}, {"id": 47, "string": "to questions drops the accuracy from 61.1% to 19%."}, {"id": 48, "string": "QA on tables (section 5): We analyze a system called Neural Programmer (henceforth, NP) (Neelakantan et al., 2017) that answers questions on tabular data."}, {"id": 49, "string": "NP determines the answer to a question by selecting a sequence of operations to apply on the accompanying table (akin to an SQL query; details in section 5)."}, {"id": 50, "string": "We find that these operation selections are more influenced by content-free words (e.g., \"in\", \"at\", \"the\", etc.)"}, {"id": 51, "string": "in questions than important words such as nouns or adjectives."}, {"id": 52, "string": "Dropping all content-free words reduces the validation accuracy of the network from 33.5% 1 to 28.5%."}, {"id": 53, "string": "Similar to Visual QA, we show that attaching content-free phrases (e.g., \"in not a lot of words\") to the question drops the network's accuracy from 33.5% to 3.3%."}, {"id": 54, "string": "We also find that NP often gets the answer right for the wrong reasons."}, {"id": 55, "string": "For instance, for the question \"which nation earned the most gold medals?"}, {"id": 56, "string": "\", one of the operations selected by NP is \"first\" (pick the first row of the table)."}, {"id": 57, "string": "Its answer is right only because the table happens to be arranged in order of rank."}, {"id": 58, "string": "We quantify this weakness by evaluating NP on the set of perturbed tables generated by Pasupat and Liang (2016) and find that its accuracy drops from 33.5% to 23%."}, {"id": 59, "string": "Finally, we show an extreme form of overstability where the table itself induces a large bias in the network regardless of the question."}, {"id": 60, "string": "For instance, we found that in tables about Olympic medal counts, NP was predisposed to selecting the \"prev\" operator."}, {"id": 61, "string": "Reading comprehension (Section 6): The task is to answer questions about paragraphs of text."}, {"id": 62, "string": "We analyze the network by Yu et al."}, {"id": 63, "string": "(2018) ."}, {"id": 64, "string": "Again, we find that the network often ignores words that should be important."}, {"id": 65, "string": "Jia and Liang (2017) proposed attacks wherein sentences are added to paragraphs that ought not to change the network's answers, but sometimes do."}, {"id": 66, "string": "Our main finding is that these attacks are more likely to succeed when an added sentence includes all the question words that the model found important (for the original paragraph)."}, {"id": 67, "string": "For instance, we find that attacks are 50% more likely to be successful when the added sentence includes top-attributed nouns in the question."}, {"id": 68, "string": "This insight should allow the construction of more successful attacks and better training data sets."}, {"id": 69, "string": "In summary, we find that all networks ignore important parts of questions."}, {"id": 70, "string": "One can fix this by either improving training data, or introducing an inductive bias."}, {"id": 71, "string": "Our analysis workflow is helpful in both cases."}, {"id": 72, "string": "It would also make sense to expose end-users to attribution visualizations."}, {"id": 73, "string": "Knowing which words were ignored, or which operations the words were mapped to, can help the user decide whether to trust a system's response."}, {"id": 74, "string": "Related Work We are motivated by Jia and Liang (2017) ."}, {"id": 75, "string": "As they discuss, \"the extent to which [reading comprehension systems] truly understand language remains unclear\"."}, {"id": 76, "string": "The contrast between Jia and Liang (2017) and our work is instructive."}, {"id": 77, "string": "Their main contribution is to fix the evaluation of reading comprehension systems by augmenting the test set with adversarially constructed examples."}, {"id": 78, "string": "(As they point out in Section 4.6 of their paper, this does not necessarily fix the model; the model may simply learn to circumvent the specific attack underlying the adversarial examples.)"}, {"id": 79, "string": "Their method is independent of the specification of the model at hand."}, {"id": 80, "string": "They use crowdsourcing to craft passage perturbations intended to fool the network, and then query the network to test their effectiveness."}, {"id": 81, "string": "In contrast, we propose improving the analysis of question answering systems."}, {"id": 82, "string": "Our method peeks into the logic of a network to identify highattribution question terms."}, {"id": 83, "string": "Often there are several important question terms (e.g., nouns, adjectives) that receive tiny attribution."}, {"id": 84, "string": "We leverage this weakness and perturb questions to craft targeted attacks."}, {"id": 85, "string": "While Jia and Liang (2017) focus exclusively on systems for the reading comprehension task, we analyze one system each for three different tasks."}, {"id": 86, "string": "Our method also helps improve the efficacy Jia and Liang (2017)'s attacks; see table 4 for examples."}, {"id": 87, "string": "Our analysis technique is specific to deep-learning-based systems, whereas theirs is not."}, {"id": 88, "string": "We could use many other methods instead of Integrated Gradients (IG) to attribute a deep network's prediction to its input features (Baehrens et al., 2010; Simonyan et al., 2013; Shrikumar et al., 2016; Binder et al., 2016; Springenberg et al., 2014) ."}, {"id": 89, "string": "One could also use model agnostic techniques like Ribeiro et al."}, {"id": 90, "string": "(2016b) ."}, {"id": 91, "string": "We choose IG for its ease and efficiency of implementation (requires just a few gradient-calls) and its axiomatic justification (see Sundararajan et al."}, {"id": 92, "string": "(2017) for a detailed comparison with other attribution methods)."}, {"id": 93, "string": "Recently, there have been a number of techniques for crafting and defending against adversarial attacks on image-based deep learning models (cf."}, {"id": 94, "string": "Goodfellow et al."}, {"id": 95, "string": "(2015) )."}, {"id": 96, "string": "They are based on oversensitivity of models, i.e., tiny, imperceptible perturbations of the image to change a model's response."}, {"id": 97, "string": "In contrast, our attacks are based on models' over-reliance on few question words even when other words should matter."}, {"id": 98, "string": "We discuss task-specific related work in corresponding sections (sections 4 to 6)."}, {"id": 99, "string": "Integrated Gradients (IG) We employ an attribution technique called Integrated Gradients (IG) (Sundararajan et al., 2017) to isolate question words that a deep learning system uses to produce an answer."}, {"id": 100, "string": "Formally, suppose a function F : R n !"}, {"id": 101, "string": "[0, 1] represents a deep network, and an input x = (x 1 , ."}, {"id": 102, "string": "."}, {"id": 103, "string": "."}, {"id": 104, "string": ", x n ) 2 R n ."}, {"id": 105, "string": "An attribution of the prediction at input x relative to a baseline input x 0 is a vector A F (x, x 0 ) = (a 1 , ."}, {"id": 106, "string": "."}, {"id": 107, "string": "."}, {"id": 108, "string": ", a n ) 2 R n where a i is the contribution of x i to the prediction F (x)."}, {"id": 109, "string": "One can think of F as the probability of a specific response."}, {"id": 110, "string": "x 1 , ."}, {"id": 111, "string": "."}, {"id": 112, "string": "."}, {"id": 113, "string": ", x n are the question words; to be precise, they are going to be vector representations of these terms."}, {"id": 114, "string": "The attributions a 1 , ."}, {"id": 115, "string": "."}, {"id": 116, "string": "."}, {"id": 117, "string": ", a n are the influences/blame-assignments to the variables x 1 , ."}, {"id": 118, "string": "."}, {"id": 119, "string": "."}, {"id": 120, "string": ", x n on the probability F ."}, {"id": 121, "string": "Notice that attributions are defined relative to a special, uninformative input called the baseline."}, {"id": 122, "string": "In this paper, we use an empty question as the baseline, that is, a sequence of word embeddings corresponding to padding value."}, {"id": 123, "string": "Note that the context (image, table, or passage) of the baseline x 0 is set to be that of x; only the question is set to empty."}, {"id": 124, "string": "We now describe how IG produces attributions."}, {"id": 125, "string": "Intuitively, as we interpolate between the baseline and the input, the prediction moves along a trajectory, from uncertainty to certainty (the final probability)."}, {"id": 126, "string": "At each point on this trajectory, one can use the gradient of the function F with respect to the input to attribute the change in probability back to the input variables."}, {"id": 127, "string": "IG simply aggregates the gradients of the probability with respect to the input along this trajectory using a path integral."}, {"id": 128, "string": "Definition 1 (Integrated Gradients) Given an input x and baseline x 0 , the integrated gradient along the i th dimension is defined as follows."}, {"id": 129, "string": "IG satisfies the condition that the attributions sum to the difference between the probabilities at the input and the baseline."}, {"id": 130, "string": "We call a variable uninfluential if all else fixed, varying it does not change the output probability."}, {"id": 131, "string": "IG satisfies the property that uninfluential variables do not get any attribution."}, {"id": 132, "string": "Conversely, influential variables always get some attribution."}, {"id": 133, "string": "Attributions for a linear combination of two functions F 1 and F 2 are a linear combination of the attributions for F 1 and F 2 ."}, {"id": 134, "string": "Finally, IG satisfies the condition that symmetric variables get equal attributions."}, {"id": 135, "string": "IG i (x, x 0 ) ::= (x i x 0 i )⇥ Z 1 ↵=0 @F (x 0 +↵⇥(x x 0 )) @x i d↵ (here @F (x) @x i is the gradient of F along the i th di- mension at x)."}, {"id": 136, "string": "In this work, we validate the use of IG empirically via question perturbations."}, {"id": 137, "string": "We observe that perturbing high-attribution terms changes the networks' response (sections 4.4 and 5.5)."}, {"id": 138, "string": "Conversely, perturbing terms that receive a low attribution does not change the network's response (sections 4.3 and 5.3)."}, {"id": 139, "string": "We use these observations to craft attacks against the network by perturbing instances where generic words (e.g., \"a\", \"the\") receive high attribution or contentful words receive low attribution."}, {"id": 140, "string": "4 Visual Question Answering 4.1 Task, model, and data The Visual Question Answering Task (Agrawal et al., 2015; Teney et al., 2017; Kazemi and Elqursh, 2017; Ben-younes et al., 2017; Zhu et al., 2016) requires a system to answer questions about images ( fig."}, {"id": 141, "string": "1 )."}, {"id": 142, "string": "We analyze the deep network from Kazemi and Elqursh (2017) ."}, {"id": 143, "string": "It achieves 61.1% accuracy on the validation set (the state of the art (Fukui et al., 2016) achieves 66.7%)."}, {"id": 144, "string": "We chose this model for its easy reproducibility."}, {"id": 145, "string": "The VQA 1.0 dataset (Agrawal et al., 2015) consists of 614,163 questions posed over 204,721 images (3 questions per image)."}, {"id": 146, "string": "The images were taken from COCO (Lin et al., 2014) , and the questions and answers were crowdsourced."}, {"id": 147, "string": "The network in Kazemi and Elqursh (2017) treats question answering as a classification task wherein the classes are 3000 most frequent answers in the training data."}, {"id": 148, "string": "The input question is tokenized, embedded and fed to a multi-layer LSTM."}, {"id": 149, "string": "The states of the LSTM attend to a featurized version of the image, and ultimately produce a probability distribution over the answer classes."}, {"id": 150, "string": "Observations We applied IG and attributed the top selected answer class to input question words."}, {"id": 151, "string": "The baseline for a given input instance is the image and an Question: how symmetrical are the white bricks on either side of the building Prediction: very Ground truth: very empty question 2 ."}, {"id": 152, "string": "We omit instances where the top answer class predicted by the network remains the same even when the question is emptied (i.e., the baseline input)."}, {"id": 153, "string": "This is because IG attributions are not informative when the input and the baseline have the same prediction."}, {"id": 154, "string": "A visualization of the attributions is shown in fig."}, {"id": 155, "string": "1 ."}, {"id": 156, "string": "Notice that very few words have high attribution."}, {"id": 157, "string": "We verified that altering the low attribution words in the question does not change the network's answer."}, {"id": 158, "string": "For instance, the following questions still return \"very\" as the answer: \"how spherical are the white bricks on either side of the building\", \"how soon are the bricks fading on either side of the building\", \"how fast are the bricks speaking on either side of the building\"."}, {"id": 159, "string": "On analyzing attributions across examples, we find that most of the highly attributed words are words such as \"there\", \"what\", \"how\", \"doing\"they are usually the less important words in questions."}, {"id": 160, "string": "In section 4.3 we describe a test to measure the extent to which the network depends on such words."}, {"id": 161, "string": "We also find that informative words in the question (e.g., nouns) often receive very low attribution, indicating a weakness on part of the network."}, {"id": 162, "string": "In Section 4.4, we describe various attacks that exploit this weakness."}, {"id": 163, "string": "Overstability test To determine the set of question words that the network finds most important, we isolate words that most frequently occur as top attributed words in questions."}, {"id": 164, "string": "We then drop all words except these and compute the accuracy."}, {"id": 165, "string": "Figure 2 shows how the accuracy changes as the size of this isolated set is varied from 0 to 5305."}, {"id": 166, "string": "We find that just one word is enough for the model to achieve more than 50% of its final accuracy."}, {"id": 167, "string": "That word is \"color\"."}, {"id": 168, "string": "Note that even when empty questions are passed as input to the network, its accuracy remains at about 44.3% of its original accuracy."}, {"id": 169, "string": "This shows that the model is largely reliant on the image for producing the answer."}, {"id": 170, "string": "The accuracy increases (almost) monotonically with the size of the isolated set."}, {"id": 171, "string": "The top 6 words in the isolated set are \"color\", \"many\", \"what\", \"is\", \"there\", and \"how\"."}, {"id": 172, "string": "We suspect that generic words like these are used to determine the type of the answer."}, {"id": 173, "string": "The network then uses the type to choose between a few answers it can give for the image."}, {"id": 174, "string": "Attacks Attributions reveal that the network relies largely on generic words in answering questions (section 4.3)."}, {"id": 175, "string": "This is a weakness in the network's logic."}, {"id": 176, "string": "We now describe a few attacks against the network that exploit this weakness."}, {"id": 177, "string": "Subject ablation attack In this attack, we replace the subject of a question with a specific noun that consistently receives low attribution across questions."}, {"id": 178, "string": "We then determine, among the questions that the network originally answered correctly, what percentage result in the same answer after the ablation."}, {"id": 179, "string": "We repeat this process for different nouns; specifically, \"fits\", \"childhood\", \"copyrights\", \"mornings\", \"disorder\", \"importance\", \"topless\", \"critter\", \"jumper\", \"tweet\", and average the result."}, {"id": 180, "string": "We find that, among the set of questions that the network originally answered correctly, 75.6% of the questions return the same answer despite the subject replacement."}, {"id": 181, "string": "Prefix attack In this attack, we attach content-free phrases to questions."}, {"id": 182, "string": "The phrases are manually crafted using generic words that the network finds important (section 4.3)."}, {"id": 183, "string": "Table 1 (top half) shows the resulting accuracy for three prefixes -\"in not a lot of words\", \"what is the answer to\", and \"in not many words\"."}, {"id": 184, "string": "All of these phrases nearly halve the model's accuracy."}, {"id": 185, "string": "The union of the three attacks drops the model's accuracy from 61.1% to 19%."}, {"id": 186, "string": "We note that the attributions computed for the network were crucial in crafting the prefixes."}, {"id": 187, "string": "For instance, we find that other prefixes like \"tell me\", \"answer this\" and \"answer this for me\" do not drop the accuracy by much; see table 1 (bottom half)."}, {"id": 188, "string": "The union of these three ineffective prefixes drops the accuracy from 61.1% to only 46.9%."}, {"id": 189, "string": "Per attributions, words present in these prefixes are not deemed important by the network."}, {"id": 190, "string": "Agrawal et al."}, {"id": 191, "string": "(2016) analyze several VQA models."}, {"id": 192, "string": "Among other attacks, they test the models on question fragments of telescopically increasing length."}, {"id": 193, "string": "They observe that VQA models often arrive at the same answer by looking at a small fragment of the question."}, {"id": 194, "string": "Our stability analysis in section 4.3 explains, and intuitively subsumes this; indeed, several of the top attributed words appear in the prefix, while important words like \"color\" often occur in the middle of the question."}, {"id": 195, "string": "Our analysis enables additional attacks, for instance, replacing question subject with low attri- (2017) ;  examine the VQA data, identify deficiencies, and propose data augmentation to reduce over-representation of certain question/answer types."}, {"id": 196, "string": "propose the VQA 2.0 dataset, which has pairs of similar images that have different answers on the same question."}, {"id": 197, "string": "We note that our method can be used to improve these datasets by identifying inputs where models ignore several words."}, {"id": 198, "string": "Huang et al."}, {"id": 199, "string": "(2017) evaluate robustness of VQA models by appending questions with semantically similar questions."}, {"id": 200, "string": "Our prefix attacks in section 4.4 are in a similar vein and perhaps a more natural and targeted approach."}, {"id": 201, "string": "Finally, Fong and Vedaldi (2017) Related work Question Answering over Tables Task, model, and data We now analyze question answering over tables based on the WikiTableQuestions benchmark dataset (Pasupat and Liang, 2015) ."}, {"id": 202, "string": "The dataset has 22033 questions posed over 2108 tables scraped from Wikipedia."}, {"id": 203, "string": "Answers are either contents of table cells or some table aggregations."}, {"id": 204, "string": "Models performing QA on tables translate the question into a structured program (akin to an SQL query) which is then executed on the table to produce the answer."}, {"id": 205, "string": "We analyze a model called Neural Programmer (NP) (Neelakantan et al., 2017) ."}, {"id": 206, "string": "NP is the state of the art among models that are weakly supervised, i.e., supervised using the final answer instead of the correct structured program."}, {"id": 207, "string": "It achieves 33.5% accuracy on the validation set."}, {"id": 208, "string": "NP translates the input into a structured program consisting of four operator and table column selections."}, {"id": 209, "string": "An example of such a program is \"reset (score), reset (score), min (score), print (name)\", where the output is the name of the person who has the lowest score."}, {"id": 210, "string": "Observations We applied IG to attribute operator and column selection to question words."}, {"id": 211, "string": "NP preprocesses inputs and whenever applicable, appends symbols tm token, cm token to questions that signify matches between a question and the accom-panying table."}, {"id": 212, "string": "These symbols are treated the same as question words."}, {"id": 213, "string": "NP also computes priors for column selection using question-table matches."}, {"id": 214, "string": "These vectors, tm and cm, are passed as additional inputs to the neural network."}, {"id": 215, "string": "In the baseline for IG, we use an empty question, and zero vectors for column selection priors 3 ."}, {"id": 216, "string": "We visualize the attributions using an alignment matrix; they are commonly used in the analysis of translation models ( fig."}, {"id": 217, "string": "3) ."}, {"id": 218, "string": "Observe that the operator \"first\" is used when the question is asking for a superlative."}, {"id": 219, "string": "Further, we see that the word \"gold\" is a trigger for this operator."}, {"id": 220, "string": "We investigate implications of this behavior in the following sections."}, {"id": 221, "string": "Overstability test Similar to the test we did for Visual QA (section 4.3), we check for overstability in NP by looking at accuracy as a function of the vocabulary size."}, {"id": 222, "string": "We treat table match annotations tm token, cm token and the out-of-vocab token (unk ) as part of the vocabulary."}, {"id": 223, "string": "The results are in fig."}, {"id": 224, "string": "4 ."}, {"id": 225, "string": "We see that the curve is similar to that of Visual QA (fig."}, {"id": 226, "string": "2 )."}, {"id": 227, "string": "Just 5 words (along with the column selection priors) are sufficient for the model to reach more than 50% of its final accuracy on the validation set."}, {"id": 228, "string": "These five words are: \"many\", \"number\", \"tm token\", \"after\", and \"total\"."}, {"id": 229, "string": "Table-specific default programs We saw in the previous section that the model relies on only a few words in producing correct answers."}, {"id": 230, "string": "An extreme case of overstability is when   words are chosen in the descending order of their frequency appearance as top attributions to question terms."}, {"id": 231, "string": "The X-axis is on logscale, except near zero where it is linear."}, {"id": 232, "string": "Note that just 5 words are necessary for the network to reach more than 50% of its final accuracy."}, {"id": 233, "string": "the operator sequences produced by the model are independent of the question."}, {"id": 234, "string": "We find that if we supply an empty question as an input, i.e., the output is a function only of the table, then the distribution over programs is quite skewed."}, {"id": 235, "string": "We call these programs For each default program, we used IG to attribute operator and column selections to column names and show ten most frequently occurring ones across tables in the validation set (table 2) ."}, {"id": 236, "string": "Here is an insight from this analysis: NP uses the combination \"reset, prev\" to exclude the last row of the table from answer computation."}, {"id": 237, "string": "The default program corresponding to \"reset, prev, max, print\" has attributions to column names such as \"rank\", \"gold\", \"silver\", \"bronze\", \"nation\", \"year\"."}, {"id": 238, "string": "These column names indicate medal tallies and usually have a \"total\" row."}, {"id": 239, "string": "If the table happens not to have a \"total\" row, the model may  produce an incorrect answer."}, {"id": 240, "string": "We now describe attacks that add or drop content-free words from the question, and cause NP to produce the wrong answer."}, {"id": 241, "string": "These attacks leverage the attribution analysis."}, {"id": 242, "string": "Attacks Question concatenation attacks In these attacks, we either suffix or prefix contentfree phrases to questions."}, {"id": 243, "string": "The phrases are crafted using irrelevant trigger words for operator selections (supplementary material, table 5)."}, {"id": 244, "string": "We manually ensure that the phrases are content-free."}, {"id": 245, "string": "Table 3 describes our results."}, {"id": 246, "string": "The first 4 phrases use irrelevant trigger words and result in a large drop in accuracy."}, {"id": 247, "string": "For instance, the first phrase uses \"not\" which is a trigger for \"next\", \"last\", and \"min\", and the second uses \"same\" which is a trigger for \"next\" and \"mfe\"."}, {"id": 248, "string": "The four phrases combined results in the model's accuracy going down from 33.5% to 3.3%."}, {"id": 249, "string": "The first two phrases alone drop the accuracy to 5.6%."}, {"id": 250, "string": "The next set of phrases use words that receive low attribution across questions, and are hence non-triggers for any operator."}, {"id": 251, "string": "The resulting drop in accuracy on using these phrases is relatively low."}, {"id": 252, "string": "Combined, they result in the model's accuracy dropping from 33.5% to 27.1%."}, {"id": 253, "string": "Stop word deletion attacks We find that sometimes an operator is selected based on stop words like: \"a\", \"at\", \"the\", etc."}, {"id": 254, "string": "For instance, in the question, \"what ethnicity is at the top?"}, {"id": 255, "string": "\", the operator \"next\" is triggered on the word \"at\"."}, {"id": 256, "string": "Dropping the word \"at\" from the question changes the operator selection and causes NP to return the wrong answer."}, {"id": 257, "string": "We drop stop words from questions in the validation dataset that were originally answered correctly and test NP on them."}, {"id": 258, "string": "The stop words to be dropped were manually selected 4 and are shown in Figure 5 in the supplementary material."}, {"id": 259, "string": "By dropping stop words, the accuracy drops from 33.5% to 28.5%."}, {"id": 260, "string": "Selecting operators based on stop words is not robust."}, {"id": 261, "string": "In real world search queries, users often phrase questions without stop words, trading grammatical correctness for conciseness."}, {"id": 262, "string": "For instance, the user may simply say \"top ethnicity\"."}, {"id": 263, "string": "It may be possible to defend against such examples by generating synthetic training data, and re-training the network on it."}, {"id": 264, "string": "Row reordering attacks We found that NP often got the question right by leveraging artifacts of the table."}, {"id": 265, "string": "For instance, the operators for the question \"which nation earned the most gold medals\" are \"reset\", \"prev\", \"first\" and \"print\"."}, {"id": 266, "string": "The \"prev\" operator essentially excludes the last row from the answer computation."}, {"id": 267, "string": "It gets the answer right for two reasons: (1) the answer is not in the last row, and (2) rows are sorted by the values in the column \"gold\"."}, {"id": 268, "string": "In general, a question answering system should not rely on row ordering in tables."}, {"id": 269, "string": "To quantify the extent of such biases, we used a perturbed version of WikiTableQuestions validation dataset as described in Pasupat and Liang (2016) 5 and evaluated the existing NP model on it (there was no re-training involved here)."}, {"id": 270, "string": "We found that NP has only 23% accuracy on it, in constrast to an accuracy of 33.5% on the original validation dataset."}, {"id": 271, "string": "One approach to making the network robust to row-reordering attacks is to train against perturbed tables."}, {"id": 272, "string": "This may also help the model generalize better."}, {"id": 273, "string": "Indeed, Mudrakarta et al."}, {"id": 274, "string": "(2018) note that the state-of-the-art strongly supervised 6 model on WikiTableQuestions (Krishnamurthy et al., 2017) enjoys a 7% gain in its final accuracy by leveraging perturbed tables during training."}, {"id": 275, "string": "6 Reading Comprehension 6.1 Task, model, and data The reading comprehension task involves identifying a span from a context paragraph as an answer to a question."}, {"id": 276, "string": "The SQuAD dataset (Rajpurkar et al., 2016) for machine reading comprehension contains 107.7K query-answer pairs, with 87.5K for training, 10.1K for validation, and another 10.1K for testing."}, {"id": 277, "string": "Deep learning methods are quite successful on this problem, with the state-of-the-art F1 score at 84.6 achieved by Yu et al."}, {"id": 278, "string": "(2018) ; we analyze their model."}, {"id": 279, "string": "Analyzing adversarial examples Recall the adversarial attacks proposed by Jia and Liang (2017) for reading comprehension systems."}, {"id": 280, "string": "Their attack ADDSENT appends sentences to the paragraph that resemble an answer to the question without changing the ground truth."}, {"id": 281, "string": "See the second column of table 4 for a few examples."}, {"id": 282, "string": "We investigate the effectiveness of their attacks using attributions."}, {"id": 283, "string": "We analyze 100 examples generated by the ADDSENT method in Jia and Liang (2017) , and find that an adversarial sentence is successful in fooling the model in two cases: First, a contentful word in the question gets low/zero attribution and the adversarially added sentence modifies that word."}, {"id": 284, "string": "E.g."}, {"id": 285, "string": "in the question, \"Who did Kubiak take the place of after Super Bowl XXIV?"}, {"id": 286, "string": "\", the word \"Super\" gets low attribution."}, {"id": 287, "string": "Adding \"After Champ Bowl XXV, Crowton took the place of Jeff Dean\" changes the prediction for the model."}, {"id": 288, "string": "Second, a contentful word in the question that is not present in the context."}, {"id": 289, "string": "For e.g."}, {"id": 290, "string": "in the question \"Where hotel did the Panthers stay at?"}, {"id": 291, "string": "\", \"hotel\", is not present in the context."}, {"id": 292, "string": "Adding \"The Vikings stayed at Chicago hotel.\""}, {"id": 293, "string": "changes the prediction for the model."}, {"id": 294, "string": "On the flip side, an adversarial sentence is unsuccessful when a contentful word in the question having high attribution is not present in the added sentence."}, {"id": 295, "string": "E.g."}, {"id": 296, "string": "for \"Where according to gross state product does Victoria rank in Australia?"}, {"id": 297, "string": "\", \"Australia\" receives high attribution."}, {"id": 298, "string": "Adding \"Accord- What period was 2.5 million years ago ?"}, {"id": 299, "string": "The period of Plasticean era was 2.5 billion years ago."}, {"id": 300, "string": "The period of Plasticean era was 1.5 billion years ago."}, {"id": 301, "string": "(as a prefix) ing to net state product, Adelaide ranks 7 in New Zealand.\""}, {"id": 302, "string": "does not fool the model."}, {"id": 303, "string": "However, retaining \"Australia\" in the adversarial sentence does change the model's prediction."}, {"id": 304, "string": "Predicting the effectiveness of attacks Next we correlate attributions with efficacy of the ADDSENT attacks."}, {"id": 305, "string": "We analyzed 1000 (question, attack phrase) instances 7 where Yu et al."}, {"id": 306, "string": "(2018) model has the correct baseline prediction."}, {"id": 307, "string": "Of the 1000 cases, 508 are able to fool the model, while 492 are not."}, {"id": 308, "string": "We split the examples into two groups."}, {"id": 309, "string": "The first group has examples where a noun or adjective in the question has high attribution, but is missing from the adversarial sentence and the rest are in the second group."}, {"id": 310, "string": "Our attribution analysis suggests that we should find more failed examples in the first group."}, {"id": 311, "string": "That is indeed the case."}, {"id": 312, "string": "The first group has 63% failed examples, while the second has only 40%."}, {"id": 313, "string": "Recall that the attack sentences were constructed by (a) generating a sentence that answers the question, (b) replacing all the adjectives and nouns with antonyms, and named entities by the nearest word in GloVe word vector space (Pennington et al., 2014) and (c) crowdsourcing to check that the new sentence is grammatically correct."}, {"id": 314, "string": "This suggests a use of attributions to improve the effectiveness of the attacks, namely ensuring that question words that the model thinks are important are left untouched in step (b) (we note that other changes in should be carried out)."}, {"id": 315, "string": "In table 4, 7 data sourced from https:// worksheets.codalab.org/worksheets/ 0xc86d3ebe69a3427d91f9aaa63f7d1e7d/ we show a few examples where an original attack did not fool the model, but preserving a noun with high attribution did."}, {"id": 316, "string": "Conclusion We analyzed three question answering models using an attribution technique."}, {"id": 317, "string": "Attributions helped us identify weaknesses of these models more effectively than conventional methods (based on validation sets)."}, {"id": 318, "string": "We believe that a workflow that uses attributions can aid the developer in iterating on model quality more effectively."}, {"id": 319, "string": "While the attacks in this paper may seem unrealistic, they do expose real weaknesses that affect the usage of a QA product."}, {"id": 320, "string": "Under-reliance on important question terms is not safe."}, {"id": 321, "string": "We also believe that other QA models may share these weaknesses."}, {"id": 322, "string": "Our attribution-based methods can be directly used to gauge the extent of such problems."}, {"id": 323, "string": "Additionally, our perturbation attacks (sections 4.4 and 5.5) serve as empirical validation of attributions."}, {"id": 324, "string": "Reproducibility Code to generate attributions and reproduce our results is freely available at https://github."}, {"id": 325, "string": "com/pramodkaushik/acl18_results."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 20}, {"section": "Our Contributions", "n": "1.1", "start": 21, "end": 73}, {"section": "Related Work", "n": "2", "start": 74, "end": 98}, {"section": "Integrated Gradients (IG)", "n": "3", "start": 99, "end": 149}, {"section": "Observations", "n": "4.2", "start": 150, "end": 162}, {"section": "Overstability test", "n": "4.3", "start": 163, "end": 173}, {"section": "Attacks", "n": "4.4", "start": 174, "end": 200}, {"section": "Task, model, and data", "n": "5.1", "start": 201, "end": 209}, {"section": "Observations", "n": "5.2", "start": 210, "end": 220}, {"section": "Overstability test", "n": "5.3", "start": 221, "end": 228}, {"section": "Table-specific default programs", "n": "5.4", "start": 229, "end": 278}, {"section": "Analyzing adversarial examples", "n": "6.2", "start": 279, "end": 303}, {"section": "Predicting the effectiveness of attacks", "n": "6.3", "start": 304, "end": 315}, {"section": "Conclusion", "n": "7", "start": 316, "end": 325}], "figures": [{"filename": "../figure/image/1299-Figure3-1.png", "caption": "Figure 3: Visualization of attributions. Question words, preprocessing tokens and column selection priors on the Yaxis. Along the X-axis are operator and column selections with their baseline counterparts in parentheses. Operators and columns not affecting the final answer, and those which are same as their baseline counterparts, are given zero attribution.", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 169.44, "y2": 307.2}}, {"filename": "../figure/image/1299-Table2-1.png", "caption": "Table 2: Attributions to column names for table-specific default programs (programs returned by NP on empty input questions). See supplementary material, table 6 for the full list. These results are indication that the network is predisposed towards picking certain operators solely based on the table.", "page": 6, "bbox": {"x1": 72.0, "x2": 558.24, "y1": 67.2, "y2": 155.04}}, {"filename": "../figure/image/1299-Figure4-1.png", "caption": "Figure 4: Accuracy as a function of vocabulary size. The words are chosen in the descending order of their frequency appearance as top attributions to question terms. The X-axis is on logscale, except near zero where it is linear. Note that just 5 words are necessary for the network to reach more than 50% of its final accuracy.", "page": 6, "bbox": {"x1": 79.67999999999999, "x2": 269.28, "y1": 219.84, "y2": 346.08}}, {"filename": "../figure/image/1299-Table3-1.png", "caption": "Table 3: Neural Programmer (Neelakantan et al., 2017): Left: Validation accuracy when attack phrases are concatenated to the question. (Original: 33.5%)", "page": 6, "bbox": {"x1": 324.96, "x2": 508.32, "y1": 202.56, "y2": 336.96}}, {"filename": "../figure/image/1299-Figure1-1.png", "caption": "Figure 1: Visual QA (Kazemi and Elqursh, 2017): Visualization of attributions (word importances) for a question that the network gets right. Red indicates high attribution, blue negative attribution, and gray near-zero attribution. The colors are determined by attributions normalized w.r.t the maximum magnitude of attributions among the question’s words.", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 530.88, "y1": 61.44, "y2": 145.92}}, {"filename": "../figure/image/1299-Table4-1.png", "caption": "Table 4: ADDSENT attacks that failed to fool the model. With modifications to preserve nouns with high attributions, these are successful in fooling the model. Question words that receive high attribution are colored red (intensity indicates magnitude).", "page": 8, "bbox": {"x1": 75.84, "x2": 521.28, "y1": 67.2, "y2": 247.2}}, {"filename": "../figure/image/1299-Table1-1.png", "caption": "Table 1: VQA network (Kazemi and Elqursh, 2017): Accuracy for prefix attacks; original accuracy is 61.1%.", "page": 4, "bbox": {"x1": 339.84, "x2": 493.44, "y1": 62.4, "y2": 197.28}}, {"filename": "../figure/image/1299-Figure2-1.png", "caption": "Figure 2: VQA network (Kazemi and Elqursh, 2017): Accuracy as a function of vocabulary size, relative to its original accuracy. Words are chosen in the descending order of how frequently they appear as top attributions. The X-axis is on logscale, except near zero where it is linear.", "page": 4, "bbox": {"x1": 79.67999999999999, "x2": 269.28, "y1": 131.51999999999998, "y2": 258.24}}]}