{"title": "Unpaired Sentiment-to-Sentiment Translation: A Cycled Reinforcement Learning Approach", "abstract": "The goal of sentiment-to-sentiment \"translation\" is to change the underlying sentiment of a sentence while keeping its content. The main challenge is the lack of parallel data. To solve this problem, we propose a cycled reinforcement learning method that enables training on unpaired data by collaboration between a neutralization module and an emotionalization module. We evaluate our approach on two review datasets, Yelp and Amazon. Experimental results show that our approach significantly outperforms the state-of-the-art systems. Especially, the proposed method substantially improves the content preservation performance. The BLEU score is improved from 1.64 to 22.46 and from 0.56 to 14.06 on the two datasets, respectively. 1", "text": [{"id": 0, "string": "Introduction Sentiment-to-sentiment \"translation\" requires the system to change the underlying sentiment of a sentence while preserving its non-emotional semantic content as much as possible."}, {"id": 1, "string": "It can be regarded as a special style transfer task that is important in Natural Language Processing (NLP) (Hu et al., 2017; Shen et al., 2017; Fu et al., 2018) ."}, {"id": 2, "string": "It has broad applications, including review sentiment transformation, news rewriting, etc."}, {"id": 3, "string": "Yet the lack of parallel training data poses a great obstacle to a satisfactory performance."}, {"id": 4, "string": "Recently, several related studies for language style transfer (Hu et al., 2017; Shen et al., 2017) have been proposed."}, {"id": 5, "string": "However, when applied * Equal Contribution."}, {"id": 6, "string": "1 The released code can be found in https://github.com/lancopku/unpaired-sentiment-translation to the sentiment-to-sentiment \"translation\" task, most existing studies only change the underlying sentiment and fail in keeping the semantic content."}, {"id": 7, "string": "For example, given \"The food is delicious\" as the source input, the model generates \"What a bad movie\" as the output."}, {"id": 8, "string": "Although the sentiment is successfully transformed from positive to negative, the output text focuses on a different topic."}, {"id": 9, "string": "The reason is that these methods attempt to implicitly separate the emotional information from the semantic information in the same dense hidden vector, where all information is mixed together in an uninterpretable way."}, {"id": 10, "string": "Due to the lack of supervised parallel data, it is hard to only modify the underlying sentiment without any loss of the nonemotional semantic information."}, {"id": 11, "string": "To tackle the problem of lacking parallel data, we propose a cycled reinforcement learning approach that contains two parts: a neutralization module and an emotionalization module."}, {"id": 12, "string": "The neutralization module is responsible for extracting non-emotional semantic information by explicitly filtering out emotional words."}, {"id": 13, "string": "The advantage is that only emotional words are removed, which does not affect the preservation of non-emotional words."}, {"id": 14, "string": "The emotionalization module is responsible for adding sentiment to the neutralized semantic content for sentiment-to-sentiment translation."}, {"id": 15, "string": "In cycled training, given an emotional sentence with sentiment s, we first neutralize it to the nonemotional semantic content, and then force the emotionalization module to reconstruct the original sentence by adding the sentiment s. Therefore, the emotionalization module is taught to add sentiment to the semantic context in a supervised way."}, {"id": 16, "string": "By adding opposite sentiment, we can achieve the goal of sentiment-to-sentiment translation."}, {"id": 17, "string": "Because of the discrete choice of neutral words, the gradient is no longer differentiable over the neutralization module."}, {"id": 18, "string": "Thus, we use policy gradient, one of the reinforcement learning methods, to reward the output of the neutralization module based on the feedback from the emotionalization module."}, {"id": 19, "string": "We add different sentiment to the semantic content and use the quality of the generated text as reward."}, {"id": 20, "string": "The quality is evaluated by two useful metrics: one for identifying whether the generated text matches the target sentiment; one for evaluating the content preservation performance."}, {"id": 21, "string": "The reward guides the neutralization module to better identify non-emotional words."}, {"id": 22, "string": "In return, the improved neutralization module further enhances the emotionalization module."}, {"id": 23, "string": "Our contributions are concluded as follows: • For sentiment-to-sentiment translation, we propose a cycled reinforcement learning approach."}, {"id": 24, "string": "It enables training with unpaired data, in which only reviews and sentiment labels are available."}, {"id": 25, "string": "• Our approach tackles the bottleneck of keeping semantic information by explicitly separating sentiment information from semantic content."}, {"id": 26, "string": "• Experimental results show that our approach significantly outperforms the state-of-the-art systems, especially in content preservation."}, {"id": 27, "string": "Related Work Style transfer in computer vision has been studied (Johnson et al., 2016; Gatys et al., 2016; Liao et al., 2017; Li et al., 2017; Zhu et al., 2017) ."}, {"id": 28, "string": "The main idea is to learn the mapping between two image domains by capturing shared representations or correspondences of higher-level structures."}, {"id": 29, "string": "There have been some studies on unpaired language style transfer recently."}, {"id": 30, "string": "Hu et al."}, {"id": 31, "string": "(2017) propose a new neural generative model that combines variational auto-encoders (VAEs) and holistic attribute discriminators for effective imposition of style semantic structures."}, {"id": 32, "string": "Fu et al."}, {"id": 33, "string": "(2018) propose to use an adversarial network to make sure that the input content does not have style information."}, {"id": 34, "string": "Shen et al."}, {"id": 35, "string": "(2017) focus on separating the underlying content from style information."}, {"id": 36, "string": "They learn an encoder that maps the original sentence to style-independent content and a style-dependent decoder for rendering."}, {"id": 37, "string": "However, their evaluations only consider the transferred style accuracy."}, {"id": 38, "string": "We argue that content preservation is also an indispensable evaluation metric."}, {"id": 39, "string": "However, when applied to the sentiment-to-sentiment translation task, the previously mentioned models share the same problem."}, {"id": 40, "string": "They have the poor preservation of non-emotional semantic content."}, {"id": 41, "string": "In this paper, we propose a cycled reinforcement learning method to improve sentiment-tosentiment translation in the absence of parallel data."}, {"id": 42, "string": "The key idea is to build supervised training pairs by reconstructing the original sentence."}, {"id": 43, "string": "A related study is \"back reconstruction\" in machine translation (He et al., 2016; Tu et al., 2017) ."}, {"id": 44, "string": "They couple two inverse tasks: one is for translating a sentence in language A to a sentence in language B; the other is for translating a sentence in language B to a sentence in language A."}, {"id": 45, "string": "Different from the previous work, we do not introduce the inverse task, but use collaboration between the neutralization module and the emotionalization module."}, {"id": 46, "string": "Sentiment analysis is also related to our work (Socher et al., 2011; Pontiki et al., 2015; Rosenthal et al., 2017; Chen et al., 2017; Ma et al., 2017 Ma et al., , 2018b ."}, {"id": 47, "string": "The task usually involves detecting whether a piece of text expresses positive, negative, or neutral sentiment."}, {"id": 48, "string": "The sentiment can be general or about a specific topic."}, {"id": 49, "string": "Cycled Reinforcement Learning for Unpaired Sentiment-to-Sentiment Translation In this section, we introduce our proposed method."}, {"id": 50, "string": "An overview is presented in Section 3.1."}, {"id": 51, "string": "The details of the neutralization module and the emotionalization module are shown in Section 3.2 and Section 3.3."}, {"id": 52, "string": "The cycled reinforcement learning mechanism is introduced in Section 3.4."}, {"id": 53, "string": "Overview The proposed approach contains two modules: a neutralization module and an emotionalization module, as shown in Figure 1 ."}, {"id": 54, "string": "The neutralization module first extracts non-emotional semantic content, and then the emotionalization module attaches sentiment to the semantic content."}, {"id": 55, "string": "Two modules are trained by the proposed cycled reinforcement learning method."}, {"id": 56, "string": "The proposed method requires the two modules to have initial learning ability."}, {"id": 57, "string": "Therefore, we propose a novel pre-training method, which uses a self-attention based sentiment classifier (SASC)."}, {"id": 58, "string": "A sketch of cycled reinforcement learning is shown in Algorithm 1."}, {"id": 59, "string": "The Neutralization Module Emotionalization Module The food is very * The food is very delicious details are introduced as follows."}, {"id": 60, "string": "Neutralization Module The neutralization module N θ is used for explicitly filtering out emotional information."}, {"id": 61, "string": "In this paper, we consider this process as an extraction problem."}, {"id": 62, "string": "The neutralization module first identifies non-emotional words and then feeds them into the emotionalization module."}, {"id": 63, "string": "We use a single Longshort Term Memory Network (LSTM) to generate the probability of being neutral or being polar for every word in a sentence."}, {"id": 64, "string": "Given an emotional input sequence x = (x 1 , x 2 , ."}, {"id": 65, "string": "."}, {"id": 66, "string": "."}, {"id": 67, "string": ", x T ) of T words from Γ, the vocabulary of words, this module is responsible for producing a neutralized sequence."}, {"id": 68, "string": "Since cycled reinforcement learning requires the modules with initial learning ability, we propose a novel pre-training method to teach the neutralization module to identify non-emotional words."}, {"id": 69, "string": "We construct a self-attention based sentiment classifier and use the learned attention weight as the supervisory signal."}, {"id": 70, "string": "The motivation comes from the fact that, in a well-trained sentiment classification model, the attention weight reflects the sentiment contribution of each word to Algorithm 1 The cycled reinforcement learning method for training the neutralization module N θ and the emotionalization module E φ ."}, {"id": 71, "string": "1: Initialize the neutralization module N θ , the emotionalization module E φ with random weights θ, φ 2: Pre-train N θ using MLE based on Eq."}, {"id": 72, "string": "6 3: Pre-train E φ using MLE based on Eq."}, {"id": 73, "string": "7 4: for each iteration i = 1, 2, ..., M do 5: Sample a sequence x with sentiment s from X 6: Generate a neutralized sequencex based on N θ 7: Givenx and s, generate an output based on E φ 8: Compute the gradient of E φ based on Eq."}, {"id": 74, "string": "8 9: Compute the reward R1 based on Eq."}, {"id": 75, "string": "11 10:s = the opposite sentiment 11: Givenx ands, generate an output based on E φ 12: Compute the reward R2 based on Eq."}, {"id": 76, "string": "11 13: Compute the combined reward Rc based on Eq."}, {"id": 77, "string": "10 14: Compute the gradient of N θ based on Eq."}, {"id": 78, "string": "9 15: Update model parameters θ, φ 16: end for some extent."}, {"id": 79, "string": "Emotional words tend to get higher attention weights while neutral words usually get lower weights."}, {"id": 80, "string": "The details of sentiment classifier are described as follows."}, {"id": 81, "string": "Given an input sequence x, a sentiment label y is produced as y = sof tmax(W · c) (1) where W is a parameter."}, {"id": 82, "string": "The term c is computed as a weighted sum of hidden vectors: c = T i=0 α i h i (2) where α i is the weight of h i ."}, {"id": 83, "string": "The term h i is the output of LSTM at the i-th word."}, {"id": 84, "string": "The term α i is computed as α i = exp(e i ) T i=0 exp(e i ) (3) where e i = f (h i , h T ) is an alignment model."}, {"id": 85, "string": "We consider the last hidden state h T as the context vector, which contains all information of an input sequence."}, {"id": 86, "string": "The term e i evaluates the contribution of each word for sentiment classification."}, {"id": 87, "string": "Our experimental results show that the proposed sentiment classifier achieves the accuracy of 89% and 90% on two datasets."}, {"id": 88, "string": "With high classification accuracy, the attention weight produced by the classifier is considered to adequately capture the sentiment information of each word."}, {"id": 89, "string": "To extract non-emotional words based on continuous attention weights, we map attention weights to discrete values, 0 and 1."}, {"id": 90, "string": "Since the discrete method is not the key part is this paper, we only use the following method for simplification."}, {"id": 91, "string": "We first calculate the averaged attention value in a sentence asᾱ = 1 T T i=0 α i (4) whereᾱ is used as the threshold to distinguish non-emotional words from emotional words."}, {"id": 92, "string": "The discrete attention weight is calculated aŝ α i = 1, if α i ≤ᾱ 0, if α i >ᾱ (5) whereα i is treated as the identifier."}, {"id": 93, "string": "For pre-training the neutralization module, we build the training pair of input text x and a discrete attention weight sequenceα."}, {"id": 94, "string": "The cross entropy loss is computed as L θ = − T i=1 P N θ (α i |x i ) (6) Emotionalization Module The emotionalization module E φ is responsible for adding sentiment to the neutralized semantic content."}, {"id": 95, "string": "In our work, we use a bi-decoder based encoder-decoder framework, which contains one encoder and two decoders."}, {"id": 96, "string": "One decoder adds the positive sentiment and the other adds the negative sentiment."}, {"id": 97, "string": "The input sentiment signal determines which decoder to use."}, {"id": 98, "string": "Specifically, we use the seq2seq model (Sutskever et al., 2014) for implementation."}, {"id": 99, "string": "Both the encoder and decoder are LSTM networks."}, {"id": 100, "string": "The encoder learns to compress the semantic content into a dense vector."}, {"id": 101, "string": "The decoder learns to add sentiment based on the dense vector."}, {"id": 102, "string": "Given the neutralized semantic content and the target sentiment, this module is responsible for producing an emotional sequence."}, {"id": 103, "string": "For pre-training the emotionalization module, we first generate a neutralized input sequencex by removing emotional words identified by the proposed sentiment classifier."}, {"id": 104, "string": "Given the training pair of a neutralized sequencex and an original sentence x with sentiment s, the cross entropy loss is computed as L φ = − T i=1 P E φ (x i |x i , s) (7) where a positive example goes through the positive decoder and a negative example goes through the negative decoder."}, {"id": 105, "string": "We also explore a simpler method for pretraining the emotionalization module, which uses the product between a continuous vector 1 − α and a word embedding sequence as the neutralized content where α represents an attention weight sequence."}, {"id": 106, "string": "Experimental results show that this method achieves much lower results than explicitly removing emotional words based on discrete attention weights."}, {"id": 107, "string": "Thus, we do not choose this method in our work."}, {"id": 108, "string": "Cycled Reinforcement Learning Two modules are trained by the proposed cycled method."}, {"id": 109, "string": "The neutralization module first neutralizes an emotional input to semantic content and then the emotionalization module is forced to reconstruct the original sentence based on the source sentiment and the semantic content."}, {"id": 110, "string": "Therefore, the emotionalization module is taught to add sentiment to the semantic content in a supervised way."}, {"id": 111, "string": "Because of the discrete choice of neutral words, the loss is no longer differentiable over the neutralization module."}, {"id": 112, "string": "Therefore, we formulate it as a reinforcement learning problem and use policy gradient to train the neutralization module."}, {"id": 113, "string": "The detailed training process is shown as follows."}, {"id": 114, "string": "We refer the neutralization module N θ as the first agent and the emotionalization module E φ as the second one."}, {"id": 115, "string": "Given a sentence x associated with sentiment s, the termx represents the middle neutralized context extracted byα, which is generated by P N θ (α|x)."}, {"id": 116, "string": "In cycled training, the original sentence can be viewed as the supervision for training the second agent."}, {"id": 117, "string": "Thus, the gradient for the second agent is ∇ φ J(φ) = ∇ φ log(P E φ (x|x, s)) (8) We denotex as the output generated by P E φ (x|x, s)."}, {"id": 118, "string": "We also denote y as the output generated by P E φ (y|x,s) wheres represents the opposite sentiment."}, {"id": 119, "string": "Givenx and y, we first calculate rewards for training the neutralized module, R 1 and R 2 ."}, {"id": 120, "string": "The details of calculation process will be introduced in Section 3.4.1."}, {"id": 121, "string": "Then, we optimize parameters through policy gradient by maximizing the expected reward to train the neutralization module."}, {"id": 122, "string": "It guides the neutralization module to identify non-emotional words better."}, {"id": 123, "string": "In return, the improved neutralization module further enhances the emotionalization module."}, {"id": 124, "string": "According to the policy gradient theorem (Williams, 1992) , the gradient for the first agent is ∇ θ J(θ) = E[R c · ∇ θ log(P N θ (α|x))] (9) where R c is calculated as R c = R 1 + R 2 (10) Based on Eq."}, {"id": 125, "string": "8 and Eq."}, {"id": 126, "string": "9, we use the sampling approach to estimate the expected reward."}, {"id": 127, "string": "This cycled process is repeated until converge."}, {"id": 128, "string": "Reward The reward consists of two parts, sentiment confidence and BLEU."}, {"id": 129, "string": "Sentiment confidence evaluates whether the generated text matches the target sentiment."}, {"id": 130, "string": "We use a pre-trained classifier to make the judgment."}, {"id": 131, "string": "Specially, we use the proposed selfattention based sentiment classifier for implementation."}, {"id": 132, "string": "The BLEU (Papineni et al., 2002) score is used to measure the content preservation performance."}, {"id": 133, "string": "Considering that the reward should encourage the model to improve both metrics, we use the harmonic mean of sentiment confidence and BLEU as reward, which is formulated as R = (1 + β 2 ) 2 · BLEU · Conf id (β 2 · BLEU ) + Conf id (11) where β is a harmonic weight."}, {"id": 134, "string": "Experiment In this section, we evaluate our method on two review datasets."}, {"id": 135, "string": "We first introduce the datasets, the training details, the baselines, and the evaluation metrics."}, {"id": 136, "string": "Then, we compare our approach with the state-of-the-art systems."}, {"id": 137, "string": "Finally, we show the experimental results and provide the detailed analysis of the key components."}, {"id": 138, "string": "Unpaired Datasets We conduct experiments on two review datasets that contain user ratings associated with each review."}, {"id": 139, "string": "Following previous work (Shen et al., 2017) , we consider reviews with rating above three as positive reviews and reviews below three as negative reviews."}, {"id": 140, "string": "The positive and negative reviews are not paired."}, {"id": 141, "string": "Since our approach focuses on sentence-level sentiment-to-sentiment translation where sentiment annotations are provided at the document level, we process the two datasets with the following steps."}, {"id": 142, "string": "First, following previous work (Shen et al., 2017) , we filter out the reviews that exceed 20 words."}, {"id": 143, "string": "Second, we construct textsentiment pairs by extracting the first sentence in a review associated with its sentiment label, because the first sentence usually expresses the core idea."}, {"id": 144, "string": "Finally, we train a sentiment classifier and filter out the text-sentiment pairs with the classifier confidence below 0.8."}, {"id": 145, "string": "Specially, we use the proposed self-attention based sentiment classifier for implementation."}, {"id": 146, "string": "Leskovec (2013) ."}, {"id": 147, "string": "It consists of amounts of food reviews from Amazon."}, {"id": 148, "string": "3 The processed Amazon dataset contains 230K, 10K, and 3K pairs for training, validation, and testing, respectively."}, {"id": 149, "string": "Training Details We tune hyper-parameters based on the performance on the validation sets."}, {"id": 150, "string": "The self-attention based sentiment classifier is trained for 10 epochs on two datasets."}, {"id": 151, "string": "We set β for calculating reward to 0.5, hidden size to 256, embedding size to 128, vocabulary size to 50K, learning rate to 0.6, and batch size to 64."}, {"id": 152, "string": "We use the Adagrad (Duchi et al., 2011) optimizer."}, {"id": 153, "string": "All of the gradients are clipped when the norm exceeds 2."}, {"id": 154, "string": "Before cycled training, the neutralization module and the emotionalization module are pre-trained for 1 and 4 epochs on the yelp dataset, for 3 and 5 epochs on the Amazon dataset."}, {"id": 155, "string": "Baselines We compare our proposed method with the following state-of-the-art systems."}, {"id": 156, "string": "Cross-Alignment Auto-Encoder (CAAE): This method is proposed by Shen et al."}, {"id": 157, "string": "(2017) ."}, {"id": 158, "string": "They propose a method that uses refined alignment of latent representations in hidden layers to perform style transfer."}, {"id": 159, "string": "We treat this model as a baseline and adapt it by using the released code."}, {"id": 160, "string": "Multi-Decoder with Adversarial Learning (MDAL): This method is proposed by Fu et al."}, {"id": 161, "string": "(2018) ."}, {"id": 162, "string": "They use a multi-decoder model with adversarial learning to separate style representations and content representations in hidden layers."}, {"id": 163, "string": "We adapt this model by using the released code."}, {"id": 164, "string": "Evaluation Metrics We conduct two evaluations in this work, including an automatic evaluation and a human evaluation."}, {"id": 165, "string": "The details of evaluation metrics are shown as follows."}, {"id": 166, "string": "Automatic Evaluation We quantitatively measure sentiment transformation by evaluating the accuracy of generating designated sentiment."}, {"id": 167, "string": "For a fair comparison, we do not use the proposed sentiment classification model."}, {"id": 168, "string": "Following previous work (Shen et al., 2017; Hu et al., 2017) , we instead use a stateof-the-art sentiment classifier (Vieira and Moura, 2017) , called TextCNN, to automatically evaluate the transferred sentiment accuracy."}, {"id": 169, "string": "TextCNN achieves the accuracy of 89% and 88% on two datasets."}, {"id": 170, "string": "Specifically, we generate sentences given sentiment s, and use the pre-trained sentiment classifier to assign sentiment labels to the generated sentences."}, {"id": 171, "string": "The accuracy is calculated as the percentage of the predictions that match the sentiment s. To evaluate the content preservation performance, we use the BLEU score (Papineni et al., 2002) between the transferred sentence and the source sentence as an evaluation metric."}, {"id": 172, "string": "BLEU is a widely used metric for text generation tasks, such as machine translation, summarization, etc."}, {"id": 173, "string": "The metric compares the automatically produced text with the reference text by computing overlapping lexical n-gram units."}, {"id": 174, "string": "To evaluate the overall performance, we use the geometric mean of ACC and BLEU as an evaluation metric."}, {"id": 175, "string": "The G-score is one of the most commonly used \"single number\" measures in Information Retrieval, Natural Language Processing, and Machine Learning."}, {"id": 176, "string": "Human Evaluation While the quantitative evaluation provides indication of sentiment transfer quality, it can not evaluate the quality of transferred text accurately."}, {"id": 177, "string": "Yelp ACC BLEU G-score CAAE (Shen et al., 2017) 93.22 1.17 10.44 MDAL (Fu et al., 2018) 85.65 1.64 11.85 Proposed Method 80.00 22.46 42.38 Amazon ACC BLEU G-score CAAE (Shen et al., 2017) 84.19 0.56 6.87 MDAL (Fu et al., 2018) 70.50 0.27 4.36 Proposed Method 70.37 14.06 31.45 Table 1 : Automatic evaluations of the proposed method and baselines."}, {"id": 178, "string": "ACC evaluates sentiment transformation."}, {"id": 179, "string": "BLEU evaluates content preservation."}, {"id": 180, "string": "G-score is the geometric mean of ACC and BLEU."}, {"id": 181, "string": "Therefore, we also perform a human evaluation on the test set."}, {"id": 182, "string": "We randomly choose 200 items for the human evaluation."}, {"id": 183, "string": "Each item contains the transformed sentences generated by different systems given the same source sentence."}, {"id": 184, "string": "The items are distributed to annotators who have no knowledge about which system the sentence is from."}, {"id": 185, "string": "They are asked to score the transformed text in terms of sentiment and semantic similarity."}, {"id": 186, "string": "Sentiment represents whether the sentiment of the source text is transferred correctly."}, {"id": 187, "string": "Semantic similarity evaluates the context preservation performance."}, {"id": 188, "string": "The score ranges from 1 to 10 (1 is very bad and 10 is very good)."}, {"id": 189, "string": "Experimental Results Automatic evaluation results are shown in Table 1 ."}, {"id": 190, "string": "ACC evaluates sentiment transformation."}, {"id": 191, "string": "BLEU evaluates semantic content preservation."}, {"id": 192, "string": "G-score represents the geometric mean of ACC and BLEU."}, {"id": 193, "string": "CAAE and MDAL achieve much lower BLEU scores, 1.17 and 1.64 on the Yelp dataset, 0.56 and 0.27 on the Amazon dataset."}, {"id": 194, "string": "The low BLEU scores indicate the worrying content preservation performance to some extent."}, {"id": 195, "string": "Even with the desired sentiment, the irrelevant generated text leads to worse overall performance."}, {"id": 196, "string": "In general, these two systems work more like sentiment-aware language models that generate text only based on the target sentiment and neglect the source input."}, {"id": 197, "string": "The main reason is that these two systems attempt to separate emotional information from non-emotional content in a hidden layer, where all information is complicatedly mixed together."}, {"id": 198, "string": "It is difficult to only modify emotional information without any loss of non-emotional semantic content."}, {"id": 199, "string": "In comparison, our proposed method achieves the best overall performance on the two datasets, Yelp Sentiment Semantic G-score CAAE (Shen et al., 2017) 7.67 3.87 5.45 MDAL (Fu et al., 2018) 7.12 3.68 5.12 Proposed Method 6.99 5.08 5.96 Amazon Sentiment Semantic G-score CAAE (Shen et al., 2017) 8.61 3.15 5.21 MDAL (Fu et al., 2018) 7.93 3.22 5.05 Proposed Method 7.92 4.67 6.08 Table 2 : Human evaluations of the proposed method and baselines."}, {"id": 200, "string": "Sentiment evaluates sentiment transformation."}, {"id": 201, "string": "Semantic evaluates content preservation."}, {"id": 202, "string": "demonstrating the ability of learning knowledge from unpaired data."}, {"id": 203, "string": "This result is attributed to the improved BLEU score."}, {"id": 204, "string": "The BLEU score is largely improved from 1.64 to 22.46 and from 0.56 to 14.06 on the two datasets."}, {"id": 205, "string": "The score improvements mainly come from the fact that we separate emotional information from semantic content by explicitly filtering out emotional words."}, {"id": 206, "string": "The extracted content is preserved and fed into the emotionalization module."}, {"id": 207, "string": "Given the overall quality of transferred text as the reward, the neutralization module is taught to extract non-emotional semantic content better."}, {"id": 208, "string": "Table 2 shows the human evaluation results."}, {"id": 209, "string": "It can be clearly seen that the proposed method obviously improves semantic preservation."}, {"id": 210, "string": "The semantic score is increased from 3.87 to 5.08 on the Yelp dataset, and from 3.22 to 4.67 on the Amazon dataset."}, {"id": 211, "string": "In general, our proposed model achieves the best overall performance."}, {"id": 212, "string": "Furthermore, it also needs to be noticed that with the large improvement in content preservation, the sentiment accuracy of the proposed method is lower than that of CAAE on the two datasets."}, {"id": 213, "string": "It shows that simultaneously promoting sentiment transformation and content preservation remains to be studied further."}, {"id": 214, "string": "By comparing two evaluation results, we find that there is an agreement between the human evaluation and the automatic evaluation."}, {"id": 215, "string": "It indicates the usefulness of automatic evaluation metrics."}, {"id": 216, "string": "However, we also notice that the human evaluation has a smaller performance gap between the baselines and the proposed method than the automatic evaluation."}, {"id": 217, "string": "It shows the limitation of automatic metrics for giving accurate results."}, {"id": 218, "string": "For evaluating sentiment transformation, even with a high accuracy, the sentiment classifier sometimes generates noisy results, especially for those neutral sentences (e.g., \"I ate a cheese sandwich\")."}, {"id": 219, "string": "For evaluating content preservation, the BLEU score Input: I would strongly advise against using this company."}, {"id": 220, "string": "CAAE: I love this place for a great experience here."}, {"id": 221, "string": "MDAL: I have been a great place was great."}, {"id": 222, "string": "Proposed Method: I would love using this company."}, {"id": 223, "string": "Input: The service was nearly non-existent and extremely rude."}, {"id": 224, "string": "CAAE: The best place in the best area in vegas."}, {"id": 225, "string": "MDAL: The food is very friendly and very good."}, {"id": 226, "string": "Proposed Method: The service was served and completely fresh."}, {"id": 227, "string": "Input: Asked for the roast beef and mushroom sub, only received roast beef."}, {"id": 228, "string": "CAAE: We had a great experience with."}, {"id": 229, "string": "MDAL: This place for a great place for a great food and best."}, {"id": 230, "string": "Proposed Method: Thanks for the beef and spring bbq."}, {"id": 231, "string": "Input: Worst cleaning job ever!"}, {"id": 232, "string": "CAAE: Great food and great service!"}, {"id": 233, "string": "MDAL: Great food, food!"}, {"id": 234, "string": "Proposed Method: Excellent outstanding job ever!"}, {"id": 235, "string": "Input: Most boring show I've ever been."}, {"id": 236, "string": "CAAE: Great place is the best place in town."}, {"id": 237, "string": "MDAL: Great place I've ever ever had."}, {"id": 238, "string": "Proposed Method: Most amazing show I've ever been."}, {"id": 239, "string": "Input: Place is very clean and the food is delicious."}, {"id": 240, "string": "CAAE: Don't go to this place."}, {"id": 241, "string": "MDAL: This place wasn't worth the worst place is horrible."}, {"id": 242, "string": "Proposed Method: Place is very small and the food is terrible."}, {"id": 243, "string": "Input: Really satisfied with experience buying clothes."}, {"id": 244, "string": "CAAE: Don't go to this place."}, {"id": 245, "string": "MDAL: Do not impressed with this place."}, {"id": 246, "string": "Proposed Method: Really bad experience."}, {"id": 247, "string": "Table 3 : Examples generated by the proposed approach and baselines on the Yelp dataset."}, {"id": 248, "string": "The two baselines change not only the polarity of examples, but also the semantic content."}, {"id": 249, "string": "In comparison, our approach changes the sentiment of sentences with higher semantic similarity."}, {"id": 250, "string": "is computed based on the percentage of overlapping n-grams between the generated text and the reference text."}, {"id": 251, "string": "However, the overlapping n-grams contain not only content words but also function words, bringing the noisy results."}, {"id": 252, "string": "In general, accurate automatic evaluation metrics are expected in future work."}, {"id": 253, "string": "Table 3 presents the examples generated by different systems on the Yelp dataset."}, {"id": 254, "string": "The two baselines change not only the polarity of examples, but also the semantic content."}, {"id": 255, "string": "In comparison, our method precisely changes the sentiment of sentences (and paraphrases slightly to ensure fluency), while keeping the semantic content unchanged."}, {"id": 256, "string": "Table 4 : Performance of key components in the proposed approach."}, {"id": 257, "string": "\"NM\" denotes the neutralization module."}, {"id": 258, "string": "\"Cycled RL\" represents cycled reinforcement learning."}, {"id": 259, "string": "Incremental Analysis In this section, we conduct a series of experiments to evaluate the contributions of our key components."}, {"id": 260, "string": "The results are shown in Table 4 ."}, {"id": 261, "string": "We treat the emotionalization module as a baseline where the input is the original emotional sentence."}, {"id": 262, "string": "The emotionalization module achieves the highest BLEU score but with much lower sentiment transformation accuracy."}, {"id": 263, "string": "The encoding of the original sentiment leads to the emotional hidden vector that influences the decoding process and results in worse sentiment transformation performance."}, {"id": 264, "string": "It can be seen that the method with all components achieves the best performance."}, {"id": 265, "string": "First, we find that the method that only uses cycled reinforcement learning performs badly because it is hard to guide two randomly initialized modules to teach each other."}, {"id": 266, "string": "Second, the pre-training method brings a slight improvement in overall performance."}, {"id": 267, "string": "The G-score is improved from 32.77 to 34.66 and from 26.46 to 27.87 on the two datasets."}, {"id": 268, "string": "The bottleneck of this method is the noisy attention weight because of the limited sentiment classification accuracy."}, {"id": 269, "string": "Third, the method that combines cycled reinforcement learning and pre-training achieves the better performance than using one of them."}, {"id": 270, "string": "Pre-training gives the two modules initial learning ability."}, {"id": 271, "string": "Cycled training teaches the two modules to improve each other based on the feedback signals."}, {"id": 272, "string": "Specially, the G-score is improved from 34.66 to 42.38 and from 27.87 to 31.45 on the two datasets."}, {"id": 273, "string": "Finally, by comparing the methods with and without the neutralization module, we find that the neutralization mechanism improves a lot in sentiment transformation with a slight reduction on content preservation."}, {"id": 274, "string": "It proves the effectiveness of explic-Michael is absolutely wonderful."}, {"id": 275, "string": "I would strongly advise against using this company."}, {"id": 276, "string": "Horrible experience!"}, {"id": 277, "string": "Worst cleaning job ever!"}, {"id": 278, "string": "Most boring show i 've ever been."}, {"id": 279, "string": "Hainan chicken was really good."}, {"id": 280, "string": "I really don't understand all the negative reviews for this dentist."}, {"id": 281, "string": "Smells so weird in there."}, {"id": 282, "string": "The service was nearly non-existent and extremely rude."}, {"id": 283, "string": "itly separating sentiment information from semantic content."}, {"id": 284, "string": "Furthermore, to analyze the neutralization ability in the proposed method, we randomly sample several examples, as shown in Table 5 ."}, {"id": 285, "string": "It can be clearly seen that emotional words are removed accurately almost without loss of non-emotional information."}, {"id": 286, "string": "Error Analysis Although the proposed method outperforms the state-of-the-art systems, we also observe several failure cases, such as sentiment-conflicted sentences (e.g., \"Outstanding and bad service\"), neutral sentences (e.g., \"Our first time here\")."}, {"id": 287, "string": "Sentiment-conflicted sentences indicate that the original sentiment is not removed completely."}, {"id": 288, "string": "This problem occurs when the input contains emotional words that are unseen in the training data, or the sentiment is implicitly expressed."}, {"id": 289, "string": "Handling complex sentiment expressions is an important problem for future work."}, {"id": 290, "string": "Neutral sentences demonstrate that the decoder sometimes fails in adding the target sentiment and only generates text based on the semantic content."}, {"id": 291, "string": "A better sentimentaware decoder is expected to be explored in future work."}, {"id": 292, "string": "Conclusions and Future Work In this paper, we focus on unpaired sentimentto-sentiment translation and propose a cycled reinforcement learning approach that enables training in the absence of parallel training data."}, {"id": 293, "string": "We conduct experiments on two review datasets."}, {"id": 294, "string": "Experimental results show that our method substantially outperforms the state-of-the-art systems, especially in terms of semantic preservation."}, {"id": 295, "string": "For future work, we would like to explore a fine-grained version of sentiment-to-sentiment translation that not only reverses sentiment, but also changes the strength of sentiment."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 26}, {"section": "Related Work", "n": "2", "start": 27, "end": 48}, {"section": "Cycled Reinforcement Learning for", "n": "3", "start": 49, "end": 52}, {"section": "Overview", "n": "3.1", "start": 53, "end": 59}, {"section": "Neutralization Module", "n": "3.2", "start": 60, "end": 93}, {"section": "Emotionalization Module", "n": "3.3", "start": 94, "end": 107}, {"section": "Cycled Reinforcement Learning", "n": "3.4", "start": 108, "end": 127}, {"section": "Reward", "n": "3.4.1", "start": 128, "end": 133}, {"section": "Experiment", "n": "4", "start": 134, "end": 137}, {"section": "Unpaired Datasets", "n": "4.1", "start": 138, "end": 148}, {"section": "Training Details", "n": "4.2", "start": 149, "end": 154}, {"section": "Baselines", "n": "4.3", "start": 155, "end": 162}, {"section": "Evaluation Metrics", "n": "4.4", "start": 163, "end": 165}, {"section": "Automatic Evaluation", "n": "4.4.1", "start": 166, "end": 175}, {"section": "Human Evaluation", "n": "4.4.2", "start": 176, "end": 188}, {"section": "Experimental Results", "n": "4.5", "start": 189, "end": 258}, {"section": "Incremental Analysis", "n": "4.6", "start": 259, "end": 285}, {"section": "Error Analysis", "n": "4.7", "start": 286, "end": 291}, {"section": "Conclusions and Future Work", "n": "5", "start": 292, "end": 295}], "figures": [{"filename": "../figure/image/1309-Figure1-1.png", "caption": "Figure 1: An illustration of the two modules. Lower: The neutralization module removes emotional words and extracts non-emotional semantic information. Upper: The emotionalization module adds sentiment to the semantic content. The proposed self-attention based sentiment classifier is used to guide the pre-training.", "page": 2, "bbox": {"x1": 80.64, "x2": 278.4, "y1": 62.879999999999995, "y2": 299.03999999999996}}, {"filename": "../figure/image/1309-Table1-1.png", "caption": "Table 1: Automatic evaluations of the proposed method and baselines. ACC evaluates sentiment transformation. BLEU evaluates content preservation. G-score is the geometric mean of ACC and BLEU.", "page": 5, "bbox": {"x1": 308.64, "x2": 522.24, "y1": 62.879999999999995, "y2": 147.35999999999999}}, {"filename": "../figure/image/1309-Table4-1.png", "caption": "Table 4: Performance of key components in the proposed approach. “NM” denotes the neutralization module. “Cycled RL” represents cycled reinforcement learning.", "page": 7, "bbox": {"x1": 75.84, "x2": 284.15999999999997, "y1": 62.879999999999995, "y2": 167.04}}, {"filename": "../figure/image/1309-Table5-1.png", "caption": "Table 5: Analysis of the neutralization module. Words in red are removed by the neutralization module.", "page": 7, "bbox": {"x1": 306.71999999999997, "x2": 527.04, "y1": 62.879999999999995, "y2": 164.16}}, {"filename": "../figure/image/1309-Table2-1.png", "caption": "Table 2: Human evaluations of the proposed method and baselines. Sentiment evaluates sentiment transformation. Semantic evaluates content preservation.", "page": 6, "bbox": {"x1": 72.0, "x2": 288.0, "y1": 62.879999999999995, "y2": 147.35999999999999}}, {"filename": "../figure/image/1309-Table3-1.png", "caption": "Table 3: Examples generated by the proposed approach and baselines on the Yelp dataset. The two baselines change not only the polarity of examples, but also the semantic content. In comparison, our approach changes the sentiment of sentences with higher semantic similarity.", "page": 6, "bbox": {"x1": 310.56, "x2": 520.3199999999999, "y1": 62.879999999999995, "y2": 435.35999999999996}}]}