{"title": "Exemplar Encoder-Decoder for Neural Conversation Generation", "abstract": "In this paper we present the Exemplar Encoder-Decoder network (EED), a novel conversation model that learns to utilize similar examples from training data to generate responses. Similar conversation examples (context-response pairs) from training data are retrieved using a traditional TF-IDF based retrieval model. The retrieved responses are used to create exemplar vectors that are used by the decoder to generate the response. The contribution of each retrieved response is weighed by the similarity of corresponding context with the input context. We present detailed experiments on two large data sets and find that our method outperforms state of the art sequence to sequence generative models on several recently proposed evaluation metrics. We also observe that the responses generated by the proposed EED model are more informative and diverse compared to existing state-of-the-art method.", "text": [{"id": 0, "string": "Introduction With the availability of large datasets and the recent progress made by neural methods, variants of sequence to sequence learning (seq2seq) (Sutskever et al., 2014) architectures have been successfully applied for building conversational systems (Serban et al., , 2017b ."}, {"id": 1, "string": "However, despite these methods being the stateof-the art frameworks for conversation generation, they suffer from problems such as lack of diversity in responses and generation of short, repetitive and uninteresting responses (Liu et al., 2016; Serban et al., , 2017b ."}, {"id": 2, "string": "A large body of recent literature has focused on overcoming such challenges (Li et al., 2016a; Lowe et al., 2017) ."}, {"id": 3, "string": "In part, such problems arise as all information required to generate responses needs to be captured as part of the model parameters learnt from the training data."}, {"id": 4, "string": "These model parameters alone may not be sufficient for generating natural conversations."}, {"id": 5, "string": "Therefore, despite providing enormous amount of data, neural generative systems have been found to be ineffective for use in real world applications (Liu et al., 2016) ."}, {"id": 6, "string": "In this paper, we focus our attention on closed domain conversations."}, {"id": 7, "string": "A characteristic feature of such conversations is that over a period of time, some conversation contexts 1 are likely to have occurred previously (Lu et al., 2017b) ."}, {"id": 8, "string": "For instance, Table 1 shows some contexts from the Ubuntu dialog corpus."}, {"id": 9, "string": "Each row presents an input dialog context with its corresponding gold response followed by a similar context and response seen in training data -as can be seen, contexts for \"installing dms\", \"sharing files\", \"blocking ufw ports\" have all occurred in training data."}, {"id": 10, "string": "We hypothesize that being able to refer to training responses for previously seen similar contexts could be a helpful signal to use while generating responses."}, {"id": 11, "string": "In order to exploit this aspect of closed domain conversations we build our neural encoderdecoder architecture called the Exemplar Encoder Decoder (EED), that learns to generate a response for a given context by exploiting similar contexts from training conversations."}, {"id": 12, "string": "Thus, instead of having the seq2seq model learn patterns of language only from aligned parallel corpora, we assist the model by providing it closely related (similar) samples from the training data that it can refer to while generating text."}, {"id": 13, "string": "Specifically, given a context c, we retrieve a set  of context-response pairs (c (k) , r (k) ), 1 ≤ k ≤ K using an inverted index of training data."}, {"id": 14, "string": "We create an exemplar vector e (k) by encoding the response r (k) (also referred to as exemplar response) along with an encoded representation of the current context c. We then learn the importance of each exemplar vector e (k) based on the likelihood of it being able to generate the ground truth response."}, {"id": 15, "string": "We believe that e (k) may contain information that is helpful in generating the response."}, {"id": 16, "string": "Table 1 highlights the words in exemplar responses that appear in the ground truth response as well."}, {"id": 17, "string": "Contributions: We present a novel Exemplar Encoder-Decoder (EED) architecture that makes use of similar conversations, fetched from an index of training data."}, {"id": 18, "string": "The retrieved contextresponse pairs are used to create exemplar vectors which are used by the decoder in the EED model, to learn the importance of training context-response pairs, while generating responses."}, {"id": 19, "string": "We present detailed experiments on the publicly benchmarked Ubuntu dialog corpus data set (Lowe et al., 2015) as well a large collection of more than 127,000 technical support conversations."}, {"id": 20, "string": "We compare the performance of the EED model with the existing state of the art generative models such as HRED  and VHRED (Serban et al., 2017b) ."}, {"id": 21, "string": "We find that our model out-performs these models on a wide variety of metrics such as the recently proposed Activity Entity metrics (Serban et al., 2017a) as well as Embedding-based metrics (Lowe et al., 2015) ."}, {"id": 22, "string": "In addition, we present qualitative insights into our results and we find that exemplar based responses are more informative and diverse."}, {"id": 23, "string": "The rest of the paper is organized as follows."}, {"id": 24, "string": "Section 2 briefly describes the recent works in neural dialogue generation The details of the proposed EED model for dialogue generation are described in detail in Section 3."}, {"id": 25, "string": "In Section 4, we describe the datasets as well as the details of the models used during training."}, {"id": 26, "string": "We present quantitative and qualitative results of EED model in Section 5."}, {"id": 27, "string": "Related Work In this section, we compare our work against other data-driven end-to-end conversation models."}, {"id": 28, "string": "Endto-end conversation models can be further classified into two broad categories -generation based models and retrieval based models."}, {"id": 29, "string": "Generation based models cast the problem of dialogue generation as a sequence to sequence learning problem."}, {"id": 30, "string": "Initial works treat the entire context as a single long sentence and learn an encoder-decoder framework to generate response word by word (Shang et al., 2015; Vinyals and Le, 2015) ."}, {"id": 31, "string": "This was followed by work that models context better by breaking it into conversation history and last utterance (Sordoni et al., 2015b) ."}, {"id": 32, "string": "Context was further modeled effectively by using a hierarchical encoder decoder (HRED) model which first learns a vector representation of each utterance and then combines these representations to learn vector representation of context ."}, {"id": 33, "string": "Later, an alternative hierarchical model called VHRED (Serban et al., 2017b) was proposed, where generated responses were conditioned on latent variables."}, {"id": 34, "string": "This leads to more in-formative responses and adds diversity to response generation."}, {"id": 35, "string": "Models that explicitly incorporate diversity in response generation have also been studied in literature (Li et al., 2016b; Vijayakumar et al., 2016; Cao and Clark, 2017; ."}, {"id": 36, "string": "Our work differs from the above as none of these above approaches utilize similar conversation contexts observed in the training data explicitly."}, {"id": 37, "string": "Retrieval based models on the other hand treat the conversation context as a query and obtain a set of responses using information retrieval (IR) techniques from the conversation logs (Ji et al., 2014) ."}, {"id": 38, "string": "There has been further work where the responses are further ranked using a deep learning based model (Yan et al., 2016a,b; Qiu et al., 2017) ."}, {"id": 39, "string": "On the other hand of the spectrum, endto-end deep learning based rankers have also been employed to generate responses (Wu et al., 2017; Henderson et al., 2017) ."}, {"id": 40, "string": "Recently a framework has also been proposed that uses a discriminative dialog network that ranks the candidate responses received from a response generator network and trains both the networks in an end to end manner (Lu et al., 2017a) ."}, {"id": 41, "string": "In contrast to the above models, we use the input contexts as well as the retrieved responses for generating the final responses."}, {"id": 42, "string": "Contemporaneous to our work, a generative model for machine translation that employs retrieved translation pairs has also been proposed (Gu et al., 2017) ."}, {"id": 43, "string": "We note that while the underlying premise of both the papers remains the same, the difference lies in the mechanism of incorporating the retrieved data."}, {"id": 44, "string": "Exemplar Encoder Decoder Overview A conversation consists of a sequence of utterances."}, {"id": 45, "string": "At a given point in the conversation, the utterances expressed prior to it are jointly referred to as the context."}, {"id": 46, "string": "The utterance that immediately follows the context is referred to as the response."}, {"id": 47, "string": "As discussed in Section 1, given a conversational context, we wish to to generate a response by utilizing similar context-response pairs from the training data."}, {"id": 48, "string": "We retrieve a set of K exemplar contextresponse pairs from an inverted index created using the training data in an off-line manner."}, {"id": 49, "string": "The input and the retrieved context-response pairs are then fed to the Exemplar Encoder Decoder (EED) network."}, {"id": 50, "string": "A schematic illustration of the EED network is presented in Figure 1 ."}, {"id": 51, "string": "The EED encoder combines the input context and the retrieved responses to create a set of exemplar vectors."}, {"id": 52, "string": "The EED decoder then uses the exemplar vectors based on the similarity between the input context and retrieved contexts to generate a response."}, {"id": 53, "string": "We now provide details of each of these modules."}, {"id": 54, "string": "Retrieval of Similar Context-Response Pairs Given a large collection of conversations as (context, response) pairs, we index each response and its corresponding context in tf − idf vector space."}, {"id": 55, "string": "We further extract the last turn of a conversation and index it as an additional attribute of the context-response document pairs so as to allow directed queries based on it."}, {"id": 56, "string": "Given an input context c, we construct a query that weighs the last utterance in the context twice as much as the rest of the context and use it to retrieve the top-k similar context-response pairs from the index based on a BM25 (Robertson et al., 2009 ) retrieval model."}, {"id": 57, "string": "These retrieved pairs form our exemplar context-response pairs (c (k) , r (k) ), 1 ≤ k ≤ K. Exemplar Encoder Network Given the exemplar pairs (c (k) , r (k) ), 1 ≤ k ≤ K and an input context-response pair (c, r), we feed the input context c and the exemplar contexts c (1) , ."}, {"id": 58, "string": "."}, {"id": 59, "string": "."}, {"id": 60, "string": ", c (K) through an encoder to generate the embeddings as given below: c e = Encode c (c) c (k) e = Encode c (c (k) ), 1 ≤ k ≤ K Note that we do not constrain our choice of encoder and that any parametrized differentiable architecture can be used as the encoder to generate the above embeddings."}, {"id": 61, "string": "Similarly, we feed the exemplar responses r (1) , ."}, {"id": 62, "string": "."}, {"id": 63, "string": "."}, {"id": 64, "string": ", r (K) through a response encoder to generate response embeddings r (1) e , ."}, {"id": 65, "string": "."}, {"id": 66, "string": "."}, {"id": 67, "string": ", r (K) e , that is, r (k) e = Encode r (r (k) ), 1 ≤ k ≤ K (1) Next, we concatenate the exemplar response encoding r (c (k) , r (k) ), 1 ≤ k ≤ K. formation about similar responses along with the encoded input context representation."}, {"id": 68, "string": "e (k) = [c e ; r (k) e ], 1 ≤ k ≤ K (2) The exemplar vectors e (k) , 1 ≤ k ≤ K are further used by the decoder for generating the ground truth response as described in the next section."}, {"id": 69, "string": "Exemplar Decoder Network Recall that we want the exemplar responses to help generate the responses based on how similar the corresponding contexts are with the input context."}, {"id": 70, "string": "More similar an exemplar context is to the input context, higher should be its effect in generating the response."}, {"id": 71, "string": "To this end, we compute the similarity scores s (k) , 1 ≤ k ≤ K using the encodings computed in Section 3.3 as shown below."}, {"id": 72, "string": "s (k) = exp(c T e c (k) e ) K l=1 exp(c T e c (l) e ) (3) Next, each exemplar vector e (k) computed in Section 3.3, is fed to a decoder, where the decoder is responsible for predicting the ground truth response from the exemplar vector."}, {"id": 73, "string": "Let p dec (r|e (k) ) be the distribution of generating the ground truth response given the exemplar embedding."}, {"id": 74, "string": "The objective function to be maximized, is expressed as a function of the scores s (k) , the decoding distribution p dec and the exemplar vectors e (k) as shown below: ll = K k=1 s (k) log p dec (r|e (k) ) (4) Note that we weigh the contribution of each exemplar vector to the final objective based on how similar the corresponding context is to the input context."}, {"id": 75, "string": "Moreover, the similarities are differentiable function of the input and hence, trainable by back propagation."}, {"id": 76, "string": "The model should learn to assign higher similarities to the exemplar contexts, whose responses are helpful for generating the correct response."}, {"id": 77, "string": "The model description uses encoder and decoder networks that can be implemented using any differentiable parametrized architecture."}, {"id": 78, "string": "We discuss our choices for the encoders and decoder in the next section."}, {"id": 79, "string": "The Encoders and Decoder In this section, we discuss the various encoders and the decoder used by our model."}, {"id": 80, "string": "The conversation context consists of an ordered sequence of utterances and each utterance can be further viewed as a sequence of words."}, {"id": 81, "string": "Thus, context can be viewed as having multiple levels of hierarchies-at the word level and then at the utterance (sentence) level."}, {"id": 82, "string": "We use a hierarchical recurrent encoder-popularly employed as part of the HRED framework for generating responses and query suggestions (Sordoni et al., 2015a; Serban et al., , 2017b ."}, {"id": 83, "string": "The word-level encoder encodes the vector representations of words of an utterance to an utterance vector."}, {"id": 84, "string": "Finally, the utterance-level encoder encodes the utterance vectors to a context vector."}, {"id": 85, "string": "Let (u 1 , ."}, {"id": 86, "string": "."}, {"id": 87, "string": "."}, {"id": 88, "string": ", u N ) be the utterances present in the context."}, {"id": 89, "string": "Furthermore, let (w n1 , ."}, {"id": 90, "string": "."}, {"id": 91, "string": "."}, {"id": 92, "string": ", w nMn ) be the words present in the n th utterance for 1 ≤ n ≤ N ."}, {"id": 93, "string": "For each word in the utterance, we retrieve its corresponding embedding from an embedding matrix."}, {"id": 94, "string": "The word embedding for w nm will be denoted as w enm ."}, {"id": 95, "string": "The encoding of the n th utterance can be computed iteratively as follows: h nm = f 1 (h nm−1 , w enm ), 1 ≤ m ≤ M n (5) We use an LSTM (Hochreiter and Schmidhuber, 1997) to model the above equation."}, {"id": 96, "string": "The last hidden state h nMn is referred to as the utterance encoding and will be denoted as h n ."}, {"id": 97, "string": "The utterance-level encoder takes the utterance encodings h 1 , ."}, {"id": 98, "string": "."}, {"id": 99, "string": "."}, {"id": 100, "string": ", h N as input and generates the encoding for the context as follows: c en = f 2 (c en−1 , h n ), 1 ≤ n ≤ N (6) Again, we use an LSTM to model the above equation."}, {"id": 101, "string": "The last hidden state c eN is referred to as the context embedding and is denoted as c e ."}, {"id": 102, "string": "A single level LSTM is used for embedding the response."}, {"id": 103, "string": "In particular, let (w 1 , ."}, {"id": 104, "string": "."}, {"id": 105, "string": "."}, {"id": 106, "string": ", w M ) be the sequence of words present in the response."}, {"id": 107, "string": "For each word w, we retrieve the corresponding word embedding w e from a word embedding matrix."}, {"id": 108, "string": "The response embedding is computed from the word embeddings iteratively as follows: r em = g(r em−1 , w em ), 1 ≤ m ≤ M (7) Again, we use an LSTM to model the above equation."}, {"id": 109, "string": "The last hidden state r em is referred to as the response embedding and is denoted as r e ."}, {"id": 110, "string": "(Lowe et al., 2015) , where |V | represents the size of vocabulary."}, {"id": 111, "string": "Tech Support Dataset We also conduct our experiments on a large technical support dataset with more than 127K conversations."}, {"id": 112, "string": "We will refer to this dataset as Tech Support dataset in the rest of the paper."}, {"id": 113, "string": "Tech Support dataset contains conversations pertaining to an employee seeking assistance from an agent (technical support) -to resolve problems such as password reset, software installation/licensing, and wireless access."}, {"id": 114, "string": "In contrast to Ubuntu dataset, this dataset has clearly two distinct users -employee and agent."}, {"id": 115, "string": "In our experiments we model the agent responses only."}, {"id": 116, "string": "For each conversation in the tech support data, we sample context and response pairs to create a dataset similar to the Ubuntu dataset format."}, {"id": 117, "string": "Note that multiple context-response pairs can be generated from a single conversation."}, {"id": 118, "string": "For each conversation, we sample 25% of the possible contextresponse pairs."}, {"id": 119, "string": "We create validation pairs by selecting 5000 conversations randomly and sampling context response pairs)."}, {"id": 120, "string": "Similarly, we create test pairs from a different subset of 5000 conversations."}, {"id": 121, "string": "The remaining conversations are used to create training context-response pairs."}, {"id": 122, "string": "Model and Training Details The EED and HRED models were implemented using the PyTorch framework (Paszke et al., 2017) ."}, {"id": 123, "string": "We initialize the word embedding matrix as well as the weights of context and response encoders from the standard normal distribution with mean 0 and variance 0.01."}, {"id": 124, "string": "The biases of the encoders and decoder are initialized with 0."}, {"id": 125, "string": "The word embedding matrix is shared by the context and response encoders."}, {"id": 126, "string": "For Ubuntu dataset, we use a word embedding size of 600, whereas the size of the hidden layers of the LSTMs in context and response encoders and the decoder is fixed at 1200."}, {"id": 127, "string": "For Tech support dataset, we use a word embedding size of 128."}, {"id": 128, "string": "Furthermore, the size of the hidden layers of the multiple LSTMs in context and response encoders and the decoder is fixed at 256."}, {"id": 129, "string": "A smaller embedding size was chosen for the Tech Support dataset since we observed much less diversity in the responses of the Tech Support dataset as compared to Ubuntu dataset."}, {"id": 130, "string": "Two different encoders are used for encoding the input context (not shown in Figure 1 for simplicity)."}, {"id": 131, "string": "The output of the first context encoder is concatenated with the exemplar response vectors to generate exemplar vectors as detailed in Section 3.3."}, {"id": 132, "string": "The output of the second context encoder is used to compute the scoring function as detailed in Section 3.4."}, {"id": 133, "string": "For each input context, we retrieve 5 similar context-response pairs for Ubuntu dataset and 3 context-response pairs for Tech support dataset using the tf-idf mechanism discussed in Section 3.2."}, {"id": 134, "string": "We use the Adam optimizer (Kingma and Ba, 2014) with a learning rate of 1e − 4 for training the model."}, {"id": 135, "string": "A batch size of 20 samples was used during training."}, {"id": 136, "string": "In order to prevent overfitting, we use early stopping with log-likelihood on validation set as the stopping criteria."}, {"id": 137, "string": "In order to generate the samples using the proposed EED model, we identify the exemplar context that is most similar to the input context based on the learnt scoring function discussed in Section 3.4."}, {"id": 138, "string": "The corresponding exemplar vector is fed to the decoder to generate the response."}, {"id": 139, "string": "The samples are generated using a beam search with width 5."}, {"id": 140, "string": "The average per-word log-likelihood is used to score the beams."}, {"id": 141, "string": "Results & Evaluation Quantitative Evaluation Activity and Entity Metrics A traditional and popular metric used for comparing a generated sentence with a ground truth sentence is BLEU (Papineni et al., 2002) and is frequently used to evaluate machine translation."}, {"id": 142, "string": "The metric has also been applied to compute scores for predicted responses in conversations, but it has been found to be less indicative of actual performance (Liu et al., 2016; Sordoni et al., 2015a; Serban et al., 2017a) , as it is extremely sensitive to the exact words in the ground truth response, and gives equal importance to stop words/phrases and informative words."}, {"id": 143, "string": "Serban et al."}, {"id": 144, "string": "(2017a) recently proposed a new set of metrics for evaluating dialogue responses for the Ubuntu corpus."}, {"id": 145, "string": "It is important to highlight that these metrics have been specifically designed for the Ubuntu corpus and evaluate a generated response with the ground truth response by comparing the coarse level representation of an utterance (such as entities, activities, Ubuntu OS commands)."}, {"id": 146, "string": "Here is a brief description of each metric: • Activity: Activity metric compares the activities present in a predicted response with the ground truth response."}, {"id": 147, "string": "Activity can be thought of as a verb."}, {"id": 148, "string": "Thus, all the verbs in a response are mapped to a set of manually identified list of 192 verbs."}, {"id": 149, "string": "• Entity: This compares the technical entities that overlap with the ground truth response."}, {"id": 150, "string": "A total of 3115 technical entities is identified using public resources such as Debian package manager APT."}, {"id": 151, "string": "• Tense: This measure compares the time tense of ground truth with predicted response."}, {"id": 152, "string": "• Cmd: This metric computes accuracy by comparing commands identified in ground truth utterance with a predicted response."}, {"id": 153, "string": "Table 4 compares our model with other recent generative models (Serban et al., 2017a ) -LSTM (Shang et al., 2015) , HRED  & VHRED (Serban et al., 2017b) .We do not compare our model with Multi-Resolution RNN (MRNN) (Serban et al., 2017a) , as MRNN explicitly utilizes the activities and entities during the generation process."}, {"id": 154, "string": "In contrast, the proposed EED model and the other models used for comparison are agnostic to the activity and entity information."}, {"id": 155, "string": "We use the standard script 3 to compute the metrics."}, {"id": 156, "string": "The EED model scores better than generative models on almost all of the metrics, indicating that we generate more informative responses than other state-of-the-art generative based approaches for Ubuntu corpus."}, {"id": 157, "string": "The results show that responses associated with similar contexts may contain the activities and entities present in the ground truth response, and thus help in response generation."}, {"id": 158, "string": "This is discussed further in Section 5.2."}, {"id": 159, "string": "Additionally, we compared our proposed EED with a retrieval only baseline."}, {"id": 160, "string": "The retrieval baseline achieves an activity F1 score of 4.23 and entity F1 score of 2.72 compared to 4.87 and 2.99 respectively achieved by our method on the Ubuntu corpus."}, {"id": 161, "string": "The Tech Support dataset is not evaluated using the above metrics, since activity and entity information is not available for this dataset."}, {"id": 162, "string": "3 https://github.com/julianser/Ubuntu-Multiresolution-Tools/blob/master/ActEntRepresentation/eval file.sh Embedding Metrics Embedding metrics (Lowe et al., 2017) were proposed as an alternative to word by word comparison metrics such as BLEU."}, {"id": 163, "string": "We use pre-trained Google news word embeddings 4 similar to Serban et al."}, {"id": 164, "string": "(2017b) , for easy reproducibility as these metrics are sensitive to the word embeddings used."}, {"id": 165, "string": "The three metrics of interest utilize the word vectors in ground truth response and a predicted response and are discussed below: • Average: Average word embedding vectors are computed for the candidate response and ground truth."}, {"id": 166, "string": "The cosine similarity is computed between these averaged embeddings."}, {"id": 167, "string": "High similarity gives as indication that ground truth and predicted response have similar words."}, {"id": 168, "string": "• Greedy: Greedy matching score finds the most similar word in predicted response to ground truth response using cosine similarity."}, {"id": 169, "string": "• Extrema: Vector extrema score computes the maximum or minimum value of each dimension of word vectors in candidate response and ground truth."}, {"id": 170, "string": "Of these, the embedding average metric is the most reflective of performance for our setup."}, {"id": 171, "string": "The extrema representation, for instance, is very sensitive to text length and becomes ineffective beyond single length sentences (Forgues et al., 2014) ."}, {"id": 172, "string": "We use the publicly available script 5 for all our computations."}, {"id": 173, "string": "As the test outputs for HRED are not available for Technical Support dataset, we use our Table 7 : Contexts, exemplar responses and responses generated by HRED, VHRED and the proposed EED model."}, {"id": 174, "string": "We use the published responses for HRED and VHRED."}, {"id": 175, "string": "GT indicates the ground truth response."}, {"id": 176, "string": "The change of turn is indicated by →."}, {"id": 177, "string": "The highlighted words in bold are common between the exemplar response and the response predicted by EED."}, {"id": 178, "string": "own implementation of HRED."}, {"id": 179, "string": "Table 5 compares our model with HRED, and depicts that our model scores better on all metrics for Technical Support dataset, and on majority of the metrics for Ubuntu dataset."}, {"id": 180, "string": "We note that the improvement achieved by the EED model on activity and entity metrics are much more significant than those on embedding metrics."}, {"id": 181, "string": "This suggests that the EED model is better able to capture the specific information (objects and actions) present in the conversations."}, {"id": 182, "string": "Finally, we evaluate the diversity of the generated responses for EED against HRED by counting the number of unique tokens, token-pairs and token-triplets present in the generated responses on Ubuntu and Tech Support dataset."}, {"id": 183, "string": "The results are shown in Table 6 ."}, {"id": 184, "string": "As can be observed, the responses in EED have a larger number of distinct tokens, token-pairs and token-triplets than HRED, and hence, are arguably more diverse."}, {"id": 185, "string": "Table 7 presents the responses generated by HRED, VHRED and the proposed EED for a few selected contexts along with the corresponding similar exemplar responses."}, {"id": 186, "string": "As can be observed from the table, the responses generated by EED tend to be more specific to the input context as compared to the responses of HRED and VHRED."}, {"id": 187, "string": "For example, in conversations 1 and 2 we find that both HRED and VHRED generate simple generic responses whereas EED generates responses with additional information such as the type of disk partition used or a command not working."}, {"id": 188, "string": "This is also confirmed by the quantitative results obtained using activity and entity metrics in the previous section."}, {"id": 189, "string": "We further observe that the exemplar responses contain informative words that are utilized by the EED model for generating the responses as highlighted in Table 7 ."}, {"id": 190, "string": "Qualitative Evaluation Conclusions In this work, we propose a deep learning method, Exemplar Encoder Decoder (EED), that given a conversation context uses similar contexts and corresponding responses from training data for generating a response."}, {"id": 191, "string": "We show that by utilizing this information the system is able to outperform state of the art generative models on publicly available Ubuntu dataset."}, {"id": 192, "string": "We further show improvements achieved by the proposed method on a large collection of technical support conversations."}, {"id": 193, "string": "While in this work, we apply the exemplar encoder decoder network on conversational task, the method is generic and could be used with other tasks such as question answering and machine translation."}, {"id": 194, "string": "In our future work we plan to extend the proposed method to these other applications."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 26}, {"section": "Related Work", "n": "2", "start": 27, "end": 43}, {"section": "Overview", "n": "3.1", "start": 44, "end": 53}, {"section": "Retrieval of Similar Context-Response Pairs", "n": "3.2", "start": 54, "end": 56}, {"section": "Exemplar Encoder Network", "n": "3.3", "start": 57, "end": 68}, {"section": "Exemplar Decoder Network", "n": "3.4", "start": 69, "end": 78}, {"section": "The Encoders and Decoder", "n": "3.5", "start": 79, "end": 110}, {"section": "Tech Support Dataset", "n": "4.1.2", "start": 111, "end": 121}, {"section": "Model and Training Details", "n": "4.2", "start": 122, "end": 140}, {"section": "Activity and Entity Metrics", "n": "5.1.1", "start": 141, "end": 161}, {"section": "Embedding Metrics", "n": "5.1.2", "start": 162, "end": 189}, {"section": "Conclusions", "n": "6", "start": 190, "end": 194}], "figures": [{"filename": "../figure/image/1325-Table3-1.png", "caption": "Table 3: Dataset statistics for Tech Support dataset.", "page": 5, "bbox": {"x1": 115.67999999999999, "x2": 246.23999999999998, "y1": 103.2, "y2": 216.95999999999998}}, {"filename": "../figure/image/1325-Table1-1.png", "caption": "Table 1: Sample input contexts and corresponding gold responses from Ubuntu validation dataset along with similar contexts seen in training data and their corresponding responses. We refer to training data as training data for the Ubuntu corpus. The highlighted words are common between the gold response and the exemplar response.", "page": 1, "bbox": {"x1": 72.0, "x2": 532.3199999999999, "y1": 62.879999999999995, "y2": 210.23999999999998}}, {"filename": "../figure/image/1325-Table4-1.png", "caption": "Table 4: Activity & Entity metrics for the Ubuntu corpus. LSTM*, HRED* & VHRED* as reported by Serban et al. (2017a).", "page": 6, "bbox": {"x1": 139.68, "x2": 457.44, "y1": 64.8, "y2": 168.0}}, {"filename": "../figure/image/1325-Table6-1.png", "caption": "Table 6: The number of unique tokens, token-pairs and token-triplets for Ubuntu and Technical Support Corpus.", "page": 7, "bbox": {"x1": 104.64, "x2": 493.44, "y1": 164.64, "y2": 228.0}}, {"filename": "../figure/image/1325-Table7-1.png", "caption": "Table 7: Contexts, exemplar responses and responses generated by HRED, VHRED and the proposed EED model. We use the published responses for HRED and VHRED. GT indicates the ground truth response. The change of turn is indicated by →. The highlighted words in bold are common between the exemplar response and the response predicted by EED.", "page": 7, "bbox": {"x1": 72.0, "x2": 547.1999999999999, "y1": 276.48, "y2": 633.12}}, {"filename": "../figure/image/1325-Table5-1.png", "caption": "Table 5: Embedding Metrics (Lowe et al., 2015) for Ubuntu and Technical Support Corpus.", "page": 7, "bbox": {"x1": 122.88, "x2": 474.24, "y1": 64.8, "y2": 128.16}}, {"filename": "../figure/image/1325-Figure1-1.png", "caption": "Figure 1: A schematic illustration of the EED network. The input context-response pair is (c, r), while the exemplar context-response pairs are (c(k), r(k)), 1 ≤ k ≤ K.", "page": 3, "bbox": {"x1": 93.6, "x2": 503.03999999999996, "y1": 61.44, "y2": 325.92}}, {"filename": "../figure/image/1325-Table2-1.png", "caption": "Table 2: Dataset statistics for Ubuntu Dialog Corpus v2.0 (Lowe et al., 2015), where |V | represents the size of vocabulary.", "page": 4, "bbox": {"x1": 351.84, "x2": 481.44, "y1": 250.07999999999998, "y2": 336.96}}]}