{"title": "Improving Knowledge Graph Embedding Using Simple Constraints", "abstract": "Embedding knowledge graphs (KGs) into continuous vector spaces is a focus of current research. Early works performed this task via simple models developed over KG triples. Recent attempts focused on either designing more complicated triple scoring models, or incorporating extra information beyond triples. This paper, by contrast, investigates the potential of using very simple constraints to improve KG embedding. We examine non-negativity constraints on entity representations and approximate entailment constraints on relation representations. The former help to learn compact and interpretable representations for entities. The latter further encode regularities of logical entailment between relations into their distributed representations. These constraints impose prior beliefs upon the structure of the embedding space, without negative impacts on efficiency or scalability. Evaluation on WordNet, Freebase, and DBpedia shows that our approach is simple yet surprisingly effective, significantly and consistently outperforming competitive baselines. The constraints imposed indeed improve model interpretability, leading to a substantially increased structuring of the embedding space. Code and data are available at https://github.com/i ieir-km/ComplEx-NNE_AER.", "text": [{"id": 0, "string": "Introduction The past decade has witnessed great achievements in building web-scale knowledge graphs (KGs), e.g., Freebase (Bollacker et al., 2008) , DBpedia (Lehmann et al., 2015) , and Google's Knowledge * Corresponding author: Quan Wang."}, {"id": 1, "string": "Vault (Dong et al., 2014) ."}, {"id": 2, "string": "A typical KG is a multirelational graph composed of entities as nodes and relations as different types of edges, where each edge is represented as a triple of the form (head entity, relation, tail entity)."}, {"id": 3, "string": "Such KGs contain rich structured knowledge, and have proven useful for many NLP tasks (Wasserman-Pritsker et al., 2015; Hoffmann et al., 2011; Yang and Mitchell, 2017) ."}, {"id": 4, "string": "Recently, the concept of knowledge graph embedding has been presented and quickly become a hot research topic."}, {"id": 5, "string": "The key idea there is to embed components of a KG (i.e., entities and relations) into a continuous vector space, so as to simplify manipulation while preserving the inherent structure of the KG."}, {"id": 6, "string": "Early works on this topic learned such vectorial representations (i.e., embeddings) via just simple models developed over KG triples (Bordes et al., 2011 (Bordes et al., , 2013 Jenatton et al., 2012; Nickel et al., 2011) ."}, {"id": 7, "string": "Recent attempts focused on either designing more complicated triple scoring models (Socher et al., 2013; Bordes et al., 2014; Wang et al., 2014; Lin et al., 2015b; Xiao et al., 2016; Nickel et al., 2016b; Trouillon et al., 2016; Liu et al., 2017) , or incorporating extra information beyond KG triples (Chang et al., 2014; Zhong et al., 2015; Lin et al., 2015a; Neelakantan et al., 2015; Luo et al., 2015b; Xie et al., 2016a,b; Xiao et al., 2017) ."}, {"id": 8, "string": "See (Wang et al., 2017) for a thorough review."}, {"id": 9, "string": "This paper, by contrast, investigates the potential of using very simple constraints to improve the KG embedding task."}, {"id": 10, "string": "Specifically, we examine two types of constraints: (i) non-negativity constraints on entity representations and (ii) approximate entailment constraints over relation representations."}, {"id": 11, "string": "By using the former, we learn compact representations for entities, which would naturally induce sparsity and interpretability (Murphy et al., 2012) ."}, {"id": 12, "string": "By using the latter, we further encode regularities of logical entailment between relations into their distributed representations, which might be advantageous to downstream tasks like link prediction and relation extraction (Rocktäschel et al., 2015; Guo et al., 2016) ."}, {"id": 13, "string": "These constraints impose prior beliefs upon the structure of the embedding space, and will help us to learn more predictive embeddings, without significantly increasing the space or time complexity."}, {"id": 14, "string": "Our work has some similarities to those which integrate logical background knowledge into KG embedding (Rocktäschel et al., 2015; Guo et al., 2016 Guo et al., , 2018 ."}, {"id": 15, "string": "Most of such works, however, need grounding of first-order logic rules."}, {"id": 16, "string": "The grounding process could be time and space inefficient especially for complicated rules."}, {"id": 17, "string": "To avoid grounding, Demeester et al."}, {"id": 18, "string": "(2016) tried to model rules using only relation representations."}, {"id": 19, "string": "But their work creates vector representations for entity pairs rather than individual entities, and hence fails to handle unpaired entities."}, {"id": 20, "string": "Moreover, it can only incorporate strict, hard rules which usually require extensive manual effort to create."}, {"id": 21, "string": "Minervini et al."}, {"id": 22, "string": "(2017b) proposed adversarial training which can integrate first-order logic rules without grounding."}, {"id": 23, "string": "But their work, again, focuses on strict, hard rules."}, {"id": 24, "string": "Minervini et al."}, {"id": 25, "string": "(2017a) tried to handle uncertainty of rules."}, {"id": 26, "string": "But their work assigns to different rules a same confidence level, and considers only equivalence and inversion of relations, which might not always be available in a given KG."}, {"id": 27, "string": "Our approach differs from the aforementioned works in that: (i) it imposes constraints directly on entity and relation representations without grounding, and can easily scale up to large KGs; (ii) the constraints, i.e., non-negativity and approximate entailment derived automatically from statistical properties, are quite universal, requiring no manual effort and applicable to almost all KGs; (iii) it learns an individual representation for each entity, and can successfully make predictions between unpaired entities."}, {"id": 28, "string": "We evaluate our approach on publicly available KGs of WordNet, Freebase, and DBpedia as well."}, {"id": 29, "string": "Experimental results indicate that our approach is simple yet surprisingly effective, achieving significant and consistent improvements over competitive baselines, but without negative impacts on efficiency or scalability."}, {"id": 30, "string": "The non-negativity and approximate entailment constraints indeed improve model interpretability, resulting in a substantially increased structuring of the embedding space."}, {"id": 31, "string": "The remainder of this paper is organized as follows."}, {"id": 32, "string": "We first review related work in Section 2, and then detail our approach in Section 3."}, {"id": 33, "string": "Experiments and results are reported in Section 4, followed by concluding remarks in Section 5."}, {"id": 34, "string": "Related Work Recent years have seen growing interest in learning distributed representations for entities and relations in KGs, a.k.a."}, {"id": 35, "string": "KG embedding."}, {"id": 36, "string": "Early works on this topic devised very simple models to learn such distributed representations, solely on the basis of triples observed in a given KG, e.g., TransE which takes relations as translating operations between head and tail entities (Bordes et al., 2013) , and RESCAL which models triples through bilinear operations over entity and relation representations (Nickel et al., 2011) ."}, {"id": 37, "string": "Later attempts roughly fell into two groups: (i) those which tried to design more complicated triple scoring models, e.g., the TransE extensions (Wang et al., 2014; Lin et al., 2015b; Ji et al., 2015) , the RESCAL extensions (Yang et al., 2015; Nickel et al., 2016b; Trouillon et al., 2016; Liu et al., 2017) , and the (deep) neural network models (Socher et al., 2013; Bordes et al., 2014; Shi and Weninger, 2017; Schlichtkrull et al., 2017; Dettmers et al., 2018) ; (ii) those which tried to integrate extra information beyond triples, e.g., entity types Xie et al., 2016b) , relation paths (Neelakantan et al., 2015; Lin et al., 2015a) , and textual descriptions (Xie et al., 2016a; Xiao et al., 2017) ."}, {"id": 38, "string": "Please refer to (Nickel et al., 2016a; Wang et al., 2017) for a thorough review of these techniques."}, {"id": 39, "string": "In this paper, we show the potential of using very simple constraints (i.e., nonnegativity constraints and approximate entailment constraints) to improve KG embedding, without significantly increasing the model complexity."}, {"id": 40, "string": "A line of research related to ours is KG embedding with logical background knowledge incorporated (Rocktäschel et al., 2015; Guo et al., 2016 Guo et al., , 2018 ."}, {"id": 41, "string": "But most of such works require grounding of first-order logic rules, which is time and space inefficient especially for complicated rules."}, {"id": 42, "string": "To avoid grounding, Demeester et al."}, {"id": 43, "string": "Both works, however, can only handle strict, hard rules which usually require extensive effort to create."}, {"id": 44, "string": "Minervini et al."}, {"id": 45, "string": "(2017a) tried to handle uncertainty of background knowledge."}, {"id": 46, "string": "But their work considers only equivalence and inversion between relations, which might not always be available in a given KG."}, {"id": 47, "string": "Our approach, in contrast, imposes constraints directly on entity and relation representations without grounding."}, {"id": 48, "string": "And the constraints used are quite universal, requiring no manual effort and applicable to almost all KGs."}, {"id": 49, "string": "Non-negativity has long been a subject studied in various research fields."}, {"id": 50, "string": "Previous studies reveal that non-negativity could naturally induce sparsity and, in most cases, better interpretability (Lee and Seung, 1999) ."}, {"id": 51, "string": "In many NLP-related tasks, nonnegativity constraints are introduced to learn more interpretable word representations, which capture the notion of semantic composition (Murphy et al., 2012; Luo et al., 2015a; Fyshe et al., 2015) ."}, {"id": 52, "string": "In this paper, we investigate the ability of non-negativity constraints to learn more accurate KG embeddings with good interpretability."}, {"id": 53, "string": "Our Approach This section presents our approach."}, {"id": 54, "string": "We first introduce a basic embedding technique to model triples in a given KG ( § 3.1)."}, {"id": 55, "string": "Then we discuss the nonnegativity constraints over entity representations ( § 3.2) and the approximate entailment constraints over relation representations ( § 3.3) ."}, {"id": 56, "string": "And finally we present the overall model ( § 3.4)."}, {"id": 57, "string": "A Basic Embedding Model We choose ComplEx (Trouillon et al., 2016) as our basic embedding model, since it is simple and efficient, achieving state-of-the-art predictive performance."}, {"id": 58, "string": "Specifically, suppose we are given a KG containing a set of triples O = {(e i , r k , e j )}, with each triple composed of two entities e i , e j ∈ E and their relation r k ∈ R. Here E is the set of entities and R the set of relations."}, {"id": 59, "string": "ComplEx then represents each entity e ∈ E as a complex-valued vector e ∈ C d , and each relation r ∈ R a complex-valued vector r ∈ C d , where d is the dimensionality of the embedding space."}, {"id": 60, "string": "Each x ∈ C d consists of a real vector component Re(x) and an imaginary vector component Im(x), i.e., x = Re(x) + iIm(x)."}, {"id": 61, "string": "For any given triple (e i , r k , e j ) ∈ E × R × E, a multilinear dot product is used to score that triple, i.e., φ(e i , r k , e j ) Re( e i , r k ,ē j ) Re( [e i ] [r k ] [ē j ] ), (1) where e i , r k , e j ∈ C d are the vectorial representations associated with e i , r k , e j , respectively;ē j is the conjugate of e j ; [·] is the -th entry of a vector; and Re(·) means taking the real part of a complex value."}, {"id": 62, "string": "Triples with higher φ(·, ·, ·) scores are more likely to be true."}, {"id": 63, "string": "Owing to the asymmetry of this scoring function, i.e., φ(e i , r k , e j ) = φ(e j , r k , e i ), ComplEx can effectively handle asymmetric relations (Trouillon et al., 2016) ."}, {"id": 64, "string": "Non-negativity of Entity Representations On top of the basic ComplEx model, we further require entities to have non-negative (and bounded) vectorial representations."}, {"id": 65, "string": "In fact, these distributed representations can be taken as feature vectors for entities, with latent semantics encoded in different dimensions."}, {"id": 66, "string": "In ComplEx, as well as most (if not all) previous approaches, there is no limitation on the range of such feature values, which means that both positive and negative properties of an entity can be encoded in its representation."}, {"id": 67, "string": "However, as pointed out by Murphy et al."}, {"id": 68, "string": "(2012) , it would be uneconomical to store all negative properties of an entity or a concept."}, {"id": 69, "string": "For instance, to describe cats (a concept), people usually use positive properties such as cats are mammals, cats eat fishes, and cats have four legs, but hardly ever negative properties like cats are not vehicles, cats do not have wheels, or cats are not used for communication."}, {"id": 70, "string": "Based on such intuition, this paper proposes to impose non-negativity constraints on entity representations, by using which only positive properties will be stored in these representations."}, {"id": 71, "string": "To better compare different entities on the same scale, we further require entity representations to stay within the hypercube of [0, 1] d , as approximately Boolean embeddings (Kruszewski et al., 2015) , i.e., 0 ≤ Re(e), Im(e) ≤ 1, ∀e ∈ E, (2) where e ∈ C d is the representation for entity e ∈ E, with its real and imaginary components denoted by Re(e), Im(e) ∈ R d ; 0 and 1 are d-dimensional vectors with all their entries being 0 or 1; and ≥, ≤ , = denote the entry-wise comparisons throughout the paper whenever applicable."}, {"id": 72, "string": "As shown by Lee and Seung (1999) , non-negativity, in most cases, will further induce sparsity and interpretability."}, {"id": 73, "string": "Approximate Entailment for Relations Besides the non-negativity constraints over entity representations, we also study approximate entailment constraints over relation representations."}, {"id": 74, "string": "By approximate entailment, we mean an ordered pair of relations that the former approximately entails the latter, e.g., BornInCountry and Nationality, stating that a person born in a country is very likely, but not necessarily, to have a nationality of that country."}, {"id": 75, "string": "Each such relation pair is associated with a weight to indicate the confidence level of entailment."}, {"id": 76, "string": "A larger weight stands for a higher level of confidence."}, {"id": 77, "string": "We denote by r p λ − → r q the approximate entailment between relations r p and r q , with confidence level λ."}, {"id": 78, "string": "This kind of entailment can be derived automatically from a KG by modern rule mining systems (Galárraga et al., 2015) ."}, {"id": 79, "string": "Let T denote the set of all such approximate entailments derived beforehand."}, {"id": 80, "string": "Before diving into approximate entailment, we first explore the modeling of strict entailment, i.e., entailment with infinite confidence level λ = +∞."}, {"id": 81, "string": "The strict entailment r p → r q states that if relation r p holds then relation r q must also hold."}, {"id": 82, "string": "This entailment can be roughly modelled by requiring φ(e i , r p , e j ) ≤ φ(e i , r q , e j ), ∀e i , e j ∈ E, (3) where φ(·, ·, ·) is the score for a triple predicted by the embedding model, defined by Eq."}, {"id": 83, "string": "(1)."}, {"id": 84, "string": "Eq."}, {"id": 85, "string": "(3) can be interpreted as follows: for any two entities e i and e j , if (e i , r p , e j ) is a true fact with a high score φ(e i , r p , e j ), then the triple (e i , r q , e j ) with an even higher score should also be predicted as a true fact by the embedding model."}, {"id": 86, "string": "Note that given the non-negativity constraints defined by Eq."}, {"id": 87, "string": "(2), a sufficient condition for Eq."}, {"id": 88, "string": "(3) to hold, is to further impose Re(r p ) ≤ Re(r q ), Im(r p ) = Im(r q ), (4) where r p and r q are the complex-valued representations for r p and r q respectively, with the real and imaginary components denoted by Re(·), Im(·) ∈ R d ."}, {"id": 89, "string": "That means, when the constraints of Eq."}, {"id": 90, "string": "(4) (along with those of Eq."}, {"id": 91, "string": "(2)) are satisfied, the requirement of Eq."}, {"id": 92, "string": "(3) (or in other words r p → r q ) will always hold."}, {"id": 93, "string": "We provide a proof of sufficiency as supplementary material."}, {"id": 94, "string": "Next we examine the modeling of approximate entailment."}, {"id": 95, "string": "To this end, we further introduce the confidence level λ and allow slackness in Eq."}, {"id": 96, "string": "(4), which yields λ Re(r p ) − Re(r q ) ≤ α, (5) λ Im(r p ) − Im(r q ) 2 ≤ β."}, {"id": 97, "string": "(6) Here α, β ≥ 0 are slack variables, and (·) 2 means an entry-wise operation."}, {"id": 98, "string": "Entailments with higher confidence levels show less tolerance for violating the constraints."}, {"id": 99, "string": "When λ = +∞, Eqs."}, {"id": 100, "string": "(5) -(6) degenerate to Eq."}, {"id": 101, "string": "(4)."}, {"id": 102, "string": "The above analysis indicates that our approach can model entailment simply by imposing constraints over relation representations, without traversing all possible (e i , e j ) entity pairs (i.e., grounding)."}, {"id": 103, "string": "In addition, different confidence levels are encoded in the constraints, making our approach moderately tolerant of uncertainty."}, {"id": 104, "string": "The Overall Model Finally, we combine together the basic embedding model of ComplEx, the non-negativity constraints on entity representations, and the approximate entailment constraints over relation representations."}, {"id": 105, "string": "The overall model is presented as follows: min Θ,{α,β} D + ∪D − log 1 + exp(−y ijk φ(e i , r k , e j )) + µ T 1 (α + β) + η Θ 2 2 , s.t."}, {"id": 106, "string": "λ Re(r p ) − Re(r q ) ≤ α, λ Im(r p ) − Im(r q ) 2 ≤ β, α, β ≥ 0, ∀r p λ − → r q ∈ T , 0 ≤ Re(e), Im(e) ≤ 1, ∀e ∈ E. (7) Here, Θ {e : e ∈ E} ∪ {r : r ∈ R} is the set of all entity and relation representations; D + and D − are the sets of positive and negative training triples respectively; a positive triple is directly observed in the KG, i.e., (e i , r k , e j ) ∈ O; a negative triple can be generated by randomly corrupting the head or the tail entity of a positive triple, i.e., (e i , r k , e j ) or (e i , r k , e j ); y ijk = ±1 is the label (positive or negative) of triple (e i , r k , e j )."}, {"id": 107, "string": "In this optimization, the first term of the objective function is a typical logistic loss, which enforces triples to have scores close to their labels."}, {"id": 108, "string": "The second term is the sum of slack variables in the approximate entailment constraints, with a penalty coefficient µ ≥ 0."}, {"id": 109, "string": "The motivation is, although we allow slackness in those constraints we hope the total slackness to be small, so that the constraints can be better satisfied."}, {"id": 110, "string": "The last term is L 2 regularization to avoid over-fitting, and η ≥ 0 is the regularization coefficient."}, {"id": 111, "string": "To solve this optimization problem, the approximate entailment constraints (as well as the corresponding slack variables) are converted into penalty terms and added to the objective function, while the non-negativity constraints remain as they are."}, {"id": 112, "string": "As such, the optimization problem of Eq."}, {"id": 113, "string": "(7) can be rewritten as: min Θ D + ∪D − log 1 + exp(−y ijk φ(e i , r k , e j )) + µ T λ1 Re(r p )−Re(r q ) + + µ T λ1 Im(r p )−Im(r q ) 2 + η Θ 2 2 , s.t."}, {"id": 114, "string": "0 ≤ Re(e), Im(e) ≤ 1, ∀e ∈ E, (8) where [x] + = max(0, x) with max(·, ·) being an entry-wise operation."}, {"id": 115, "string": "The equivalence between Eq."}, {"id": 116, "string": "(7) and Eq."}, {"id": 117, "string": "(8) is shown in the supplementary material."}, {"id": 118, "string": "We use SGD in mini-batch mode as our optimizer, with AdaGrad (Duchi et al., 2011) to tune the learning rate."}, {"id": 119, "string": "After each gradient descent step, we project (by truncation) real and imaginary components of entity representations into the hypercube of [0, 1] d , to satisfy the non-negativity constraints."}, {"id": 120, "string": "While favouring a better structuring of the embedding space, imposing the additional constraints will not substantially increase model complexity."}, {"id": 121, "string": "Our approach has a space complexity of O(nd + md), which is the same as that of ComplEx."}, {"id": 122, "string": "Here, n is the number of entities, m the number of relations, and O(nd + md) to store a d-dimensional complex-valued vector for each entity and each relation."}, {"id": 123, "string": "The time complexity (per iteration) of our approach is O(sd+td+nd), where s is the average number of triples in a mini-batch,n the average number of entities in a mini-batch, and t the total number of approximate entailments in T ."}, {"id": 124, "string": "O(sd) is to handle triples in a mini-batch, O(td) penalty terms introduced by the approximate entailments, and O(nd) further the non-negativity constraints on entity representations."}, {"id": 125, "string": "Usually there are much fewer entailments than triples, i.e., t s, and alsō n ≤ 2s."}, {"id": 126, "string": "1 So the time complexity of our approach is on a par with O(sd), i.e., the time complexity of ComplEx."}, {"id": 127, "string": "Experiments and Results This section presents our experiments and results."}, {"id": 128, "string": "We first introduce the datasets used in our experiments ( § 4.1)."}, {"id": 129, "string": "Then we empirically evaluate our approach in the link prediction task ( § 4.2)."}, {"id": 130, "string": "After that, we conduct extensive analysis on both entity representations ( § 4.3) and relation representations ( § 4.4) to show the interpretability of our model."}, {"id": 131, "string": "1 There will be at most 2s entities contained in s triples."}, {"id": 132, "string": "Code and data used in the experiments are available at https://github.com/iieir-km/ ComplEx-NNE_AER."}, {"id": 133, "string": "Datasets The first two datasets we used are WN18 and F-B15K, released by Bordes et al."}, {"id": 134, "string": "(2013) ."}, {"id": 135, "string": "2 WN18 is a subset of WordNet containing 18 relations and 40,943 entities, and FB15K a subset of Freebase containing 1,345 relations and 14,951 entities."}, {"id": 136, "string": "We create our third dataset from the mapping-based objects of core DBpedia."}, {"id": 137, "string": "3 We eliminate relations not included within the DBpedia ontology such as HomePage and Logo, and discard entities appearing less than 20 times."}, {"id": 138, "string": "The final dataset, referred to as DB100K, is composed of 470 relations and 99,604 entities."}, {"id": 139, "string": "Triples on each datasets are further divided into training, validation, and test sets, used for model training, hyperparameter tuning, and evaluation respectively."}, {"id": 140, "string": "We follow the original split for WN18 and FB15K, and draw a split of 597,572/ 50,000/50,000 triples for DB100K."}, {"id": 141, "string": "We further use AMIE+ (Galárraga et al., 2015) 4 to extract approximate entailments automatically from the training set of each dataset."}, {"id": 142, "string": "As suggested by Guo et al."}, {"id": 143, "string": "(2018) , we consider entailments with PCA confidence higher than 0.8."}, {"id": 144, "string": "5 As such, we extract 17 approximate entailments from WN18, 535 from FB15K, and 56 from DB100K."}, {"id": 145, "string": "Table 1 gives some examples of these approximate entailments, along with their confidence levels."}, {"id": 146, "string": "Table 2 further summarizes the statistics of the datasets."}, {"id": 147, "string": "Link Prediction We first evaluate our approach in the link prediction task, which aims to predict a triple (e i , r k , e j ) with e i or e j missing, i.e., predict e i given (r k , e j ) or predict e j given (e i , r k )."}, {"id": 148, "string": "Evaluation Protocol: We follow the protocol introduced by Bordes et al."}, {"id": 149, "string": "(2013) ."}, {"id": 150, "string": "For each test triple (e i , r k , e j ), we replace its head entity e i with every entity e i ∈ E, and calculate a score for the corrupted triple (e i , r k , e j ), e.g., φ(e i , r k , e j ) defined by Eq."}, {"id": 151, "string": "(1)."}, {"id": 152, "string": "Then we sort these scores in de-  scending order, and get the rank of the correct entity e i ."}, {"id": 153, "string": "During ranking, we remove corrupted triples that already exist in either the training, validation, or test set, i.e., the filtered setting as described in (Bordes et al., 2013) ."}, {"id": 154, "string": "This whole procedure is repeated while replacing the tail entity e j ."}, {"id": 155, "string": "We report on the test set the mean reciprocal rank (MRR) and the proportion of correct entities ranked in the top n (HITS@N), with n = 1, 3, 10."}, {"id": 156, "string": "Comparison Settings: We compare the performance of our approach against a variety of KG embedding models developed in recent years."}, {"id": 157, "string": "These models can be categorized into three groups: • Simple embedding models that utilize triples alone without integrating extra information, including TransE (Bordes et al., 2013) , Dist-Mult (Yang et al., 2015) , HolE (Nickel et al., 2016b) , ComplEx (Trouillon et al., 2016) , and ANALOGY (Liu et al., 2017) ."}, {"id": 158, "string": "Our approach is developed on the basis of ComplEx."}, {"id": 159, "string": "• Other extensions of ComplEx that integrate logical background knowledge in addition to triples, including RUGE (Guo et al., 2018) and ComplEx R (Minervini et al., 2017a) ."}, {"id": 160, "string": "The former requires grounding of first-order logic rules."}, {"id": 161, "string": "The latter is restricted to relation equiv-alence and inversion, and assigns an identical confidence level to all different rules."}, {"id": 162, "string": "• Latest developments or implementations that achieve current state-of-the-art performance reported on the benchmarks of WN18 and F-B15K, including R-GCN (Schlichtkrull et al., 2017) , ConvE (Dettmers et al., 2018) , and Single DistMult (Kadlec et al., 2017) ."}, {"id": 163, "string": "6 The first two are built based on neural network architectures, which are, by nature, more complicated than the simple models."}, {"id": 164, "string": "The last one is a re-implementation of DistMult, generating 1000 to 2000 negative training examples per positive one, which leads to better performance but requires significantly longer training time."}, {"id": 165, "string": "We further evaluate our approach in two different settings: (i) ComplEx-NNE that imposes only the Non-Negativity constraints on Entity representations, i.e., optimization Eq."}, {"id": 166, "string": "(8) with µ = 0; and (ii) ComplEx-NNE+AER that further imposes the Approximate Entailment constraints over Relation representations besides those non-negativity ones, i.e., optimization Eq."}, {"id": 167, "string": "(8) with µ > 0."}, {"id": 168, "string": "Implementation Details: We compare our approach against all the three groups of baselines on the benchmarks of WN18 and FB15K."}, {"id": 169, "string": "We directly report their original results on these two datasets to avoid re-implementation bias."}, {"id": 170, "string": "On DB100K, the newly created dataset, we take the first two groups of baselines, i.e., those simple embedding models and ComplEx extensions with logical background knowledge incorporated."}, {"id": 171, "string": "We do not use the third group of baselines due to efficiency and complexity issues."}, {"id": 172, "string": "We use the code provided by Trouillon et al."}, {"id": 173, "string": "(2016) 7 for TransE, DistMult, and ComplEx, and the code released by their authors for ANAL-OGY 8 and RUGE 9 ."}, {"id": 174, "string": "We re-implement HolE and ComplEx R so that all the baselines (as well as our approach) share the same optimization mode, i.e., SGD with AdaGrad and gradient normalization, to facilitate a fair comparison."}, {"id": 175, "string": "10 We follow Trouillon et al."}, {"id": 176, "string": "(2016) to adopt a ranking loss for TransE and a logistic loss for all the other methods."}, {"id": 177, "string": "(Trouillon et al., 2016) ."}, {"id": 178, "string": "Results for the other baselines are taken from the original papers."}, {"id": 179, "string": "Missing scores not reported in the literature are indicated by \"-\"."}, {"id": 180, "string": "Best scores are highlighted in bold, and \" * \" indicates statistically significant improvements over ComplEx."}, {"id": 181, "string": "Table 4 : Link prediction results on the test set of DB100K, with best scores highlighted in bold, statistically significant improvements marked by \" * \"."}, {"id": 182, "string": "Among those baselines, RUGE and ComplEx R require additional logical background knowledge."}, {"id": 183, "string": "RUGE makes use of soft rules, which are extracted by AMIE+ from the training sets."}, {"id": 184, "string": "As suggested by Guo et al."}, {"id": 185, "string": "(2018) , length-1 and length-2 rules with PCA confidence higher than 0.8 are utilized."}, {"id": 186, "string": "Note that our approach also makes use of AMIE+ rules with PCA confidence higher than 0.8."}, {"id": 187, "string": "But it only considers entailments between a pair of relations, i.e., length-1 rules."}, {"id": 188, "string": "ComplEx R takes into account equivalence and inversion between relations."}, {"id": 189, "string": "We derive such axioms directly from our approximate entailments."}, {"id": 190, "string": "If r p λ 1 − → r q and r q λ 2 − → r p with λ 1 , λ 2 > 0.8, we think relations r p and r q are equivalent."}, {"id": 191, "string": "And similarly, if r −1 p λ 1 − → r q and r −1 q λ 2 − → r p with λ 1 , λ 2 > 0.8, we consider r p as an inverse of r q ."}, {"id": 192, "string": "For all the methods, we create 100 mini-batches on each dataset, and conduct a grid search to find hyperparameters that maximize MRR on the validation set, with at most 1000 iterations over the training set."}, {"id": 193, "string": "Specifically, we tune the embedding size d ∈ {100, 150, 200}, the L 2 regularization coefficient η ∈ {0.001, 0.003, 0.01, 0.03, 0.1}, the ratio of negative over positive training examples α ∈ {2, 10}, and the initial learning rate γ ∈ {0.01, 0.05, 0.1, 0.5, 1.0}."}, {"id": 194, "string": "For TransE, we tune the margin of the ranking loss δ ∈ {0.1, 0.2, 0.5, 1, 2, 5, 10}."}, {"id": 195, "string": "Other hyperparameters of ANALOGY and RUGE are set or tuned according to the default settings suggested by their authors (Liu et al., 2017; Guo et al., 2018) ."}, {"id": 196, "string": "After getting the best ComplEx model, we tune the relation constraint penalty of our approach ComplEx-NNE+AER (µ in Eq."}, {"id": 197, "string": "(8)) in the range of {10 −5 , 10 −4 , · · · , 10 4 , 10 5 }, with all its other hyperparameters fixed to their optimal configurations."}, {"id": 198, "string": "We then directly set µ = 0 to get the optimal ComplEx-NNE model."}, {"id": 199, "string": "The weight of soft constraints in ComplEx R is tuned in the same range as µ."}, {"id": 200, "string": "The optimal configurations for our approach are: d = 200, η = 0.03, α = 10, γ = 1.0, µ = 10 on WN18; d = 200, η = 0.01, α = 10, γ = 0.5, µ = 10 −3 on FB15K; and d = 150, η = 0.03, α = 10, γ = 0.1, µ = 10 −5 on DB100K."}, {"id": 201, "string": "Experimental Results: Table 3 presents the results on the test sets of WN18 and FB15K, where the results for the baselines are taken directly from previous literature."}, {"id": 202, "string": "Table 4 further provides the results on the test set of DB100K, with all the methods tuned and tested in (almost) the same setting."}, {"id": 203, "string": "On all the datasets, we test statistical significance of the improvements achieved by ComplEx-NNE/ ComplEx-NNE+AER over ComplEx, by using a paired t-test."}, {"id": 204, "string": "The reciprocal rank or HITS@N value with n = 1, 3, 10 for each test triple is used as paired data."}, {"id": 205, "string": "The symbol \" * \" indicates a significance level of p < 0.05."}, {"id": 206, "string": "The results demonstrate that imposing the nonnegativity and approximate entailment constraints indeed improves KG embedding."}, {"id": 207, "string": "ComplEx-NNE and ComplEx-NNE+AER perform better than (or at least equally well as) ComplEx in almost all the metrics on all the three datasets, and most of the improvements are statistically significant (except those on WN18)."}, {"id": 208, "string": "More interestingly, just by introducing these simple constraints, ComplEx-NNE+ AER can beat very strong baselines, including the best performing basic models like ANALOGY, those previous extensions of ComplEx like RUGE or ComplEx R , and even the complicated developments or implementations like ConvE or Single DistMult."}, {"id": 209, "string": "This demonstrates the superiority of our approach."}, {"id": 210, "string": "Analysis on Entity Representations This section inspects how the structure of the entity embedding space changes when the constraints are imposed."}, {"id": 211, "string": "We first provide the visualization of entity representations on DB100K."}, {"id": 212, "string": "On this dataset each entity is associated with a single type label."}, {"id": 213, "string": "11 We pick 4 types reptile, wine region, species, and programming language, and randomly select 30 entities from each type."}, {"id": 214, "string": "Figure 1 visualizes with the same type tend to activate the same set of dimensions, while entities with different types often get clearly different dimensions activated."}, {"id": 215, "string": "Then we investigate the semantic purity of these dimensions."}, {"id": 216, "string": "Specifically, we collect the representations of all the entities on DB100K (real components only)."}, {"id": 217, "string": "For each dimension of these representations, top K percent of entities with the highest activation values on this dimension are picked."}, {"id": 218, "string": "We can calculate the entropy of the type distribution of the entities selected."}, {"id": 219, "string": "This entropy reflects diversity of entity types, or in other words, semantic purity."}, {"id": 220, "string": "If all the K percent of entities have the same type, we will get the lowest entropy of zero (the highest semantic purity)."}, {"id": 221, "string": "On the contrary, if each of them has a distinct type, we will get the highest entropy (the lowest semantic purity)."}, {"id": 222, "string": "Figure 2 AER, as K varies."}, {"id": 223, "string": "We can see that after imposing the non-negativity constraints, ComplEx-NNE and ComplEx-NNE+AER can learn entity representations with latent dimensions of consistently higher semantic purity."}, {"id": 224, "string": "We have conducted the same analyses on imaginary components of entity representations, and observed similar phenomena."}, {"id": 225, "string": "The results are given as supplementary material."}, {"id": 226, "string": "Analysis on Relation Representations This section further provides a visual inspection of the relation embedding space when the constraints are imposed."}, {"id": 227, "string": "To this end, we group relation pairs involved in the DB100K entailment constraints into 3 classes: equivalence, inversion, and others."}, {"id": 228, "string": "12 We choose 2 pairs of relations from each class, and visualize these relation representations learned by ComplEx-NNE+AER in Figure 3 , where for each relation we randomly pick 5 dimensions from both its real and imaginary components."}, {"id": 229, "string": "By imposing the approximate entailment constraints, these relation representations can encode logical regularities quite well."}, {"id": 230, "string": "Pairs of relations from the first class (equivalence) tend to have identical representations r p ≈ r q , those from the second class (inversion) complex conjugate representations r p ≈r q ; and the others representations that Re(r p ) ≤ Re(r q ) and Im(r p ) ≈ Im(r q )."}, {"id": 231, "string": "12 Equivalence and inversion are detected using heuristics introduced in § 4.2 (implementation details)."}, {"id": 232, "string": "See the supplementary material for detailed properties of these three classes."}, {"id": 233, "string": "Conclusion This paper investigates the potential of using very simple constraints to improve KG embedding."}, {"id": 234, "string": "Two types of constraints have been studied: (i) the non-negativity constraints to learn compact, interpretable entity representations, and (ii) the approximate entailment constraints to further encode logical regularities into relation representations."}, {"id": 235, "string": "Such constraints impose prior beliefs upon the structure of the embedding space, and will not significantly increase the space or time complexity."}, {"id": 236, "string": "Experimental results on benchmark KGs demonstrate that our method is simple yet surprisingly effective, showing significant and consistent improvements over strong baselines."}, {"id": 237, "string": "The constraints indeed improve model interpretability, yielding a substantially increased structuring of the embedding space."}, {"id": 238, "string": "Kai-Wei Chang, Wen-tau Yih, Bishan Yang, and Christopher Meek."}, {"id": 239, "string": "2014"}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 33}, {"section": "Related Work", "n": "2", "start": 34, "end": 52}, {"section": "Our Approach", "n": "3", "start": 53, "end": 56}, {"section": "A Basic Embedding Model", "n": "3.1", "start": 57, "end": 63}, {"section": "Non-negativity of Entity Representations", "n": "3.2", "start": 64, "end": 72}, {"section": "Approximate Entailment for Relations", "n": "3.3", "start": 73, "end": 103}, {"section": "The Overall Model", "n": "3.4", "start": 104, "end": 126}, {"section": "Experiments and Results", "n": "4", "start": 127, "end": 132}, {"section": "Datasets", "n": "4.1", "start": 133, "end": 146}, {"section": "Link Prediction", "n": "4.2", "start": 147, "end": 209}, {"section": "Analysis on Entity Representations", "n": "4.3", "start": 210, "end": 225}, {"section": "Analysis on Relation Representations", "n": "4.4", "start": 226, "end": 232}, {"section": "Conclusion", "n": "5", "start": 233, "end": 239}], "figures": [{"filename": "../figure/image/1331-Figure3-1.png", "caption": "Figure 3: Visualization of relation representations learned by ComplEx-NNE+AER, with the top 4 relations from the equivalence class, the middle 4 the inversion class, and the bottom 4 others.", "page": 8, "bbox": {"x1": 78.72, "x2": 282.24, "y1": 61.919999999999995, "y2": 261.12}}, {"filename": "../figure/image/1331-Table1-1.png", "caption": "Table 1: Approximate entailments extracted from WN18 (top), FB15K (middle), and DB100K (bottom), where r−1 means the inverse of relation r.", "page": 5, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 62.4, "y2": 197.28}}, {"filename": "../figure/image/1331-Table2-1.png", "caption": "Table 2: Statistics of datasets, where the columns respectively indicate the number of entities, relations, training/validation/test triples, and approximate entailments.", "page": 5, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 261.12, "y2": 313.92}}, {"filename": "../figure/image/1331-Figure1-1.png", "caption": "Figure 1: Visualization of real components of entity representations (rows) learned by ComplExNNE+AER (left) and ComplEx (right). From top to bottom, entities belong to type reptile, wine region, species, and programming language in turn. Values range from 0 (white) via 0.5 (orange) to 1 (black). Best viewed in color.", "page": 7, "bbox": {"x1": 309.12, "x2": 523.68, "y1": 63.839999999999996, "y2": 160.79999999999998}}, {"filename": "../figure/image/1331-Figure2-1.png", "caption": "Figure 2: Average entropy over all dimensions of real components of entity representations learned by ComplEx (circles), ComplEx-NNE (squares), and ComplEx-NNE+AER (triangles) as K varies.", "page": 7, "bbox": {"x1": 310.08, "x2": 521.28, "y1": 289.44, "y2": 398.4}}, {"filename": "../figure/image/1331-Table4-1.png", "caption": "Table 4: Link prediction results on the test set of DB100K, with best scores highlighted in bold, statistically significant improvements marked by “∗”.", "page": 6, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 343.2, "y2": 481.91999999999996}}, {"filename": "../figure/image/1331-Table3-1.png", "caption": "Table 3: Link prediction results on the test sets of WN18 and FB15K. Results for TransE and DistMult are taken from (Trouillon et al., 2016). Results for the other baselines are taken from the original papers. Missing scores not reported in the literature are indicated by “—”. Best scores are highlighted in bold, and “∗” indicates statistically significant improvements over ComplEx.", "page": 6, "bbox": {"x1": 71.52, "x2": 526.0799999999999, "y1": 67.2, "y2": 262.08}}]}