{"title": "Document Modeling with External Attention for Sentence Extraction", "abstract": "Document modeling is essential to a variety of natural language understanding tasks. We propose to use external information to improve document modeling for problems that can be framed as sentence extraction. We develop a framework composed of a hierarchical document encoder and an attention-based extractor with attention over external information. We evaluate our model on extractive document summarization (where the external information is image captions and the title of the document) and answer selection (where the external information is a question). We show that our model consistently outperforms strong baselines, in terms of both informativeness and fluency (for CNN document summarization) and achieves state-of-the-art results for answer selection on WikiQA and NewsQA. 1 * The first three authors made equal contributions to this paper. The work was done when the second author was visiting Edinburgh. 1 Our TensorFlow code and datasets are publicly available at https://github.com/shashiongithub/ Document-Models-with-Ext-Information.", "text": [{"id": 0, "string": "Introduction Recurrent neural networks have become one of the most widely used models in natural language processing (NLP) ."}, {"id": 1, "string": "A number of variants of RNNs such as Long Short-Term Memory networks (LSTM; Hochreiter and Schmidhuber, 1997) and Gated Recurrent Unit networks (GRU; Cho et al., 2014) have been designed to model text capturing long-term dependencies in problems such as language modeling."}, {"id": 2, "string": "However, document modeling, a key to many natural language understanding tasks, is still an open challenge."}, {"id": 3, "string": "Recently, some neural network architectures were proposed to capture large context for modeling text (Mikolov and Zweig, 2012; Ghosh et al., 2016; Ji et al., 2015; Wang and Cho, 2016) ."}, {"id": 4, "string": "Lin et al."}, {"id": 5, "string": "(2015) and Yang et al."}, {"id": 6, "string": "(2016) proposed a hierarchical RNN network for document-level modeling as well as sentence-level modeling, at the cost of increased computational complexity."}, {"id": 7, "string": "Tran et al."}, {"id": 8, "string": "(2016) further proposed a contextual language model that considers information at interdocument level."}, {"id": 9, "string": "It is challenging to rely only on the document for its understanding, and as such it is not surprising that these models struggle on problems such as document summarization (Cheng and Lapata, 2016; Chen et al., 2016; Nallapati et al., 2017; See et al., 2017; Tan and Wan, 2017) and machine reading comprehension (Trischler et al., 2016; Miller et al., 2016; Weissenborn et al., 2017; Hu et al., 2017; ."}, {"id": 10, "string": "In this paper, we formalize the use of external information to further guide document modeling for end goals."}, {"id": 11, "string": "We present a simple yet effective document modeling framework for sentence extraction that allows machine reading with \"external attention.\""}, {"id": 12, "string": "Our model includes a neural hierarchical document encoder (or a machine reader) and a hierarchical attention-based sentence extractor."}, {"id": 13, "string": "Our hierarchical document encoder resembles the architectures proposed by Cheng and Lapata (2016) and Narayan et al."}, {"id": 14, "string": "(2018) in that it derives the document meaning representation from its sentences and their constituent words."}, {"id": 15, "string": "Our novel sentence extractor combines this document meaning representation with an attention mechanism (Bahdanau et al., 2015) over the external information to label sentences from the input document."}, {"id": 16, "string": "Our model explicitly biases the extractor with external cues and implicitly biases the encoder through training."}, {"id": 17, "string": "We demonstrate the effectiveness of our model on two problems that can be naturally framed as sentence extraction with external information."}, {"id": 18, "string": "These two problems, extractive document summarization and answer selection for machine reading comprehension, both require local and global contextual reasoning about a given document."}, {"id": 19, "string": "Extractive document summarization systems aim at creating a summary by identifying (and subsequently concatenating) the most important sentences in a document, whereas answer selection systems select the candidate sentence in a document most likely to contain the answer to a query."}, {"id": 20, "string": "For document summarization, we exploit the title and image captions which often appear with documents (specifically newswire articles) as external information."}, {"id": 21, "string": "For answer selection, we use word overlap features, such as the inverse sentence frequency (ISF, Trischler et al., 2016) and the inverse document frequency (IDF) together with the query, all formulated as external cues."}, {"id": 22, "string": "Our main contributions are three-fold: First, our model ensures that sentence extraction is done in a larger (rich) context, i.e., the full document is read first before we start labeling its sentences for extraction, and each sentence labeling is done by implicitly estimating its local and global relevance to the document and by directly attending to some external information for importance cues."}, {"id": 23, "string": "Second, while external information has been shown to be useful for summarization systems using traditional hand-crafted features (Edmundson, 1969; Kupiec et al., 1995; Mani, 2001) , our model is the first to exploit such information in deep learning-based summarization."}, {"id": 24, "string": "We evaluate our models automatically (in terms of ROUGE scores) on the CNN news highlights dataset (Hermann et al., 2015) ."}, {"id": 25, "string": "Experimental results show that our summarizer, informed with title and image captions, consistently outperforms summarizers that do not use this information."}, {"id": 26, "string": "We also conduct a human evaluation to judge which type of summary participants prefer."}, {"id": 27, "string": "Our results overwhelmingly show that human subjects find our summaries more informative and complete."}, {"id": 28, "string": "Lastly, with the machine reading capabilities of our model, we confirm that a full document needs to be \"read\" to produce high quality extracts allowing a rich contextual reasoning, in contrast to previous answer selection approaches that often measure a score between each sentence in the document and the question and return the sentence with highest score in an isolated manner (Yin et al., 2016; ."}, {"id": 29, "string": "Our model with ISF and IDF scores as external features achieves competitive results for answer selection."}, {"id": 30, "string": "Our ensemble model combining scores from our model and word overlap scores using a logistic regression layer achieves state-ofthe-art results on the popular question answering datasets WikiQA  and NewsQA (Trischler et al., 2016) , and it obtains comparable results to the state of the art for SQuAD (Rajpurkar et al., 2016) ."}, {"id": 31, "string": "We also evaluate our approach on the MSMarco dataset (Nguyen et al., 2016) and elaborate on the behavior of our machine reader in a scenario where each candidate answer sentence is contextually independent of each other."}, {"id": 32, "string": "Document Modeling For Sentence Extraction Given a document D consisting of a sequence of n sentences (s 1 , s 2 , ..., s n ) , we aim at labeling each sentence s i in D with a label y i ∈ {0, 1} where y i = 1 indicates that s i is extraction-worthy and 0 otherwise."}, {"id": 33, "string": "Our architecture resembles those previously proposed in the literature (Cheng and Lapata, 2016; Nallapati et al., 2017) ."}, {"id": 34, "string": "The main components include a sentence encoder, a document encoder, and a novel sentence extractor (see Figure 1) that we describe in more detail below."}, {"id": 35, "string": "The novel characteristics of our model are that each sentence is labeled by implicitly estimating its (local and global) relevance to the document and by directly attending to some external information for importance cues."}, {"id": 36, "string": "Sentence Encoder A core component of our model is a convolutional sentence encoder (Kim, 2014; Kim et al., 2016) which encodes sentences into continuous representations."}, {"id": 37, "string": "We use temporal narrow convolution by applying a kernel filter K of width h to a window of h words in sentence s to produce a new feature."}, {"id": 38, "string": "This filter is applied to each possible window of words in s to produce a feature map f ∈ R k−h+1 where k is the sentence length."}, {"id": 39, "string": "We then apply max-pooling over time over the feature map f and take the maximum value as the feature corresponding to this particular filter K. We use multiple kernels of various sizes and each kernel multiple times to construct the representation of a sentence."}, {"id": 40, "string": "In Figure 1 , ker-nels of size 2 (red) and 4 (blue) are applied three times each."}, {"id": 41, "string": "The max-pooling over time operation yields two feature lists f K 2 and f K 4 ∈ R 3 ."}, {"id": 42, "string": "The final sentence embeddings have six dimensions."}, {"id": 43, "string": "Document Encoder The document encoder composes a sequence of sentences to obtain a document representation."}, {"id": 44, "string": "We use a recurrent neural network with LSTM cells to avoid the vanishing gradient problem when training long sequences (Hochreiter and Schmidhuber, 1997) ."}, {"id": 45, "string": "Given a document D consisting of a sequence of sentences (s 1 , s 2 , ."}, {"id": 46, "string": "."}, {"id": 47, "string": "."}, {"id": 48, "string": ", s n ), we follow common practice and feed the sentences in reverse order (Sutskever et al., 2014; Filippova et al., 2015) ."}, {"id": 49, "string": "Sentence Extractor Our sentence extractor sequentially labels each sentence in a document with 1 or 0 by implicitly estimating its relevance in the document and by directly attending to the external information for importance cues."}, {"id": 50, "string": "It is implemented with another RNN with LSTM cells with an attention mechanism (Bahdanau et al., 2015) and a softmax layer."}, {"id": 51, "string": "Our attention mechanism differs from the standard practice of attending intermediate states of the input (encoder)."}, {"id": 52, "string": "Instead, our extractor attends to a sequence of p pieces of external information E : (e 1 , e 2 , ..., e p ) relevant for the task (e.g., e i is a title or an image caption for summarization) for cues."}, {"id": 53, "string": "At time t i , it reads sentence s i and makes a binary prediction, conditioned on the document representation (obtained from the document encoder), the previously labeled sentences and the external information."}, {"id": 54, "string": "This way, our labeler is able to identify locally and globally important sentences within the document which correlate well with the external information."}, {"id": 55, "string": "Given sentence s t at time step t, it returns a probability distribution over labels as: p(y t |s t , D, E) = softmax(g(h t , h t )) (1) g(h t , h t ) = U o (V h h t + W h h t ) (2) h t = LSTM(s t , h t−1 ) h t = p i=1 α (t,i) e i , where α (t,i) = exp(h t e i ) j exp(h t e j ) where g(·) is a single-layer neural network with parameters U o , V h and W h ."}, {"id": 56, "string": "h t is an intermedi- Figure 1 : Hierarchical encoder-decoder model for sentence extraction with external attention."}, {"id": 57, "string": "s 1 , ."}, {"id": 58, "string": "."}, {"id": 59, "string": "."}, {"id": 60, "string": ", s 5 are sentences in the document and, e 1 , e 2 and e 3 represent external information."}, {"id": 61, "string": "For the extractive summarization task, e i s are external information such as title and image captions."}, {"id": 62, "string": "For the answers selection task, e i s are the query and word overlap features."}, {"id": 63, "string": "ate RNN state at time step t. The dynamic context vector h t is essentially the weighted sum of the external information (e 1 , e 2 , ."}, {"id": 64, "string": "."}, {"id": 65, "string": "."}, {"id": 66, "string": ", e p )."}, {"id": 67, "string": "Figure 1 summarizes our model."}, {"id": 68, "string": "Sentence Extraction Applications We validate our model on two sentence extraction problems: extractive document summarization and answer selection for machine reading comprehension."}, {"id": 69, "string": "Both these tasks require local and global contextual reasoning about a given document."}, {"id": 70, "string": "As such, they test the ability of our model to facilitate document modeling using external information."}, {"id": 71, "string": "Extractive Summarization An extractive summarizer aims to produce a summary S by selecting m sentences from D (where m < n)."}, {"id": 72, "string": "In this setting, our sentence extractor sequentially predicts label y i ∈ {0, 1} (where 1 means that s i should be included in the summary) by assigning score p(y i |s i , D, E , θ) quantifying the relevance of s i to the summary."}, {"id": 73, "string": "We assemble a summary S by selecting m sentences with top p(y i = 1|s i , D, E , θ) scores."}, {"id": 74, "string": "We formulate external information E as the sequence of the title and the image captions associated with the document."}, {"id": 75, "string": "We use the convolutional sentence encoder to get their sentence-level representations."}, {"id": 76, "string": "Answer Selection Given a question q and a document D , the goal of the task is to select one candidate sentence s i ∈ D in which the answer exists."}, {"id": 77, "string": "In this setting, our sentence extractor sequentially predicts label y i ∈ {0, 1} (where 1 means that s i contains the answer) and assign score p(y i |s i , D, E , θ) quantifying s i 's relevance to the query."}, {"id": 78, "string": "We return as answer the sentence s i with the highest p(y i = 1|s i , D, E , θ) score."}, {"id": 79, "string": "We treat the question q as external information and use the convolutional sentence encoder to get its sentence-level representation."}, {"id": 80, "string": "This simplifies Eq."}, {"id": 81, "string": "(1) and (2) as follow: p(y t |s t , D, q) = softmax(g(h t , q)) (3) g(h t , q) = U o (V h h t + W q q), where V h and W q are network parameters."}, {"id": 82, "string": "We exploit the simplicity of our model to further assimilate external features relevant for answer selection: the inverse sentence frequency (ISF, (Trischler et al., 2016) ), the inverse document frequency (IDF) and a modified version of the ISF score which we call local ISF."}, {"id": 83, "string": "Trischler et al."}, {"id": 84, "string": "(2016) have shown that a simple ISF baseline (i.e., a sentence with the highest ISF score as an answer) correlates well with the answers."}, {"id": 85, "string": "The ISF score α s i for the sentence s i is computed as α s i = w∈s i ∩q IDF(w), where IDF is the inverse document frequency score of word w, defined as: IDF(w) = log N Nw , where N is the total number of sentences in the training set and N w is the number of sentences in which w appears."}, {"id": 86, "string": "Note that, s i ∩ q refers to the set of words that appear both in s i and in q."}, {"id": 87, "string": "Local ISF is calculated in the same manner as the ISF score, only with setting the total number of sentences (N ) to the number of sentences in the article that is being analyzed."}, {"id": 88, "string": "More formally, this modifies Eq."}, {"id": 89, "string": "(3) as follows: p(y t |s t , D, q) = softmax(g(h t , q, α t , β t , γ t )), (4) where α t , β t and γ t are the ISF, IDF and local ISF scores (real values) of sentence s t respectively ."}, {"id": 90, "string": "The function g is calculated as follows: g(h t , q, α t , β t , γ t ) =U o (V h h t + W q q + W isf (α t · 1)+ W idf (β t · 1) + W lisf (γ t · 1) , where W isf , W idf and W lisf are new parameters added to the network and 1 is a vector of 1s of size equal to the sentence embedding size."}, {"id": 91, "string": "In Figure  1 , these external feature vectors are represented as 6-dimensional gray vectors accompanied with dashed arrows."}, {"id": 92, "string": "Experiments and Results This section presents our experimental setup and results assessing our model in both the extractive summarization and answer selection setups."}, {"id": 93, "string": "In the rest of the paper, we refer to our model as XNET for its ability to exploit eXternal information to improve document representation."}, {"id": 94, "string": "Extractive Document Summarization Summarization Dataset We evaluated our models on the CNN news highlights dataset (Hermann et al., 2015) ."}, {"id": 95, "string": "2 We used the standard splits of Hermann et al."}, {"id": 96, "string": "(2015) for training, validation, and testing (90,266/1,220/1,093 documents)."}, {"id": 97, "string": "We followed previous studies (Cheng and Lapata, 2016; Nallapati et al., 2016 Nallapati et al., , 2017 See et al., 2017; Tan and Wan, 2017) in assuming that the \"story highlights\" associated with each article are gold-standard abstractive summaries."}, {"id": 98, "string": "We trained our network on a named-entity-anonymized version of news articles."}, {"id": 99, "string": "However, we generated deanonymized summaries and evaluated them against gold summaries to facilitate human evaluation and to make human evaluation comparable to automatic evaluation."}, {"id": 100, "string": "To train our model, we need documents annotated with sentence extraction information, i.e., each sentence in a document is labeled with 1 (summary-worthy) or 0 (not summary-worthy)."}, {"id": 101, "string": "We followed Nallapati et al."}, {"id": 102, "string": "(2017) and automatically extracted ground truth labels such that all positively labeled sentences from an article collectively give the highest ROUGE (Lin and Hovy, 2003) score with respect to the gold summary."}, {"id": 103, "string": "We used a modified script of Hermann et al."}, {"id": 104, "string": "(2015) to extract titles and image captions, and we associated them with the corresponding articles."}, {"id": 105, "string": "All articles get associated with their titles."}, {"id": 106, "string": "The availability of image captions varies from 0 to 414 per article, with an average of 3 image captions."}, {"id": 107, "string": "There are 40% CNN articles with at least one image caption."}, {"id": 108, "string": "All sentences, including titles and image captions, were padded with zeros to a sentence length of 100."}, {"id": 109, "string": "All input documents were padded with zeros to a maximum document length of 126."}, {"id": 110, "string": "For each document, we consider a maximum of 10 image captions."}, {"id": 111, "string": "We experimented with various numbers (1, 3, 5, 10 and 20) of image captions on the validation set and found that our model performed best with 10 image captions."}, {"id": 112, "string": "We refer the reader to the supplementary material for more implementation details to replicate our results."}, {"id": 113, "string": "Comparison Systems We compared the output of our model against the standard baseline of simply selecting the first three sentences from each document as the summary."}, {"id": 114, "string": "We refer to this baseline as LEAD in the rest of the paper."}, {"id": 115, "string": "We also compared our system against the sentence extraction system of Cheng and Lapata (2016) ."}, {"id": 116, "string": "We refer to this system as POINTERNET as the neural attention architecture in Cheng and Lapata (2016) resembles the one of Pointer Networks ."}, {"id": 117, "string": "3 It does not exploit any external information."}, {"id": 118, "string": "4 The architecture of POINTERNET is closely related to our model without external information."}, {"id": 119, "string": "4 Adding external information to POINTERNET is an in- Automatic Evaluation To automatically assess the quality of our summaries, we used ROUGE (Lin and Hovy, 2003) , a recall-oriented metric, to compare our model-generated summaries to manually-written highlights."}, {"id": 120, "string": "6 Previous work has reported ROUGE-1 (R1) and ROUGE-2 (R2) scores to access informativeness, and ROUGE-L (RL) to access fluency."}, {"id": 121, "string": "In addition to R1, R2 and RL, we also report ROUGE-3 (R3) and ROUGE-4 (R4) capturing higher order n-grams overlap to assess informativeness and fluency simultaneously."}, {"id": 122, "string": "teresting direction of research but we do not pursue it here."}, {"id": 123, "string": "It requires decoding with multiple types of attentions and this is not the focus of this paper."}, {"id": 124, "string": "5 We are unable to compare our results to the extractive system of Nallapati et al."}, {"id": 125, "string": "(2017) because they report their results on the DailyMail dataset and their code is not available."}, {"id": 126, "string": "The abstractive systems of Chen et al."}, {"id": 127, "string": "(2016) and Tan and Wan (2017) report their results on the CNN dataset, however, their results are not comparable to ours as they report on the full-length F1 variants of ROUGE to evaluate their abstractive summaries."}, {"id": 128, "string": "We report ROUGE recall scores which is more appropriate to evaluate our extractive summaries."}, {"id": 129, "string": "6 We used pyrouge, a Python package, to compute all our ROUGE scores with parameters \"-a -c 95 -m -n 4 -w 1.2.\""}, {"id": 130, "string": "We report our results on both full length (three sentences with the top scores as the summary) and fixed length (first 75 bytes and 275 bytes as the summary) summaries."}, {"id": 131, "string": "For full length summaries, our decision of selecting three sentences is guided by the fact that there are 3.11 sentences on average in the gold highlights of the training set."}, {"id": 132, "string": "We conduct our ablation study on the validation set with full length ROUGE scores, but we report both fixed and full length ROUGE scores for the test set."}, {"id": 133, "string": "We experimented with two types of external information: title (TITLE) and image captions (CAPTION)."}, {"id": 134, "string": "In addition, we experimented with the first sentence (FS) of the document as external information."}, {"id": 135, "string": "Note that the latter is not external information, it is a sentence in the document."}, {"id": 136, "string": "However, we wanted to explore the idea that the first sentence of the document plays a crucial part in generating summaries (Rush et al., 2015; Nallapati et al., 2016) ."}, {"id": 137, "string": "XNET with FS acts as a baseline for XNET with title and image captions."}, {"id": 138, "string": "We report the performance of several variants of XNET on the validation set in Table 1 ."}, {"id": 139, "string": "We also compare them against the LEAD baseline and POINTERNET."}, {"id": 140, "string": "These two systems do not use any additional information."}, {"id": 141, "string": "Interestingly, all the variants of XNET significantly outperform LEAD and POINTERNET."}, {"id": 142, "string": "When the title (TITLE), image captions (CAPTION) and the first sentence (FS) are used separately as additional information, XNET performs best with TITLE as its external information."}, {"id": 143, "string": "Our result demonstrates the importance of the title of the document in extractive summarization (Edmundson, 1969; Kupiec et al., 1995; Mani, 2001) ."}, {"id": 144, "string": "The performance with TITLE and CAP-TION is better than that with FS."}, {"id": 145, "string": "We also tried possible combinations of TITLE, CAPTION and FS."}, {"id": 146, "string": "All XNET models are superior to the ones without any external information."}, {"id": 147, "string": "XNET performs best when TITLE and CAPTION are jointly used as external information (55.4%, 21.8%, 11.8%, 7.5%, and 49.2% for R1, R2, R3, R4, and RL respectively)."}, {"id": 148, "string": "It is better than the the LEAD baseline by 3.7 points on average and than POINTERNET by 1.8 points on average, indicating that external information is useful to identify the gist of the document."}, {"id": 149, "string": "We use this model for testing purposes."}, {"id": 150, "string": "Our final results on the test set are shown in   to XNET."}, {"id": 151, "string": "This result could be because LEAD (always) and POINTERNET (often) include the first sentence in their summaries, whereas, XNET is better capable at selecting sentences from various document positions."}, {"id": 152, "string": "This is not captured by smaller summaries of 75 bytes, but it becomes more evident with longer summaries (275 bytes and full length) where XNET performs best across all ROUGE scores."}, {"id": 153, "string": "We note that POINTERNET outperforms LEAD for 75-byte summaries, then its performance drops behind LEAD for 275-byte summaries, but then it outperforms LEAD for full length summaries on the metrics R1, R2 and RL."}, {"id": 154, "string": "It shows that POINTERNET with its attention over sentences in the document is capable of exploring more than first few sentences in the document, but it is still behind XNET which is better at identifying salient sentences in the document."}, {"id": 155, "string": "XNET performs significantly better than POINTERNET by 0.8 points for 275-byte summaries and by 1.9 points for full length summaries, on average for all ROUGE scores."}, {"id": 156, "string": "Human Evaluation We complement our automatic evaluation results with human evaluation."}, {"id": 157, "string": "We randomly selected 20 articles from the test set."}, {"id": 158, "string": "Annotators were presented with a news article and summaries from four different systems."}, {"id": 159, "string": "These include the LEAD baseline, POINTERNET, XNET and the human authored highlights."}, {"id": 160, "string": "We followed the guidelines in Cheng and Lapata (2016) , and asked our participants to rank the summaries from best (1st) to worst (4th) in order of informativeness (does the summary capture important information in the article?)"}, {"id": 161, "string": "and fluency (is the summary written in well-formed English?)."}, {"id": 162, "string": "We did not allow any ties and we only sampled articles with nonidentical summaries."}, {"id": 163, "string": "We assigned this task to five annotators who were proficient English speakers."}, {"id": 164, "string": "Each annotator was presented with all 20 articles."}, {"id": 165, "string": "The order of summaries to rank was randomized per article."}, {"id": 166, "string": "An example of summaries our subjects ranked is provided in the supplementary material."}, {"id": 167, "string": "The results of our human evaluation study are shown in Table 3 ."}, {"id": 168, "string": "As one might imagine, HUMAN gets ranked 1st most of the time (41%)."}, {"id": 169, "string": "However, it is closely followed by XNET which ranked 1st 28% of the time."}, {"id": 170, "string": "In comparison, POINTER-NET and LEAD were mostly ranked at 3rd and 4th places."}, {"id": 171, "string": "We also carried out pairwise comparisons between all models in Table 3 for their statistical significance using a one-way ANOVA with post-hoc Tukey HSD tests with (p < 0.01)."}, {"id": 172, "string": "It showed that XNET is significantly better than LEAD and POINTERNET, and it does not differ significantly from HUMAN."}, {"id": 173, "string": "On the other hand, POINTERNET does not differ significantly from LEAD and it differs significantly from both XNET and HUMAN."}, {"id": 174, "string": "The human evaluation results corroborates our empirical results in Table 1 and Table 2: XNET is better than LEAD and POINT-ERNET in producing informative and fluent summaries."}, {"id": 175, "string": "Answer Selection Question Answering Datasets We run experiments on four datasets collected for open domain question-answering tasks: WikiQA , SQuAD (Rajpurkar et al., 2016) , NewsQA (Trischler et al., 2016) , and MSMarco (Nguyen et al., 2016) ."}, {"id": 176, "string": "NewsQA was especially designed to present lexical and syntactic divergence between questions and answers."}, {"id": 177, "string": "It contains 119,633 questions posed by crowdworkers on 12,744 CNN articles previously collected by Hermann et al."}, {"id": 178, "string": "(2015) ."}, {"id": 179, "string": "In a similar manner, SQuAD associates 100,000+ question with a Wikipedia article's first paragraph, for 500+ previously chosen articles."}, {"id": 180, "string": "WikiQA was collected by mining web-searching query logs and then associating them with the summary section of the Wikipedia article presumed to be related to the topic of the query."}, {"id": 181, "string": "A similar collection procedure was followed to create MSMarco with the difference that each candidate answer is a whole paragraph from a different browsed website associated with the query."}, {"id": 182, "string": "We follow the widely used setup of leaving out unanswered questions (Trischler et al., 2016; and adapt the format of each dataset to our task of answer sentence selection by labeling a candidate sentence with 1 if any answer span is contained in that sentence."}, {"id": 183, "string": "In the case of MS-Marco, each candidate paragraph comes associated with a label, hence we treat each one as a single long sentence."}, {"id": 184, "string": "Since SQuAD keeps the official test dataset hidden and MSMarco does not provide labels for its released test set, we report results on their official validation sets."}, {"id": 185, "string": "For validation, we set apart 10% of each official training set."}, {"id": 186, "string": "Our dataset splits consist of 92, 525, 5, 165 and 5, 124 samples for NewsQA; 79, 032, 8, 567, and 10, 570 for SQuAD; 873, 122, and 79, 704, 9, 706, and 9, 650 for MSMarco, for training, validation, and testing respectively."}, {"id": 187, "string": "Comparison Systems We compared the output of our model against the ISF (Trischler et al., 2016) and LOCALISF baselines."}, {"id": 188, "string": "Given an article, the sentence with the highest ISF score is selected as an answer for the ISF baseline and the sentence with the highest local ISF score for the LOCALISF baseline."}, {"id": 189, "string": "We also compare our model against a neural network (PAIRCNN) that encodes (question, candidate) in an isolated manner as in previous work (Yin et al., 2016; ."}, {"id": 190, "string": "The architecture uses the sentence encoder explained in earlier sections to learn the question and candidate representations."}, {"id": 191, "string": "The distribution over labels is given by p(y t |q) = p(y t |s t , q) = softmax(g(s t , q)) where g(s t , q) = ReLU(W sq · [s t ; q] + b sq )."}, {"id": 192, "string": "In addition, we also compare our model against AP-CNN (dos Santos et al., 2016) , ABCNN (Yin et al., 2016) , L.D.C (Wang and Jiang, 2017) , KV-MemNN (Miller et al., 2016) , and COMPAGGR, a state-of-the-art system by ."}, {"id": 193, "string": "We experiment with several variants of our model."}, {"id": 194, "string": "XNET is the vanilla version of our sen- SQuAD WikiQA NewsQA MSMarco ACC MAP MRR ACC MAP MRR ACC MAP MRR ACC MAP MRR WRD CNT 77.84 27.50 27.77 51.05 48.91 49.24 44.67 46.48 46.91 20.16 19.37 19.51 WGT WRD CNT 78.43 28.10 28.38 49.79 50.99 51.32 45.24 48.20 48.64 20.50 20.06 20.23 AP-CNN  ----68.86 69.57  ------ABCNN  ----69.21 71.08  ------L.D.C  ----70.58 72.26  ------KV-MemNN  ----70.69 72.65  ------LOCALISF 79.50 27.78 28.05 49.79 49.57 50.11 44.69 48.40 46.48 20.21 20.22 20.39 ISF 78.85 28.09 28.36 48.52 46.53 46.72 45.61 48.57 48.99 20.52 20.07 20.23 PAIRCNN 32.53 46.34 46.35 32.49 39.87 38.71 (Yin et al., 2016) , L.D.C (Wang and Jiang, 2017) , KV-MemNN (Miller et al., 2016) , and COMPAGGR, a state-of-the-art system by ."}, {"id": 195, "string": "(WGT) WRD CNT stands for the (weighted) word count baseline."}, {"id": 196, "string": "See text for more details."}, {"id": 197, "string": "tence extractor conditioned only on the query q as external information (Eq."}, {"id": 198, "string": "(3) )."}, {"id": 199, "string": "XNET+ is an extension of XNET which uses ISF, IDF and local ISF scores in addition to the query q as external information (Eqn."}, {"id": 200, "string": "(4) )."}, {"id": 201, "string": "We also experimented with a baseline XNETTOPK where we choose the top k sentences with highest ISF score, and then among them choose the one with the highest probability according to XNET."}, {"id": 202, "string": "In our experiments, we set k = 5."}, {"id": 203, "string": "In the end, we experimented with an ensemble network LRXNET which combines the XNET score, the COMPAGGR score and other word-overlap-based scores (tweaked and optimized for each dataset separately) for each sentence using a logistic regression classifier."}, {"id": 204, "string": "It uses ISF and LocalISF scores for NewsQA, IDF and ISF scores for SQuAD, sentence length, IDF and ISF scores for WikiQA, and word overlap and ISF score for MSMarco."}, {"id": 205, "string": "We refer the reader to the supplementary material for more implementation and optimization details to replicate our results."}, {"id": 206, "string": "Evaluation Metrics We consider metrics that evaluate systems that return a ranked list of candidate answers: mean average precision (MAP), mean reciprocal rank (MRR), and accuracy (ACC)."}, {"id": 207, "string": "Results Table 4 gives the results for the test sets of NewsQA and WikiQA, and the original validation sets of SQuAD and MSMarco."}, {"id": 208, "string": "Our first observation is that XNET outperforms PAIRCNN, supporting our claim that it is beneficial to read the whole document in order to make decisions, instead of only observing each candidate in isolation."}, {"id": 209, "string": "Secondly, we can observe that ISF is indeed a strong baseline that outperforms XNET."}, {"id": 210, "string": "This means that just \"reading\" the document using a vanilla version of XNET is not sufficient, and help is required through a coarse filtering."}, {"id": 211, "string": "Indeed, we observe that XNET+ outperforms all baselines except for COMPAGGR."}, {"id": 212, "string": "Our ensemble model LRXNET can ultimately surpass COMPAGGR on majority of the datasets."}, {"id": 213, "string": "This consistent behavior validates the machine reading capabilities and the improved document representation with external features of our model for answer selection."}, {"id": 214, "string": "Specifically, the combination of document reading and word overlap features is required to be done in a soft manner, using a classification technique."}, {"id": 215, "string": "Using it as a hard constraint, with XNETTOPK, does not achieve the best result."}, {"id": 216, "string": "We believe that often the ISF score is a better indicator of answer presence in the vicinity of certain candidate instead of in the candidate itself."}, {"id": 217, "string": "As such, XNET+ is capable of using this feature in datasets with richer context."}, {"id": 218, "string": "It is worth noting that the improvement gained by LRXNET over the state-of-the-art follows a pattern."}, {"id": 219, "string": "For the SQuAD dataset, the results are comparable (less than 1%)."}, {"id": 220, "string": "However, the improvement for WikiQA reaches ∼3% and then the gap shrinks again for NewsQA, with an improvement of ∼1%."}, {"id": 221, "string": "This could be explained by the fact that each sample of the SQuAD is a paragraph, compared to an article summary for WikiQA, and to an entire article for NewsQA."}, {"id": 222, "string": "Hence, we further strengthen our hypothesis that a richer context is needed to achieve better results, in this case expressed as document length, but as the length of the context increases the limitation of sequential models to learn from long rich sequences arises."}, {"id": 223, "string": "7 Interestingly, our model lags behind COM-PAGGR on the MSMarco dataset."}, {"id": 224, "string": "It turns out this is due to contextual independence between candidates in the MSMarco dataset, i.e., each candidate is a stand-alone paragraph in this dataset, in contrast to contextually dependent candidate sentences from a document in the NewsQA, SQuAD and WikiQA datasets."}, {"id": 225, "string": "As a result, our models (XNET+ and LRXNET) with document reading abilities perform poorly."}, {"id": 226, "string": "This can be observed by the fact that XNET and PAIRCNN obtain comparable results."}, {"id": 227, "string": "COMPAGGR performs better because comparing each candidate independently is a better strategy."}, {"id": 228, "string": "Conclusion We describe an approach to model documents while incorporating external information that informs the representations learned for the sentences in the document."}, {"id": 229, "string": "We implement our approach through an attention mechanism of a neural network architecture for modeling documents."}, {"id": 230, "string": "Our experiments with extractive document summarization and answer selection tasks validates our model in two ways: first, we demonstrate that external information is important to guide document modeling for natural language understanding tasks."}, {"id": 231, "string": "Our model uses image captions and the title of the document for document summarization, and the query with word overlap features for answer selection and outperforms its counterparts that do not use this information."}, {"id": 232, "string": "Second, our external attention mechanism successfully guides the learning of the document representation for the relevant end goal."}, {"id": 233, "string": "For answer selection, we show that inserting the query with word overlap features using our external attention mechanism outperforms state-of-the-art systems that naturally also have access to this information."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 31}, {"section": "Document Modeling For Sentence Extraction", "n": "2", "start": 32, "end": 67}, {"section": "Sentence Extraction Applications", "n": "3", "start": 68, "end": 90}, {"section": "Experiments and Results", "n": "4", "start": 91, "end": 93}, {"section": "Extractive Document Summarization", "n": "4.1", "start": 94, "end": 174}, {"section": "Answer Selection", "n": "4.2", "start": 175, "end": 227}, {"section": "Conclusion", "n": "5", "start": 228, "end": 233}], "figures": [{"filename": "../figure/image/1342-Figure1-1.png", "caption": "Figure 1: Hierarchical encoder-decoder model for sentence extraction with external attention. s1, . . . , s5 are sentences in the document and, e1, e2 and e3 represent external information. For the extractive summarization task, eis are external information such as title and image captions. For the answers selection task, eis are the query and word overlap features.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 528.0, "y1": 63.839999999999996, "y2": 418.08}}, {"filename": "../figure/image/1342-Table2-1.png", "caption": "Table 2: Final results on the test set. POINTERNET is the sentence extraction system of Cheng and Lapata. XNET is our best model from Table 1. Best ROUGE score in each block and each column is highlighted in boldface.", "page": 5, "bbox": {"x1": 315.84, "x2": 514.0799999999999, "y1": 62.879999999999995, "y2": 196.32}}, {"filename": "../figure/image/1342-Table3-1.png", "caption": "Table 3: Human evaluations: Ranking of various systems. Rank 1st is best and rank 4th, worst. Numbers show the percentage of times a system gets ranked at a certain position.", "page": 5, "bbox": {"x1": 328.8, "x2": 504.0, "y1": 282.71999999999997, "y2": 335.03999999999996}}, {"filename": "../figure/image/1342-Table1-1.png", "caption": "Table 1: Ablation results on the validation set. We report R1, R2, R3, R4, RL and their average (Avg.). The first block of the table presents LEAD and POINTERNET which do not use any external information. LEAD is the baseline system selecting first three sentences. POINTERNET is the sentence extraction system of Cheng and Lapata. XNET is our model. The second and third blocks of the table present different variants of XNET. We experimented with three types of external information: title (TITLE), image captions (CAPTION) and the first sentence (FS) of the document. The bottom block of the table presents models with more than one type of external information. The best performing model (highlighted in boldface) is used on the test set.", "page": 4, "bbox": {"x1": 307.68, "x2": 523.1999999999999, "y1": 62.879999999999995, "y2": 155.04}}, {"filename": "../figure/image/1342-Table4-1.png", "caption": "Table 4: Results (in percentage) for answer selection comparing our approaches (bottom part) to baselines (top): AP-CNN (dos Santos et al., 2016), ABCNN (Yin et al., 2016), L.D.C (Wang and Jiang, 2017), KV-MemNN (Miller et al., 2016), and COMPAGGR, a state-of-the-art system by Wang et al. (2017). (WGT) WRD CNT stands for the (weighted) word count baseline. See text for more details.", "page": 7, "bbox": {"x1": 72.0, "x2": 530.4, "y1": 62.879999999999995, "y2": 224.16}}]}