{"title": "Measuring Immediate Adaptation Performance for Neural Machine Translation", "abstract": "Incremental domain adaptation, in which a system learns from the correct output for each input immediately after making its prediction for that input, can dramatically improve system performance for interactive machine translation. Users of interactive systems are sensitive to the speed of adaptation and how often a system repeats mistakes, despite being corrected. Adaptation is most commonly assessed using corpus-level BLEU-or TERderived metrics that do not explicitly take adaptation speed into account. We find that these metrics often do not capture immediate adaptation effects, such as zero-shot and oneshot learning of domain-specific lexical items. To this end, we propose new metrics that directly evaluate immediate adaptation performance for machine translation. We use these metrics to choose the most suitable adaptation method from a range of different adaptation techniques for neural machine translation systems.", "text": [{"id": 0, "string": "Introduction Incremental domain adaptation, or online adaptation, has been shown to improve statistical machine translation and especially neural machine translation (NMT) systems significantly (Turchi et al., 2017; Karimova et al., 2018) (inter-alia)."}, {"id": 1, "string": "The natural use case is a computeraided translation (CAT) scenario, where a user and a machine translation system collaborate to translate a document."}, {"id": 2, "string": "Each user translation is immediately used as a new training example to adapt the machine translation system to the specific document."}, {"id": 3, "string": "Adaptation techniques for MT are typically evaluated by their corpus translation quality, but such evaluations may not capture prominent aspects of the user experience in a collaborative translation scenario."}, {"id": 4, "string": "This paper focuses on directly measuring the speed of lexical acquisition for in-domain vocabulary."}, {"id": 5, "string": "To that end, we propose three related metrics that are designed to reflect the responsiveness of adaptation."}, {"id": 6, "string": "An ideal system would immediately acquire indomain lexical items upon observing their translations."}, {"id": 7, "string": "Moreover, one might expect a neural system to generalize from one corrected translation to related terms."}, {"id": 8, "string": "Once a user translates \"bank\" to German \"Bank\" (institution) instead of \"Ufer\" (shore) in a document, the system should also correctly translate \"banks\" to \"Banken\" instead of \"Ufer\" (the plural is identical to the singular in German) in future sentences."}, {"id": 9, "string": "We measure both one-shot vocabulary acquisition for terms that have appeared once in a previous target sentence, as well as zeroshot vocabulary acquisition for terms that have not previously appeared."}, {"id": 10, "string": "Our experimental evaluation shows some surprising results."}, {"id": 11, "string": "Methods that appear to have comparable performance using corpus quality metrics such as BLEU can differ substantially in zero-shot and one-shot vocabulary acquisition."}, {"id": 12, "string": "In addition, we find that fine-tuning a neural model tends to improve one-shot vocabulary recall while degrading zero-shot vocabulary recall."}, {"id": 13, "string": "We evaluate several adaptation techniques on a range of online adaptation datasets."}, {"id": 14, "string": "Fine tuning applied to all parameters in the NMT model maximizes one-shot acquisition, but shows a worrisome degradation in zero-shot recall."}, {"id": 15, "string": "By contrast, fine tuning with group lasso regularization, a technique recently proposed to improve the space efficiency of adapted models (Wuebker et al., 2018) , achieves an appealing balance of zero-shot and one-shot vocabulary acquisition as well as high corpus-level translation quality."}, {"id": 16, "string": "Measuring Immediate Adaptation Motivation For interactive, adaptive machine translation systems, perceived adaptation performance is a crucial property: An error in the machine translation output which needs to be corrected multiple times can cause frustration, and thus may compromise acceptance of the MT system by human users."}, {"id": 17, "string": "A class of errors that are particularly salient are lexical choice errors for domain-specific lexical items."}, {"id": 18, "string": "In the extreme, NMT systems using subword modeling (Sennrich et al., 2015) can generate \"hallucinated\" words-words that do not exist in the target language-which are especially irritating for users (Lee et al., 2018; Koehn and Knowles, 2017) ."}, {"id": 19, "string": "Users of adaptive MT have a reasonable expectation that in-domain vocabulary will be translated correctly after the translation of a term or some related term has been corrected manually."}, {"id": 20, "string": "Arguably, more subtle errors, referring to syntax, word order or more general semantics are less of a focus for immediate adaptation, as these types of errors are also harder to pinpoint and thus to evaluate 1 (Bentivogli et al., 2016) ."}, {"id": 21, "string": "Traditional metrics for evaluating machine translation outputs, e.g."}, {"id": 22, "string": "BLEU and TER, in essence try to measure the similarity of a hypothesized translation to one or more reference translations, taking the full string into account."}, {"id": 23, "string": "Due to significant improvements in MT quality with neural models (Bentivogli et al., 2016 ) (interalia), more specialized metrics, evaluating certain desired behaviors of systems become more useful for specific tasks."}, {"id": 24, "string": "For example, Wuebker et al."}, {"id": 25, "string": "(2016) show, that NMT models, while being better in most respects, still fall short in the handling of content words in comparison with phrase-based MT."}, {"id": 26, "string": "This observation is also supported by Bentivogli et al."}, {"id": 27, "string": "(2016) , who show smaller gains for NMT for translation of nouns, an important category of content words."}, {"id": 28, "string": "Another reason to isolate vocabulary acquisition as an evaluation criterion is that interactive translation often employs local adaptation via prefix-decoding (Knowles and Koehn, 2016; Wuebker et al., 2016) , which can allow the system to recover syntactic structure or resolve local am-biguities when given a prefix, but may still suffer from poor handling of unknown or domainspecific vocabulary."}, {"id": 29, "string": "In this work, we therefore focus on translation performance with respect to content words, setting word order and other aspects aside."}, {"id": 30, "string": "Metrics We propose three metrics: one to directly measure one-shot vocabulary acquisition, one to measure zero-shot vocabulary acquisition, and one to measure both."}, {"id": 31, "string": "In all three, we measure the recall of target-language content words so that the metrics can be computed automatically by comparing translation hypotheses to reference translations without the use of models or word alignments 2 ."}, {"id": 32, "string": "We define content words as those words that are not included in a fixed stopword list, as used for example in query simplification for information retrieval."}, {"id": 33, "string": "Such lists are typically compiled manually and are available for many languages."}, {"id": 34, "string": "3 For western languages, content words are mostly nouns, main verbs, adjectives or adverbs."}, {"id": 35, "string": "For the i-th pair of source sentence and reference translation, i = 1, ."}, {"id": 36, "string": "."}, {"id": 37, "string": "."}, {"id": 38, "string": ", |G|, of an ordered test corpus G, we define two sets R 0,i and R 1,i that are a subset of the whole set of unique 4 content words (i.e."}, {"id": 39, "string": "types) of the reference translation for i. R 0,i includes a word if its first occurrence in the test set is in the i-th reference of G, and R 1,i if its second occurrence in the test set is in the i-th reference of G. The union R 0,i ∪ R 1,i includes content words occurring for either the first or second time."}, {"id": 40, "string": "To measure zero-shot adaptation in a given hypothesis H i , also represented as a set of its content words, we propose to evaluate the number of word types that were immediately translated correctly: R0 = |H i ∩ R 0,i | |R 0,i | ."}, {"id": 41, "string": "To measure one-shot adaptation, where the system correctly produces a content word after ob-2 In each of the data sets considered in this work, the average number of occurrences of content words ranges between 1.01 and 1.11 per sentence."}, {"id": 42, "string": "We find this sufficiently close to 1 to evaluate in a bag-of-words fashion and not consider alignments."}, {"id": 43, "string": "3 For German we used the list available here: https://github.com/stopwords-iso."}, {"id": 44, "string": "4 All proposed metrics operate on the set-level, without clipping (Papineni et al., 2002) or alignment (Banerjee and Lavie, 2005; Kothur et al., 2018) , as we have found this simplification effective."}, {"id": 45, "string": "1/1 2/2 3/3 Total 2/4 2/2 4/6 Figure 1 : Example for calculating R0, R1, and R0+1 on a corpus of two sentences."}, {"id": 46, "string": "Content words are written in brackets, the corpus-level score is given below the per-segment scores."}, {"id": 47, "string": "In the example, the denominator for R1 is 2 due to the two repeated words dog and bites in the reference."}, {"id": 48, "string": "serving it exactly once, we propose: R1 = |H i ∩ R 1,i | |R 1,i | ."}, {"id": 49, "string": "This principle can be extended to define metrics Rk, k > 1 to allow more \"slack\" in the adaptation, but we leave that investigation to future work."}, {"id": 50, "string": "Finally, we define a metric that measures both zero-and one-shot adaptation: R0+1 = |H i ∩ [R 0,i ∪ R 1,i ] | |R 0,i ∪ R 1,i | ."}, {"id": 51, "string": "All metrics can either be calculated for single sentences as described above, or for a full test corpus by summing over all sentences, e.g."}, {"id": 52, "string": "for R0: Figure 1 gives an example calculation of all three metrics across a two-sentence corpus."}, {"id": 53, "string": "|G| i=1 |H i ∩ R 0,i | |G| i=1 |R 0,i | ."}, {"id": 54, "string": "Related Work An important line of related work is concerned with estimating the potential adaptability of a system given a source text only, the so-called repetition rate (Cettolo et al., 2014) ."}, {"id": 55, "string": "The metric is inspired by BLEU, and uses a sliding window over the source text to count singleton N -grams."}, {"id": 56, "string": "The modus operandi for our metrics is most similar to HTER (Snover et al., 2006) , since we are also assuming a single, targeted reference translation 5 for evaluation."}, {"id": 57, "string": "The introduction of NMT brought more aspects of translation quality evaluation into focus, such as discourse-level evaluation (Bawden et al., 2017) , or very fine-grained evaluation of specific aspects of the translations (Bentivogli et al., 2016) , highlighting the differences between phrase-based and NMT systems."}, {"id": 58, "string": "Online adaptation for (neural) machine translation has been thoroughly explored using BLEU (Turchi et al., 2017) , simulated keystroke and mouse action ratio (Barrachina et al., 2009 ) for effort estimation (Peris and Casacuberta, 2018) , word prediction accuracy (Wuebker et al., 2016) , and user studies (Denkowski et al., 2014; Karimova et al., 2018 ) (all inter-alia)."}, {"id": 59, "string": "In (Simianer et al., 2016) immediate adaptation for hierarchical phrase-based MT is specifically investigated, but they also evaluate their systems using humantargeted BLEU and TER."}, {"id": 60, "string": "Regularization for segment-wise continued training in NMT has been explored by  by means of knowledge distillation, and with the group lasso by Wuebker et al."}, {"id": 61, "string": "(2018) , as used in this paper."}, {"id": 62, "string": "Most relevant to our work, in the context of document-level adaptation, Kothur et al."}, {"id": 63, "string": "(2018) calculate accuracy for novel words based on an automatic word alignment."}, {"id": 64, "string": "However, they do not focus on zero-and one-shot matches, but instead aggregate counts over the full corpus."}, {"id": 65, "string": "Online Adaptation NMT systems can be readily adapted by finetuning (also called continued training) with the same cross-entropy loss (L) as used for training the parameters of the baseline system, which also serves as the starting point for adaptation (Luong and Manning, 2015) ."}, {"id": 66, "string": "Following Turchi et al."}, {"id": 67, "string": "(2017) , we perform learning from each example i using (stochastic) gradient descent, using the current source x i and reference translation y i as a batch of size 1: θ i ← θ i−1 − γ∇L(θ i−1 , x i , y i )."}, {"id": 68, "string": "(1) Evaluation is carried out using simulated postediting (Hardt and Elming, 2010) , first translating the source using the model with parameters θ i−1 , before performing the update described above with the now revealed reference translation."}, {"id": 69, "string": "The machine translation system effectively only trains for a single iteration for any given data set."}, {"id": 70, "string": "The naïve approach, updating all parameters θ of the NMT model, while being effective, can be infeasible in certain settings 6 , since tens of millions of parameters are updated depending on the respective model."}, {"id": 71, "string": "While some areas of a typical NMT model can be stored in a sparse fashion without loss (source-and target embeddings), large parts of the model cannot."}, {"id": 72, "string": "We denote this type of adaptation as full."}, {"id": 73, "string": "A light-weight alternative to adaptation of the full parameter set is to introduce a second bias term in the final output layer of the NMT model, which is trained in isolation, freezing the rest of the model (Michel and Neubig, 2018) ."}, {"id": 74, "string": "This merely introduces a vector in the size of the output vocabulary."}, {"id": 75, "string": "This method is referred to as bias."}, {"id": 76, "string": "Another alternative is freezing parts of the model , for example determining a subset of parameters by performance on a held-out set (Wuebker et al., 2018) ."}, {"id": 77, "string": "In our experiments we use two systems using this method, fixed and top, the former being a pre-determined fixed selection of parameters, and the latter being the topmost encoder and decoder layers in the Transformer NMT model (Vaswani et al., 2017) ."}, {"id": 78, "string": "Finally, a data-driven alternative to the fixed freezing method was introduced to NMT by Wuebker et al."}, {"id": 79, "string": "(2018) , implementing tensor-wise 1 / 2 group lasso regularization, allowing the learning procedure to select a fixed number of parameters after each update."}, {"id": 80, "string": "This setup is referred to as lasso."}, {"id": 81, "string": "Experiments Neural Machine Translation Systems We adapt an English→German NMT system based on the Transformer architecture trained with an in-house NMT framework on about 100M bilingual sentence pairs."}, {"id": 82, "string": "The model has six layers in the encoder, three layers in the decoder, each with eight attention heads with dimensionality 256, distinct input and output embeddings, and vocabulary sizes of around 40,000."}, {"id": 83, "string": "The vocabularies are generated with byte-pair encoding (Sennrich et al., 2015) ."}, {"id": 84, "string": "For adaptation we use a learning rate γ of 10 −2 (for the bias adaptation a learn- ing rate of 1.0 is used), no dropout, and no labelsmoothing."}, {"id": 85, "string": "We use a tensor-wise 2 normalization to 1.0 for all gradients (gradient clipping)."}, {"id": 86, "string": "Updates for a sentence pair are repeated until the perplexity on that sentence pair is ≤ 2.0, for a maximum of three repetitions."}, {"id": 87, "string": "The fixed adaptation scheme, which involves selecting a subset of parameters on held-out data following Wuebker et al."}, {"id": 88, "string": "(2018) , uses about two million parameters excluding all embedding matrices, in addition to potentially the full source embeddings, but in practice this is limited to about 1M parameters."}, {"id": 89, "string": "The top scheme only adapts the top layers for both encoder and decoder."}, {"id": 90, "string": "For the lasso adaptation, we allow 1M parameters excluding the embeddings, for which we allow 1M parameters in total selected from all embedding matrices."}, {"id": 91, "string": "This scheme also always includes the previously described second bias term in the final output layer."}, {"id": 92, "string": "Since the proposed metrics operate on words, the machine translation outputs are first converted to full-form words using sentencepiece (Kudo and Richardson, 2018) , then tokenized and truecased with the tokenizer and truecaser distributed with the Moses toolkit (Koehn et al., 2007) ."}, {"id": 93, "string": "Results Tables 1 and 2 show the performance of different adaptation techniques on the Autodesk dataset (Zhechev, 2012) , a public post-editing software domain dataset for which incremental adaptation is known to provide large gains for corpus-level metrics."}, {"id": 94, "string": "BLEU, sentence BLEU, and TER scores (Table 1) are similar for full adaptation, sparse adaptation with group lasso, and adaptation of a fixed subset of parameters."}, {"id": 95, "string": "However (in Table 2 lasso substantially outperforms the other methods in zero-shot (R0), and combined zero-and oneshot recall of content words (R0+1)."}, {"id": 96, "string": "Zero-shot recall is considerably degraded relative to the non-adapted baseline for both full and adaptation of a fixed subset of tensors (fixed and top)."}, {"id": 97, "string": "That is, terms never observed before during online training are translated correctly less often than they would be with an unadapted system, despite the data set's consistent domain."}, {"id": 98, "string": "These approaches trade off long-term gains in BLEU and high one-shot recall for low zero-shot recall, which could be frustrating for users who may perceive the degradation in quality for terms appearing for the first time in a document."}, {"id": 99, "string": "The lasso technique is the only one that shows an improvement in R0 over the baseline."}, {"id": 100, "string": "However, lasso has considerably lower one-shot recall compared to the other adaptation methods, implying that it often must observe a translated term more than once to acquire it."}, {"id": 101, "string": "Appendix A shows similar experiments for several other datasets."}, {"id": 102, "string": "Analysis For a better understanding of the results described in the previous section, we conduct an analysis varying the units of the proposed metrics, while focusing on full and lasso adaptation."}, {"id": 103, "string": "For the first variant, only truly novel words are taken into account, i.e."}, {"id": 104, "string": "words in the test set that do not appear in the training data."}, {"id": 105, "string": "Results for these experiments are depicted in Table 3 ."}, {"id": 106, "string": "It is apparent that the findings of Table 2 are confirmed, and that relative differences are amplified."}, {"id": 107, "string": "This can be explained by the reduced number of total occurrences considered, which is only 310 words in this data set."}, {"id": 108, "string": "It is also important to note that all of these   words are made up of known subwords 7 , since our NMT system does not include a copying mechanism and is thus constrained to the target vocabulary."}, {"id": 109, "string": "Further results using the raw subword output 8 of the MT systems are depicted in Table 4 : R0 for the lasso method is degraded only slightly below the baseline (-1%, compared to +2% for the regular metric), the findings for R1 and R0+1 remain the same as observed before."}, {"id": 110, "string": "Compared to the results for novel words this indicates that the improvement in terms of R0 for lasso mostly come from learning new combinations of subwords."}, {"id": 111, "string": "A discussion of the adaptation behavior over time, with exemplified differences between the metrics, can be found in Appendix B."}, {"id": 112, "string": "Conclusions To summarize: In some cases, the strong gains in corpus-level translation quality achieved by fine tuning an NMT model come at the expense of zero-shot recall of content words."}, {"id": 113, "string": "This concerning impact of adaptation could affect practical user experience."}, {"id": 114, "string": "Existing regularization methods mitigate this effect to some degree, but there may be more effective techniques for immediate adaptation that have yet to be developed."}, {"id": 115, "string": "The proposed metrics R0, R1, and R0+1 are useful for measuring immediate adaptation performance, which is crucial in adaptive CAT systems."}, {"id": 116, "string": "Table 5 contains results for additional English→German datasets, namely patents (Wäschle and Riezler, 2012) (Patent), transcribed public speeches (Cettolo et al., 2012) (TED), and two proprietary user data sets, one from the financial domain (User 1) and the other being technical documentation (User 2)."}, {"id": 117, "string": "The same pattern is observed in almost all cases: lasso outperforms the other adaptation techniques in zero-shot recall (R0) and combined recall (R0+1), while full has the highest one-shot recall (R1) on two out of five test sets, being close runner-up to lasso on all others."}, {"id": 118, "string": "Overall however, we observe that zero-shot recall R0 is degraded by adaptation, while one-shot recall is improved."}, {"id": 119, "string": "We also find that adaptation with the light-weight bias method often does not deviate much from the baseline."}, {"id": 120, "string": "In contrast, the results for the traditional MT metrics are predominantly positive."}, {"id": 121, "string": "For adaptation, the lasso method provides the best tradeoff in terms of performance throughout the considered metrics."}, {"id": 122, "string": "A Additional Results B Learning Curves We are also interested in the behavior of the adaptation methods over time."}, {"id": 123, "string": "To this end, in Figure 2 , we plot the difference in cumulative scores 9 of two adapted systems (full and lasso) to the baseline for the proposed metrics as well as the BLEU score."}, {"id": 124, "string": "As evident from comparing the curves for BLEU and R0, the BLEU score and the proposed metric give disparate signals for this data."}, {"id": 125, "string": "Specifically, there are two distinct dips in the curves for R0 (as well as R0+1) and BLEU: 1."}, {"id": 126, "string": "The degradation in R0 around segment 800 is due to significant noise in segment 774, which has a strong impact on the adapted systems, while the baseline system is not affected."}, {"id": 127, "string": "The full system's score drops by about 50% at segment 775 (i.e."}, {"id": 128, "string": "after adaptation) relative to the cumulative score difference at the previous segment and never recovers after that."}, {"id": 129, "string": "2."}, {"id": 130, "string": "The dip in the BLEU score at segment 752, observable for both adapted systems, depicting a relative degradation of about 10%, is due to a pathological repetition of a single character in the output of the adapted MT systems for this segment, which has a large impact on the score."}, {"id": 131, "string": "The dip observed with R0 is also noticeable in BLEU, but much less pronounced at 4% relative for full and 2% relative for lasso."}, {"id": 132, "string": "The dip in BLEU on the other hand is not noticeable with R0, R1, or R0+1."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Motivation", "n": "2.1", "start": 16, "end": 29}, {"section": "Metrics", "n": "2.2", "start": 30, "end": 53}, {"section": "Related Work", "n": "3", "start": 54, "end": 64}, {"section": "Online Adaptation", "n": "4", "start": 65, "end": 80}, {"section": "Neural Machine Translation Systems", "n": "5.1", "start": 81, "end": 92}, {"section": "Results", "n": "5.2", "start": 93, "end": 101}, {"section": "Analysis", "n": "5.3", "start": 102, "end": 111}, {"section": "Conclusions", "n": "6", "start": 112, "end": 132}], "figures": [{"filename": "../figure/image/1350-Figure1-1.png", "caption": "Figure 1: Example for calculating R0, R1, and R0+1 on a corpus of two sentences. Content words are written in brackets, the corpus-level score is given below the per-segment scores. In the example, the denominator for R1 is 2 due to the two repeated words dog and bites in the reference.", "page": 2, "bbox": {"x1": 110.88, "x2": 486.24, "y1": 61.44, "y2": 124.32}}, {"filename": "../figure/image/1350-Table5-1.png", "caption": "Table 5: BLEU, sentence-wise BLEU, TER, R0+1, R0, and R1 metrics for a number of data sets, comparing different adaptation methods as described in Section 4. Baseline results are given as absolute scores, results for adaptation are given as relative differences. Best viewed in color.", "page": 7, "bbox": {"x1": 160.79999999999998, "x2": 436.32, "y1": 121.44, "y2": 653.28}}, {"filename": "../figure/image/1350-Table1-1.png", "caption": "Table 1: Results on the Autodesk test set for traditional MT quality metrics. SBLEU refers to an average of sentence-wise BLEU scores as described by Nakov et al. (2012). The best result in each column is denoted with bold font.", "page": 3, "bbox": {"x1": 331.68, "x2": 501.12, "y1": 62.4, "y2": 175.2}}, {"filename": "../figure/image/1350-Figure2-1.png", "caption": "Figure 2: Differences in cumulative scores for R0 (top left), R1 (top right), R0+1 (bottom left), and BLEU (bottom right) to the baseline system on the Autodesk test set for full and lasso adaptation. The peculiarities discussed in the running text are marked by solid vertical lines (at x = 751 and x = 774).", "page": 8, "bbox": {"x1": 95.52, "x2": 502.08, "y1": 198.72, "y2": 578.88}}, {"filename": "../figure/image/1350-Table4-1.png", "caption": "Table 4: Results on Autodesk data calculating the metrics with subwords.", "page": 4, "bbox": {"x1": 342.71999999999997, "x2": 490.08, "y1": 191.51999999999998, "y2": 264.0}}, {"filename": "../figure/image/1350-Table2-1.png", "caption": "Table 2: Results on the Autodesk test set for the proposed metrics R0, R1, and R0+1.", "page": 4, "bbox": {"x1": 106.56, "x2": 255.35999999999999, "y1": 62.4, "y2": 175.2}}, {"filename": "../figure/image/1350-Table3-1.png", "caption": "Table 3: Results on Autodesk data calculating the metrics only for truly novel content words, i.e. ones that do not occur in the training data.", "page": 4, "bbox": {"x1": 342.71999999999997, "x2": 490.08, "y1": 62.4, "y2": 135.35999999999999}}]}