{"title": "A Stylometric Inquiry into Hyperpartisan and Fake News", "abstract": "We report on a comparative style analysis of hyperpartisan (extremely one-sided) news and fake news. A corpus of 1,627 articles from 9 political publishers, three each from the mainstream, the hyperpartisan left, and the hyperpartisan right, have been fact-checked by professional journalists at BuzzFeed: 97% of the 299 fake news articles identified are also hyperpartisan. We show how a style analysis can distinguish hyperpartisan news from the mainstream (F 1 = 0.78), and satire from both (F 1 = 0.81). But stylometry is no silver bullet as style-based fake news detection does not work (F 1 = 0.46). We further reveal that left-wing and right-wing news share significantly more stylistic similarities than either does with the mainstream. This result is robust: it has been confirmed by three different modeling approaches, one of which employs Unmasking in a novel way. Applications of our results include partisanship detection and pre-screening for semi-automatic fake news detection.", "text": [{"id": 0, "string": "Introduction The media and the public are currently discussing the recent phenomenon of \"fake news\" and its potential role in swaying elections, how it may affect society, and what can and should be done about it."}, {"id": 1, "string": "Prone to misunderstanding and misue, the term \"fake news\" arose from the observation that, in social media, a certain kind of 'news' spreads much more successfully than others, and this kind of 'news' is typically extremely one-sided (hyperpartisan), inflammatory, emotional, and often riddled with untruths."}, {"id": 2, "string": "Although traditional yellow press has been spreading 'news' of varying de-grees of truthfulness long before the digital revolution, its amplification over real news within social media gives many people pause."}, {"id": 3, "string": "The fake news hype caused a widespread disillusionment about social media, and many politicians, news publishers, IT companies, activists, and scientists concur that this is where to draw the line."}, {"id": 4, "string": "For all their good intentions, however, it must be drawn very carefully (if at all), since nothing less than free speech is at stake-a fundamental right of every free society."}, {"id": 5, "string": "Many favor a two-step approach where fake news items are detected and then countermeasures are implemented to foreclose rumors and to discourage repetition."}, {"id": 6, "string": "While some countermeasures are already tried in practice, such as displaying warnings and withholding ad revenue, fake news detection is still in its infancy."}, {"id": 7, "string": "At any rate, a nearreal time reaction is crucial: once a fake news item begins to spread virally, the damage is done and undoing it becomes arduous."}, {"id": 8, "string": "Since knowledge-based and context-based approaches to fake news detection can only be applied after publication, i.e., as news events unfold and as social interactions occur, they may not be fast enough."}, {"id": 9, "string": "We have identified style-based approaches as a viable alternative, allowing for instantaneous reactions, albeit not to fake news, but to hyperpartisanship."}, {"id": 10, "string": "In this regard we contribute (1) a large news corpus annotated by experts with respect to veracity and hyperpartisanship, (2) extensive experiments on discriminating fake news, hyperpartisan news, and satire based solely on writing style, and (3) validation experiments to verify our finding that the writing style of the left and the right have more in common than any of the two have with the mainstream, applying Unmasking in a novel way."}, {"id": 11, "string": "After a review of related work, Section 3 details the corpus and its construction, Section 4 introduces our methodology, and Section 5 reports the results of the aforementioned experiments."}, {"id": 12, "string": "Related Work Approaches to fake news detection divide into three categories (Figure 1 ): they can be knowledge-based (by relating to known facts), context-based (by analyzing news spread in social media), and stylebased (by analyzing writing style)."}, {"id": 13, "string": "Knowledge-based fake news detection."}, {"id": 14, "string": "Methods from information retrieval have been proposed early on to determine the veracity of web documents."}, {"id": 15, "string": "For example, Etzioni et al."}, {"id": 16, "string": "(2008) propose to identify inconsistencies by matching claims extracted from the web with those of a document in question."}, {"id": 17, "string": "Similarly, Magdy and Wanas (2010) measure the frequency of documents that support a claim."}, {"id": 18, "string": "Both approaches face the challenges of web data credibility, namely expertise, trustworthiness, quality, and reliability (Ginsca et al., 2015) ."}, {"id": 19, "string": "Other approaches rely on knowledge bases, including the semantic web and linked open data."}, {"id": 20, "string": "Wu et al."}, {"id": 21, "string": "(2014) \"perturb\" a claim in question to query knowledge bases, using the result variations as indicator of the support a knowledge base offers for the claim."}, {"id": 22, "string": "Ciampaglia et al."}, {"id": 23, "string": "(2015) use the shortest path between concepts in a knowledge graph, whereas Shi and Weninger (2016) use a link prediction algorithm."}, {"id": 24, "string": "However, these approaches are unsuited for new claims without corresponding entries in a knowledge base, whereas knowledge bases can be manipulated (Heindorf et al., 2016) ."}, {"id": 25, "string": "Context-based fake news detection."}, {"id": 26, "string": "Here, fake news items are identified via meta information and spread patterns."}, {"id": 27, "string": "For example, Long et al."}, {"id": 28, "string": "(2017) show that author information can be a useful feature for fake news detection, and Derczynski et al."}, {"id": 29, "string": "(2017) attempt to determine the veracity of a claim based on the conversation it sparks on Twitter as one of the RumourEval tasks."}, {"id": 30, "string": "The Facebook analysis of Mocanu et al."}, {"id": 31, "string": "(2015) shows that unsubstantiated claims spread as widely as well-established ones, and that user groups predisposed to conspiracy theories are more open to sharing the former."}, {"id": 32, "string": "Similarly, Acemoglu et al."}, {"id": 33, "string": "(2010) , Kwon et al."}, {"id": 34, "string": "(2013) , Ma et al."}, {"id": 35, "string": "(2017) , and  model the spread of (mis-)information, while Budak et al."}, {"id": 36, "string": "(2011) and Nguyen et al."}, {"id": 37, "string": "(2012) propose algorithms to limit its spread."}, {"id": 38, "string": "The efficacy of countermeasures like debunking sites is studied by Tambuscio et al."}, {"id": 39, "string": "(2015) ."}, {"id": 40, "string": "While achieving good results, context-based approaches suffer from working only a posteriori, requiring large amounts of data, and disregarding the actual news content."}, {"id": 41, "string": "Long et al., 2017 Mocanu et al., 2015 Acemoglu et al., 2010 Kwon et al., 2013 Ma et al., 2017 Budak et al., 2011 Nguyen et al."}, {"id": 42, "string": "2012 Derczynski et al., 2017 Tambuscio et al., 2015 Afroz et al., 2012 Badaskar et al., 2008 Rubin et al., 2016 Rashkin et al., 2017 Horne and Adali, 2017 Pérez-Rosas et al., 2017 Wang et al., 2017 Bourgonje et al., 2017 Wu et al., 2014 Ciampaglia et al, 2015 Shi and Weninger, 2016 Etzioni et al., 2018 Magdy and Wanas, 2010 Ginsca et al., 2015 Figure 1: Taxonomy of paradigms for fake news detection alongside a selection of related work."}, {"id": 43, "string": "Style-based fake news detection."}, {"id": 44, "string": "Deception detection originates from forensic linguistics and builds on the Undeutsch hypothesis-a result from forensic psychology which asserts that memories of reallife, self-experienced events differ in content and quality from imagined events (Undeutsch, 1967) ."}, {"id": 45, "string": "The hypothesis led to the development of forensic tools to assess testimonies at the statement level."}, {"id": 46, "string": "Some approaches operationalize deception detection at scale to detect uncertainty in social media posts, for example  and ."}, {"id": 47, "string": "In this regard,  use rhetorical structure theory as a measure of story coherence and as an indicator for fake news."}, {"id": 48, "string": "Recently, Wang (2017) collected a large dataset consisting of sentence-length statements along their veracity from the fact-checking site PolitiFact.com, and then used style features to detect false statements."}, {"id": 49, "string": "A related task is stance detection, where the goal is to detect the relation between a claim about an article, and the article itself (Bourgonje et al., 2017) ."}, {"id": 50, "string": "Most prominently, stance detection was the task of the Fake News Challenge 1 which ran in 2017 and received 50 submissions, albeit hardly any participants published their approach."}, {"id": 51, "string": "Where deception detection focuses on single statements, style-based text categorization as proposed by Argamon-Engelson et al."}, {"id": 52, "string": "(1998) assesses entire texts."}, {"id": 53, "string": "Common applications are author profiling (age, gender, etc.)"}, {"id": 54, "string": "and genre classification."}, {"id": 55, "string": "Though susceptible to authors who can modify their writing style, such obfuscations may be detectable (e.g., Afroz et al."}, {"id": 56, "string": "(2012) )."}, {"id": 57, "string": "As an early precursor to fake news detection, Badaskar et al."}, {"id": 58, "string": "(2008) train models to identify news items that were automatically generated."}, {"id": 59, "string": "Currently, text categorization methods for fake news detection focus mostly on satire detection (e.g., Rubin et al."}, {"id": 60, "string": "(2016) , )."}, {"id": 61, "string": "Rashkin et al."}, {"id": 62, "string": "(2017) perform a statistical analysis of the stylistic differences between real, satire, hoax, and propaganda news."}, {"id": 63, "string": "We make use of their results by incorporating the bestperforming style features identified."}, {"id": 64, "string": "Finally, two preprint papers have been recently shared."}, {"id": 65, "string": "Horne and Adali (2017) use style features for fake news detection."}, {"id": 66, "string": "However, the relatively high accuracies reported must be taken with a grain of salt: their two datasets comprise only 70 news articles each, whose ground-truth is based on where an article came from, instead of resulting from a per-article expert review as in our case; their final classifier uses only 4 features (number of nouns, type-token ratio, word count, number of quotes), which can be easily manipulated; and based on their experimental setup, it cannot be ruled out that the classifier simply differentiates news portals rather than fake and real articles."}, {"id": 67, "string": "We avoid this problem by testing our classifiers on articles from portals which were not represented in the training data."}, {"id": 68, "string": "Similarly, Pérez-Rosas et al."}, {"id": 69, "string": "(2017) also report on constructing two datasets comprising around 240 and 200 news article excerpts (i.e., the 5-sentence lead) with a balanced distribution of fake vs. real."}, {"id": 70, "string": "The former was collected via crowdsourcing, asking workers to write a fake news item based on a real news item, the latter was collected from the web."}, {"id": 71, "string": "For style analysis, the former dataset may not be suitable, since the authors note themselves that \"workers succeeded in mimicking the reporting style from the original news\"."}, {"id": 72, "string": "The latter dataset encompasses only celebrity news (i.e., yellow press), which introduces a bias."}, {"id": 73, "string": "Their feature selection follows that of Rubin et al."}, {"id": 74, "string": "(2016) , which is covered by our experiments, but also incorporates topic features, rendering the resulting classifier not generalizable."}, {"id": 75, "string": "The BuzzFeed-Webis Fake News Corpus This section introduces the BuzzFeed-Webis Fake News Corpus 2016, detailing its construction and annotation by professional journalists employed at BuzzFeed, as well as key figures and statistics."}, {"id": 76, "string": "2 Corpus Construction The corpus encompasses the output of 9 publishers on 7 workdays close to the US presidential elections 2016, namely September 19 to 23, 26, and 27."}, {"id": 77, "string": "Table 1 gives an overview."}, {"id": 78, "string": "Among the selected publishers are six prolific hyperpartisan ones (three left-wing and three right-wing), and three mainstream ones."}, {"id": 79, "string": "All publishers earned Facebook's blue checkmark , indicating authenticity and an elevated status within the network."}, {"id": 80, "string": "Every post and linked news article has been fact-checked by 4 BuzzFeed journalists, including about 19% of posts forwarded from third parties."}, {"id": 81, "string": "Having checked a total of 2,282 posts, 1,145 mainstream, 471 leftwing, and 666 right-wing, Silverman et al."}, {"id": 82, "string": "(2016) reported key insights as a data journalism article."}, {"id": 83, "string": "The annotations were published alongside the article."}, {"id": 84, "string": "3 However, this data only comprises URLs to the original Facebook posts."}, {"id": 85, "string": "To construct our corpus, we archived the posts, the linked articles, and attached media as well as relevant meta data to ensure long-term availability."}, {"id": 86, "string": "Due to the rapid pace at which the publishers change their websites, we were able to recover only 1,627 articles, 826 mainstream, 256 left-wing, and 545 right-wing."}, {"id": 87, "string": "Manual fact-checking."}, {"id": 88, "string": "A binary distinction between fake and real news turned out to be infeasible, since hardly any piece of fake news is entirely false, and pieces of real news may not be flawless."}, {"id": 89, "string": "Therefore, posts were rated \"mostly true,\" \"mixture of true and false,\" \"mostly false,\" or, if the post was opinion-driven or otherwise lacked a factual claim, \"no factual content.\""}, {"id": 90, "string": "Four BuzzFeed journalists worked on the manual fact-checks of the news articles: to minimize costs, each article was reviewed only once and articles were assigned round robin."}, {"id": 91, "string": "The ratings \"mixture of true and false\" and \"mostly false\" had to be justified, and, when in doubt about a rating, a second opinion was collected, whereas disagreements were resolved by a third one."}, {"id": 92, "string": "Finally, all news rated \"mostly false\" underwent a final check to ensure the rating was justified, lest the respective publishers would contest it."}, {"id": 93, "string": "The journalists were given the following guidance: Mostly true: The post and any related link or image are based on factual information and portray it accurately."}, {"id": 94, "string": "The authors may interpret the event/info in their own way, so long as they do not misrepresent events, numbers, quotes, reactions, etc., or make information up."}, {"id": 95, "string": "This rating does not allow for unsupported speculation or claims."}, {"id": 96, "string": "Mixture of true and false (mix, for short): Some elements of the information are factually accurate, but some elements or claims are not."}, {"id": 97, "string": "This rating should be used when speculation or unfounded claims are mixed with real events, numbers, quotes, etc., or when the headline of the link being shared makes a false claim but the text of the story is largely accurate."}, {"id": 98, "string": "It should also only be used when the unsupported or false information is roughly equal to the accurate information in the post or link."}, {"id": 99, "string": "Finally, use this rating for news articles that are based on unconfirmed information."}, {"id": 100, "string": "Mostly false: Most or all of the information in the post or in the link being shared is inaccurate."}, {"id": 101, "string": "This should also be used when the central claim being made is false."}, {"id": 102, "string": "No factual content (n/a, for short): This rating is used for posts that are pure opinion, comics, satire, or any other posts that do not make a factual claim."}, {"id": 103, "string": "This is also the category to use for posts that are of the \"Like this if you think...\" variety."}, {"id": 104, "string": "Limitations Given the significant workload (i.e., costs) required to carry out the aforementioned annotations, the corpus is restricted to the given temporal period and biased toward the US culture and political landscape, comprising only English news articles from a limited number of publishers."}, {"id": 105, "string": "Annotations were recorded at the article level, not at statement level."}, {"id": 106, "string": "For text categorization, this is sufficient."}, {"id": 107, "string": "At the time of writing, our corpus is the largest of its kind that has been annotated by professional journalists."}, {"id": 108, "string": "Table 1 shows the fact-checking results and some key statistics per article."}, {"id": 109, "string": "Unsurprisingly, none of the mainstream articles are mostly false, whereas 8 across all three publishers are a mixture of true and false."}, {"id": 110, "string": "Disregarding non-factual articles, a little more than a quarter of all hyperpartisan left-wing articles were found faulty: 15 articles mostly false, and 51 a mixture of true and false."}, {"id": 111, "string": "Publisher \"The Other 98%\" sticks out by achieving an almost per-  fect score."}, {"id": 112, "string": "By contrast, almost 45% of the rightwing articles are a mixture of true and false (153) or mostly false (72)."}, {"id": 113, "string": "Here, publisher \"Right Wing News\" sticks out by supplying more than half of mixtures of true and false alone, whereas mostly false articles are equally distributed."}, {"id": 114, "string": "Corpus Statistics Regarding key statistics per article, it is interesting that the articles from all mainstream publishers are on average about 20 paragraphs long with word counts ranging from 550 words on average at ABC News to 800 at Politico."}, {"id": 115, "string": "Except for one publisher, left-wing articles and right-wing articles are shorter on average in terms of paragraphs as well as word count, averaging at about 420 words and 400 words, respectively."}, {"id": 116, "string": "Left-wing articles quote on average about 10 words more than the mainstream, and right-wing articles 6 words more."}, {"id": 117, "string": "When articles comprise links, they are usually external ones, whereas ABC News rather uses internal links, and only half of the links found at Politico articles are external."}, {"id": 118, "string": "Left-wing news articles stick out by containing almost double the amount of links across publishers than mainstream and right-wing ones."}, {"id": 119, "string": "Operationalizing Fake News In our experiments, we operationalize the category of fake news by joining the articles that were rated mostly false with those rated a mixture of true and false."}, {"id": 120, "string": "Arguably, the latter may not be exactly what is deemed \"fake news\" (as in: a complete fabrication), however, practice shows fake news are hardly ever devoid of truth."}, {"id": 121, "string": "More often, true facts are misconstrued or framed badly."}, {"id": 122, "string": "In our experiments, we hence call mostly true articles real news, mostly false plus mixtures of true and false-except for satire-fake news, and disregard all articles rated non-factual."}, {"id": 123, "string": "Methodology This section covers our methodology, including our feature set to capture writing style, and a brief recap of Unmasking by Koppel et al."}, {"id": 124, "string": "(2007) , which we employ for the first time to distinguish genre styles as opposed to author styles."}, {"id": 125, "string": "For sake of reproducibility, all our code has been published."}, {"id": 126, "string": "4 Style Features and Feature Selection Our writing style model incorporates common features as well as ones specific to the news domain."}, {"id": 127, "string": "The former are n-grams, n in [1, 3] , of characters, stop words, and parts-of-speech."}, {"id": 128, "string": "Further, we employ 10 readability scores 5 and dictionary features, each indicating the frequency of words from a tailor-made dictionary in a document, using the General Inquirer Dictionaries as a basis (Stone et al., 1966) ."}, {"id": 129, "string": "The domain-specific features include ratios of quoted words and external links, the number of paragraphs, and their average length."}, {"id": 130, "string": "In each of our experiments, we carefully select from the aforementioned features the ones worthwhile using: all features are discarded that are hardly represented in our corpus, namely word tokens that occur in less than 2.5% of the documents, and n-gram features that occur in less than 10% of the documents."}, {"id": 131, "string": "Discarding these features prevents overfitting and improves the chances that our model will generalize."}, {"id": 132, "string": "If not stated otherwise, our experiments share a common setup."}, {"id": 133, "string": "In order to avoid biases from the respective training sets, we balance them using oversampling."}, {"id": 134, "string": "Furthermore, we perform 3-fold cross-validation where each fold comprises one publisher from each orientation, so that the classifier does not learn a publisher's style."}, {"id": 135, "string": "For non-Unmasking experiments we use WEKA's random forest implementation with default settings."}, {"id": 136, "string": "Unmasking Genre Styles Unmasking, as proposed by Koppel et al."}, {"id": 137, "string": "(2007) , is a meta learning approach for authorship verification."}, {"id": 138, "string": "We study for the first time whether it can be used to assess the similarity of more broadly defined style categories, such as left-wing vs. rightwing vs. mainstream news."}, {"id": 139, "string": "This way, we uncover relations between the writing styles that people may involuntarily adopt as per their political orientation."}, {"id": 140, "string": "Originally, Unmasking takes two documents as input and outputs its confidence whether they have been written by the same author."}, {"id": 141, "string": "Three steps are taken to accomplish this: first, each document is chunked into a set of at least 500-word long chunks; second, classification errors are measured while iteratively removing the most discriminative features of a style model consisting of the 250 most frequent words, separating the two chunk sets with a linear classifier; and third, the resulting classification accuracy curves are analyzed with regard to their slope."}, {"id": 142, "string": "A steep decrease is more likely than a shallow decrease if the two documents have been written by the same author, since there are presumably less discriminating features between documents written by the same author than between documents written by different authors."}, {"id": 143, "string": "Training a classifier on many examples of error curves obtained from same-author document pairs and differentauthor document pairs yields an effective authorship verifier-at least for long documents that can be split up into a sufficient number of chunks."}, {"id": 144, "string": "It turns out that what applies to the style of authors also applies to genre styles."}, {"id": 145, "string": "We adapt Unmasking by skipping its first step and using two sets of documents (e.g., left-wing articles and rightwing articles) as input."}, {"id": 146, "string": "When plotting classification error curves for visual inspection, steeper decreases in these plots, too, indicate higher style similarity of the two input document sets, just as with chunk sets of two documents written by the same author."}, {"id": 147, "string": "Baselines We employ four baseline models: a topic-based bag of words model, often used in the literature, but less practical since news topics change frequently and drastically; a model using only the domain-specific news style features to check whether the differences between categories measured as corpus statistics play a significant role; and naive baselines that classify all items into one of the categories in question, relating our results to the class distributions."}, {"id": 148, "string": "Performance Measures Classification performance is measured as accuracy, and class-wise precision, recall, and F 1 ."}, {"id": 149, "string": "We favor these measures over, e.g., areas under the ROC curve or the precision recall curve for simplicity sake."}, {"id": 150, "string": "Also, the tasks we are tackling are new, so that little is known to date about user preferences."}, {"id": 151, "string": "This is also why we chose the evenly-balanced F 1 ."}, {"id": 152, "string": "Experiments We report on the results of two series of experiments that investigate style differences and similarities between hyperpartisan and mainstream news, and between fake, real, and satire news, shedding light on the following questions: 1."}, {"id": 153, "string": "Can (left/right) hyperpartisanship be distinguished from the mainstream?"}, {"id": 154, "string": "2."}, {"id": 155, "string": "Is style-based fake news detection feasible?"}, {"id": 156, "string": "3."}, {"id": 157, "string": "Can fake news be distinguished from satire?"}, {"id": 158, "string": "Our first experiment addressing the first question uncovered an odd behavior of our classifier: it would often misjudge left-wing for right-wing news, while being much better at distinguishing both combined from the mainstream."}, {"id": 159, "string": "To explain this behavior, we hypothesized that maybe the writing style of the hyperpartisan left and right are more similar to one another than to the mainstream."}, {"id": 160, "string": "To investigate this hypothesis, we devised two additional validation experiments, yielding three sources of evidence instead of just one."}, {"id": 161, "string": "Hyperpartisanship vs."}, {"id": 162, "string": "Mainstream A."}, {"id": 163, "string": "Predicting orientation."}, {"id": 164, "string": "Table 2 shows the classification performance of a ternary classifier trained to discriminate left, right, and mainstream-an obvious first experiment for our dataset."}, {"id": 165, "string": "Separating the left and right orientation from the mainstream does not work too well: the topic baseline outperforms the style-based models with regard to accuracy, whereas the results for class-wise precision and recall are a mixed bag."}, {"id": 166, "string": "The left-wing articles are apparently significantly more difficult to be identified compared to articles from the other two orientations."}, {"id": 167, "string": "When we inspected the confusion matrix (not shown), it turned out that 66% of misclassifications of left-wing articles are falsely classified as right-wing articles, whereas 60% of all misclassified right-wing articles are classified as mainstream articles."}, {"id": 168, "string": "Misclassified mainstream articles spread almost evenly across the other classes."}, {"id": 169, "string": "The poor performance of the domain-specific news style features by themselves demonstrate that orientation cannot be discriminated based on the basic corpus characteristics observed with respect to paragraphs, quotations, and hyperlinks."}, {"id": 170, "string": "This holds for all subsequent experiments."}, {"id": 171, "string": "B."}, {"id": 172, "string": "Predicting hyperpartisanship."}, {"id": 173, "string": "Given the apparent difficulty of telling apart individual orientations, we did not frantically add features or switch classifiers to make it work."}, {"id": 174, "string": "Rather, we trained a binary    classifier to discriminate hyperpartisanship in general from the mainstream."}, {"id": 175, "string": "Table 3 shows the performance values."}, {"id": 176, "string": "This time, the best classification accuracy of 0.75 at a remarkable 0.89 recall for the hyperpartisan class is achieved by the style-based classifier, outperforming the topic baseline."}, {"id": 177, "string": "Comparing Table 2 and Table 3 , we were left with a riddle: all other things being equal, how could it be that hyperpartisanship in general can be much better discriminated from the mainstream than individual orientation?"}, {"id": 178, "string": "Attempts to answer this question gave rise to our aforementioned hypothesis that, perhaps, the writing style of hyperpartisan left and right are not altogether different, despite their opposing agendas."}, {"id": 179, "string": "Or put another way, if style and topic are orthogonal concepts, then being an extremist should not exert a different style dependent on political orientation."}, {"id": 180, "string": "Excited, we sought ways to independently disprove the hypothesis, and found two: Experiments C and D. C. Validation using leave-out classification."}, {"id": 181, "string": "If leftwing and right-wing articles have a more similar style than either of them compared to mainstream articles, then what class would a binary classifier assign to a left-wing article, if it were trained to distinguish only the right-wing from the mainstream, and vice versa?"}, {"id": 182, "string": "Table 4 shows the results of this experiment."}, {"id": 183, "string": "As indicated by proportions well above 0.50, full style-based classifiers have a tendency of clas- approach in the context of authorship verification, for the first time, we generalize Unmasking to assess genre styles: just like author style similarity, genre style similarity will be characterized by the slope of a given Unmasking curve, where a steeper decrease indicates higher similarity."}, {"id": 184, "string": "We apply Unmasking as described in Section 4.2 onto pairs of sets of left, right, and mainstream articles."}, {"id": 185, "string": "Figure 2 shows the resulting Unmasking curves (Unmasking is symmetrical, hence three curves)."}, {"id": 186, "string": "The curves are averaged over 5 runs, where each run comprised sets of 100 articles from each orientation."}, {"id": 187, "string": "In case of the left-wing orientation, where less than 500 articles are available in our corpus, once all of them had been used, they were shuffled again to select articles for the remainder of the runs."}, {"id": 188, "string": "As can be seen, the curve comparing left vs. right has a distinctly steeper slope than either of the others."}, {"id": 189, "string": "This result hence matches the findings of the previous experiments."}, {"id": 190, "string": "With caution, we conclude that the evidence gained from our three independent experimental setups supports our hypothesis that the hyperpartisan left and the hyperpartisan right have more in common in terms of writing style than any of the two have with the mainstream."}, {"id": 191, "string": "Another more tangible (e.g., practical) outcome of Experiment B is the finding that hyperpartisan news can apparently be discriminated well from the mainstream: in particular the high recall of 0.89 at a reasonable precision of 0.69 gives us confidence that, with some further effort, a practical classifier can be built that detects hyperpartisan news at scale and in real time, since an article's style can be assessed immediately without referring to external information."}, {"id": 192, "string": "Fake vs. Real (vs. Satire) This series of experiments targets research questions (2) and (3) ."}, {"id": 193, "string": "Again, we conduct three experiments, where the first is about predicting veracity, and the last two about discriminating satire."}, {"id": 194, "string": "A."}, {"id": 195, "string": "Predicting veracity."}, {"id": 196, "string": "When taking into account that the mainstream news publishers in our corpus did not publish any news items that are mostly false, and only very few instances that are mixtures of true and false, we may safely disregard them for the task of fake news detection."}, {"id": 197, "string": "A reliable classifier for hyperpartisan news can act as a prefilter for a subsequent, more in-depth fake news detection approach, which may in turn be tailored to a much more narrowly defined classification task."}, {"id": 198, "string": "We hence use only the left-wing articles and the right-wing articles of our corpus for our attempt at a style-based fake news classifier."}, {"id": 199, "string": "Table 5 shows the performance values for a generic classifier that predicts fake news across orientations, and orientation-specific classifiers that have been individually trained on articles from either orientation."}, {"id": 200, "string": "Although all classifiers outperform the naive baselines of classifying everything into one of the classes in terms of precision, the slight increase comes at the cost of a large decrease in recall."}, {"id": 201, "string": "While the orientation-specific classifiers are slightly better for most metrics, none of them outperform the naive baselines regarding the F -Measure."}, {"id": 202, "string": "We conclude that style-based fake news classification simply does not work in general."}, {"id": 203, "string": "B."}, {"id": 204, "string": "Predicting satire."}, {"id": 205, "string": "Yet, not all fake news are the same."}, {"id": 206, "string": "One should distinguish satire from the rest, which takes the form of news but lies more or less obviously to amuse its readers."}, {"id": 207, "string": "Regardless the problems that spreading fake news may cause, satire should never be filtered, but be discriminated from other fakes."}, {"id": 208, "string": "Table 6 shows the performance values of our classifier in the satire-detection setting used by Rubin et al."}, {"id": 209, "string": "(2016) (the S-n-L News DB corpus), distinguishing satire from real news."}, {"id": 210, "string": "This setting uses a balanced 3:1 training-to-test set split over 360 articles (180 per class)."}, {"id": 211, "string": "As can be seen, our style-based model significantly outperforms all baselines across the board, achieving an accuracy of 0.82, and an F score of 0.81."}, {"id": 212, "string": "It clearly improves over topic classification, but does not outperform Rubin et al."}, {"id": 213, "string": "'s classifier, which includes features based on topic, absurdity, grammar, and punctuation."}, {"id": 214, "string": "We argue that incorporating topic into satire detection is not appropriate, since the topics of satire change along the topics of news."}, {"id": 215, "string": "A classifier with topic features therefore does not generalize."}, {"id": 216, "string": "Apparently, a style-based model is competitive, and we believe that satire can be detected at scale this way, so as to prevent other fake news detection technology from falsely filtering it."}, {"id": 217, "string": "C. Unmasking satire."}, {"id": 218, "string": "Given the above results on stylistic similarities between left and right news, the question remains how satire fits into the picture."}, {"id": 219, "string": "We assess the style similarity of satire from Rubin et al."}, {"id": 220, "string": "'s corpus compared to fake news and real news from ours, again applying Unmasking to compare pairs of the three categories of news as described above."}, {"id": 221, "string": "Figure 3 shows the resulting Un-masking curves."}, {"id": 222, "string": "The curve for the pair of fake vs. real news drops faster compared to the other two pairs."}, {"id": 223, "string": "Apparently, the style of fake news has more in common with that of real news than either of the two have with satire."}, {"id": 224, "string": "These results are encouraging: satire is distinct enough from fake and real news, so that, just like with hyperpartisan news compared to mainstream news, it can be discriminated with reasonable accuracy."}, {"id": 225, "string": "Conclusion Fact-checking for fake news detection poses an interdisciplinary challenge: technology is required to extract factual statements from text, to match facts with a knowledge base, to dynamically retrieve and maintain knowledge bases from the web, to reliably assess the overall veracity of an entire article rather than individual statements, to do so in real time as news events unfold, to monitor the spread of fake news within and across social media, to measure the reputation of information sources, and to raise awareness in readers."}, {"id": 226, "string": "These are only the most salient things that need be done to tackle the problem, and as our cross-section of related work shows, a large body of work must be covered."}, {"id": 227, "string": "Notwithstanding the many attacks on fake news by developing one way or another of fact-checking, we believe it worthwhile to mount our attack from another angle: writing style."}, {"id": 228, "string": "We show that news articles conveying a hyperpartisan world view can be distinguished from more balanced news by writing style alone."}, {"id": 229, "string": "Moreover, for the first time, we found quantifiable evidence that the writing styles of news of the two opposing orientations are in fact very similar: there appears to be a common writing style of left and right extremism."}, {"id": 230, "string": "We further show that satire can be distinguished well from other news, ensuring that humor will not be outcast by fake news detection technology."}, {"id": 231, "string": "All of these results offer new, tangible, short-term avenues of development, lest large-scale fact-checking is still far out of reach."}, {"id": 232, "string": "Employed as pre-filtering technologies to separate hyperpartisan news from mainstream news, our approach allows for directing the attention of human fact checkers to the most likely sources of fake news."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 11}, {"section": "Related Work", "n": "2", "start": 12, "end": 72}, {"section": "The BuzzFeed-Webis Fake News Corpus", "n": "3", "start": 73, "end": 75}, {"section": "Corpus Construction", "n": "3.1", "start": 76, "end": 103}, {"section": "Limitations", "n": "3.2", "start": 104, "end": 113}, {"section": "Corpus Statistics", "n": "3.3", "start": 114, "end": 118}, {"section": "Operationalizing Fake News", "n": "3.4", "start": 119, "end": 122}, {"section": "Methodology", "n": "4", "start": 123, "end": 125}, {"section": "Style Features and Feature Selection", "n": "4.1", "start": 126, "end": 135}, {"section": "Unmasking Genre Styles", "n": "4.2", "start": 136, "end": 146}, {"section": "Baselines", "n": "4.3", "start": 147, "end": 147}, {"section": "Performance Measures", "n": "4.4", "start": 148, "end": 151}, {"section": "Experiments", "n": "5", "start": 152, "end": 161}, {"section": "Hyperpartisanship vs. Mainstream", "n": "5.1", "start": 162, "end": 191}, {"section": "Fake vs. Real (vs. Satire)", "n": "5.2", "start": 192, "end": 224}, {"section": "Conclusion", "n": "6", "start": 225, "end": 232}], "figures": [{"filename": "../figure/image/1353-Table4-1.png", "caption": "Table 4: Ratio of left articles misclassified right when omitting left articles from training, and vice versa.", "page": 5, "bbox": {"x1": 329.76, "x2": 503.03999999999996, "y1": 275.52, "y2": 331.2}}, {"filename": "../figure/image/1353-Table2-1.png", "caption": "Table 2: Performance of predicting orientation.", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 115.67999999999999, "y2": 144.96}}, {"filename": "../figure/image/1353-Table3-1.png", "caption": "Table 3: Performance of predicting hyperpartisanship.", "page": 5, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 173.76, "y2": 248.16}}, {"filename": "../figure/image/1353-Figure1-1.png", "caption": "Figure 1: Taxonomy of paradigms for fake news detection alongside a selection of related work.", "page": 1, "bbox": {"x1": 312.0, "x2": 525.6, "y1": 72.48, "y2": 365.28}}, {"filename": "../figure/image/1353-Figure3-1.png", "caption": "Figure 3: Unmasking applied to pairs of sets of news that are fake, real, and satire.", "page": 6, "bbox": {"x1": 319.2, "x2": 515.04, "y1": 62.879999999999995, "y2": 194.88}}, {"filename": "../figure/image/1353-Figure2-1.png", "caption": "Figure 2: Unmasking applied to pairs of political orientations. The steeper a curve, the more similar the respective styles.", "page": 6, "bbox": {"x1": 84.0, "x2": 279.36, "y1": 62.879999999999995, "y2": 195.84}}, {"filename": "../figure/image/1353-Table6-1.png", "caption": "Table 6: Performance of predicting satire (sat.).", "page": 7, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 193.44, "y2": 273.12}}, {"filename": "../figure/image/1353-Table5-1.png", "caption": "Table 5: Performance of predicting veracity.", "page": 7, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 62.4, "y2": 166.07999999999998}}]}