{"title": "Towards Understanding the Geometry of Knowledge Graph Embeddings", "abstract": "Knowledge Graph (KG) embedding has emerged as a very active area of research over the last few years, resulting in the development of several embedding methods. These KG embedding methods represent KG entities and relations as vectors in a high-dimensional space. Despite this popularity and effectiveness of KG embeddings in various tasks (e.g., link prediction), geometric understanding of such embeddings (i.e., arrangement of entity and relation vectors in vector space) is unexplored -we fill this gap in the paper. We initiate a study to analyze the geometry of KG embeddings and correlate it with task performance and other hyperparameters. To the best of our knowledge, this is the first study of its kind. Through extensive experiments on real-world datasets, we discover several insights. For example, we find that there are sharp differences between the geometry of embeddings learnt by different classes of KG embeddings methods. We hope that this initial study will inspire other follow-up research on this important but unexplored problem.", "text": [{"id": 0, "string": "Introduction Knowledge Graphs (KGs) are multi-relational graphs where nodes represent entities and typededges represent relationships among entities."}, {"id": 1, "string": "Recent research in this area has resulted in the development of several large KGs, such as NELL (Mitchell et al., 2015) , YAGO (Suchanek et al., 2007) , and Freebase (Bollacker et al., 2008) , among others."}, {"id": 2, "string": "These KGs contain thousands of predicates (e.g., person, city, mayorOf(person, city), etc."}, {"id": 3, "string": "), and millions of triples involving such predicates, e.g., (Bill de Blasio, mayorOf, New York City) ."}, {"id": 4, "string": "The problem of learning embeddings for Knowledge Graphs has received significant attention in recent years, with several methods being proposed (Bordes et al., 2013; Lin et al., 2015; Nguyen et al., 2016; Nickel et al., 2016; Trouillon et al., 2016) ."}, {"id": 5, "string": "These methods represent entities and relations in a KG as vectors in high dimensional space."}, {"id": 6, "string": "These vectors can then be used for various tasks, such as, link prediction, entity classification etc."}, {"id": 7, "string": "Starting with TransE (Bordes et al., 2013) , there have been many KG embedding methods such as TransH (Wang et al., 2014) , TransR (Lin et al., 2015) and STransE (Nguyen et al., 2016) which represent relations as translation vectors from head entities to tail entities."}, {"id": 8, "string": "These are additive models, as the vectors interact via addition and subtraction."}, {"id": 9, "string": "Other KG embedding models, such as, DistMult (Yang et al., 2014) , HolE (Nickel et al., 2016) , and ComplEx (Trouillon et al., 2016) are multiplicative where entityrelation-entity triple likelihood is quantified by a multiplicative score function."}, {"id": 10, "string": "All these methods employ a score function for distinguishing correct triples from incorrect ones."}, {"id": 11, "string": "In spite of the existence of many KG embedding methods, our understanding of the geometry and structure of such embeddings is very shallow."}, {"id": 12, "string": "A recent work (Mimno and Thompson, 2017) analyzed the geometry of word embeddings."}, {"id": 13, "string": "However, the problem of analyzing geometry of KG embeddings is still unexplored -we fill this important gap."}, {"id": 14, "string": "In this paper, we analyze the geometry of such vectors in terms of their lengths and conicity, which, as defined in Section 4, describes their positions and orientations in the vector space."}, {"id": 15, "string": "We later study the effects of model type and training hyperparameters on the geometry of KG embeddings and correlate geometry with performance."}, {"id": 16, "string": "We make the following contributions: • We initiate a study to analyze the geometry of various Knowledge Graph (KG) embeddings."}, {"id": 17, "string": "To the best of our knowledge, this is the first study of its kind."}, {"id": 18, "string": "We also formalize various metrics which can be used to study geometry of a set of vectors."}, {"id": 19, "string": "• Through extensive analysis, we discover several interesting insights about the geometry of KG embeddings."}, {"id": 20, "string": "For example, we find systematic differences between the geometries of embeddings learned by additive and multiplicative KG embedding methods."}, {"id": 21, "string": "• We also study the relationship between geometric attributes and predictive performance of the embeddings, resulting in several new insights."}, {"id": 22, "string": "For example, in case of multiplicative models, we observe that for entity vectors generated with a fixed number of negative samples, lower conicity (as defined in Section 4) or higher average vector length lead to higher performance."}, {"id": 23, "string": "Source code of all the analysis tools developed as part of this paper is available at https://github.com/malllabiisc/ kg-geometry."}, {"id": 24, "string": "We are hoping that these resources will enable one to quickly analyze the geometry of any KG embedding, and potentially other embeddings as well."}, {"id": 25, "string": "Related Work In spite of the extensive and growing literature on both KG and non-KG embedding methods, very little attention has been paid towards understanding the geometry of the learned embeddings."}, {"id": 26, "string": "A recent work (Mimno and Thompson, 2017) is an exception to this which addresses this problem in the context of word vectors."}, {"id": 27, "string": "This work revealed a surprising correlation between word vector geometry and the number of negative samples used during training."}, {"id": 28, "string": "Instead of word vectors, in this paper we focus on understanding the geometry of KG embeddings."}, {"id": 29, "string": "In spite of this difference, the insights we discover in this paper generalizes some of the observations in the work of (Mimno and Thompson, 2017) ."}, {"id": 30, "string": "Please see Section 6.2 for more details."}, {"id": 31, "string": "Since KGs contain only positive triples, negative sampling has been used for training KG embeddings."}, {"id": 32, "string": "Effect of the number of negative samples in KG embedding performance was studied by (Toutanova et al., 2015) ."}, {"id": 33, "string": "In this paper, we study the effect of the number of negative samples on KG embedding geometry as well as performance."}, {"id": 34, "string": "In addition to the additive and multiplicative KG embedding methods already mentioned in Section 1, there is another set of methods where the entity and relation vectors interact via a neural network."}, {"id": 35, "string": "Examples of methods in this category include NTN (Socher et al., 2013) , CONV (Toutanova et al., 2015) , ConvE (Dettmers et al., 2017) , R-GCN (Schlichtkrull et al., 2017) , ER-MLP (Dong et al., 2014) and ER-MLP-2n (Ravishankar et al., 2017) ."}, {"id": 36, "string": "Due to space limitations, in this paper we restrict our scope to the analysis of the geometry of additive and multiplicative KG embedding models only, and leave the analysis of the geometry of neural network-based methods as part of future work."}, {"id": 37, "string": "Overview of KG Embedding Methods For our analysis, we consider six representative KG embedding methods: TransE (Bordes et al., 2013) , TransR (Lin et al., 2015) , STransE (Nguyen et al., 2016) , DistMult (Yang et al., 2014) , HolE (Nickel et al., 2016) and ComplEx (Trouillon et al., 2016) ."}, {"id": 38, "string": "We refer to TransE, TransR and STransE as additive methods because they learn embeddings by modeling relations as translation vectors from one entity to another, which results in vectors interacting via the addition operation during training."}, {"id": 39, "string": "On the other hand, we refer to Dist-Mult, HolE and ComplEx as multiplicative methods as they quantify the likelihood of a triple belonging to the KG through a multiplicative score function."}, {"id": 40, "string": "The score functions optimized by these methods are summarized in Table 1 ."}, {"id": 41, "string": "Notation: Let G = (E, R, T ) be a Knowledge Graph (KG) where E is the set of entities, R is the set of relations and T ⊂ E × R × E is the set of triples stored in the graph."}, {"id": 42, "string": "Most of the KG embedding methods learn vectors e ∈ R de for e ∈ E, and r ∈ R dr for r ∈ R. Some methods also learn projection matrices M r ∈ R dr×de for relations."}, {"id": 43, "string": "The correctness of a triple is evaluated using a model specific score function σ : E × R × E → R. For learning the embeddings, a loss function L(T , T ; θ), defined over a set of positive triples T , set of (sampled) negative triples T , and the parameters θ is optimized."}, {"id": 44, "string": "We use small italics characters (e.g., h, r) to represent entities and relations, and correspond-Type Model Score Function σ(h, r, t) Additive TransE (Bordes et al., 2013) − h + r − t 1 TransR (Lin et al., 2015) − Mrh + r − Mrt 1 STransE (Nguyen et al., 2016) − M 1 r h + r − M 2 r t 1 Multiplicative DistMult (Yang et al., 2014) r (h t) HolE (Nickel et al., 2016) r (h t) ComplEx (Trouillon et al., 2016) Re(r (h t )) Table 1 : Summary of various Knowledge Graph (KG) embedding methods used in the paper."}, {"id": 45, "string": "Please see Section 3 for more details."}, {"id": 46, "string": "ing bold characters to represent their vector embeddings (e.g., h, r)."}, {"id": 47, "string": "We use bold capitalization (e.g., V) to represent a set of vectors."}, {"id": 48, "string": "Matrices are represented by capital italics characters (e.g., M )."}, {"id": 49, "string": "Additive KG Embedding Methods This is the set of methods where entity and relation vectors interact via additive operations."}, {"id": 50, "string": "The score function for these models can be expressed as below σ(h, r, t) = − M 1 r h + r − M 2 r t 1 (1) where h, t ∈ R de and r ∈ R dr are vectors for head entity, tail entity and relation respectively."}, {"id": 51, "string": "M 1 r , M 2 r ∈ R dr×de are projection matrices from entity space R de to relation space R dr ."}, {"id": 52, "string": "TransE (Bordes et al., 2013) is the simplest additive model where the entity and relation vectors lie in same d−dimensional space, i.e., d e = d r = d. The projection matrices M 1 r = M 2 r = I d are identity matrices."}, {"id": 53, "string": "The relation vectors are modeled as translation vectors from head entity vectors to tail entity vectors."}, {"id": 54, "string": "Pairwise ranking loss is then used to learn these vectors."}, {"id": 55, "string": "Since the model is simple, it has limited capability in capturing many-to-one, one-to-many and many-to-many relations."}, {"id": 56, "string": "TransR (Lin et al., 2015) is another translationbased model which uses separate spaces for entity and relation vectors allowing it to address the shortcomings of TransE."}, {"id": 57, "string": "Entity vectors are projected into a relation specific space using the corresponding projection matrix M 1 r = M 2 r = M r ."}, {"id": 58, "string": "The training is similar to TransE."}, {"id": 59, "string": "STransE (Nguyen et al., 2016) is a generalization of TransR and uses different projection matrices for head and tail entity vectors."}, {"id": 60, "string": "The training is similar to TransE."}, {"id": 61, "string": "STransE achieves better performance than the previous methods but at the cost of more number of parameters."}, {"id": 62, "string": "Equation 1 is the score function used in STransE."}, {"id": 63, "string": "TransE and TransR are special cases of STransE with M 1 r = M 2 r = I d and M 1 r = M 2 r = M r , respectively."}, {"id": 64, "string": "Multiplicative KG Embedding Methods This is the set of methods where the vectors interact via multiplicative operations (usually dot product)."}, {"id": 65, "string": "The score function for these models can be expressed as σ(h, r, t) = r f (h, t) (2) where h, t, r ∈ F d are vectors for head entity, tail entity and relation respectively."}, {"id": 66, "string": "f (h, t) ∈ F d measures compatibility of head and tail entities and is specific to the model."}, {"id": 67, "string": "F is either real space R or complex space C. Detailed descriptions of the models we consider are as follows."}, {"id": 68, "string": "DistMult (Yang et al., 2014 ) models entities and relations as vectors in R d ."}, {"id": 69, "string": "It uses an entry-wise product ( ) to measure compatibility between head and tail entities, while using logistic loss for training the model."}, {"id": 70, "string": "σ DistM ult (h, r, t) = r (h t) (3) Since the entry-wise product in (3) is symmetric, DistMult is not suitable for asymmetric and antisymmetric relations."}, {"id": 71, "string": "HolE (Nickel et al., 2016) also models entities and relations as vectors in R d ."}, {"id": 72, "string": "It uses circular correlation operator ( ) as compatibility function defined as [h t] k = d−1 i=0 h i t (k+i) mod d The score function is given as σ HolE (h, r, t) = r (h t) (4) The circular correlation operator being asymmetric, can capture asymmetric and anti-symmetric relations, but at the cost of higher time complexity The points are sampled from 3d Spherical Gaussian with mean (1,1,1) and standard deviation 0.1 (left) and 1.3 (right)."}, {"id": 73, "string": "Please refer to Section 4 for more details."}, {"id": 74, "string": "(O (d log d) )."}, {"id": 75, "string": "For training, we use pairwise ranking loss."}, {"id": 76, "string": "ComplEx (Trouillon et al., 2016) represents entities and relations as vectors in C d ."}, {"id": 77, "string": "The compatibility of entity pairs is measured using entry-wise product between head and complex conjugate of tail entity vectors."}, {"id": 78, "string": "σ ComplEx (h, r, t) = Re(r (h t )) (5) In contrast to (3), using complex vectors in (5) allows ComplEx to handle symmetric, asymmetric and anti-symmetric relations using the same score function."}, {"id": 79, "string": "Similar to DistMult, logistic loss is used for training the model."}, {"id": 80, "string": "Metrics For our geometrical analysis, we first define a term 'alignment to mean' (ATM) of a vector v belonging to a set of vectors V, as the cosine similarity 1 between v and the mean of all vectors in V. ATM(v, V) = cosine v, 1 |V| x∈V x We also define 'conicity' of a set V as the mean ATM of all vectors in V.  By this definition, a high value of Conicity(V) would imply that the vectors in V lie in a narrow cone centered at origin."}, {"id": 81, "string": "In other words, the vectors in the set V are highly aligned with each other."}, {"id": 82, "string": "In addition to that, we define the variance of ATM across all vectors in V, as the 'vector spread'(VS) of set V, For each method, a plot averaged across entity frequency bins is shown."}, {"id": 83, "string": "From these plots, we conclude that entity embeddings from additive models tend to have low (positive as well as negative) ATM and thereby low Conicity and high vector spread."}, {"id": 84, "string": "Interestingly, this is reversed in case of multiplicative methods."}, {"id": 85, "string": "Please see Section 6.1 for more details."}, {"id": 86, "string": "Conicity(V) = 1 |V| v∈V ATM(v, V) 1 cosine(u, v) = u v u v Dataset VS(V) = 1 |V| v∈V ATM(v, V)−Conicity(V) Experimental Setup Datasets: We run our experiments on subsets of two widely used datasets, viz., Freebase (Bollacker et al., 2008) and WordNet (Miller, 1995) , called FB15k and WN18 (Bordes et al., 2013) , respectively."}, {"id": 87, "string": "We detail the characteristics of these datasets in Table 2 ."}, {"id": 88, "string": "Please note that while the results presented in Section 6 are on the FB15K dataset, we reach the same conclusions on WN18."}, {"id": 89, "string": "The plots for our experiments on WN18 can be found in the Supplementary Section."}, {"id": 90, "string": "Hyperparameters: We experiment with multiple values of hyperparameters to understand their effect on the geometry of KG embeddings."}, {"id": 91, "string": "Specifically, we vary the dimension of the generated vectors between {50, 100, 200} and the number of negative samples used during training between {1, 50, 100}."}, {"id": 92, "string": "For more details on algorithm specific hyperparameters, we refer the reader to the Supplementary Section."}, {"id": 93, "string": "2 2 For training, we used codes from https://github."}, {"id": 94, "string": "Frequency Bins: We follow (Mimno and Thompson, 2017) for entity and relation samples used in the analysis."}, {"id": 95, "string": "Multiple bins of entities and relations are created based on their frequencies and 100 randomly sampled vectors are taken from each bin."}, {"id": 96, "string": "These set of sampled vectors are then used for our analysis."}, {"id": 97, "string": "For more information about sampling vectors, please refer to (Mimno and Thompson, 2017) ."}, {"id": 98, "string": "Results and Analysis In this section, we evaluate the following questions."}, {"id": 99, "string": "• Does model type (e.g., additive vs multiplicative) have any effect on the geometry of embeddings?"}, {"id": 100, "string": "(Section 6."}, {"id": 101, "string": "For each method, a plot averaged across entity frequency bins is shown."}, {"id": 102, "string": "Trends in these plots are similar to those in Figure 2 ."}, {"id": 103, "string": "Main findings from these plots are summarized in Section 6.1."}, {"id": 104, "string": "• Does negative sampling have any effect on the embedding geometry?"}, {"id": 105, "string": "(Section 6.2) • Does the dimension of embedding have any effect on its geometry?"}, {"id": 106, "string": "(Section 6.3) • How is task performance related to embedding geometry?"}, {"id": 107, "string": "(Section 6.4) In each subsection, we summarize the main findings at the beginning, followed by evidence supporting those findings."}, {"id": 108, "string": "Effect of Model Type on Geometry Summary of Findings: Additive: Low conicity and high vector spread."}, {"id": 109, "string": "Multiplicative: High conicity and low vector spread."}, {"id": 110, "string": "In this section, we explore whether the type of the score function optimized during the training has any effect on the geometry of the resulting embedding."}, {"id": 111, "string": "For this experiment, we set the number of negative samples to 1 and the vector dimension to 100 (we got similar results for 50-dimensional vectors)."}, {"id": 112, "string": "Figure 2 and Figure 3 show the distribution of ATMs of these sampled entity and relation vectors, respectively."}, {"id": 113, "string": "3 Entity Embeddings: As seen in Figure 2 , there is a stark difference between the geometries of entity vectors produced by additive and multiplicative models."}, {"id": 114, "string": "The ATMs of all entity vectors produced by multiplicative models are positive with very low vector spread."}, {"id": 115, "string": "Their high conicity suggests that they are not uniformly dispersed in the vector space, but lie in a narrow cone along the mean vector."}, {"id": 116, "string": "This is in contrast to the entity vectors obtained from additive models which are both positive and negative with higher vector spread."}, {"id": 117, "string": "From the lower values of conicity, we conclude that entity vectors from additive models are evenly dispersed in the vector space."}, {"id": 118, "string": "This observation is also reinforced by looking at the high vector spread of additive models in comparison to that of multiplicative models."}, {"id": 119, "string": "We also observed that additive models are sensitive to the frequency of entities, with high frequency bins having higher conicity than low frequency bins."}, {"id": 120, "string": "However, no such pattern was observed for multiplicative models and In each bar group, first three models are additive, while the last three are multiplicative."}, {"id": 121, "string": "Main findings from these plots are summarized in Section 6.2 conicity was consistently similar across frequency bins."}, {"id": 122, "string": "For clarity, we have not shown different plots for individual frequency bins."}, {"id": 123, "string": "Relation Embeddings: As in entity embeddings, we observe a similar trend when we look at the distribution of ATMs for relation vectors in Figure 3 ."}, {"id": 124, "string": "The conicity of relation vectors generated using additive models is almost zero across frequency bands."}, {"id": 125, "string": "This coupled with the high vector spread observed, suggests that these vectors are scattered throughout the vector space."}, {"id": 126, "string": "Relation vectors from multiplicative models exhibit high conicity and low vector spread, suggesting that they lie in a narrow cone centered at origin, like their entity counterparts."}, {"id": 127, "string": "Effect of Number of Negative Samples on Geometry Summary of Findings: Additive: Conicity and average length are invariant to changes in #NegativeSamples for both entities and relations."}, {"id": 128, "string": "Multiplicative: Conicity increases while average vector length decrease with increasing #NegativeSamples for entities."}, {"id": 129, "string": "Conicity decreases, while average vector length remains constant (except HolE) for relations."}, {"id": 130, "string": "For experiments in this section, we keep the vector dimension constant at 100."}, {"id": 131, "string": "Entity Embeddings: As seen in Figure 4 (left) , the conicity of entity vectors increases as the number of negative samples is increased for multiplicative models."}, {"id": 132, "string": "In contrast, conicity of the entity vectors generated by additive models is unaffected by change in number of negative samples and they continue to be dispersed throughout the vector space."}, {"id": 133, "string": "From Figure 4 (right), we observe that the average length of entity vectors produced by additive models is also invariant of any changes in number of negative samples."}, {"id": 134, "string": "On the other hand, increase in negative sampling decreases the average entity vector length for all multiplicative models except HolE."}, {"id": 135, "string": "The average entity vector length for HolE is nearly 1 for any number of negative samples, which is understandable considering it constrains the entity vectors to lie inside a unit ball (Nickel et al., 2016) ."}, {"id": 136, "string": "This constraint is also enforced by the additive models: TransE, TransR, and STransE."}, {"id": 137, "string": "Relation Embeddings: Similar to entity embeddings, in case of relation vectors trained using additive models, the average length and conicity do not change while varying the number of negative samples."}, {"id": 138, "string": "However, the conicity of relation vectors from multiplicative models decreases with increase in negative sampling."}, {"id": 139, "string": "The average relation vector length is invariant for all multiplicative methods, except for HolE."}, {"id": 140, "string": "We see a surprisingly big jump in average relation vector length for HolE going from 1 to 50 negative samples, but it does not change after that."}, {"id": 141, "string": "Due to space constraints in the paper, we refer the reader to the Supplementary Section for plots discussing the effect of number of negative samples on geometry of relation vectors."}, {"id": 142, "string": "We note that the multiplicative score between two vectors may be increased by either increasing the alignment between the two vectors (i.e., increasing Conicity and reducing vector spread between them), or by increasing their lengths."}, {"id": 143, "string": "It is interesting to note that we see exactly these effects in the geometry of multiplicative methods In each bar group, first three models are additive, while the last three are multiplicative."}, {"id": 144, "string": "Main findings from these plots are summarized in Section 6.3. analyzed above."}, {"id": 145, "string": "Correlation with Geometry of Word Embeddings Our conclusions from the geometrical analysis of entity vectors produced by multiplicative models are similar to the results in (Mimno and Thompson, 2017) , where increase in negative sampling leads to increased conicity of word vectors trained using the skip-gram with negative sampling (SGNS) method."}, {"id": 146, "string": "On the other hand, additive models remain unaffected by these changes."}, {"id": 147, "string": "SGNS tries to maximize a score function of the form w T · c for positive word context pairs, where w is the word vector and c is the context vector (Mikolov et al., 2013) ."}, {"id": 148, "string": "This is very similar to the score function of multiplicative models as seen in Table 1 ."}, {"id": 149, "string": "Hence, SGNS can be considered as a multiplicative model in the word domain."}, {"id": 150, "string": "Hence, we argue that our result on the increase in negative samples increasing the conicity of vectors trained using a multiplicative score function can be considered as a generalization of the one in (Mimno and Thompson, 2017) ."}, {"id": 151, "string": "Effect of Vector Dimension on Geometry Summary of Findings: Additive: Conicity and average length are invariant to changes in dimension for both entities and relations."}, {"id": 152, "string": "Multiplicative: Conicity decreases for both entities and relations with increasing dimension."}, {"id": 153, "string": "Average vector length increases for both entities and relations, except for HolE entities."}, {"id": 154, "string": "Entity Embeddings: To study the effect of vec-tor dimension on conicity and length, we set the number of negative samples to 1, while varying the vector dimension."}, {"id": 155, "string": "From Figure 5 (left), we observe that the conicity for entity vectors generated by any additive model is almost invariant of increase in dimension, though STransE exhibits a slight decrease."}, {"id": 156, "string": "In contrast, entity vector from multiplicative models show a clear decreasing pattern with increasing dimension."}, {"id": 157, "string": "As seen in Figure 5 (right) , the average lengths of entity vectors from multiplicative models increase sharply with increasing vector dimension, except for HolE."}, {"id": 158, "string": "In case of HolE, the average vector length remains constant at one."}, {"id": 159, "string": "Deviation involving HolE is expected as it enforces entity vectors to fall within a unit ball."}, {"id": 160, "string": "Similar constraints are enforced on entity vectors for additive models as well."}, {"id": 161, "string": "Thus, the average entity vector lengths are not affected by increasing vector dimension for all additive models."}, {"id": 162, "string": "Relation Embeddings: We reach similar conclusion when analyzing against increasing dimension the change in geometry of relation vectors produced using these KG embedding methods."}, {"id": 163, "string": "In this setting, the average length of relation vectors learned by HolE also increases as dimension is increased."}, {"id": 164, "string": "This is consistent with the other methods in the multiplicative family."}, {"id": 165, "string": "This is because, unlike entity vectors, the lengths of relation vectors of HolE are not constrained to be less than unit length."}, {"id": 166, "string": "Due to lack of space, we are unable to show plots for relation vectors here, but the same can be found in the Supplementary Section."}, {"id": 167, "string": "Relating Geometry to Performance Summary of Findings: Additive: Neither entites nor relations exhibit correlation between geometry and performance."}, {"id": 168, "string": "Multiplicative: Keeping negative samples fixed, lower conicity or higher average vector length for entities leads to improved performance."}, {"id": 169, "string": "No relationship for relations."}, {"id": 170, "string": "In this section, we analyze the relationship between geometry and performance on the Link prediction task, using the same setting as in (Bordes et al., 2013) ."}, {"id": 171, "string": "Figure 6 (left) presents the effects of conicity of entity vectors on performance, while Figure 6 (right) shows the effects of average entity vector length."}, {"id": 172, "string": "4 As we see from Figure 6 (left), for fixed number of negative samples, the multiplicative model with lower conicity of entity vectors achieves better performance."}, {"id": 173, "string": "This performance gain is larger for higher numbers of negative samples (N)."}, {"id": 174, "string": "Additive models don't exhibit any relationship between performance and conicity, as they are all clustered around zero conicity, which is in-line with our observations in previous sections."}, {"id": 175, "string": "In Figure 6 (right) , for all multiplicative models except HolE, a higher average entity vector length translates to better performance, while the number of negative samples is kept fixed."}, {"id": 176, "string": "Additive models and HolE don't exhibit any such patterns, as they are all clustered just below unit average entity vector length."}, {"id": 177, "string": "The above two observations for multiplicative models make intuitive sense, as lower conicity and higher average vector length would both translate to vectors being more dispersed in the space."}, {"id": 178, "string": "We see another interesting observation regarding the high sensitivity of HolE to the number of negative samples used during training."}, {"id": 179, "string": "Using a large number of negative examples (e.g., N = 50 or 100) leads to very high conicity in case of HolE."}, {"id": 180, "string": "Figure 6 (right) shows that average entity vector length of HolE is always one."}, {"id": 181, "string": "These two observations point towards HolE's entity vectors lying in a tiny part of the space."}, {"id": 182, "string": "This translates to HolE performing poorer than all other models in case of high numbers of negative sampling."}, {"id": 183, "string": "We also did a similar study for relation vectors, but did not see any discernible patterns."}, {"id": 184, "string": "Conclusion In this paper, we have initiated a systematic study into the important but unexplored problem of analyzing geometry of various Knowledge Graph (KG) embedding methods."}, {"id": 185, "string": "To the best of our knowledge, this is the first study of its kind."}, {"id": 186, "string": "Through extensive experiments on multiple realworld datasets, we are able to identify several insights into the geometry of KG embeddings."}, {"id": 187, "string": "We have also explored the relationship between KG embedding geometry and its task performance."}, {"id": 188, "string": "We have shared all our source code to foster further research in this area."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 24}, {"section": "Related Work", "n": "2", "start": 25, "end": 36}, {"section": "Overview of KG Embedding Methods", "n": "3", "start": 37, "end": 48}, {"section": "Additive KG Embedding Methods", "n": "3.1", "start": 49, "end": 63}, {"section": "Multiplicative KG Embedding Methods", "n": "3.2", "start": 64, "end": 79}, {"section": "Metrics", "n": "4", "start": 80, "end": 85}, {"section": "Experimental Setup", "n": "5", "start": 86, "end": 97}, {"section": "Results and Analysis", "n": "6", "start": 98, "end": 126}, {"section": "Effect of Number of Negative Samples on Geometry", "n": "6.2", "start": 127, "end": 144}, {"section": "Correlation with Geometry of Word Embeddings", "n": "6.2.1", "start": 145, "end": 183}, {"section": "Conclusion", "n": "7", "start": 184, "end": 188}], "figures": [{"filename": "../figure/image/1355-Figure3-1.png", "caption": "Figure 3: Alignment to Mean (ATM) vs Density plots for relation embeddings learned by various additive (top row) and multiplicative (bottom row) KG embedding methods. For each method, a plot averaged across entity frequency bins is shown. Trends in these plots are similar to those in Figure 2. Main findings from these plots are summarized in Section 6.1.", "page": 5, "bbox": {"x1": 70.56, "x2": 536.16, "y1": 61.44, "y2": 342.71999999999997}}, {"filename": "../figure/image/1355-Figure4-1.png", "caption": "Figure 4: Conicity (left) and Average Vector Length (right) vs Number of negative samples for entity vectors learned using various KG embedding methods. In each bar group, first three models are additive, while the last three are multiplicative. Main findings from these plots are summarized in Section 6.2", "page": 6, "bbox": {"x1": 72.0, "x2": 532.3199999999999, "y1": 61.44, "y2": 207.35999999999999}}, {"filename": "../figure/image/1355-Table1-1.png", "caption": "Table 1: Summary of various Knowledge Graph (KG) embedding methods used in the paper. Please see Section 3 for more details.", "page": 2, "bbox": {"x1": 115.67999999999999, "x2": 481.44, "y1": 62.879999999999995, "y2": 149.28}}, {"filename": "../figure/image/1355-Figure5-1.png", "caption": "Figure 5: Conicity (left) and Average Vector Length (right) vs Number of Dimensions for entity vectors learned using various KG embedding methods. In each bar group, first three models are additive, while the last three are multiplicative. Main findings from these plots are summarized in Section 6.3.", "page": 7, "bbox": {"x1": 72.0, "x2": 532.3199999999999, "y1": 61.44, "y2": 207.35999999999999}}, {"filename": "../figure/image/1355-Figure1-1.png", "caption": "Figure 1: Comparison of high vs low Conicity. Randomly generated vectors are shown in blue with their sample mean vector M in black. Figure on the left shows the case when vectors lie in narrow cone resulting in high Conicity value. Figure on the right shows the case when vectors are spread out having relatively lower Conicity value. We skipped very low values of Conicity as it was difficult to visualize. The points are sampled from 3d Spherical Gaussian with mean (1,1,1) and standard deviation 0.1 (left) and 1.3 (right). Please refer to Section 4 for more details.", "page": 3, "bbox": {"x1": 102.72, "x2": 507.35999999999996, "y1": 61.44, "y2": 260.15999999999997}}, {"filename": "../figure/image/1355-Table2-1.png", "caption": "Table 2: Summary of datasets used in the paper.", "page": 3, "bbox": {"x1": 328.8, "x2": 504.0, "y1": 361.44, "y2": 436.32}}, {"filename": "../figure/image/1355-Figure6-1.png", "caption": "Figure 6: Relationship between Performance (HITS@10) on a link prediction task vs Conicity (left) and Avg. Vector Length (right). For each point, N represents the number of negative samples used. Main findings are summarized in Section 6.4.", "page": 8, "bbox": {"x1": 72.0, "x2": 532.3199999999999, "y1": 61.44, "y2": 207.35999999999999}}, {"filename": "../figure/image/1355-Figure2-1.png", "caption": "Figure 2: Alignment to Mean (ATM) vs Density plots for entity embeddings learned by various additive (top row) and multiplicative (bottom row) KG embedding methods. For each method, a plot averaged across entity frequency bins is shown. From these plots, we conclude that entity embeddings from additive models tend to have low (positive as well as negative) ATM and thereby low Conicity and high vector spread. Interestingly, this is reversed in case of multiplicative methods. Please see Section 6.1 for more details.", "page": 4, "bbox": {"x1": 70.56, "x2": 536.16, "y1": 61.44, "y2": 342.71999999999997}}]}