{"title": "Searching for the X-Factor: Exploring Corpus Subjectivity for Word Embeddings", "abstract": "We explore the notion of subjectivity, and hypothesize that word embeddings learnt from input corpora of varying levels of subjectivity behave differently on natural language processing tasks such as classifying a sentence by sentiment, subjectivity, or topic. Through systematic comparative analyses, we establish this to be the case indeed. Moreover, based on the discovery of the outsized role that sentiment words play on subjectivity-sensitive tasks such as sentiment classification, we develop a novel word embedding SentiVec which is infused with sentiment information from a lexical resource, and is shown to outperform baselines on such tasks.", "text": [{"id": 0, "string": "Introduction Distributional analysis methods such as Word2Vec (Mikolov et al., 2013) and GloVe (Pennington et al., 2014) have been critical for the success of many large-scale natural language processing (NLP) applications (Collobert et al., 2011; Socher et al., 2013; Goldberg, 2016) ."}, {"id": 1, "string": "These methods employ distributional hypothesis (i.e., words used in the same contexts tend to have similar meaning) to derive distributional meaning via context prediction tasks and produce dense word embeddings."}, {"id": 2, "string": "While there have been active and ongoing research on improving word embedding methods (see Section 5), there is a relative dearth of study on the impact that an input corpus may have on the quality of the word embeddings."}, {"id": 3, "string": "The previous preoccupation centers around corpus size, i.e., a larger corpus is perceived to be richer in statistical information."}, {"id": 4, "string": "For instance, popular corpora include Wikipedia, Common Crawl, and Google News."}, {"id": 5, "string": "We postulate that there may be variations across corpora owing to factors that affect language use."}, {"id": 6, "string": "Intuitively, the many things we write (a work email, a product review, an academic publication, etc.)"}, {"id": 7, "string": "may each involve certain stylistic, syntactic, and lexical choices, resulting in meaningfully different distributions of word cooccurrences."}, {"id": 8, "string": "Consequently, such factors may be encoded in the word embeddings, and input corpora may be differentially informative towards various NLP tasks."}, {"id": 9, "string": "In this work, we are interested in the notion of subjectivity."}, {"id": 10, "string": "Some NLP tasks, such as sentiment classification, revolve around subjective expressions of likes or dislikes."}, {"id": 11, "string": "Others, such as topic classification, revolve around more objective elements of whether a document belongs to a topic (e.g., science, politics)."}, {"id": 12, "string": "Our central hypothesis is that word embeddings learnt from input corpora of contrasting levels of subjectivity perform differently when classifying sentences by sentiment, subjectivity, or topic."}, {"id": 13, "string": "As the first contribution, we outline an experimental scheme to explore this hypothesis in Section 2, and conduct a series of controlled experiments in Section 3 establishing that there exists a meaningful difference between word embeddings derived from objective vs. subjective corpora."}, {"id": 14, "string": "We further systematically investigate factors that could potentially explain the differences."}, {"id": 15, "string": "Upon discovering from the investigation that sentiment words play a particularly important role in subjectivity-sensitive NLP tasks, such as sentiment classification, as the second contribution, in Section 4 we develop SentiVec, a novel word embedding method infused with information from lexical resources such as a sentiment lexicon."}, {"id": 16, "string": "We further identify two alternative lexical objectives: Logistic SentiVec based on discriminative logistic regression, and Spherical SentiVec based on soft clustering effect of von Mises-Fisher distributions."}, {"id": 17, "string": "In Section 6, the proposed word embeddings show evident improvements on sentiment classification, as compared to the base model Word2Vec and other baselines using the same lexical resource."}, {"id": 18, "string": "Data and Methodology We lay out the methodology for generating word embeddings of contrasting subjectivity, whose effects are tested on several text classification tasks."}, {"id": 19, "string": "Generating Word Embeddings As it is difficult to precisely quantify the degree of subjectivity of a corpus, we resort to generating word embeddings from two corpora that contrast sharply in subjectivity, referring to them as the Objective Corpus and the Subjective Corpus."}, {"id": 20, "string": "Objective Corpus As virtually all contents are written by humans, an absolutely objective corpus (in the philosophical sense) may prove elusive."}, {"id": 21, "string": "There are however exemplars where, by construction, a corpus aspires to be as objective as possible, and probably achieves that in practical terms."}, {"id": 22, "string": "We postulate that one such corpus is Wikipedia."}, {"id": 23, "string": "Its list of policies and guidelines 1 , assiduously enforced by an editorial team, specify that an article must be written from a neutral point of view, which among other things means \"representing fairly, proportionately, and, as far as possible, without editorial bias, all of the significant views that have been published by reliable sources on a topic.\"."}, {"id": 24, "string": "Moreover, it is a common resource for training distributional word embeddings and adopted widely by the research community to solve various NLP problems."}, {"id": 25, "string": "Hence, in this study, we use Wikipedia as the Objective Corpus."}, {"id": 26, "string": "Subjective Corpus By extension, one may then deem a corpus subjective if its content does not at least meet Wikipedia's neutral point of view requirement."}, {"id": 27, "string": "In other words, if the content is replete with personal feelings and opinions."}, {"id": 28, "string": "We posit that product reviews would be one such corpus."}, {"id": 29, "string": "For instance, Amazon's Community Guideline 2 states that \"Amazon values diverse opinions\", and that \"Content you submit should be relevant and based on your own honest opinions and experience.\"."}, {"id": 30, "string": "Reviews consist of expressive content written by customers, and may not strive for the neutrality of an encyclopedia."}, {"id": 31, "string": "We rely on a 1 https://en.wikipedia.org/wiki/ Wikipedia:List_of_policies_and_ guidelines 2 https://www.amazon.com/gp/help/ customer/display.html?nodeId=201929730 large corpus of Amazon reviews from various categories (e.g., electronics, jewelry, books, and etc.)"}, {"id": 32, "string": "(McAuley et al., 2015) as the Subjective Corpus."}, {"id": 33, "string": "Word Embeddings For the comparative analysis in Section 3, we employ Word2Vec (reviewed below) to generate word embeddings from each corpus."}, {"id": 34, "string": "Later on in Section 4, we will propose a new word embedding method called SentiVec."}, {"id": 35, "string": "For Word2Vec, we use the Skip-gram model to train distributional word embeddings on the Objective Corpus and the Subjective Corpus respectively."}, {"id": 36, "string": "Skip-gram aims to find word embeddings that are useful for predicting nearby words."}, {"id": 37, "string": "The objective is to maximize the context probability: log L(W ; C) = w∈W w ∈C(w) log P(w |w), (1) where W is an input corpus and C(w) is the context of token w. The probability of context word w , given observed word w is defined via softmax: P(w |w) = exp (v w · vw) ŵ∈V exp (vŵ · vw) , (2) where v w and v w are corresponding embeddings and V is the corpus vocabulary."}, {"id": 38, "string": "Though theoretically sound, the formulation is computationally impractical and requires tractable approximation."}, {"id": 39, "string": "Mikolov et al."}, {"id": 40, "string": "(2013) propose two efficient procedures to optimize (1): Hierarchical Softmax and Negative Sampling (NS)."}, {"id": 41, "string": "In this work we focus on the widely adopted NS."}, {"id": 42, "string": "The intuition is that a \"good\" model should be able to differentiate observed data from noise."}, {"id": 43, "string": "The differentiation task is defined using logistic regression; the goal is to tell apart real context-word pair (w , w) from randomly generated noise pair (ŵ, w)."}, {"id": 44, "string": "Formally, log L [w',w] = log σ (v w · vw) + k i=1 log σ (−vŵ i · vw), (3) where σ( · ) is a sigmoid function, and {ŵ i } k i=1 are negative samples."}, {"id": 45, "string": "Summing up all the contextword pairs, we derive the NS Skip-gram objective: log L word2vec (W ; C) = w∈W w ∈C(w) log L [w',w] ."}, {"id": 46, "string": "(4) Training word embeddings with Skip-gram, we keep the same hyperparameters across all the runs: 300 dimensions for embeddings, k = 5 negative samples, and window of 5 tokens."}, {"id": 47, "string": "The Objective and Subjective corpora undergo the same preprocessing, i.e., discarding short sentences (< 5 tokens) and rare words (< 10 occurrences), removing punctuation, normalizing Unicode symbols."}, {"id": 48, "string": "Evaluation Tasks To compare word embeddings, we need a common yardstick."}, {"id": 49, "string": "It is difficult to define an inherent quality to word embeddings."}, {"id": 50, "string": "Instead, we put them through several evaluation tasks that can leverage word embeddings and standardize their formulations as binary classification tasks."}, {"id": 51, "string": "To boil the comparisons down to the essences of word embeddings (which is our central focus), we rely on standardized techniques so as to attribute as much of the differences as possible to the word embeddings."}, {"id": 52, "string": "We use logistic regression for classification, and represent a text snippet (e.g., a sentence) in the feature space as the average of the word embeddings of tokens in the snippet (ignoring out-ofvocabulary tokens)."}, {"id": 53, "string": "The evaluation metric is the average accuracy from 10-fold cross validation."}, {"id": 54, "string": "There are three evaluation tasks of varying degrees of hypothetical subjectivity, as outlined below."}, {"id": 55, "string": "Each may involve multiple datasets."}, {"id": 56, "string": "Sentiment Classification Task This task classifies a sentence into either positive or negative."}, {"id": 57, "string": "We use two groups of datasets as follows."}, {"id": 58, "string": "The first group consists of 24 datasets from UCSD Amazon product data 3 corresponding to various product categories."}, {"id": 59, "string": "Each review has a rating from 1 to 5, which is transformed into positive (ratings 4 or 5) or negative (ratings 1 or 2) class."}, {"id": 60, "string": "For each dataset respectively, we sample 5000 sentences each from the positive and negative reviews."}, {"id": 61, "string": "Note that these sentences used for this evaluation task have not participated in the generation of word embeddings."}, {"id": 62, "string": "Due to space constraint, in most cases we present the average accuracy across the datasets, but where appropriate we enumerate the results for each dataset."}, {"id": 63, "string": "The second is Cornell's sentence polarity dataset v1.0 4 (Pang and Lee, 2005) , made up of 5331 each of positive and negative sentences from Rotten Tomatoes movie reviews."}, {"id": 64, "string": "The inclusion of this out-of-domain evaluation dataset is useful for examining whether the performance of word embeddings from the Subjective Corpus on the first group above may inadvertently be affected by indomain advantage arising from its Amazon origin."}, {"id": 65, "string": "Subjectivity Classification Task This task classifies a sentence into subjective or objective."}, {"id": 66, "string": "The dataset is Cornell's subjectivity dataset v1.0 5 , consisting of 5000 subjective sentences derived from Rotten Tomatoes (RT) reviews and 5000 objective sentences derived from IMDB plot summaries (Pang and Lee, 2004) ."}, {"id": 67, "string": "This task is probably less sensitive to the subjectivity within word embeddings than sentiment classification, as determining whether a sentence is subjective or objective should ideally be an objective undertaking."}, {"id": 68, "string": "Topic Classification Task We use the 20 Newsgroups dataset 6 (\"bydate\" version), whereby the newsgroups are organized into six subject matter groupings."}, {"id": 69, "string": "We extract the message body and split them into sentences."}, {"id": 70, "string": "Each group's sentences then form the in-topic class, and we randomly sample an equivalent number of sentences from the remaining newsgroups to form the out-of-topic class."}, {"id": 71, "string": "This results in six datasets, each corresponding to a binary classification task."}, {"id": 72, "string": "In most cases, we present the average results, and where appropriate we enumerate the results for each dataset."}, {"id": 73, "string": "Hypothetically, this task is the least affected by the subjectivity within word embeddings."}, {"id": 74, "string": "Comparative Analyses of Subjective vs."}, {"id": 75, "string": "Objective Corpora We conduct a series of comparative analyses under various setups."}, {"id": 76, "string": "For each, we compare the performance in the evaluation tasks when using the Objective Corpus and the Subjective Corpus."}, {"id": 77, "string": "Table 1 shows the results for this series of analyses."}, {"id": 78, "string": "Initial Condition Setup I seeks to answer whether there is any difference between word embeddings derived from the Objective Corpus and the Subjective Corpus."}, {"id": 79, "string": "The word embeddings were trained on the whole data respectively."}, {"id": 80, "string": "Table 1 shows the corpus statistics and classification accuracies."}, {"id": 81, "string": "Evidently, the Subjective word embeddings outperform the Objective word embeddings on all the evaluation tasks."}, {"id": 82, "string": "The margins are largest for sentiment classification (86.5% vs. 81.5% or +5% Amazon, and 78.2% vs. 75.4% or +2.8% on Rotten Tomatoes or RT)."}, {"id": 83, "string": "For subjectivity and topic classifications, the differences are smaller."}, {"id": 84, "string": "As earlier hypothesized, the sentiment classification task is more sensitive to subjectivity within word embeddings than the other tasks."}, {"id": 85, "string": "Therefore, training word embeddings on a subjective corpus may confer an advantage for such tasks."}, {"id": 86, "string": "On the other hand, the corpus statistics show a substantial difference in corpus size, which could be an alternative explanation for the outperformance by the Subjective Corpus if the larger corpus contains more informative distributional statistics."}, {"id": 87, "string": "Controlling for Corpus Size In Setup II, we keep the number of sentences in both corpora the same, by randomly downsampling sentences in the Subjective Corpus."}, {"id": 88, "string": "This procedure consequently reduces the number of types and tokens (see Table 1 , Setup II, Corpus Statistics)."}, {"id": 89, "string": "Note that the number of tokens in the Subjective corpus is now fewer than in the Objective, the latter suffers no change."}, {"id": 90, "string": "Yet, even after a dramatic reduction in size, the Subjective embeddings still outperform the Objective significantly on both datasets of the sentiment classification task (+4% on Amazon and +2.5% on RT), while showing similar performance on subjectivity and topic classifications."}, {"id": 91, "string": "This bolsters the earlier observation that sentiment classification is more sensitive to subjectivity."}, {"id": 92, "string": "While there is a small effect due to corpus size difference, the gap in performance between Subjective and Objective embeddings on sentiment classification is still significant and cannot be explained away by the corpus size alone."}, {"id": 93, "string": "Controlling for Vocabulary While the Subjective Corpus has a much smaller vocabulary (i.e., # types), we turn a critical eye on whether its apparent advantage lies in having access to special word types that do not exist in the Objective Corpus."}, {"id": 94, "string": "In Setup III, we keep the training vocabulary the same for both, removing the types that are Table 2 : Top words of misclassified sentences present in one corpus but not in the other, so that out-of-vocabulary words are ignored in the training phase."}, {"id": 95, "string": "Table 1 , Setup III, shows significant reduction in types for both corpora."}, {"id": 96, "string": "Yet, the outperformance by the Subjective embeddings on the sentiment classification task still stands (+3.8% on Amazon and +2.3% on RT)."}, {"id": 97, "string": "Moreover, it is so for both Amazon and Rotten Tomatoes datasets, implying that it is not due to close in-domain similarity between the corpora used for training the word embeddings and the classification tasks."}, {"id": 98, "string": "Significant Words To get more insights on the difference between the Subjective and Objective corpora, we analyze the mistakes word embeddings make on the development folds."}, {"id": 99, "string": "At this point we focus on the sentiment classification task and specifically on the Amazon data, which indicates the largest performance differences in the controlled experiments (see Table 1 , Setup III)."}, {"id": 100, "string": "As words are still the main unit of information in distributional word embeddings, we extract words strongly associated with misclassified sentences."}, {"id": 101, "string": "We employed log-odds ratio with informative Dirichlet prior method (Monroe et al., 2008) to quantify this association."}, {"id": 102, "string": "It is used to contrast the words in misclassified vs. correctly classified sentences, and accounts for the variance of words and their prior counts taken from a large corpus."}, {"id": 103, "string": "Table 2 shows the top 25 words most associated with the misclassified sentences, sorted by their association scores."}, {"id": 104, "string": "On average 50% of the mistakes overlap for both word embeddings, therefore, some of the words are included in both lists."}, {"id": 105, "string": "40 − 44% of these words carry positive or negative sentiment connotations in general (see the underlined words in Table 2 ), while other words like return or send may carry sentiment connotation in e-commerce context."}, {"id": 106, "string": "We check if a word carries sentiment connotation using sentiment lexicon compiled by Hu and Liu (2004) , including 6789 words along with positive or negative labels."}, {"id": 107, "string": "We also observe linguistic negations (i.e., not, Don't)."}, {"id": 108, "string": "For instance, the word most associated with the Objective-specific mistakes (excluding the Subjective misclassified sentences) is not, which suggests that perhaps Subjective word embedding accommodates better understanding of linguistic negations, which may partially explain the difference."}, {"id": 109, "string": "However, our methodology as outlined in Section 2.2 permits exchangeable word order and is not intended to analyze structural interaction between words."}, {"id": 110, "string": "We focus on further analysis of sentiment words, leaving linguistic negations in word embeddings for future investigation."}, {"id": 111, "string": "Controlling for Sentiment Words To control for the \"amount\" of sentiment in the Subjective and Objective corpora, we use sentiment lexicon compiled by Hu and Liu (2004) ."}, {"id": 112, "string": "For each corpus, we create two subcorpora: With Sentiment contains only the sentences with at least one word from the sentiment lexicon, while Without Sentiment is the complement."}, {"id": 113, "string": "We match the corpora on the number of sentences, downsampling the larger corpus, train word embeddings on each subcorpus, and proceed with the classification experiments."}, {"id": 114, "string": "Table 3 shows the results, including that of random word embeddings for reference."}, {"id": 115, "string": "Sentiment lexicon has a significant impact on the performance of sentiment and subjectivity classifications, and a smaller impact on topic classification."}, {"id": 116, "string": "Without sentiment, the Subjective embeddings prove more robust, still outperforming the Objective on sentiment classification, while the Objective performs close to random word embeddings on Amazon ."}, {"id": 117, "string": "In summary, evidences from the series of controlled experiments support the existence of some X-factor to the Subjective embeddings, which confers superior performance in subjectivity-sensitive tasks such as sentiment classification."}, {"id": 118, "string": "To leverage the consequential sentiment information, we propose a family of methods, called SentiVec, for training distributional word embeddings that are infused with information on the sentiment polarity of words."}, {"id": 119, "string": "The methods are built upon Word2Vec optimization algorithm and make use of available lexical sentiment resources such as SentiWordNet (Baccianella et al., 2010) , sentiment lexicon by Hu and Liu (2004) , and etc."}, {"id": 120, "string": "SentiVec seeks to satisfy two objectives, namely context prediction and lexical category prediction: log L = log L word2vec (W ; C) + λ log L lex (W, L), (5) where L word2vec (W ; C) is the Skip-gram objective as in (4) ; L lex (W, L) is a lexical objective for corpus W and lexical resource L; and λ is a tradeoff parameter."}, {"id": 121, "string": "Lexical resource L = {X i } n i=1 comprises of n word sets, each X i contains words of the same category."}, {"id": 122, "string": "For sentiment classification, we consider positive and negative word categories."}, {"id": 123, "string": "Logistic SentiVec Logistic SentiVec admits lexical resource in the form of two disjoint word sets, L = {X 1 , X 2 }, X 1 ∩ X 2 = ∅."}, {"id": 124, "string": "The objective is to tell apart which word set of L word w belongs to: log L lex (W, L) (6) = w∈X 1 log P(w ∈ X 1 ) + w∈X 2 log P(w ∈ X 2 )."}, {"id": 125, "string": "We further tie these probabilities together, and cast the objective as a logistic regression problem: P(w ∈ X 1 ) = 1 − P(w ∈ X 2 ) = σ(v w · τ ), (7) where v w is a word embedding and τ is a direction vector."}, {"id": 126, "string": "Since word embeddings are generally invariant to scaling and rotation when used as downstream feature representations, τ can be chosen randomly and fixed during training."}, {"id": 127, "string": "We experiment with randomly sampled unit length directions."}, {"id": 128, "string": "For simplicity, we also scale embedding v w to its unit length when computing v w · τ , which now equals to cosine similarity between v w and τ ."}, {"id": 129, "string": "When v w is completely aligned with τ , the cosine similarity between them is 1, which maximizes P(w ∈ X 1 ) and favors words in X 1 ."}, {"id": 130, "string": "When v w is opposite to τ , the cosine similarity equals to −1, which maximizes P(w ∈ X 2 ) and predicts vectors from X 2 ."}, {"id": 131, "string": "Orthogonal vectors have cosine similarity of 0, which makes both w ∈ X 1 and w ∈ X 2 equally probable."}, {"id": 132, "string": "Optimizing (6) makes the corresponding word embeddings of X 1 and X 2 gravitate to the opposite semispaces and simulates clustering effect for the words of the same category, while the Word2Vec objective prevents words from collapsing to the same directions."}, {"id": 133, "string": "Optimization The objective in (6) permits simple stochastic gradient ascent optimization and can be combined with negative sampling procedure for Skip-gram in (5)."}, {"id": 134, "string": "The gradient for unnormalized embedding v w is solved as follows: log L [w∈X 1 ] (D, L) v wi = (log P (x ∈ X 1 )) v wi = 1 v w 2 σ − v w · τ v w τ i v w − v wi v w · τ v w (8) The optimization equation for v w , when w ∈ X 2 , can be derived analogously."}, {"id": 135, "string": "Spherical SentiVec Spherical SentiVec extends Logistic SentiVec by dealing with any number of lexical categories, L = {X i } n i=1 ."}, {"id": 136, "string": "As such, the lexical objective takes on generic form: log L lex (W, L) = n i=1 w∈X i log P (w ∈ X i ), (9) Each P (w ∈ X i ) defines embedding generating process."}, {"id": 137, "string": "We assume each length-normalized v w for w of L is generated w.r.t."}, {"id": 138, "string": "a mixture model of von Mises-Fisher (vMF) distributions."}, {"id": 139, "string": "vMF is a probability distribution on a multidimensional sphere, characterized by parameters µ (mean direction) and κ (concentration parameter)."}, {"id": 140, "string": "Sampled points are concentrated around µ; the greater the κ, the closer the sampled points are to µ."}, {"id": 141, "string": "We consider only unimodal vMF distributions, restricting concentration parameters to be strictly positive."}, {"id": 142, "string": "Hereby, each X i ∈ L is assigned to vMF distribution parameters (µ i , κ i ) and the membership probabilities are defined as follows: P(w ∈ X i ) = P (v w ; µ i , κ i ) = 1 Z κ i e κ i µ i ·vw , (10) where Z κ is the normalization factor."}, {"id": 143, "string": "The Spherical SentiVec lexical objective forces words of every X i ∈ L to gravitate towards and concentrate around their direction mean µ i ."}, {"id": 144, "string": "As in Logistic SentiVec, it simulates clustering effect for the words of the same set."}, {"id": 145, "string": "In comparison to the direction vector of Logistic SentiVec, mean directions of Spherical SentiVec when fixed can substantially influence word embeddings training and must be carefully selected."}, {"id": 146, "string": "We optimize the mean directions along with the word embeddings using alternating procedure resembling K-means clustering algorithm."}, {"id": 147, "string": "For simplicity, we keep concentration parameters tied, κ 1 = κ 2 = ... = κ n = κ, and treat κ as a hyperparameter of this algorithm."}, {"id": 148, "string": "Optimization We derive optimization procedure for updating word embeddings assuming fixed direction means."}, {"id": 149, "string": "Like Logistic SentiVec, Spherical SentiVec can be combined with the negative sampling procedure of Skip-gram."}, {"id": 150, "string": "The gradient for unnormalized word embedding v w is solved by the following equation: log L [w∈X i ] (W, L) v wj = κi µij vw − vwj vw ·µ i vw vw 2 (11) Once word embedding v w (w ∈ X i ) is updated, we revise direction mean µ i w.r.t."}, {"id": 151, "string": "maximum likelihood estimator: µi = w∈X i vw w∈X i vw ."}, {"id": 152, "string": "(12) Updating the direction means in such a way ensures that the lexical objective is non-decreasing."}, {"id": 153, "string": "Assuming the stochastic optimization procedure for L word2vec complies with the same nondecreasing property, the proposed alternating procedure converges."}, {"id": 154, "string": "Related Work There have been considerable research on improving the quality of distributional word embeddings."}, {"id": 155, "string": "Bolukbasi et al."}, {"id": 156, "string": "(2016) seek to debias word embeddings from gender stereotypes."}, {"id": 157, "string": "Rothe and Schütze (2017) incorporate WordNet lexeme and synset information."}, {"id": 158, "string": "Mrkšic et al."}, {"id": 159, "string": "(2016) encode antonym-synonym relations."}, {"id": 160, "string": "Liu et al."}, {"id": 161, "string": "(2015) encode ordinal relations such as hypernym and hyponym."}, {"id": 162, "string": "Kiela et al."}, {"id": 163, "string": "(2015) augment Skip-gram to enforce lexical similarity or relatedness constraints, Bollegala et al."}, {"id": 164, "string": "(2016) modify GloVe optimization procedure for the same purpose."}, {"id": 165, "string": "Faruqui et al."}, {"id": 166, "string": "(2015) employ semantic relations of PPDB, WordNet, FrameNet to retrofit word embeddings for various prediction tasks."}, {"id": 167, "string": "We use this Retrofitting method 7 as a baseline."}, {"id": 168, "string": "Socher et al."}, {"id": 169, "string": "(2011) derive multi-word embeddings for sentiment distribution prediction, while we focus on lexical distributional analysis."}, {"id": 170, "string": "Maas et al."}, {"id": 171, "string": "(2011) and Tang et al."}, {"id": 172, "string": "(2016) use documentlevel sentiment annotations to fit word embeddings, but document annotation might not always be available for distributional analysis on neutral corpora such as Wikipedia."}, {"id": 173, "string": "SentiVec relies on simple sentiment lexicon instead."}, {"id": 174, "string": "Refining (Yu et al., 2018) aligns the sentiment scores taken from lexical resource and the cosine similarity scores of corresponding word embeddings."}, {"id": 175, "string": "The method generally requires fine-grained sentiment scores for the words, which may not be available in some settings."}, {"id": 176, "string": "We use Refining as a baseline and adopt coarse-grained sentiment lexicon for this method."}, {"id": 177, "string": "Villegas et al."}, {"id": 178, "string": "(2016) compare various distributional word embeddings arising from the same corpus for sentiment classification, whereas we focus on the differentiation in input corpora and propose novel sentiment-infused word embeddings."}, {"id": 179, "string": "Experiments The objective of experiments is to study the efficacy of Logistic SentiVec and Spherical SentiVec word embeddings on the aforementioned text classification tasks."}, {"id": 180, "string": "One natural baseline is Word2Vec, as SentiVec subsumes its context prediction objective, while further incorporating lexical category prediction."}, {"id": 181, "string": "We include two other baselines that can leverage the same lexical resource but in manners different from SentiVec, namely: Retrofitting (Faruqui et al., 2015) and Refining (Yu et al., 2018) ."}, {"id": 182, "string": "For these methods, we generate their word embeddings based on Setup III (see Section 3)."}, {"id": 183, "string": "All the methods were run multiple times with various hyperparameters, optimized via grid-search; for each we present the best performing setting."}, {"id": 184, "string": "First, we discuss the sentiment classification task."}, {"id": 185, "string": "Table 4 shows the unfolded results for the 24 classification datasets of Amazon, as well as for Rotten Tomatoes."}, {"id": 186, "string": "For each classification dataset (row), and for the Objective and Subjective embedding corpora respectively, the best word embedding methods are shown in bold."}, {"id": 187, "string": "An asterisk indicates statistically significant 8 results at 5% in comparison to Word2Vec."}, {"id": 188, "string": "Both SentiVec variants outperform Word2Vec in the vast majority of the cases."}, {"id": 189, "string": "The degree of outperformance is higher for the Objective than the Subjective word embeddings."}, {"id": 190, "string": "This is a reasonable trend given our previous findings in Section 3."}, {"id": 191, "string": "As the Objective Corpus encodes less information than the Subjective Corpus for sentiment classification, the former is more likely to benefit from the infusion of sentiment information from additional lexical resources."}, {"id": 192, "string": "Note that the sentiment infusion into the word embeddings comes from separate lexical resources, and does not involve any sentiment classification label."}, {"id": 193, "string": "SentiVec also outperforms the two baselines that benefit from the same lexical resources."}, {"id": 194, "string": "Retrofitting does not improve upon Word2Vec, with the two embeddings essentially indistinguishable (the difference is only noticeable at the second decimal point)."}, {"id": 195, "string": "Refining makes the word embeddings perform worse on the sentiment classification task."}, {"id": 196, "string": "One possible explanation is that Refining normally requires fine-grained labeled lexicon, where the words are scored w.r.t."}, {"id": 197, "string": "the sentiment scale, whereas we use sentiment lexicon of two labels (i.e., positive or negative)."}, {"id": 198, "string": "SentiVec accepts coarse-grained sentiment lexicons, and potentially could be extended to deal with fine-grained labels."}, {"id": 199, "string": "As previously alluded to, topic and subjectivity classifications are less sensitive to the subjectivity within word embeddings than sentiment classification."}, {"id": 200, "string": "One therefore would not expect much, if any, performance gain from infusion of sentiment information."}, {"id": 201, "string": "However, such infusion should not subtract or harm the quality of word embeddings either."}, {"id": 202, "string": "Table 5 shows that the unfolded results for topic classification on the six datasets, and the result for subjectivity classification are similar across methods."}, {"id": 203, "string": "Neither the SentiVec variants, nor Retrofitting and Refining, change the subjectivity and topic classification capabilities much, which means that the used sentiment lexicon is targeted only at the sentiment subspace of embeddings."}, {"id": 204, "string": "Illustrative Changes in Embeddings To give more insights on the difference between SentiVec and Word2Vec, we show \"flower\" diagrams in Figure 1 for Logistic SentiVec and Figure 2 for Spherical SentiVec."}, {"id": 205, "string": "Each is associated with a reference word (e.g., good for Figure 1a) , and indicates relative changes in cosine distances between the reference word and the testing words surrounding the \"flower\"."}, {"id": 206, "string": "Every testing word is associated with a \"petal\" or black axis extending from the center of the circle."}, {"id": 207, "string": "The \"petal\" length is proportional to the relative distance change in two word embeddings: κ = Word2Vec embeddings correspondingly."}, {"id": 208, "string": "If the distance remains unchanged (κ = 1), then the \"petal\" points at the circumference; if the reference and testing words are closer in the SentiVec embedding than they are in Word2Vec (κ < 1), the \"petal\" lies inside the circle; when the distance increases (κ > 1), the \"petal\" goes beyond the circle."}, {"id": 209, "string": "The diagrams are presented for Objective Embeddings 9 ."}, {"id": 210, "string": "We use three reference words: good (positive), bad (negative), time (neutral); as well as three groups of testing words: green for words randomly sampled from positive lexicon (Sector I-II), red for words randomly sampled from negative lexicon (Sector II-III), and gray for frequent neutral common nouns (Sector III-I)."}, {"id": 211, "string": "Figure 1 shows changes produced by Logistic SentiVec."}, {"id": 212, "string": "For the positive reference word (Figure 1a) , the average distance to the green words is shortened, whereas the distance to the red words increases."}, {"id": 213, "string": "The reverse is observed for the negative reference word (Figure 1b )."}, {"id": 214, "string": "This observation complies with the lexical objective (7) of Logistic SentiVec, which aims to separate the words of two different classes."}, {"id": 215, "string": "Note that the gray words suffer only moderate change with respect to positive and negative reference words."}, {"id": 216, "string": "For the neutral reference word (Figure 1c ), the distances are only moderately affected across all testing groups."}, {"id": 217, "string": "Figure 2 shows that Spherical SentiVec tends to make embeddings more compact than Logistic SentiVec."}, {"id": 218, "string": "As the former's lexical objective (9) is designed for clustering, but not for separation, we look at the comparative strength of the clustering effect on the testing words."}, {"id": 219, "string": "For the positive reference word (Figure 2a ), the largest clustering effect is achieved for the green words."}, {"id": 220, "string": "For the negative reference word (Figure 2b) , as expected, the red words are affected the most."}, {"id": 221, "string": "The gray words suffer the least change for all the reference words."}, {"id": 222, "string": "In summary, SentiVec effectively provides an advantage for subjectivity-sensitive task such as sentiment classification, while not harming the performance of other text classification tasks."}, {"id": 223, "string": "Conclusion We explore the differences between objective and subjective corpora for generating word embeddings, and find that there is indeed a difference in the embeddings' classification task performances."}, {"id": 224, "string": "Identifying the presence of sentiment words as one key factor for the difference, we propose a novel method SentiVec to train word embeddings that are infused with the sentiment polarity of words derived from a separate sentiment lexicon."}, {"id": 225, "string": "We further identify two lexical objectives: Logistic SentiVec and Spherical SentiVec."}, {"id": 226, "string": "The proposed word embeddings show improvements in sentiment classification, while maintaining their performance on subjectivity and topic classifications."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 15}, {"section": "Data and Methodology", "n": "2", "start": 16, "end": 18}, {"section": "Generating Word Embeddings", "n": "2.1", "start": 19, "end": 47}, {"section": "Evaluation Tasks", "n": "2.2", "start": 48, "end": 74}, {"section": "Comparative Analyses of Subjective vs. Objective Corpora", "n": "3", "start": 75, "end": 122}, {"section": "Logistic SentiVec", "n": "4.1", "start": 123, "end": 134}, {"section": "Spherical SentiVec", "n": "4.2", "start": 135, "end": 153}, {"section": "Related Work", "n": "5", "start": 154, "end": 178}, {"section": "Experiments", "n": "6", "start": 179, "end": 222}, {"section": "Conclusion", "n": "7", "start": 223, "end": 226}], "figures": [{"filename": "../figure/image/1359-Figure1-1.png", "caption": "Figure 1: Relative changes in cosine distances in Logistic SentiVec contrasted with Word2Vec", "page": 8, "bbox": {"x1": 79.2, "x2": 519.36, "y1": 67.2, "y2": 220.79999999999998}}, {"filename": "../figure/image/1359-Figure2-1.png", "caption": "Figure 2: Relative changes in cosine distances in Spherical SentiVec contrasted with Word2Vec", "page": 8, "bbox": {"x1": 76.8, "x2": 521.28, "y1": 267.84, "y2": 415.68}}, {"filename": "../figure/image/1359-Table3-1.png", "caption": "Table 3: With and without sentiment", "page": 4, "bbox": {"x1": 310.56, "x2": 522.24, "y1": 62.4, "y2": 137.28}}, {"filename": "../figure/image/1359-Table4-1.png", "caption": "Table 4: Comparison of Sentiment-Infused Word Embeddings on Sentiment Classification Task", "page": 7, "bbox": {"x1": 72.0, "x2": 537.12, "y1": 65.75999999999999, "y2": 312.96}}, {"filename": "../figure/image/1359-Table5-1.png", "caption": "Table 5: Comparison of Word Embeddings on Subjectivity and Topic Classification Tasks", "page": 7, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 351.36, "y2": 460.32}}, {"filename": "../figure/image/1359-Table1-1.png", "caption": "Table 1: Controlled comparison of Objective and Subjective corpora", "page": 3, "bbox": {"x1": 78.72, "x2": 519.36, "y1": 65.75999999999999, "y2": 203.04}}, {"filename": "../figure/image/1359-Table2-1.png", "caption": "Table 2: Top words of misclassified sentences", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 526.0799999999999, "y1": 245.76, "y2": 334.08}}]}