{"title": "Numeracy for Language Models: Evaluating and Improving their Ability to Predict Numbers", "abstract": "Numeracy is the ability to understand and work with numbers. It is a necessary skill for composing and understanding documents in clinical, scientific, and other technical domains. In this paper, we explore different strategies for modelling numerals with language models, such as memorisation and digit-by-digit composition, and propose a novel neural architecture that uses a continuous probability density function to model numerals from an open vocabulary. Our evaluation on clinical and scientific datasets shows that using hierarchical models to distinguish numerals from words improves a perplexity metric on the subset of numerals by 2 and 4 orders of magnitude, respectively, over nonhierarchical models. A combination of strategies can further improve perplexity. Our continuous probability density function model reduces mean absolute percentage errors by 18% and 54% in comparison to the second best strategy for each dataset, respectively.", "text": [{"id": 0, "string": "Introduction Language models (LMs) are statistical models that assign a probability over sequences of words."}, {"id": 1, "string": "Language models can often help with other tasks, such as speech recognition (Mikolov et al., 2010; Prabhavalkar et al., 2017) , machine translation (Luong et al., 2015; Gülçehre et al., 2017) , text summarisation (Filippova et al., 2015; Gambhir and Gupta, 2017) , question answering (Wang et al., 2017) , semantic error detection (Rei and Yannakoudakis, 2017; Spithourakis et al., 2016a) , and fact checking (Rashkin et al., 2017) ."}, {"id": 2, "string": "Numeracy and literacy refer to the ability to comprehend, use, and attach meaning to numbers and words, respectively."}, {"id": 3, "string": "Language models exhibit literacy by being able to assign higher probabilities to sentences that Figure 1: Modelling numerals with a categorical distribution over a fixed vocabulary maps all out-ofvocabulary numerals to the same type, e.g."}, {"id": 4, "string": "UNK, and does not reflect the smoothness of the underlying continuous distribution of certain attributes."}, {"id": 5, "string": "are both grammatical and realistic, as in this example: 'I eat an apple' (grammatical and realistic) 'An apple eats me' (unrealistic) 'I eats an apple ' (ungrammatical) Likewise, a numerate language model should be able to rank numerical claims based on plausibility: 'John's height is 1.75 metres' (realistic) 'John's height is 999.999 metres ' (unrealistic) Existing approaches to language modelling treat numerals similarly to other words, typically using categorical distributions over a fixed vocabulary."}, {"id": 6, "string": "However, this maps all unseen numerals to the same unknown type and ignores the smoothness of continuous attributes, as shown in Figure 1 ."}, {"id": 7, "string": "In that respect, existing work on language modelling does not explicitly evaluate or optimise for numeracy."}, {"id": 8, "string": "Numerals are often neglected and low-resourced, e.g."}, {"id": 9, "string": "they are often masked (Mitchell and Lapata, 2009) , and there are only 15,164 (3.79%) numerals among GloVe's 400,000 embeddings pretrained on 6 billion tokens (Pennington et al., 2014) ."}, {"id": 10, "string": "Yet, numbers appear ubiquitously, from children's magazines (Joram et al., 1995) to clinical reports (Bigeard et al., 2015) , and grant objectivity to sciences (Porter, 1996) ."}, {"id": 11, "string": "Previous work finds that numerals have higher out-of-vocabulary rates than other words and proposes solutions for representing unseen numerals as inputs to language models, e.g."}, {"id": 12, "string": "using numerical magnitudes as features (Spithourakis et al., 2016b,a) ."}, {"id": 13, "string": "Such work identifies that the perplexity of language models on the subset of numerals can be very high, but does not directly address the issue."}, {"id": 14, "string": "This paper focuses on evaluating and improving the ability of language models to predict numerals."}, {"id": 15, "string": "The main contributions of this paper are as follows: 1."}, {"id": 16, "string": "We explore different strategies for modelling numerals, such as memorisation and digit-bydigit composition, and propose a novel neural architecture based on continuous probability density functions."}, {"id": 17, "string": "2."}, {"id": 18, "string": "We propose the use of evaluations that adjust for the high out-of-vocabulary rate of numerals and account for their numerical value (magnitude)."}, {"id": 19, "string": "3."}, {"id": 20, "string": "We evaluate on a clinical and a scientific corpus and provide a qualitative analysis of learnt representations and model predictions."}, {"id": 21, "string": "We find that modelling numerals separately from other words can drastically improve the perplexity of LMs, that different strategies for modelling numerals are suitable for different textual contexts, and that continuous probability density functions can improve the LM's prediction accuracy for numbers."}, {"id": 22, "string": "Language Models Let s 1 ,s 2 ,...,s L denote a document, where s t is the token at position t. A language model estimates the probability of the next token given previous tokens, i.e."}, {"id": 23, "string": "p(s t |s 1 ,...,s t−1 )."}, {"id": 24, "string": "Neural LMs estimate this probability by feeding embeddings, i.e."}, {"id": 25, "string": "vectors that represent each token, into a Recurrent Neural Network (RNN) (Mikolov et al., 2010) ."}, {"id": 26, "string": "Token Embeddings Tokens are most commonly represented by a D-dimensional dense vector that is unique for each word from a vocabulary V of known words."}, {"id": 27, "string": "This vocabulary includes special symbols (e.g."}, {"id": 28, "string": "'UNK') to handle out-of-vocabulary tokens, such as unseen words or numerals."}, {"id": 29, "string": "Let w s be the one-hot representation of token s, i.e."}, {"id": 30, "string": "a sparse binary vector with a single element set to 1 for that token's index in the vocabulary, and E ∈R D×|V| be the token embeddings matrix."}, {"id": 31, "string": "The token embedding for s is the vector e token s =Ew s ."}, {"id": 32, "string": "Character-Based Embeddings A representation for a token can be build from its constituent characters (Luong and Manning, 2016; Santos and Zadrozny, 2014) ."}, {"id": 33, "string": "Such a representation takes into account the internal structure of tokens."}, {"id": 34, "string": "Let d 1 ,d 2 ,...,d N be the characters of token s. A character-based embedding for s is the final hidden state of a D-dimensional character-level RNN: e chars s =RNN(d 0 ,d 1 ,...d L )."}, {"id": 35, "string": "Recurrent and Output Layer The computation of the conditional probability of the next token involves recursively feeding the embedding of the current token e st and the previous hidden state h t−1 into a D-dimensional token-level RNN to obtain the current hidden state h t ."}, {"id": 36, "string": "The output probability is estimated using the softmax function, i.e."}, {"id": 37, "string": "p(s t |h t )=softmax(ψ(s t ))= 1 Z e ψ(st) Z = s ∈V e ψ(s ) , (1) where ψ(.)"}, {"id": 38, "string": "is a score function."}, {"id": 39, "string": "Training and Evaluation Neural LMs are typically trained to minimise the cross entropy on the training corpus: H train =− 1 N st∈train logp(s t |s <t ) (2) A common performance metric for LMs is per token perplexity (Eq."}, {"id": 40, "string": "3), evaluated on a test corpus."}, {"id": 41, "string": "It can also be interpreted as the branching factor: the size of an equally weighted distribution with equivalent uncertainty, i.e."}, {"id": 42, "string": "how many sides you need on a fair die to get the same uncertainty as the model distribution."}, {"id": 43, "string": "P P test =exp(H test ) (3) Strategies for Modelling Numerals In this section we describe models with different strategies for generating numerals and propose the use of number-specific evaluation metrics that adjust for the high out-of-vocabulary rate of numerals and account for numerical values."}, {"id": 44, "string": "We draw inspiration from theories of numerical cognition."}, {"id": 45, "string": "The triple code theory (Dehaene et al., 2003) postulates that humans process quantities through two exact systems (verbal and visual) and one approximate number system that semantically represents a number on a mental number line."}, {"id": 46, "string": "Tzelgov et al."}, {"id": 47, "string": "(2015) identify two classes of numbers: i) primitives, which are holistically retrieved from long-term memory; and ii) non-primitives, which are generated online."}, {"id": 48, "string": "An in-depth review of numerical and mathematical cognition can be found in Kadosh and Dowker (2015) and Campbell (2005) ."}, {"id": 49, "string": "Softmax Model and Variants This class of models assumes that numerals come from a finite vocabulary that can be memorised and retrieved later."}, {"id": 50, "string": "The softmax model treats all tokens (words and numerals) alike and directly uses Equation 1 with score function: ψ(s t )=h T t e token st =h T t E out w st , (4) where E out ∈ R D×|V| is an output embeddings matrix."}, {"id": 51, "string": "The summation in Equation 1 is over the complete target vocabulary, which requires mapping any out-of-vocabulary tokens to special symbols, e.g."}, {"id": 52, "string": "'UNK word ' and 'UNK numeral '."}, {"id": 53, "string": "Softmax with Digit-Based Embeddings The softmax+rnn variant considers the internal syntax of a numeral's digits by adjusting the score function: ψ(s t )=h T t e token st +h T t e chars st =h T t E out w st +h T t E RNN out w st , (5) where the columns of E RNN out are composed of character-based embeddings for in-vocabulary numerals and token embeddings for the remaining vocabulary."}, {"id": 54, "string": "The character set comprises digits (0-9), the decimal point, and an end-of-sequence character."}, {"id": 55, "string": "The model still requires normalisation over the whole vocabulary, and the special unknown tokens are still needed."}, {"id": 56, "string": "Hierarchical Softmax A hierarchical softmax (Morin and Bengio, 2005a) can help us decouple the modelling of numerals from that of words."}, {"id": 57, "string": "The probability of the next token s t is decomposed to that of its class c t and the probability of the exact token from within the class: p(s t |h t )= ct∈C p(c t |h t )p(s t |c t ,h t ) p(c t |h t )=σ h T t b (6) where the valid token classes are C = {word, numeral}, σ is the sigmoid function and b is a D-dimensional vector."}, {"id": 58, "string": "Each of the two branches of p(s t |c t ,h t ) can now be modelled by independently normalised distributions."}, {"id": 59, "string": "The hierarchical variants (h-softmax and h-softmax+rnn) use two independent softmax distributions for words and numerals."}, {"id": 60, "string": "The two branches share no parameters, and thus words and numerals will be embedded into separate spaces."}, {"id": 61, "string": "The hierarchical approach allows us to use any well normalised distribution to model each of its branches."}, {"id": 62, "string": "In the next subsections, we examine different strategies for modelling the branch of numerals, i.e."}, {"id": 63, "string": "p(s t |c t = numeral,h t )."}, {"id": 64, "string": "For simplicity, we will abbreviate this to p(s)."}, {"id": 65, "string": "Digit-RNN Model Let d 1 ,d 2 ...d N be the digits of numeral s. A digit-bydigit composition strategy estimates the probability of the numeral from the probabilities of its digits: p(s)=p(d 1 )p(d 2 |d 1 )...p(d N |d <N ) (7) The d-RNN model feeds the hidden state h t of the token-level RNN into a character-level RNN (Graves, 2013; Sutskever et al., 2011) to estimate this probability."}, {"id": 66, "string": "This strategy can accommodate an open vocabulary, i.e."}, {"id": 67, "string": "it eliminates the need for an UNK numeral symbol, as the probability is normalised one digit at a time over the much smaller vocabulary of digits (digits 0-9, decimal separator, and end-of-sequence)."}, {"id": 68, "string": "Mixture of Gaussians Model Inspired by the approximate number system and the mental number line (Dehaene et al., 2003) , our proposed MoG model computes the probability of numerals from a probability density function (pdf) over real numbers, using a mixture of Gaussians for the underlying pdf: q(v)= K k=1 π k N k (v;µ k ,σ 2 k ) π k =softmax B T h t , (8) where K is the number of components, π k are mixture weights that depend on hidden state h t of the token-level RNN, N k is the pdf of the normal distribution with mean µ k ∈ R and variance σ 2 k ∈ R, and B ∈R D×K is a matrix."}, {"id": 69, "string": "The difficulty with this approach is that for any continuous random variable, the probability that it equals a specific value is always zero."}, {"id": 70, "string": "To resolve this, Figure 2 : Mixture of Gaussians model."}, {"id": 71, "string": "The probability of a numeral is decomposed into the probability of its decimal precision and the probability that an underlying number will produce the numeral when rounded at the given precision."}, {"id": 72, "string": "we consider a probability mass function (pmf) that discretely approximates the pdf: Q(v|r)= v+ r v− r q(u)du=F (v+ r )−F (v− r ), (9) where F (.)"}, {"id": 73, "string": "is the cumulative density function of q(."}, {"id": 74, "string": "), and r = 0.5×10 −r is the number's precision."}, {"id": 75, "string": "The level of discretisation r, i.e."}, {"id": 76, "string": "how many decimal digits to keep, is a random variable in N with distribution p(r)."}, {"id": 77, "string": "The mixed joint density is: p(s)=p(v,r)=p(r) Q(v|r) (10) Figure 2 summarises this strategy, where we model the level of discretisation by converting the numeral into a pattern and use a RNN to estimate the probability of that pattern sequence: p(r)=p(SOS INT_PART ."}, {"id": 78, "string": "r decimal digits \\d ... \\d EOS) (11) Combination of Strategies Different mechanisms might be better for predicting numerals in different contexts."}, {"id": 79, "string": "We propose a combination model that can select among different strategies for modelling numerals: p(s)= ∀m∈M α m p(s|m) α m =softmax A T h t , (12) where M={h-softmax, d-RNN, MoG}, and A∈R D×|M| ."}, {"id": 80, "string": "Since both d-RNN and MoG are openvocabulary models, the unknown numeral token can now be removed from the vocabulary of h-softmax."}, {"id": 81, "string": "Evaluating the Numeracy of LMs Numeracy skills are centred around the understanding of numbers and numerals."}, {"id": 82, "string": "A number is a mathematical object with a specific magnitude, whereas a numeral is its symbolic representation, usually in the positional decimal Hindu-Arabic numeral system (McCloskey and Macaruso, 1995) ."}, {"id": 83, "string": "In humans, the link between numerals and their numerical values boosts numerical skills (Griffin et al., 1995) ."}, {"id": 84, "string": "Perplexity Evaluation Test perplexity evaluated only on numerals will be informative of the symbolic component of numeracy."}, {"id": 85, "string": "However, model comparisons based on naive evaluation using Equation 3 might be problematic: perplexity is sensitive to outof-vocabulary (OOV) rate, which might differ among models, e.g."}, {"id": 86, "string": "it is zero for open-vocabulary models."}, {"id": 87, "string": "As an extreme example, in a document where all words are out of vocabulary, the best perplexity is achieved by a trivial model that predicts everything as unknown."}, {"id": 88, "string": "Ueberla (1994) proposed Adjusted Perplexity (APP; Eq."}, {"id": 89, "string": "14), also known as unknown-penalised perplexity , to cancel the effect of the out-of-vocabulary rate on perplexity."}, {"id": 90, "string": "The APP is the perplexity of an adjusted model that uniformly redistributes the probability of each out-of-vocabulary class over all different types in that class: p (s)= p(s) 1 |OOVc| if s∈OOV c p(s) otherwise (13) where OOV c is an out-of-vocabulary class (e.g."}, {"id": 91, "string": "words and numerals), and |OOV c | is the cardinality of each OOV set."}, {"id": 92, "string": "Equivalently, adjusted perplexity can be calculated as: 14) where N is the total number of tokens in the test set and |s ∈ OOV c | is the count of tokens from the test set belonging in each OOV set."}, {"id": 93, "string": "AP P test =exp H test + c H c adjust H c adjust =− t |s t ∈OOV c | N log 1 |OOV c | ( Evaluation on the Number Line While perplexity looks at symbolic performance on numerals, this evaluation focuses on numbers and particularly on their numerical value, which is their most prominent semantic content (Dehaene et al., 2003; Dehaene and Cohen, 1995) ."}, {"id": 94, "string": "Let v t be the numerical value of token s t from the test corpus."}, {"id": 95, "string": "Also, letv t be the value of the most probable numeral under the model s t = argmax (p(s t |h t ,c t =num))."}, {"id": 96, "string": "Any evaluation metric from the regression literature can be used to measure the models performance."}, {"id": 97, "string": "To evaluate on the number line, we can use any evaluation metric from the regression literature."}, {"id": 98, "string": "In reverse order of tolerance to extreme errors, some of the most popular are Root Mean Squared Error (RMSE), Mean Absolute Error (MAE), and Median Absolute Error (MdAE): e i = v i −v i RMSE = 1 N N i=1 e 2 i MAE = 1 N N i=1 |e i | MdAE = median{|e i |} (15) The above are sensitive to the scale of the data."}, {"id": 99, "string": "If the data contains values from different scales, percentage metrics are often preferred, such as the Mean/Median Absolute Percentage Error (MAPE/MdAPE): pe i = v i −v i v i MAP E = 1 N N i=1 |pe i | MdAP E = median{|pe i |} (16) Data To evaluate our models, we created two datasets with documents from the clinical and scientific domains, where numbers abound (Bigeard et al., 2015; Porter, 1996) ."}, {"id": 100, "string": "Furthermore, to ensure that the numbers will be informative of some attribute, we only selected texts that reference tables."}, {"id": 101, "string": "Clinical Data Our clinical dataset comprises clinical records from the London Chest Hospital."}, {"id": 102, "string": "The records where accompanied by tables with 20 numeric attributes (age, heart volumes, etc.)"}, {"id": 103, "string": "that they partially describe, as well as include numbers not found in the tables."}, {"id": 104, "string": "Numeric tokens constitute only a small proportion of each sentence (4.3%), but account for a large part of the unique tokens vocabulary (>40%) and suffer high OOV rates."}, {"id": 105, "string": "Scientific Data Our scientific dataset comprises paragraphs from Cornell's ARXIV 1 repository of scientific articles, with more than half a million converted papers in 37 scientific sub-fields."}, {"id": 106, "string": "We used the preprocessed ARXMLIV (Stamerjohanns et al., 2010; Stamerjohanns and Kohlhase, 2008 ) 2 version, where papers have been converted from LATEX into a custom XML format using the LATEXML 3 tool."}, {"id": 107, "string": "We then kept all paragraphs with at least one reference to a table and a number."}, {"id": 108, "string": "For both datasets, we lowercase tokens and normalise numerals by omitting the thousands separator (\"2,000\" becomes \"2000\") and leading zeros (\"007\" becomes \"7\")."}, {"id": 109, "string": "Special mathematical symbols are tokenised separately, e.g."}, {"id": 110, "string": "negation (\"-1\" as \"-\", \"1\"), fractions (\"3/4\" as \"3\", \"/\", \"4\"), etc."}, {"id": 111, "string": "For this reason, all numbers were non-negative."}, {"id": 112, "string": "Table 1 shows descriptive statistics for both datasets."}, {"id": 113, "string": "Experimental Results and Discussion We set the vocabularies to the 1,000 and 5,000 most frequent token types for the clinical and scientific datasets, respectively."}, {"id": 114, "string": "We use gated token-character embeddings (Miyamoto and Cho, 2016) for the input of numerals and token embeddings for the input and output of words, since the scope of our paper is numeracy."}, {"id": 115, "string": "We set the models' hidden dimensions to D = 50 and initialise all token embeddings to pretrained GloVe (Pennington et al., 2014) ."}, {"id": 116, "string": "All our   RNNs are LSTMs (Hochreiter and Schmidhuber, 1997) with the biases of LSTM forget gate were initialised to 1.0 (Józefowicz et al., 2015) ."}, {"id": 117, "string": "We train using mini-batch gradient decent with the Adam optimiser (Kingma and Ba, 2014) and regularise with early stopping and 0.1 dropout rate (Srivastava, 2013) in the input and output of the token-based RNN."}, {"id": 118, "string": "For the mixture of Gaussians, we select the mean and variances to summarise the data at different granularities by fitting 7 separate mixture of Gaussian models on all numbers, each with twice as many components as the previous, for a total of 2 7+1 − 1 = 256 components."}, {"id": 119, "string": "These models are initialised at percentile points from the data and trained with the expectation-minimisation algorithm."}, {"id": 120, "string": "The means and variances are then fixed and not updated when we train the language model."}, {"id": 121, "string": "Quantitative Results Perplexities Table 2 shows perplexities evaluated on the subsets of words, numerals and all tokens of the test data."}, {"id": 122, "string": "Overall, all models performed better on the clinical than on the scientific data."}, {"id": 123, "string": "On words, all models achieve similar perplexities in each dataset."}, {"id": 124, "string": "On numerals, softmax variants perform much better than other models in PP, which is an artefact of the high OOV-rate of numerals."}, {"id": 125, "string": "APP is significantly worse, especially for non-hierarchical variants, which perform about 2 and 4 orders of magnitude worse than hierarchical ones."}, {"id": 126, "string": "For open-vocabulary models, i.e."}, {"id": 127, "string": "d-RNN, MoG, and combination, PP is equivalent to APP."}, {"id": 128, "string": "On numerals, d-RNN performed better than softmax variants in both datasets."}, {"id": 129, "string": "The MoG model performed twice as well as softmax variants on the clinical dataset, but had the third worse performance in the scientific dataset."}, {"id": 130, "string": "The combination model had the best overall APP results for both datasets."}, {"id": 131, "string": "Evaluations on the Number Line To factor out model specific decoding processes for finding the best next numeral, we use our models to rank a set of candidate numerals: we compose the union of in-vocabulary numbers and 100 percentile points from the training set, and we convert numbers into numerals by considering all formats up to n decimal points."}, {"id": 132, "string": "We select n to represent 90% of numerals seen at training, which yields n=3 and n=4 for the clinical and scientific data, respectively."}, {"id": 133, "string": "Table 3 shows evaluation results, where we also include two naive baselines of constant predictions: with the mean and median of the training data."}, {"id": 134, "string": "For both datasets, RMSE and MAE were too sensitive to extreme errors to allow drawing safe conclusions, particularly for the scientific dataset, where both metrics were in the order of 10 9 ."}, {"id": 135, "string": "MdAE can be of some use, as 50% of the errors are absolutely smaller than that."}, {"id": 136, "string": "Along percentage metrics, MoG achieved the best MAPE in both datasets (18% and 54% better that the second best) and was the only model to perform better than the median baseline for the clinical data."}, {"id": 137, "string": "However, it had the worst MdAPE, which means that MoG mainly reduced larger percentage errors."}, {"id": 138, "string": "The d-RNN model came third and second in the clinical and scientific datasets, respectively."}, {"id": 139, "string": "In the latter it achieved the best MdAPE, i.e."}, {"id": 140, "string": "it was effective at reducing errors for 50% of the numbers."}, {"id": 141, "string": "The combination model did not perform better than its constituents."}, {"id": 142, "string": "This is possibly because MoG is the only strategy that takes into account the numerical magnitudes of the numerals."}, {"id": 143, "string": "Learnt Representations Softmax versus Hierarchical Softmax Figure 3 visualises the cosine similarities of the output token embeddings of numerals for the softmax and h-softmax models."}, {"id": 144, "string": "Simple softmax enforced high similarities among all numerals and the unknown numeral token, so as to make them more dissimilar to words, since the model embeds both in the same space."}, {"id": 145, "string": "This is not the case for h-softmax that uses two different spaces: similarities are concentrated along the diagonal and fan out as the magnitude grows, with the exception of numbers with special meaning, e.g."}, {"id": 146, "string": "years and percentile points."}, {"id": 147, "string": "Figure 4 shows the cosine similarities between the digits of the d-RNN output mode."}, {"id": 148, "string": "We observe that each primitive digit is mostly similar to its previous and next digit."}, {"id": 149, "string": "Similar behaviour was found for all digit embeddings of all models."}, {"id": 150, "string": "Digit embeddings Predictions from the Models Next Numeral Figure 5 shows the probabilities of different numerals under each model for two  Probabilities rapidly decrease for more decimal digits, which is reminiscent of the theoretical expectation that the probability of en exact value for a continuous variable is zero."}, {"id": 151, "string": "Table 4 shows development set examples with high selection probabilities for each strategy of the combination model, along with numerals with the highest average selection per mode."}, {"id": 152, "string": "The h-softmax model is responsible for mostly integers with special functions, Table 4 : Examples of numerals with highest probability in each strategy of the combination model."}, {"id": 153, "string": "showed affinity to different indices from catalogues of astronomical objects: d-RNN mainly to NGC (Dreyer, 1888) and MoG to various other indices, such as GL (Gliese, 1988) and HIP (Perryman et al., 1997) ."}, {"id": 154, "string": "In this case, MoG was wrongly selected for numerals with a labelling function, which also highlights a limitation of evaluating on the number line, when a numeral is not used to represent its magnitude."}, {"id": 155, "string": "Figure 5 shows the distributions of the most significant digits under the d-RNN model and from data counts."}, {"id": 156, "string": "The theoretical estimate has been overlayed, according to Benford's law (Benford, 1938) , also called the first-digit law, which applies to many real-life numerals."}, {"id": 157, "string": "The law predicts that the first digit is 1 with higher probability (about 30%) than 9 (< 5%) and weakens towards uniformity at higher digits."}, {"id": 158, "string": "Model probabilities closely follow estimates from the data."}, {"id": 159, "string": "Violations from Benford's law can be due to rounding (Beer, 2009 ) and can be used as evidence for fraud detection (Lu et al., 2006) ."}, {"id": 160, "string": "Selection of Strategy in Combination Model Significant Digits Related Work Numerical quantities have been recognised as important for textual entailment (Lev et al., 2004; Dagan et al., 2013) ."}, {"id": 161, "string": "Roy et al."}, {"id": 162, "string": "(2015) proposed a quantity entailment sub-task that focused on whether a given quantity can be inferred from a given text and, if so, what its value should be."}, {"id": 163, "string": "A common framework for acquiring common sense about numerical attributes of objects has been to collect a corpus of numerical values in pre-specified templates and then model attributes as a normal distribution (Aramaki et al., 2007; Davidov and Rappoport, 2010; Iftene and Moruz, 2010; Narisawa et al., 2013; de Marneffe et al., 2010) ."}, {"id": 164, "string": "Our model embeds these approaches into a LM that has a sense for numbers."}, {"id": 165, "string": "Other tasks that deal with numerals are numerical information extraction and solving mathematical problems."}, {"id": 166, "string": "Numerical relations have at least one argument that is a number and the aim of the task is to extract all such relations from a corpus, which can range from identifying a few numerical attributes (Nguyen and Moschitti, 2011; Intxaurrondo et al., 2015) to generic numerical relation extraction (Hoffmann et al., 2010; Madaan et al., 2016) ."}, {"id": 167, "string": "Our model does not extract values, but rather produces an probabilistic estimate."}, {"id": 168, "string": "Much work has been done in solving arithmetic (Mitra and Baral, 2016; Hosseini et al., 2014; Roy and Roth, 2016) , geometric (Seo et al., 2015) , and algebraic problems (Zhou et al., 2015; Koncel-Kedziorski et al., 2015; Shi et al., 2015; expressed in natural language."}, {"id": 169, "string": "Such models often use mathematical background knowledge, such as linear system solvers."}, {"id": 170, "string": "The output of our model is not based on such algorithmic operations, but could be extended to do so in future work."}, {"id": 171, "string": "In language modelling, generating rare or unknown words has been a challenge, similar to our unknown numeral problem."}, {"id": 172, "string": "Gulcehre et al."}, {"id": 173, "string": "(2016) and Gu et al."}, {"id": 174, "string": "(2016) adopted pointer networks  to copy unknown words from the source in translation and summarisation tasks."}, {"id": 175, "string": "Merity et al."}, {"id": 176, "string": "(2016) and Lebret et al."}, {"id": 177, "string": "(2016) have models that copy from context sentences and from Wikipedia's infoboxes, respectively."}, {"id": 178, "string": "proposed a LM that retrieves unknown words from facts in a knowledge graph."}, {"id": 179, "string": "They draw attention to the inappropriateness of perplexity when OOV-rates are high and instead propose an adjusted perplexity metric that is equivalent to APP."}, {"id": 180, "string": "Other methods aim at speeding up LMs to allow for larger vocabularies , such as hierarchical softmax (Morin and Bengio, 2005b) , target sampling (Jean et al., 2014) , etc., but still suffer from the unknown word problem."}, {"id": 181, "string": "Finally, the problem is resolved when predicting one character at a time, as done by the character-level RNN (Graves, 2013; Sutskever et al., 2011) used in our d-RNN model."}, {"id": 182, "string": "Conclusion In this paper, we investigated several strategies for LMs to model numerals and proposed a novel openvocabulary generative model based on a continuous probability density function."}, {"id": 183, "string": "We provided the first thorough evaluation of LMs on numerals on two corpora, taking into account their high out-of-vocabulary rate and numerical value (magnitude)."}, {"id": 184, "string": "We found that modelling numerals separately from other words through a hierarchical softmax can substantially improve the perplexity of LMs, that different strategies are suitable for different contexts, and that a combination of these strategies can help improve the perplexity further."}, {"id": 185, "string": "Finally, we found that using a continuous probability density function can improve prediction accuracy of LMs for numbers by substantially reducing the mean absolute percentage metric."}, {"id": 186, "string": "Our approaches in modelling and evaluation can be used in future work in tasks such as approximate information extraction, knowledge base completion, numerical fact checking, numerical question answering, and fraud detection."}, {"id": 187, "string": "Our code and data are available at: https://github.com/uclmr/ numerate-language-models."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 21}, {"section": "Language Models", "n": "2", "start": 22, "end": 42}, {"section": "Strategies for Modelling Numerals", "n": "3", "start": 43, "end": 48}, {"section": "Softmax Model and Variants", "n": "3.1", "start": 49, "end": 64}, {"section": "Digit-RNN Model", "n": "3.2", "start": 65, "end": 67}, {"section": "Mixture of Gaussians Model", "n": "3.3", "start": 68, "end": 77}, {"section": "Combination of Strategies", "n": "3.4", "start": 78, "end": 80}, {"section": "Evaluating the Numeracy of LMs", "n": "3.5", "start": 81, "end": 98}, {"section": "Data", "n": "4", "start": 99, "end": 112}, {"section": "Experimental Results and Discussion", "n": "5", "start": 113, "end": 120}, {"section": "Quantitative Results", "n": "5.1", "start": 121, "end": 142}, {"section": "Learnt Representations", "n": "5.2", "start": 143, "end": 149}, {"section": "Predictions from the Models", "n": "5.3", "start": 150, "end": 159}, {"section": "Related Work", "n": "6", "start": 160, "end": 181}, {"section": "Conclusion", "n": "7", "start": 182, "end": 187}], "figures": [{"filename": "../figure/image/953-Figure1-1.png", "caption": "Figure 1: Modelling numerals with a categorical distribution over a fixed vocabulary maps all out-ofvocabulary numerals to the same type, e.g. UNK, and does not reflect the smoothness of the underlying continuous distribution of certain attributes.", "page": 0, "bbox": {"x1": 317.76, "x2": 515.04, "y1": 221.76, "y2": 499.2}}, {"filename": "../figure/image/953-Table2-1.png", "caption": "Table 2: Test set perplexities for the clinical and scientific data. Adjusted perplexities (APP) are directly comparable across all data and models, but perplexities (PP) are sensitive to the varying out-of-vocabulary rates.", "page": 5, "bbox": {"x1": 72.0, "x2": 524.16, "y1": 68.64, "y2": 193.92}}, {"filename": "../figure/image/953-Table3-1.png", "caption": "Table 3: Test set regression evaluation for the clinical and scientific data. Mean absolute percentage error (MAPE) is scale independent and allows for comparison across data, whereas root mean square and mean absolute errors (RMSE, MAE) are scale dependent. Medians (MdAE, MdAPE) are informative of the distribution of errors.", "page": 5, "bbox": {"x1": 72.0, "x2": 524.16, "y1": 245.28, "y2": 406.08}}, {"filename": "../figure/image/953-Figure4-1.png", "caption": "Figure 4: Cosine similarities for d-RNN’s output digit embeddings trained on the scientific data.", "page": 6, "bbox": {"x1": 344.64, "x2": 488.15999999999997, "y1": 373.44, "y2": 495.35999999999996}}, {"filename": "../figure/image/953-Figure3-1.png", "caption": "Figure 3: Numeral embeddings for the softmax (top) and h-softmax (bottom) models on the clinical data. Numerals are sorted by value.", "page": 6, "bbox": {"x1": 339.84, "x2": 493.44, "y1": 61.44, "y2": 310.08}}, {"filename": "../figure/image/953-Table4-1.png", "caption": "Table 4: Examples of numerals with highest probability in each strategy of the combination model.", "page": 7, "bbox": {"x1": 81.6, "x2": 516.0, "y1": 68.64, "y2": 346.08}}, {"filename": "../figure/image/953-Figure5-1.png", "caption": "Figure 5: Example model predictions for the h-softmax (top), d-RNN (middle) and MoG (bottom) models. Examples from the clinical development set.", "page": 7, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 390.71999999999997, "y2": 624.0}}, {"filename": "../figure/image/953-Figure6-1.png", "caption": "Figure 6: Distributions of significant digits from d-RNN model, data, and theoretical expectation (Benford’s law).", "page": 7, "bbox": {"x1": 316.32, "x2": 498.24, "y1": 411.84, "y2": 523.1999999999999}}, {"filename": "../figure/image/953-Figure2-1.png", "caption": "Figure 2: Mixture of Gaussians model. The probability of a numeral is decomposed into the probability of its decimal precision and the probability that an underlying number will produce the numeral when rounded at the given precision.", "page": 3, "bbox": {"x1": 81.6, "x2": 280.32, "y1": 61.44, "y2": 297.12}}, {"filename": "../figure/image/953-Table1-1.png", "caption": "Table 1: Statistical description of the clinical and scientific datasets: Number of instances (i.e. paragraphs), maximum and average lengths, proportions of words and numerals, descriptive statistics of numbers.", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 524.16, "y1": 241.44, "y2": 363.36}}]}