{"title": "Identification and Classification of Emotional Key Phrases from Psycho- logical Texts", "abstract": "Emotions, a complex state of feeling results in physical and psychological changes that influence human behavior. Thus, in order to extract the emotional key phrases from psychological texts, here, we have presented a phrase level emotion identification and classification system. The system takes pre-defined emotional statements of seven basic emotion classes (anger, disgust, fear, guilt, joy, sadness and shame) as input and extracts seven types of emotional trigrams. The trigrams were represented as Context Vectors. Between a pair of Context Vectors, an Affinity Score was calculated based on the law of gravitation with respect to different distance metrics (e.g., Chebyshev, Euclidean and Hamming). The words, Part-Of-Speech (POS) tags, TF-IDF scores, variance along with Affinity Score and ranked score of the vectors were employed as important features in a supervised classification framework after a rigorous analysis. The comparative results carried out for four different classifiers e.g., NaiveBayes, J48, Decision Tree and BayesNet show satisfactory performances.", "text": [{"id": 0, "string": "Introduction Human emotions are the most complex and unique features to be described."}, {"id": 1, "string": "If we ask someone regarding emotion, he or she will reply simply that it is a 'feeling'."}, {"id": 2, "string": "Then, the obvious question that comes into our mind is about the definition of feeling."}, {"id": 3, "string": "It is observed that such terms are difficult to define and even more difficult to understand completely."}, {"id": 4, "string": "Ekman (1980) proposed six basic emotions (anger, disgust, fear, guilt, joy and sadness) that have a shared meaning on the level of facial expressions across cultures (Scherer, 1997; Scher-er and Wallbott, 1994) ."}, {"id": 5, "string": "Psychological texts contain huge number of emotional words because psychology and emotions are inter-wined, though they are different (Brahmachari et.al, 2013) ."}, {"id": 6, "string": "A phrase that contains more than one word can be a better way of representing emotions than a single word."}, {"id": 7, "string": "Thus, the emotional phrase identification and their classification from text have great importance in Natural Language Processing (NLP)."}, {"id": 8, "string": "In the present work, we have extracted seven different types of emotional statements (anger, disgust, fear, guilt, joy, sadness and shame) from the Psychological corpus."}, {"id": 9, "string": "Each of the emotional statements was tokenized; the tokens were grouped in trigrams and considered as Context Vectors."}, {"id": 10, "string": "These Context Vectors are POS tagged and corresponding TF and TF-IDF scores were measured for considering them as important features or not."}, {"id": 11, "string": "In addition, the Affinity Scores were calculated for each pair of Context Vectors based on different distance metrics (Chebyshev, Euclidean and Hamming) ."}, {"id": 12, "string": "Such features lead to apply different classification methods like NaiveBayes, J48, Decision Tree and BayesNet and after that the results are compared."}, {"id": 13, "string": "The route map for this paper is the Related Work (Section 2), Data Preprocessing Framework (Section 3) followed by Feature Analysis and Classification framework (Section 4) and result analysis (Section 5) along with the improvement due to ranking."}, {"id": 14, "string": "Finally, we have concluded the discussion (Section 6)."}, {"id": 15, "string": "Strapparava and Valitutti (2004) developed the WORDNET-AFFECT, a lexical resource that assigns one or more affective labels such as emotion, mood, trait, cognitive state, physical state, behavior, attitude and sensation etc to a number of WORDNET synsets."}, {"id": 16, "string": "A detailed annotation scheme that identifies key components and properties of opinions and emotions in language has been described in (Wiebe et al., 2005) ."}, {"id": 17, "string": "The authors in (Kobayashi et al., 2004) also developed an opinion lexicon out of their annotated corpora."}, {"id": 18, "string": "Takamura et al."}, {"id": 19, "string": "(2005) extracted semantic orientation of words according to the spin model, where the semantic orientation of words propagates in two possible directions like electrons."}, {"id": 20, "string": "Esuli and Sebastiani's (2006) approach to develop the SentiWord-Net is an adaptation to synset classification based on the training of ternary classifiers for deciding positive and negative (P-N) polarity."}, {"id": 21, "string": "Each of the ternary classifiers is generated using the Semisupervised rules."}, {"id": 22, "string": "Related Work On the other hand, Mohammad, et al., (2010) has performed an extensive analysis of the annotations to better understand the distribution of emotions evoked by terms of different parts of speech."}, {"id": 23, "string": "The authors in Bandyopadhyay, 2009, 2010) created the emotion lexicon and systems for Bengali language."}, {"id": 24, "string": "The development of SenticNet (Cambria et al., 2010) was inspired later by (Poria et al., 2013) ."}, {"id": 25, "string": "The authors developed an enriched SenticNet with affective information by assigning emotion labels."}, {"id": 26, "string": "Similarly, ConceptNet 1 is a multilingual knowledge base, representing words and phrases that people use and the common-sense relationships between them."}, {"id": 27, "string": "Balahur et al., (2012) had shown that the task of emotion detection from texts such as the one in the ISEAR corpus (where little or no lexical clues of affect are present) can be best tackled using approaches based on commonsense knowledge."}, {"id": 28, "string": "In this sense, EmotiNet, apart from being a precise resource for classifying emotions in such examples, has the advantage of being extendable with external sources, thus increasing the recall of the methods employing it."}, {"id": 29, "string": "Patra et al., (2013) adopted the Potts model for the probability modeling of the lexical network that was constructed by connecting each pair of words in which one of the two words appears in the gloss of the other."}, {"id": 30, "string": "In contrast to the previous approaches, the present task comprises of classifying the emotional phrases by forming Context Vectors and the experimentation with simple features like POS, TF-IDF and Affinity Score followed by the computation of 1 http://conceptnet5.media.mit.edu/ similarities based on different distance metrics help in making decisions to correctly classify the emotional phrases."}, {"id": 31, "string": "3 Data Preprocessing Framework Corpus Preparation The emotional statements were collected from the ISEAR 7 (International Survey on Emotion Antecedents and Reactions) database."}, {"id": 32, "string": "Each of the emotion classes contains the emotional statements given by the respondents as answers based on some predefined questions."}, {"id": 33, "string": "Student respondents, both psychologists and non-psychologists were asked to report situations in which they had experienced all of the 7 major emotions (anger, disgust, fear, guilt, joy, sadness, shame) ."}, {"id": 34, "string": "The final data set contains reports of 3000 respondents from 37 countries."}, {"id": 35, "string": "The statements were split in sentences and tokenized into words and the statistics were presented in Table 1."}, {"id": 36, "string": "It is found that only 1096 statements belong to anger, disgust sadness and shame classes whereas the fear, guilt and joy classes contain 1095, 1093 and 1094 different statements, respectively."}, {"id": 37, "string": "Since each statement may contain multiple sentences, so after sentence tokenization, it is observed that the anger and fear classes contain the maximum number of sentences."}, {"id": 38, "string": "Similarly, it is observed that the anger class contains the maximum number of tokenized words."}, {"id": 39, "string": "The tokenized words were grouped to form trigrams in order to grasp the roles of the previous and next tokens with respect to the target token."}, {"id": 40, "string": "Thus, each of the trigrams was considered as a Context Window (CW) to acquire the emotional phrases."}, {"id": 41, "string": "The updated version of the standard word lists of the WordNet Affect (Strapparava, and Vali-tutti, 2004 ) was collected and it is observed that the total of 2,958 affect words is present."}, {"id": 42, "string": "It is considered that, in each of the Context Windows, the first word appears as a non-affect word, second word as an affect word, and third word as a non-affect word (<NAW 1 >, <AW>, <NAW 2 >)."}, {"id": 43, "string": "It is observed from the statistics of CW as shown in Table 2 that the anger class contains the maximum number of trigrams (20, 785) and joy class has the minimum number of trigrams (15, 743) whereas only the fear class contains the maximum number of trigrams (1,573) that follow the CW pattern."}, {"id": 44, "string": "A few example patterns of the CWs which follows the pattern (<NAW 1 >, <AW>, <NAW 2 >) are \"advices, about, problems\" (Anger), \"already, frightened, us\" (Fear), \"always, joyous, one\" (Joy), \"acted, cruelly, to\" (Disgust), \"adolescent, guilt, growing\" (guilt), \"always, sad, for\" (sad) , \"and, sorry, just\" (Shame) etc."}, {"id": 45, "string": "It was observed that the stop words are mostly present in <NAW 1 , AW, NAW 2 > pattern where similar and dissimilar NAWs are appeared before and after their corresponding CWs."}, {"id": 46, "string": "In case of fear, a total of 979 stop words were found in NAW 1 position and 935 stop words in NAW 2 position."}, {"id": 47, "string": "It is observed that in case of fear, the occurrence of similar NAW before and after of CWs is only 22 in contrast to the dissimilar occurrences of 1551."}, {"id": 48, "string": "Table 3 explains the statistics of similar and dissimilar NAWs along with their appearances as stop words."}, {"id": 49, "string": "Context Vector Formation In order to identify whether the Context Windows (CWs) play any significant role in classifying emotions or not, we have mapped the Context Windows in a Vector space by representing them as vectors."}, {"id": 50, "string": "We have tried to find out the semantic relation or similarity between a pair of vectors using Affinity Score which in turn takes care of different distances into consideration."}, {"id": 51, "string": "Since a CW follows the pattern (NAW1, AW, NAW2), the formation of vector with respect to each of the Context Windows of each emotion class was done based on the following formula, 1 2 CW ( ) #NAW #NAW #A = , , W Vectoriza T T T tion       Where, T= Total count of CW in an emotion class #NAW 1 = Total occurrence of a nonaffect word in NAW 1 position #NAW 2 = Total occurrence of a nonaffect word in NAW 2 position #AW = Total occurrence of an affect word in AW position."}, {"id": 52, "string": "It was found that in case of anger emotion, a CW identified as (always, angry, about) corresponds to a Vector, <0.29, 10.69, 1.47> Emotions Total No of Trigrams Affinity Score Calculation We assume that each of the Context Vectors in an emotion class is represented in the vector space at a specific distance from the others."}, {"id": 53, "string": "Thus, there must be some affinity or similarity exists between each of the Context Vectors."}, {"id": 54, "string": "An Affinity Score was calculated for each pair of Context Vectors (p u ,q v ) where u = {1,2,3,.........n} and v = {1,2,3,.......n} for n number of vectors with respect to each of the emotion classes."}, {"id": 55, "string": "The final Score is calculated using the following gravitational formula as described in (Poria et al., 2013) :       p q , , q * p q p            Score 2 dist The Score of any two context vectors p and q of an emotion class is the dot product of the vectors divided by the square of distance (dist) between p and q."}, {"id": 56, "string": "This score was inspired by Newton's law of gravitation."}, {"id": 57, "string": "This score values reflect the affinity between two context vectors p and q."}, {"id": 58, "string": "Higher score implies higher affinity between p and q."}, {"id": 59, "string": "However, apart from the score values, we also calculated the median, standard deviation and inter quartile range (iqr) and only those context windows were considered if their iqr values are greater than some cutoff value selected during experiments."}, {"id": 60, "string": "Affinity Scores using Distance Metrics In the vector space, it is needed to calculate how close the context vectors are in the space in order to conduct better classification into their respective emotion classes."}, {"id": 61, "string": "The Score values were calculated for all the emotion classes with respect to different metrics of distance (dist) viz."}, {"id": 62, "string": "Chebyshev, Euclidean and Hamming."}, {"id": 63, "string": "The distance was calculated for each context vector with respect to all the vectors of the same emotion class."}, {"id": 64, "string": "The distance formula is given below: a. Chebyshev distance (C d ) = max |x i -y i | where x i and y i represents two vectors."}, {"id": 65, "string": "b. Euclidean distance (E d ) = ||x -y|| 2 for vectors x and y. c. Hamming distance (H d ) = (c 01 + c 10 ) / n where c ij is the number of occurrence in the boolean vectors x and y and x[k] = i and y[k] = j for k < n. Hamming distance denotes the proportion of disagreeing components in x and y."}, {"id": 66, "string": "Feature Selection and Analysis It is observed that the feature selection always plays an important role in building a good pattern classifier."}, {"id": 67, "string": "The sentences were POS tagged using the Stanford POS Tagger and the POS tagged Context Windows were extracted and termed as PTCW."}, {"id": 68, "string": "Similarly, the POS tag sequence from each of the PTCWs were extracted and named each as POS Tagged Window (PTW)."}, {"id": 69, "string": "It is observed that \"fear\" emotion class has the maximum number of CWs and unique PTCWs whereas the \"anger\" class contains the maximum number of unique PTWs."}, {"id": 70, "string": "The Figure 1 as shown below represents the counts of CW, unique PTCWs and PTWs."}, {"id": 71, "string": "It was noticed that the total number of CWs is 8967, total number of unique PTCW is 7609 and of unique PTW is 3117."}, {"id": 72, "string": "Obviously, the number of PTCW was less than CW and number of PTW was less than PTCW, because of the uniqueness of PTCW and PTW."}, {"id": 73, "string": "In Figure 2 , the total counts of CW, PTCW and PTW have been shown."}, {"id": 74, "string": "Some sample patterns of PTWs that occur with the maximum frequencies in three emotion classes are \"VBD/RB_JJ_IN\" (anger), \"NN/VBD_VBN_NN\" (disgust) and \"VBD_VBN/JJ_IN/NN\" (fear)."}, {"id": 75, "string": "TF and TF-IDF Measure The Term Frequencies (TFs) and the Inverse Document Frequencies (IDFs) of the CWs for each of the emotion classes were calculated."}, {"id": 76, "string": "In order to identify different ranges of the TF and TF-IDF scores, the minimum and maximum values of the TF and the variance of TF were calculated for each of the emotion classes."}, {"id": 77, "string": "It was observed that guilt has the maximum scores for Max_TF and variance whereas the emotions like anger and disgust have the lowest scores for Max_TF as shown in Figure  3 ."}, {"id": 78, "string": "Similarly, the minimum, maximum and variance of the TF-IDF values were calculated for each emotion class, separately."}, {"id": 79, "string": "Again, it is found that the guilt emotion has the highest Max_TF-IDF and disgust emotion has the lowest Max_TF-IDF as shown in Figure 4 ."}, {"id": 80, "string": "Not only for the Context Windows (CWs), the TF and TF-IDF scores of the POS Tagged Context Windows (PTCWs) and POS Tagged Windows (PTWs) were also calculated with respect to each emotion."}, {"id": 81, "string": "It was observed that, similar results were found."}, {"id": 82, "string": "Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data."}, {"id": 83, "string": "A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.The variance for TF_IDF of guilt is 0.0000456874."}, {"id": 84, "string": "A few slight differences were found in the results of PTWs while calculating Max_TF , Min_TF and variance as shown in Figure 3 ."}, {"id": 85, "string": "It was observed that fear emotion has the highest Max_TF and anger has the lowest Max_TF whereas the variance of TF for guilt is 0.0002435522."}, {"id": 86, "string": "Similarly, Figure 4 shows that fear has the highest Max_TF_IDF and anger contains the lowest Max_TF-IDF values and the variance of TF-IDF of fear is 0.000922226."}, {"id": 87, "string": "Ranking Score of CW It was found that some of the Context Windows appear more than one time in the same emotion class."}, {"id": 88, "string": "Thus, they were removed and a ranking score was calculated for each of the context windows."}, {"id": 89, "string": "Each of the words in a context window was searched in the SentiWordnet lexicon and if found, we considered either positive or negative or both scores."}, {"id": 90, "string": "The summation of the absolute scores of all the words in a Context Window is returned."}, {"id": 91, "string": "The returned scores were sorted so that, in turn, each of the context windows obtains a rank in its corresponding emotion class."}, {"id": 92, "string": "All the ranks were calculated for each emotion class, successively."}, {"id": 93, "string": "This rank is useful in finding the important emotional phrases from the list of CWs."}, {"id": 94, "string": "Some examples from the list of top 12 important context windows according to their rank are \"much anger when\" (anger), \"whom love after\" (happy), \"felt sad about\" (sadness) etc."}, {"id": 95, "string": "Result Analysis The accuracies of the classifiers were obtained by employing user defined test data and data for 10 fold cross validation."}, {"id": 96, "string": "It is observed that when Euclidean distance was considered, the BayesNet Classifier gives 100% accuracy on the Test data and gives 97.91% of accuracy on 10-fold cross validation data."}, {"id": 97, "string": "On the other hand, J48 classifier achieves 77% accuracy on Test data and 83.54% on 10-fold cross validation data whereas the Nai-veBayesSimple classifier obtains 92.30% accuracy on Test data and 27.07% accuracy on 10-fold cross validation data."}, {"id": 98, "string": "In the Naïve BayesSimple with 10fold cross validation, the average Recall, Precision and F-measure values are 0.271, 0.272 and 0.264, respectively."}, {"id": 99, "string": "But, the DecisionTree classifier obtains 98.30% and 98.10% accuracies on the Test data as well as 10-fold cross validation data."}, {"id": 100, "string": "The comparative results are shown in Figure 5 ."}, {"id": 101, "string": "Overall, it is observed from Figure 5 that the BayesNet classifier achieves the best results on the score data which was prepared based on the Euclidean distance."}, {"id": 102, "string": "In contrast, the BayesNet achieved 99.30% accuracy on the Test data and 96.92% accuracy on 10-fold cross validation data when the Hamming distance was considered."}, {"id": 103, "string": "Similarly, J48 and Naïve BayesSimple classifiers produce 93.05% and 85.41% accuracies on the Test data and 87.95% and 39.50% accuracies on 10-fold cross validation data, respectively."}, {"id": 104, "string": "From Figure 6 , it is observed that the DecisionTree classifier produces the best accuracy on the score data that was found using Hamming distance."}, {"id": 105, "string": "When the score values are found by using Chebyshev distance, the BayesNet classifier obtains 100% accuracy on Test data and 97.57% accuracy on 10-fold cross validation data."}, {"id": 106, "string": "Similarly, J48 achieves 84.82% accuracy on the Test data and 82.75% accuracy on 10-fold cross validation data whereas NaiveBayes and DecisionTable achieve 80% , 29.85% and 98.62% ,96.93% accuracies on the Test data and 10-fold cross validatation data, respectively."}, {"id": 107, "string": "It has to be mentioned based on Figure 7 that the DecisionTree classifier performs better in comparison with all other classifiers and achieves the best result among the rest of the classifiers on affinity score data prepared based on the Chebyshev distance only."}, {"id": 108, "string": "Conclusions and Future Works In this paper, vector formation was done for each of the Context Windows; TF and TF-IDF measures were calculated."}, {"id": 109, "string": "The calculated affinity score, depending on the distance values was inspired from Newton's law of gravitation."}, {"id": 110, "string": "To classify these CWs, BayesNet, J48, NaivebayesSimple and Deci-sionTable classifiers."}, {"id": 111, "string": "In future, we would like to incorporate more number of lexicons to identify and classify emotional expressions."}, {"id": 112, "string": "Moreover, we are planning to include associative learning process to identify some important rules for classification."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 21}, {"section": "Related Work", "n": "2", "start": 22, "end": 30}, {"section": "Corpus Preparation", "n": "3.1", "start": 31, "end": 48}, {"section": "Context Vector Formation", "n": "3.2", "start": 49, "end": 51}, {"section": "Affinity Score Calculation", "n": "3.3", "start": 52, "end": 59}, {"section": "Affinity Scores using Distance Metrics", "n": "3.4", "start": 60, "end": 65}, {"section": "Feature Selection and Analysis", "n": "4", "start": 66, "end": 74}, {"section": "TF and TF-IDF Measure", "n": "4.2", "start": 75, "end": 86}, {"section": "Ranking Score of CW", "n": "4.3", "start": 87, "end": 94}, {"section": "Result Analysis", "n": "5", "start": 95, "end": 112}], "figures": [{"filename": "../figure/image/956-Figure5-1.png", "caption": "Figure 5: Classification Results on Test data and 10- fold cross validation using Euclidean distance (Ed)", "page": 5, "bbox": {"x1": 303.84, "x2": 515.04, "y1": 98.88, "y2": 225.12}}, {"filename": "../figure/image/956-Figure6-1.png", "caption": "Figure 6: Classification Results on Test data and 10- fold cross validation using Hamming distance (Hd)", "page": 5, "bbox": {"x1": 303.84, "x2": 515.04, "y1": 245.76, "y2": 365.28}}, {"filename": "../figure/image/956-Figure7-1.png", "caption": "Figure 7: Classification Results on Test data and 10- fold cross validation using Chebyshev distance (Cd)", "page": 5, "bbox": {"x1": 303.84, "x2": 518.4, "y1": 384.47999999999996, "y2": 516.96}}, {"filename": "../figure/image/956-Table1-1.png", "caption": "Table 1: Corpus Statistics", "page": 1, "bbox": {"x1": 297.59999999999997, "x2": 524.16, "y1": 477.59999999999997, "y2": 603.36}}, {"filename": "../figure/image/956-Table2-1.png", "caption": "Table 2: Trigrams and Affect Words Statistics", "page": 2, "bbox": {"x1": 318.71999999999997, "x2": 503.03999999999996, "y1": 229.44, "y2": 348.96}}, {"filename": "../figure/image/956-Table3-1.png", "caption": "Table 3: Statistics for similar and dissimilar NAW patterns and stop words", "page": 2, "bbox": {"x1": 305.76, "x2": 516.0, "y1": 370.56, "y2": 539.04}}, {"filename": "../figure/image/956-Figure1-1.png", "caption": "Figure 1: Count of CW, PTCW and PTW for seven emotion classes", "page": 3, "bbox": {"x1": 303.84, "x2": 518.4, "y1": 521.76, "y2": 645.12}}, {"filename": "../figure/image/956-Figure4-1.png", "caption": "Figure 4: Variance,Max_TF-IDF, Min_TF-IDF of CW, PTCW and PTW", "page": 4, "bbox": {"x1": 303.84, "x2": 515.04, "y1": 283.68, "y2": 413.28}}, {"filename": "../figure/image/956-Figure3-1.png", "caption": "Figure 3:Variance,Max_TF,Min_TF of CW, PTCW and PTW", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 515.04, "y1": 122.88, "y2": 259.2}}, {"filename": "../figure/image/956-Figure2-1.png", "caption": "Figure 2:Total Count of CW, PTCW and PTW", "page": 4, "bbox": {"x1": 76.8, "x2": 291.36, "y1": 98.88, "y2": 224.16}}]}