{"title": "LINA: Identifying Comparable Documents from Wikipedia", "abstract": "This paper describes the LINA system for the BUCC 2015 shared track. Following (Enright and Kondrak, 2007), our system identify comparable documents by collecting counts of hapax words. We extend this method by filtering out document pairs sharing target documents using pigeonhole reasoning and cross-lingual information.", "text": [{"id": 0, "string": "Introduction Parallel corpora, that is, collections of documents that are mutual translations, are used in many natural language processing applications, particularly for statistical machine translation."}, {"id": 1, "string": "Building such resources is however exceedingly expensive, requiring highly skilled annotators or professional translators (Preiss, 2012) ."}, {"id": 2, "string": "Comparable corpora, that are sets of texts in two or more languages without being translations of each other, are often considered as a solution for the lack of parallel corpora, and many techniques have been proposed to extract parallel sentences (Munteanu et al., 2004; Abdul-Rauf and Schwenk, 2009; Smith et al., 2010) , or mine word translations (Fung, 1995; Rapp, 1999; Chiao and Zweigenbaum, 2002; Morin et al., 2007; Vulić and Moens, 2012) ."}, {"id": 3, "string": "Identifying comparable resources in a large amount of multilingual data remains a very challenging task."}, {"id": 4, "string": "The purpose of the Building and Using Comparable Corpora (BUCC) 2015 shared task 1 is to provide the first evaluation of existing approaches for identifying comparable resources."}, {"id": 5, "string": "More precisely, given a large collection of Wikipedia pages in several languages, the task is to identify the most similar pages across languages."}, {"id": 6, "string": "1 https://comparable.limsi.fr/bucc2015/ In this paper, we describe the system that we developed for the BUCC 2015 shared track and show that a language agnostic approach can achieve promising results."}, {"id": 7, "string": "Proposed Method The method we propose is based on (Enright and Kondrak, 2007) 's approach to parallel document identification."}, {"id": 8, "string": "Documents are treated as bags of words, in which only blank separated strings that are at least four characters long and that appear only once in the document (hapax words) are indexed."}, {"id": 9, "string": "Given a document in language A, the document in language B that share the largest number of these words is considered as parallel."}, {"id": 10, "string": "Although very simple, this approach was shown to perform very well in detecting parallel documents in Wikipedia (Patry and Langlais, 2011) ."}, {"id": 11, "string": "The reason for this is that most hapax words are in practice proper nouns or numerical entities, which are often cognates."}, {"id": 12, "string": "An example of hapax words extracted from a document is given in Table 1 ."}, {"id": 13, "string": "We purposely keep urls and special characters, as these are useful clues for identifying translated Wikipedia pages."}, {"id": 14, "string": "website major gaston links flutist marcel debost states sources college crunelle conservatoire principal rampal united currently recorded chastain competitions music http://www.oberlin.edu/faculty/mdebost/ under international flutists jean-pierre profile moyse french repertoire amazon lives external *http://www.amazon.com/micheldebost/dp/b000s9zsk0 known teaches conservatory school professor studied kathleen orchestre replaced michel Here, we experiment with this approach for detecting near-parallel (comparable) documents."}, {"id": 15, "string": "Following (Patry and Langlais, 2011) , we first search for the potential source-target document pairs."}, {"id": 16, "string": "To do so, we select for each document in the source language, the N = 20 documents in the target language that share the largest number of hapax words (hereafter baseline)."}, {"id": 17, "string": "Scoring each pair of documents independently of other candidate pairs leads to several source documents being paired to a same target document."}, {"id": 18, "string": "As indicated in Table 2 , the percentage of English articles that are paired with multiple source documents is high (57.3% for French and 60.4% for German)."}, {"id": 19, "string": "To address this problem, we remove potential multiple source documents by keeping the document pairs with the highest number of shared words (hereafter pigeonhole)."}, {"id": 20, "string": "This strategy greatly reduces the number of multiply assigned source documents from roughly 60% to 10%."}, {"id": 21, "string": "This in turn removes needlessly paired documents and greatly improves the effectiveness of the method."}, {"id": 22, "string": "In an attempt to break the remaining score ties between document pairs, we further extend our model to exploit cross-lingual information."}, {"id": 23, "string": "When multiple source documents are paired to a given English document with the same score, we use the paired documents in a third language to order them (hereafter cross-lingual)."}, {"id": 24, "string": "Here we make two assumptions that are valid for the BUCC 2015 shared Task: (1) we have access to comparable documents in a third language, and (2) source documents should be paired 1-to-1 with target documents."}, {"id": 25, "string": "Strategy An example of two French documents (doc fr 1 and doc fr 2) being paired to the same English document (doc en ) is given in Figure 1 ."}, {"id": 26, "string": "We use the German document (doc de ) paired with doc en and select the French document that shares the largest number of hapax words, which for this example is doc fr 2."}, {"id": 27, "string": "This strategy further reduces the number of multiply assigned source documents from 10% to less than 4%."}, {"id": 28, "string": "Experiments Experimental settings The BUCC 2015 shared task consists in returning for each Wikipedia page in a source language, up to five ranked suggestions to its linked page in English."}, {"id": 29, "string": "Inter-language links, that is, links from a page in one language to an equivalent page in another language, are used to evaluate the effectiveness of the systems."}, {"id": 30, "string": "Here, we only focus on the French-English and German-English pairs."}, {"id": 31, "string": "Following the task guidelines, we use the following evaluation measures investigate the effectiveness of our method: • Mean Average Precision (MAP)."}, {"id": 32, "string": "Average of precisions computed at the point of each correctly paired document in the ranked list of paired documents."}, {"id": 33, "string": "• Success (Succ.)."}, {"id": 34, "string": "Precision computed on the first returned paired document."}, {"id": 35, "string": "• Precision at 5 (P@5)."}, {"id": 36, "string": "Precision computed on the 5 topmost paired documents."}, {"id": 37, "string": "Results Results are presented in Table 3 ."}, {"id": 38, "string": "Overall, we observe that the two strategies that filter out multiply assigned source documents improve the performance of the method."}, {"id": 39, "string": "The largest part of the improvement comes from using pigeonhole reasoning."}, {"id": 40, "string": "The use of cross-lingual information to Table 3 : Performance in terms of MAP, success (Succ.)"}, {"id": 41, "string": "and precision at 5 (P@5) of our model."}, {"id": 42, "string": "break ties between the remaining multiply assigned source documents only gives a small improvement."}, {"id": 43, "string": "We assume that the limited number of potential source-target document pairs we use in our experiments (N = 20) is a reason for this."}, {"id": 44, "string": "Interestingly, results are consistent across languages and datasets (test and train)."}, {"id": 45, "string": "Our best configuration, that is, with pigeonhole and crosslingual, achieves nearly 60% of success for the first returned pair."}, {"id": 46, "string": "Here we show that a simple and straightforward approach that requires no language-specific resources still yields some interesting results."}, {"id": 47, "string": "Discussion In this paper we described the LINA system for the BUCC 2015 shared track."}, {"id": 48, "string": "We proposed to extend (Enright and Kondrak, 2007) 's approach to parallel document identification by filtering out document pairs sharing target documents using pigeonhole reasoning and cross-lingual information."}, {"id": 49, "string": "Experimental results show that our system identifies comparable documents with a precision of about 60%."}, {"id": 50, "string": "Scoring document pairs using the number of shared hapax words was first intended to be a baseline for comparison purposes."}, {"id": 51, "string": "We tried a finer grained scoring approach relying on bilingual dictionaries and information retrieval weighting schemes."}, {"id": 52, "string": "For reasonable computation time, we were unable to include low-frequency words in our system."}, {"id": 53, "string": "Partial results were very low and we are still in the process of investigating the reasons for this."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 6}, {"section": "Proposed Method", "n": "2", "start": 7, "end": 27}, {"section": "Experimental settings", "n": "3.1", "start": 28, "end": 36}, {"section": "Results", "n": "3.2", "start": 37, "end": 46}, {"section": "Discussion", "n": "4", "start": 47, "end": 53}], "figures": [{"filename": "../figure/image/957-Table3-1.png", "caption": "Table 3: Performance in terms of MAP, success (Succ.) and precision at 5 (P@5) of our model.", "page": 2, "bbox": {"x1": 78.72, "x2": 518.4, "y1": 63.36, "y2": 162.23999999999998}}, {"filename": "../figure/image/957-Table2-1.png", "caption": "Table 2: Percentage of English articles that are paired with multiple French or German articles on the training data.", "page": 1, "bbox": {"x1": 88.8, "x2": 273.12, "y1": 388.32, "y2": 455.03999999999996}}, {"filename": "../figure/image/957-Figure1-1.png", "caption": "Figure 1: Example of the use of cross-lingual information to order multiple documents that received the same scores. The number of shared words are labelled on the edges.", "page": 1, "bbox": {"x1": 344.64, "x2": 488.15999999999997, "y1": 112.8, "y2": 240.0}}, {"filename": "../figure/image/957-Table1-1.png", "caption": "Table 1: Example of indexed document as bag of hapax words (en-bacde.txt).", "page": 0, "bbox": {"x1": 307.68, "x2": 525.12, "y1": 572.64, "y2": 729.12}}]}