{"title": "What papers should I cite from my reading list? User evaluation of a manuscript preparatory assistive task", "abstract": "Literature Review (LR) and Manuscript Preparatory (MP) tasks are two key activities for researchers. While process-based and technologicaloriented interventions have been introduced to bridge the apparent gap between novices and experts for LR tasks, there are very few approaches for MP tasks. In this paper, we introduce a novel task of shortlisting important papers from the reading list of researchers, meant for citation in a manuscript. The technique helps in identifying the important and unique papers in the reading list. Based on a user evaluation study conducted with 116 participants, the effectiveness and usefulness of the task is shown using multiple evaluation metrics. Results show that research students prefer this task more than research and academic staff. Qualitative feedback of the participants including the preferred aspects along with critical comments is presented in this paper.", "text": [{"id": 0, "string": "Introduction The Scientific Publication Lifecycle comprises of different activities carried out by researchers [5] ."}, {"id": 1, "string": "Of all these activities, the three main activities are literature review, actual research work and dissemination of results through conferences and journals."}, {"id": 2, "string": "These three activities in themselves cover multiple sub-activities that require specific expertise and experience [16] ."}, {"id": 3, "string": "Prior studies have shown researchers with low experience, face difficulties in completing research related activities [9, 15] ."}, {"id": 4, "string": "These researchers rely on assistance from supervisors, experts and librarians for learning the required skills to pursue such activities."}, {"id": 5, "string": "Scenarios where external assistance have been traditionally required are (i) selection of information sources (academic search engines, databases and citation indices), (ii) formulation of search queries, (iii) browsing of retrieved results and (iv) relevance judgement of retrieved articles [9] ."}, {"id": 6, "string": "Apart from human assistance, academic assistive systems have been built for alleviating the expertise gap between experts and novices in terms of research execution."}, {"id": 7, "string": "Some of these interventions include search systems with faceted user interfaces for better dis-play of search results [2] , bibliometric tools for visualizing citation networks [7] and scientific paper recommender systems [3, 14] , to name a few."}, {"id": 8, "string": "In the area of manuscript writing, techniques have been proposed to recommend articles for citation contexts in manuscripts [11] ."}, {"id": 9, "string": "In the context of manuscript publication, prior studies have tried to recommend prospective conference venues [25] most suited for the research in hand."}, {"id": 10, "string": "One unexplored area is helping researchers in identifying the important and unique papers that can be potentially cited in the manuscript."}, {"id": 11, "string": "This identification is affected by two factors."}, {"id": 12, "string": "The first factor is the type of research where citation of a particular paper makes sense due to the particular citation context."}, {"id": 13, "string": "The second factor is the type of article (for e.g., conference full paper, journal paper, demo paper) that the author is intending to write."}, {"id": 14, "string": "For the first factor, there have been some previous studies [11, 14, 21] ."}, {"id": 15, "string": "The second factor represents a task that can be explored since the article-type places a constraint on the citations that can be made in a manuscript, in terms of dimensions such as recency, quantity, to name a few."}, {"id": 16, "string": "In our research, we address this new manuscript preparatory task with the objective of shortlisting papers from the reading list of researchers based on article-type preference."}, {"id": 17, "string": "By the term 'shortlisting', we allude to the nature of the task in identifying important papers from the reading list This task is part of a functionality provided by an assistive system called Rec4LRW meant for helping researchers in literature review and manuscript preparation."}, {"id": 18, "string": "The system uses a corpus of papers, built from an extract of ACM Digital Library (ACM DL)."}, {"id": 19, "string": "It is hypothesized that the Rec4LRW system will be highly beneficial to novice researchers such as Ph.D. and Masters students and also for researchers who are venturing into new research topics."}, {"id": 20, "string": "A user evaluation study was conducted to evaluate all the tasks in the system, from a researcher's perspective."}, {"id": 21, "string": "In this paper, we report the findings from the study."}, {"id": 22, "string": "The study was conducted with 116 participants comprising of research students, academic staff and research staff."}, {"id": 23, "string": "Results from the six evaluation measures show that the participants prefer to have the shortlisting feature included in academic search systems and digital libraries."}, {"id": 24, "string": "Subjective feedback from the participants in terms of the preferred features and the features that need to be improved, are also presented in the paper."}, {"id": 25, "string": "The reminder of this work is organized as follows."}, {"id": 26, "string": "Section two surveys the related work."}, {"id": 27, "string": "The Rec4LRW system is introduced along with dataset, technical details and unique UI features in section three."}, {"id": 28, "string": "In section four, the shortlisting technique of the task is explained."}, {"id": 29, "string": "Details about the user study and data collection are outlined in Section five."}, {"id": 30, "string": "The evaluation results are presented in section six."}, {"id": 31, "string": "The concluding remarks and future plans for research are provided in the final section."}, {"id": 32, "string": "Related Work Conceptual models and systems have been proposed in the past for helping researchers during manuscript writing."}, {"id": 33, "string": "Generating recommendations for citation contexts is an approach meant to help the researcher in finding candidate citations for particular placeholders (locations) in the manuscript."}, {"id": 34, "string": "These studies make use of content oriented recommender techniques as there is no scope for using Collaborative Filtering (CF) based techniques due to lack of user ratings."}, {"id": 35, "string": "Translation models have been specifically used in [13, 17] as they are able to handle the issue of vocabulary mismatch gap between the user query and document content."}, {"id": 36, "string": "The efficiency of the approaches is dependent on the comprehensiveness of training set data as the locations and corresponding citations data are recorded."}, {"id": 37, "string": "The study in [11] is the most sophisticated, as it does not expect the user to mark the citation contexts in the input paper unlike other studies where the contexts have to be set by the user."}, {"id": 38, "string": "The proposed model in the study learns the placeholders in previous research articles where citations are widely made so that the citation recommendation can be made on occurrence of similar patterns."}, {"id": 39, "string": "The methods in these studies are heavily reliant on the quality & quantity of training data; therefore they are not applicable to systems which lack access to full text of research papers."}, {"id": 40, "string": "Citation suggestions have also been provided as part of reference management and stand-alone recommendation tools."}, {"id": 41, "string": "ActiveCite [21] is a recommendation tool that provides both high level and specific citation suggestions based on text mining techniques."}, {"id": 42, "string": "Docear is one of the latest reference management software [3] with a mind map feature that helps users in better organizing their references."}, {"id": 43, "string": "The in-built recommendation module in this tool is based on Content based (CB) recommendation technique with all the data stored in a central server."}, {"id": 44, "string": "The Refseer system [14] , similar to ActiveCite, provides both global and local (particular citation context) level recommendations."}, {"id": 45, "string": "The system is based on the non-parametric probabilistic model proposed in [12] ."}, {"id": 46, "string": "These systems depend on the quality and quantity of full text data available in the central server as scarcity of papers could lead to redundant recommendations."}, {"id": 47, "string": "Even though article-type recommendations have not been practically implemented, the prospective idea has been discussed in few studies."}, {"id": 48, "string": "The article-type dimension has been highlighted as part of the user's 'Purpose' in the multi-layer contextual model put forth in [8] and as one of the facets in document contextual information in [6] ."}, {"id": 49, "string": "The article type indirectly refers to the goal of the researcher."}, {"id": 50, "string": "It is to be noted that goal or purpose related dimensions have been considered for research in other research areas of recommender systems namely course recommendations [23] and TV guide recommendations [20] ."}, {"id": 51, "string": "Our work, on the other hand, is the first to explore this task of providing article-type based recommendations with the aim of shortlisting important and unique papers from the cumulative reading list prepared by researchers during their literature review."}, {"id": 52, "string": "Through this study, we hope to open new avenues of research which requires a different kind of mining of bibliographic data, for providing more relevant results."}, {"id": 53, "string": "3 Assistive System Brief Overview The Rec4LRW system has been built as a tool aimed to help researchers in two main tasks of literature review and one manuscript preparatory task."}, {"id": 54, "string": "The three tasks are (i) Building an initial reading list of research papers, (ii) Finding similar papers based on a set of papers, and (iii) Shortlisting papers from the final reading list for inclusion in manuscript based on article-type choice."}, {"id": 55, "string": "The usage context of the system is as follows."}, {"id": 56, "string": "Typically, a researcher would run the first task for one or two times at the start of the literature review, followed by selection of few relevant seed papers which are then used for task 2."}, {"id": 57, "string": "The second task takes these seed papers as an input to find topically similar papers."}, {"id": 58, "string": "This task is run multiple times until the researcher is satisfied with the whole list of papers in the reading list."}, {"id": 59, "string": "The third task (described in this paper), is meant to be run when the researcher is at the stage of writing manuscripts for publication."}, {"id": 60, "string": "It is observed that the researcher would maintain numerous papers in his/her reading list while performing research (could be more than 100 papers for most research studies)."}, {"id": 61, "string": "The third task helps the researcher in identifying both important and unique papers from the reading list."}, {"id": 62, "string": "The shortlisted papers count varies as per the article-type preference of the researcher."}, {"id": 63, "string": "The recommendation mechanisms of the three tasks are based on seven features/criteria that represent the characteristics of the bibliography and its relationship with the parent research paper [19] ."}, {"id": 64, "string": "Dataset A snapshot of the ACM Digital Library (ACM DL) is used as the dataset for the system."}, {"id": 65, "string": "Papers from proceedings and journals for the period 1951 to 2011 form the dataset."}, {"id": 66, "string": "The papers from the dataset have been shortlisted based on full text and metadata availability in the dataset, to form the sample set/corpus for the system."}, {"id": 67, "string": "The sample set contains a total of 103,739 articles and corresponding 2,320,345 references."}, {"id": 68, "string": "User-Interface (UI) Features In this sub-section, the unique UI features of the Rec4LRW system are presented."}, {"id": 69, "string": "Apart from the regular fields such as author name(s), abstract, publication year and citation count, the system displays the fields:-author-specified keywords, references count and short summary of the paper (if the abstract of the paper is missing)."}, {"id": 70, "string": "Most importantly, we have included information cue labels beside the title for each article."}, {"id": 71, "string": "There are four labels (1) Popular, (2) Recent, (3) High Reach and (4) Survey/Review."}, {"id": 72, "string": "A screenshot from the system for the cue labels (adjacent to article title) is provided in Figure 1 ."}, {"id": 73, "string": "The display logic for the cue labels are described as follows."}, {"id": 74, "string": "The recent label is displayed for papers published between the years 2009 and 2011 (the most recent papers in the ACM dataset is of 2011)."}, {"id": 75, "string": "The survey/review label is displayed for papers which are of the type -literature survey or review."}, {"id": 76, "string": "For the popular label, the unique citation counts of all papers for the selected research topic are first retrieved from the database."}, {"id": 77, "string": "The label is displayed for a paper if the citation count is in the top 5% percentile of the citation counts for that topic."}, {"id": 78, "string": "Similar logic is used for the high reach label with references count data."}, {"id": 79, "string": "The high reach label indicates that the paper has more number of references than most other articles for the research topic, thereby facilitating the scope for extended citation chaining."}, {"id": 80, "string": "Specifically for task 3, the system provides an option for the user to view the papers in the parent cluster of the shortlisted papers."}, {"id": 81, "string": "This feature helps the user in serendipitously finding more papers for reading."}, {"id": 82, "string": "The screenshot for this feature is provided in Figure 1 ."}, {"id": 83, "string": "Technique For Shortlisting Papers From Reading List The objective of this task is to help researchers in identifying important (based on citation counts) and unique papers from the final reading list."}, {"id": 84, "string": "These papers are to be considered as potential candidates for citation in the manuscript."}, {"id": 85, "string": "For this task, the Girvan-Newman algorithm [10] was used for identifying the clusters in the citations network."}, {"id": 86, "string": "The specific goal of clustering is to identify the communities within the citation network."}, {"id": 87, "string": "From the identified clusters, the top cited papers are shortlisted."}, {"id": 88, "string": "The algorithm is implemented as the EdgeBetweennessClusterer in JUNG library."}, {"id": 89, "string": "The algorithm was selected as it is the one of the most prominent community detection algorithms based on link removal."}, {"id": 90, "string": "The other algorithms considered were voltage clustering algorithm [24] and bi-component DFS clustering algorithm [22] ."}, {"id": 91, "string": "Based on internal trail tests, the Girvan-Newman algorithm was able to consistently identify meaningful clusters using the graph constructed with the citations and references of the papers from the reading list."}, {"id": 92, "string": "As a part of this task, we have tried to explore the notion of varying the count of shortlisted papers by article-type choice."}, {"id": 93, "string": "For this purpose, four article-types were considered: conference full paper (cfp), conference poster (cp), generic research paper (gp) 1 and case study (cs)."}, {"id": 94, "string": "The article-type classification is not part of the ACM metadata but it is partly inspired by the article classification used in Emerald publications."}, {"id": 95, "string": "The number of papers to be shortlisted for these article-types was identified by using the historical data from ACM dataset."}, {"id": 96, "string": "First, the papers in the dataset were filtered by using the title field and section field for the four article-types."}, {"id": 97, "string": "Second, the average of the references count was calculated for the filtered papers for each articletype from previous step."}, {"id": 98, "string": "The average references count for the article-types gp, cs, cfp and cp are 26, 17, 16 and 6 respectively."}, {"id": 99, "string": "This new data field is used to set the number of papers to be retrieved from the paper clusters."}, {"id": 100, "string": "The procedure for this technique is given in Procedure 1. for each cluster in C do 9: sort papers in the cluster on citation count 10: s top ranked paper from the cluster 11: add s to S 12: end for 13: end while 14: else 15: N 0 16. while |S| = RC 17: N N +1 18: for each cluster in C do 19: sort papers in the cluster on citation count 20: s N ranked paper from the cluster 21: add s to S 22: end for 23: end while 24: end if 25: display papers from S to user 5 User Evaluation Study In IR and RS studies, offline experiments are conducted for evaluating the proposed technique/algorithm with baseline approaches."}, {"id": 101, "string": "Since the task addressed in the current study is a novel task, the best option was to perform a user evaluation study with researchers."}, {"id": 102, "string": "Considering the suggestions from [4] , the objective of the study was to ascertain the usefulness and effectiveness of the task to researchers."}, {"id": 103, "string": "The specific evaluation goals were (i) ascertain the agreement percentages of the evaluation measures and (ii) identify the top preferred and critical aspects of the task through the subjective feedback of the participants."}, {"id": 104, "string": "An online pre-screening survey was conducted to identify the potential participants."}, {"id": 105, "string": "Participants needed to have experience in writing conference or journal paper(s) as a qualification for taking part in the study."}, {"id": 106, "string": "All the participants were required to evaluate the three tasks and the overall system."}, {"id": 107, "string": "In task 1, the participants had to select a research topic from a list of 43 research topics."}, {"id": 108, "string": "On selection of topic, the system provides the top 20 paper recommendations which are meant to be part of the initial LR reading list."}, {"id": 109, "string": "In task 2, they had to select a minimum of five papers from task 1 in order for the system to retrieve 30 topically similar papers."}, {"id": 110, "string": "For the third task, the participants were requested to add at least 30 papers in the reading list."}, {"id": 111, "string": "The paper count was set to 30 as the threshold for highest number of shortlisted papers was 26 (for the article-type 'generic research paper')."}, {"id": 112, "string": "The three other article-types provided for the experiment were conference full paper, conference poster and case study."}, {"id": 113, "string": "The shortlisted papers count for these article-types was fixed by taking average of the references count of the related papers from the ACM DL extract."}, {"id": 114, "string": "The participant had to then select the article-type and run the task so that the system could retrieve the shortlisted papers."}, {"id": 115, "string": "The screenshot of the task 3 from the Rec4LRW system is provided in Figure 1 ."}, {"id": 116, "string": "In addition to the basic metadata, the system provides the feature \"View papers in the parent cluster\" for the participant to see the cluster from which the paper has been shortlisted."}, {"id": 117, "string": "The evaluation screen was provided to the user at the bottom of the screen (not shown in Figure 1 )."}, {"id": 118, "string": "The participants had to answer seven mandatory survey questions and one optional subjective feedback question as a part of the evaluation."}, {"id": 119, "string": "The seven survey questions and the corresponding measures are provided in Table 1 ."}, {"id": 120, "string": "A five-point Likert scale was provided for measuring participant agreement for each question."}, {"id": 121, "string": "The measures were selected based on the key aspects of the task."}, {"id": 122, "string": "The measures Relevance, Usefulness, Importance, Certainty, Good_List and Improve-ment_Needed were meant to ascertain the quality of the recommendations."}, {"id": 123, "string": "The final measure Shortlisting_Feature was used to identify whether participants would be interested to use this task in current academic search systems and digital libraries."}, {"id": 124, "string": "This is a good recommendation list, at an overall level Improvement_Needed There is a need to further improve this shortlisted papers list Shortlisting_Feature I would like to see the feature of shortlisting papers from reading list based on article-type preference, in academic search systems and databases The response values 'Agree' and 'Strongly Agree' were the two values considered for the calculation of agreement percentages for the evaluation measures."}, {"id": 125, "string": "Descriptive statistics were used to measure central tendency."}, {"id": 126, "string": "Independent samples t-test was used to check the presence of statistically significant difference in the mean values of the students and staff group, for the testing the hypothesis."}, {"id": 127, "string": "Statistical significance was set at p < .05."}, {"id": 128, "string": "Statistical analyses were done using SPSS 21.0 and R. Participants' subjective feedback responses were coded by a single coder using an inductive approach [1] , with the aim of identifying the central themes (concepts) in the text."}, {"id": 129, "string": "The study was conducted between November 2015 and January 2016."}, {"id": 130, "string": "Out of the eligible 230 participants, 116 participants signed the consent form and completed the whole study inclusive of the three tasks in the system."}, {"id": 131, "string": "57 participants were Ph.D./Masters students while 59 were research staff, academic staff and librarians."}, {"id": 132, "string": "The average research experience for Ph.D. students was 2 years while for staff, it was 5.6 years."}, {"id": 133, "string": "51% of participants were from the computer science, electrical and electronics disciplines, 35% from information and communication studies discipline while 14% from other disciplines."}, {"id": 134, "string": "6 Results and Discussion Agreement Percentages (AP) The agreement percentages (AP) for the seven measures by the participant groups are shown in Figure 2 ."}, {"id": 135, "string": "In the current study, an agreement percentage above 75% is considered as an indication of higher agreement from the participants."}, {"id": 136, "string": "As expected, the AP of students was consistently higher than the staff with the biggest difference found for the measures Usefulness (82.00% for students, 64.15% for staff) and Good_List (76.00% for students, 62.26% for staff)."}, {"id": 137, "string": "It has been reported in earlier studies that graduate students generally look for assistance in most stages of research [9] ."}, {"id": 138, "string": "Consequently, students would prefer technological interventions such as the current system due to the simplicity in interaction."}, {"id": 139, "string": "Hence, the evaluation of students was evidently better than staff."}, {"id": 140, "string": "The quality measures Importance (85.96% for students, 77.97% for staff) and Shortlisting_Feature (84.21% for students, 74.58% for staff) had the highest APs."}, {"id": 141, "string": "This observation validates the usefulness of the technique in identifying popular/seminal papers from the reading list."}, {"id": 142, "string": "Due to favorable APs for the most measures, the lowest agreement values were observed for the measure Improve-ment_Needed (57.89% for students, 57.63% for staff)."}, {"id": 143, "string": "The results for the measure Certainty (70% for students, 62.26% for staff) indicate some level of reluctance among the participants in being confident of citing the papers."}, {"id": 144, "string": "Citation of a particular paper is subject to the particular citation context in the manuscript, therefore not all participants would be able to prejudge their citation behavior."}, {"id": 145, "string": "In summary, participants seem to acknowledge the usefulness of the task in identifying important papers from the reading list."}, {"id": 146, "string": "However, there is an understandable lack of inclination in citing these papers."}, {"id": 147, "string": "This issue is to be addressed in future studies."}, {"id": 148, "string": "Qualitative Data Analysis In Table 2 , the top five categories of the preferred aspects and critical aspects are listed."}, {"id": 149, "string": "Preferred Aspects."}, {"id": 150, "string": "Out of the total 116 participants, 68 participants chose to give feedback about the features that they found to be useful."}, {"id": 151, "string": "24% of the participants felt that the feature of the shortlisting papers based on article-type preference was quite preferable and would help them in completing their tasks in a faster and efficient manner."}, {"id": 152, "string": "They also felt that the quality of the shortlisting papers was satisfactory."}, {"id": 153, "string": "15% of the participants felt that the information cue labels (popular, recent, high reach and literature survey) were helpful for them in relevance judgement of the shortlisted papers."}, {"id": 154, "string": "This particular observation of the participants was echoed for the first two tasks of the Rec4LRW system, thereby validating the usefulness of information cue labels in academic search systems and digital libraries."}, {"id": 155, "string": "Around 11% of the participants felt the option of viewing papers in the parent cluster of the particular shortlisted papers was useful in two ways."}, {"id": 156, "string": "Firstly, it helped in understanding the different clusters formed with the references and citations of the papers in the reading list."}, {"id": 157, "string": "Secondly, the clusters served as an avenue for finding some useful and relevant papers in serendipitous manner as some papers could have been missed by the researcher dur-ing the literature review process."}, {"id": 158, "string": "The other features that the participants commended were the metadata provided along with the shortlisted papers (citations count, article summary) and the paper management collection features across the three tasks."}, {"id": 159, "string": "Ranking of Papers (3%) UI can be Improved (3%) Critical Aspects."}, {"id": 160, "string": "Out of the 116 participants, 41 participants gave critical comments about the task and features of the system catering to the task."}, {"id": 161, "string": "Around 16% of the participants felt that the study procedure of adding 30 papers to the reading list as a precursor for running the task was uninteresting."}, {"id": 162, "string": "The reasons cited were the irrelevance of some of the papers to the participants as these papers had to be added just for the sake of executing the task while some participants felt that the 30 papers count was too much while some could not comprehend why these many papers had to be added."}, {"id": 163, "string": "Around 5% of the participants felt that the study experience was hindered by the dataset not catering to recent papers (circa 2012-2015) and the dataset being restricted to computer science related topics."}, {"id": 164, "string": "Another 5% of the participants felt that they shortlisting algorithm/technique could be improved to provide a better list of papers."}, {"id": 165, "string": "A section of these participants needed more recent papers in the final list while others wanted papers specifically from high impact publications."}, {"id": 166, "string": "Around 4% of the participants could not find the usefulness of the task in their work."}, {"id": 167, "string": "They felt that the task was not beneficial."}, {"id": 168, "string": "The other minor critical comments given by the participants were the ranking of the list could be improved, the task execution speed could be improved and more UI control features could be provided, such as sorting options and free-text search box."}, {"id": 169, "string": "Conclusion and Future Work For literature review and manuscript preparatory related tasks, the gap between novices and experts in terms of task knowledge and execution skills is well-known [15] ."}, {"id": 170, "string": "A majority of the previous studies have brought forth assistive systems that focus heavily on LR tasks, while only a few studies have concentrated on approaches for helping researchers during manuscript preparation."}, {"id": 171, "string": "With the Rec4LRW system, we have attempted to address the aforementioned gap with a novel task for shortlisting articles from researcher's reading list, for inclusion in manuscript."}, {"id": 172, "string": "The shortlisting task makes use of a popular community detection algorithm [10] for identifying communities of papers generated from the citations network of the papers from the reading list."}, {"id": 173, "string": "Additionally, we have also tried to vary shortlisted papers count by taking the article-type choice into consideration."}, {"id": 174, "string": "In order to evaluate the system, a user evaluation study was conducted with 116 participants who had the experience of writing research papers."}, {"id": 175, "string": "The participants were instructed to run each task followed by evaluation questionnaire."}, {"id": 176, "string": "Participants were requested to answer survey questions and provide subjective feedback on the features of the tasks."}, {"id": 177, "string": "As hypothesized before the start of the study, students evaluated the task favorably for all measures."}, {"id": 178, "string": "There was high level of agreement among all participants on the availability of important papers among the shortlisted papers."}, {"id": 179, "string": "This finding validates the aim of the task in identifying the papers that manuscript reviewers would expected to be cited."}, {"id": 180, "string": "In the qualitative feedback provided by the participants, majority of the participants preferred the idea of shortlisting papers and also thought the output of the task was of good quality."}, {"id": 181, "string": "Secondly, they liked the information cue labels provided along with certain papers, for indicating the special nature of the paper."}, {"id": 182, "string": "As a part of critical feedback, participants felt that the study procedure was a bit longwinded as they had to select 30 papers without reading them, just for running the task."}, {"id": 183, "string": "As a part of future work, the scope for this task will be expanded to bring in more variations for the different article-type choices."}, {"id": 184, "string": "For instance, research would be conducted:-(i) to ascertain the quantity of recent papers to be shortlisted for different article-type choices, (ii) include new papers in the output so that the user is alerted about some key paper(s) which could have been missed during literature review, (iii) provide more user control in the system so that the user can select papers as mandatory to be shortlisted and (iv) Integrate this task with the citation context recommendation task [11, 14] so that the user can be fully aided during the whole process of manuscript writing."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 31}, {"section": "Related Work", "n": "2", "start": 32, "end": 52}, {"section": "Brief Overview", "n": "3.1", "start": 53, "end": 63}, {"section": "Dataset", "n": "3.2", "start": 64, "end": 67}, {"section": "User-Interface (UI) Features", "n": "3.3", "start": 68, "end": 82}, {"section": "Technique For Shortlisting Papers From Reading List", "n": "4", "start": 83, "end": 133}, {"section": "Agreement Percentages (AP)", "n": "6.1", "start": 134, "end": 147}, {"section": "Qualitative Data Analysis", "n": "6.2", "start": 148, "end": 168}, {"section": "Conclusion and Future Work", "n": "7", "start": 169, "end": 184}], "figures": [{"filename": "../figure/image/959-Figure2-1.png", "caption": "Fig. 2. Agreement percentage results by participant group", "page": 8, "bbox": {"x1": 142.56, "x2": 452.15999999999997, "y1": 249.6, "y2": 408.96}}, {"filename": "../figure/image/959-Figure1-1.png", "caption": "Fig. 1. Sample list of shortlisted papers for the task output", "page": 4, "bbox": {"x1": 124.8, "x2": 473.28, "y1": 183.84, "y2": 397.91999999999996}}, {"filename": "../figure/image/959-Table2-1.png", "caption": "Table 2. Top five categories for preferred and critical aspects", "page": 9, "bbox": {"x1": 117.6, "x2": 477.12, "y1": 211.67999999999998, "y2": 307.2}}, {"filename": "../figure/image/959-Table1-1.png", "caption": "Table 1. Evaluation measures and corresponding questions", "page": 6, "bbox": {"x1": 118.56, "x2": 477.12, "y1": 639.84, "y2": 668.64}}]}