{"title": "Context-Aware Neural Machine Translation Learns Anaphora Resolution", "abstract": "Standard machine translation systems process sentences in isolation and hence ignore extra-sentential information, even though extended context can both prevent mistakes in ambiguous cases and improve translation coherence. We introduce a context-aware neural machine translation model designed in such way that the flow of information from the extended context to the translation model can be controlled and analyzed. We experiment with an English-Russian subtitles dataset, and observe that much of what is captured by our model deals with improving pronoun translation. We measure correspondences between induced attention distributions and coreference relations and observe that the model implicitly captures anaphora. It is consistent with gains for sentences where pronouns need to be gendered in translation. Beside improvements in anaphoric cases, the model also improves in overall BLEU, both over its context-agnostic version (+0.7) and over simple concatenation of the context and source sentences (+0.6).", "text": [{"id": 0, "string": "Introduction It has long been argued that handling discourse phenomena is important in translation (Mitkov, 1999; Hardmeier, 2012) ."}, {"id": 1, "string": "Using extended context, beyond the single source sentence, should in principle be beneficial in ambiguous cases and also ensure that generated translations are coherent."}, {"id": 2, "string": "Nevertheless, machine translation systems typically ignore discourse phenomena and translate sentences in isolation."}, {"id": 3, "string": "Earlier research on this topic focused on handling specific phenomena, such as translating pronouns (Le Nagard and Koehn, 2010; Hardmeier and Federico, 2010; Hardmeier et al., 2015) , discourse connectives (Meyer et al., 2012) , verb tense (Gong et al., 2012) , increasing lexical consistency (Carpuat, 2009; Tiedemann, 2010; Gong et al., 2011) , or topic adaptation (Su et al., 2012; Hasler et al., 2014) , with special-purpose features engineered to model these phenomena."}, {"id": 4, "string": "However, with traditional statistical machine translation being largely supplanted with neural machine translation (NMT) models trained in an end-toend fashion, an alternative is to directly provide additional context to an NMT system at training time and hope that it will succeed in inducing relevant predictive features (Jean et al., 2017; Wang et al., 2017; Tiedemann and Scherrer, 2017; Bawden et al., 2018) ."}, {"id": 5, "string": "While the latter approach, using context-aware NMT models, has demonstrated to yield performance improvements, it is still not clear what kinds of discourse phenomena are successfully handled by the NMT systems and, importantly, how they are modeled."}, {"id": 6, "string": "Understanding this would inform development of future discourse-aware NMT models, as it will suggest what kind of inductive biases need to be encoded in the architecture or which linguistic features need to be exploited."}, {"id": 7, "string": "In our work we aim to enhance our understanding of the modelling of selected discourse phenomena in NMT."}, {"id": 8, "string": "To this end, we construct a simple discourse-aware model, demonstrate that it achieves improvements over the discourse-agnostic baseline on an English-Russian subtitles dataset (Lison et al., 2018) and study which context information is being captured in the model."}, {"id": 9, "string": "Specifically, we start with the Trans-former (Vaswani et al., 2017) , a state-of-the-art model for context-agnostic NMT, and modify it in such way that it can handle additional context."}, {"id": 10, "string": "In our model, a source sentence and a context sentence are first encoded independently, and then a single attention layer, in a combination with a gating function, is used to produce a context-aware representation of the source sentence."}, {"id": 11, "string": "The information from context can only flow through this attention layer."}, {"id": 12, "string": "When compared to simply concatenating input sentences, as proposed by Tiedemann and Scherrer (2017) , our architecture appears both more accurate (+0.6 BLEU) and also guarantees that the contextual information cannot bypass the attention layer and hence remain undetected in our analysis."}, {"id": 13, "string": "We analyze what types of contextual information are exploited by the translation model."}, {"id": 14, "string": "While studying the attention weights, we observe that much of the information captured by the model has to do with pronoun translation."}, {"id": 15, "string": "It is not entirely surprising, as we consider translation from a language without grammatical gender (English) to a language with grammatical gender (Russian)."}, {"id": 16, "string": "For Russian, translated pronouns need to agree in gender with their antecedents."}, {"id": 17, "string": "Moreover, since in Russian verbs agree with subjects in gender and adjectives also agree in gender with pronouns in certain frequent constructions, mistakes in translating pronouns have a major effect on the words in the produced sentences."}, {"id": 18, "string": "Consequently, the standard cross-entropy training objective sufficiently rewards the model for improving pronoun translation and extracting relevant information from the context."}, {"id": 19, "string": "We use automatic co-reference systems and human annotation to isolate anaphoric cases."}, {"id": 20, "string": "We observe even more substantial improvements in performance on these subsets."}, {"id": 21, "string": "By comparing attention distributions induced by our model against co-reference links, we conclude that the model implicitly captures coreference phenomena, even without having any kind of specialized features which could help it in this subtask."}, {"id": 22, "string": "These observations also suggest potential directions for future work."}, {"id": 23, "string": "For example, effective co-reference systems go beyond relying simply on embeddings of contexts."}, {"id": 24, "string": "One option would be to integrate 'global' features summarizing properties of groups of mentions predicted as linked in a document (Wiseman et al., 2016) , or to use latent relations to trace en-tities across documents (Ji et al., 2017) ."}, {"id": 25, "string": "Our key contributions can be summarized as follows: • we introduce a context-aware neural model, which is effective and has a sufficiently simple and interpretable interface between the context and the rest of the translation model; • we analyze the flow of information from the context and identify pronoun translation as the key phenomenon captured by the model; • by comparing to automatically predicted or human-annotated coreference relations, we observe that the model implicitly captures anaphora."}, {"id": 26, "string": "Neural Machine Translation Given a source sentence x = (x 1 , x 2 , ."}, {"id": 27, "string": "."}, {"id": 28, "string": "."}, {"id": 29, "string": ", x S ) and a target sentence y = (y 1 , y 2 , ."}, {"id": 30, "string": "."}, {"id": 31, "string": "."}, {"id": 32, "string": ", y T ), NMT models predict words in the target sentence, word by word."}, {"id": 33, "string": "Current NMT models mainly have an encoderdecoder structure."}, {"id": 34, "string": "The encoder maps an input sequence of symbol representations x to a sequence of distributed representations z = (z 1 , z 2 , ."}, {"id": 35, "string": "."}, {"id": 36, "string": "."}, {"id": 37, "string": ", z S )."}, {"id": 38, "string": "Given z, a neural decoder generates the corresponding target sequence of symbols y one element at a time."}, {"id": 39, "string": "Attention-based NMT The encoder-decoder framework with attention has been proposed by Bahdanau et al."}, {"id": 40, "string": "(2015) and has become the defacto standard in NMT."}, {"id": 41, "string": "The model consists of encoder and decoder recurrent networks and an attention mechanism."}, {"id": 42, "string": "The attention mechanism selectively focuses on parts of the source sentence during translation, and the attention weights specify the proportions with which information from different positions is combined."}, {"id": 43, "string": "Transformer Vaswani et al."}, {"id": 44, "string": "(2017) proposed an architecture that avoids recurrence completely."}, {"id": 45, "string": "The Transformer follows an encoder-decoder architecture using stacked self-attention and fully connected layers for both the encoder and decoder."}, {"id": 46, "string": "An important advantage of the Transformer is that it is more parallelizable and faster to train than recurrent encoder-decoder models."}, {"id": 47, "string": "From the source tokens, learned embeddings are generated and then modified using positional encodings."}, {"id": 48, "string": "The encoded word embeddings are then used as input to the encoder which consists of N layers each containing two sub-layers: (a) a multihead attention mechanism, and (b) a feed-forward network."}, {"id": 49, "string": "The self-attention mechanism first computes attention weights: i.e., for each word, it computes a distribution over all words (including itself)."}, {"id": 50, "string": "This distribution is then used to compute a new representation of that word: this new representation is set to an expectation (under the attention distribution specific to the word) of word representations from the layer below."}, {"id": 51, "string": "In multi-head attention, this process is repeated h times with different representations and the result is concatenated."}, {"id": 52, "string": "The second component of each layer of the Transformer network is a feed-forward network."}, {"id": 53, "string": "The authors propose using a two-layered network with the ReLU activations."}, {"id": 54, "string": "Analogously, each layer of the decoder contains the two sub-layers mentioned above as well as an additional multi-head attention sub-layer that receives input from the corresponding encoding layer."}, {"id": 55, "string": "In the decoder, the attention is masked to prevent future positions from being attended to, or in other words, to prevent illegal leftward information flow."}, {"id": 56, "string": "See Vaswani et al."}, {"id": 57, "string": "(2017) for additional details."}, {"id": 58, "string": "The proposed architecture reportedly improves over the previous best results on the WMT 2014 English-to-German and English-to-French translation tasks, and we verified its strong performance on our data set in preliminary experiments."}, {"id": 59, "string": "Thus, we consider it a strong state-of-the-art baseline for our experiments."}, {"id": 60, "string": "Moreover, as the Transformer is attractive in practical NMT applications because of its parallelizability and training efficiency, integrating extra-sentential information in Transformer is important from the engineering perspective."}, {"id": 61, "string": "As we will see in Section 4, previous techniques developed for recurrent encoderdecoders do not appear effective for the Transformer."}, {"id": 62, "string": "3 Context-aware model architecture Our model is based on Transformer architecture (Vaswani et al., 2017) ."}, {"id": 63, "string": "We leave Transformer's decoder intact while incorporating context information on the encoder side ( Figure 1 )."}, {"id": 64, "string": "Source encoder: The encoder is composed of a stack of N layers."}, {"id": 65, "string": "The first N − 1 layers are identical and represent the original layers of Trans- g i = σ W g c (s−attn) i , c (c−attn) i + b g (1) c i = g i c (s−attn) i + (1 − g i ) c (c−attn) i (2) Context encoder: The context encoder is composed of a stack of N identical layers and replicates the original Transformer encoder."}, {"id": 66, "string": "In contrast to related work (Jean et al., 2017; Wang et al., 2017) , we found in preliminary experiments that using separate encoders does not yield an accurate model."}, {"id": 67, "string": "Instead we share the parameters of the first N − 1 layers with the source encoder."}, {"id": 68, "string": "Since major proportion of the context encoder's parameters are shared with the source encoder, we add a special token (let us denote it <bos>) to the beginning of context sentences, but not source sentences, to let the shared layers know whether it is encoding a source or a context sentence."}, {"id": 69, "string": "Experiments Data and setting We use the publicly available OpenSubtitles2018 corpus (Lison et al., 2018) for English and Russian."}, {"id": 70, "string": "1 As described in the appendix, we apply data cleaning and randomly choose 2 million training instances from the resulting data."}, {"id": 71, "string": "For development and testing, we randomly select two subsets of 10000 instances from movies not encountered in training."}, {"id": 72, "string": "2 Sentences were encoded using byte-pair encoding (Sennrich et al., 2016) , with source and target vocabularies of about 32000 tokens."}, {"id": 73, "string": "We generally used the same parameters and optimizer as in the original Transformer (Vaswani et al., 2017) ."}, {"id": 74, "string": "The hyperparameters, preprocessing and training details are provided in the supplementary material."}, {"id": 75, "string": "Results and analysis We start by experiments motivating the setting and verifying that the improvements are indeed genuine, i.e."}, {"id": 76, "string": "they come from inducing predictive features of the context."}, {"id": 77, "string": "In subsequent section 5.2, we analyze the features induced by the context encoder and perform error analysis."}, {"id": 78, "string": "Overall performance We use the traditional automatic metric BLEU on a general test set to get an estimate of the overall performance of the discourse-aware model, before turning to more targeted evaluation in the next section."}, {"id": 79, "string": "We provide results in Table 1 ."}, {"id": 80, "string": "3 The 'baseline' is the discourse-agnostic version of the Transformer."}, {"id": 81, "string": "As another baseline we use the standard Transformer applied to the concatenation of the previous and source sentences, as proposed by Tiedemann and Scherrer (2017 a substantial degradation of performance (over 1 BLEU)."}, {"id": 82, "string": "Instead, we use a binary flag at every word position in our concatenation baseline telling the encoder whether the word belongs to the context sentence or to the source sentence."}, {"id": 83, "string": "We consider two versions of our discourseaware model: one using the previous sentence as the context, another one relying on the next sentence."}, {"id": 84, "string": "We hypothesize that both the previous and the next sentence provide a similar amount of additional clues about the topic of the text, whereas for discourse phenomena such as anaphora, discourse relations and elliptical structures, the previous sentence is more important."}, {"id": 85, "string": "First, we observe that our best model is the one using a context encoder for the previous sentence: it achieves 0.7 BLEU improvement over the discourse-agnostic model."}, {"id": 86, "string": "We also notice that, unlike the previous sentence, the next sentence does not appear beneficial."}, {"id": 87, "string": "This is a first indicator that discourse phenomena are the main reason for the observed improvement, rather than topic effects."}, {"id": 88, "string": "Consequently, we focus solely on using the previous sentence in all subsequent experiments."}, {"id": 89, "string": "Second, we observe that the concatenation baseline appears less accurate than the introduced context-aware model."}, {"id": 90, "string": "This result suggests that our model is not only more amendable to analysis but also potentially more effective than using concatenation."}, {"id": 91, "string": "In order to verify that our improvements are genuine, we also evaluate our model (trained with the previous sentence as context) on the same test set with shuffled context sentences."}, {"id": 92, "string": "It can be seen that the performance drops significantly when a real context sentence is replaced with a random one."}, {"id": 93, "string": "This confirms that the model does rely on context information to achieve the improvement in translation quality, and is not merely better regularized."}, {"id": 94, "string": "However, the model is robust towards being shown a random context and obtains a performance similar to the context-agnostic baseline."}, {"id": 95, "string": "Analysis In this section we investigate what types of contextual information are exploited by the model."}, {"id": 96, "string": "We study the distribution of attention to context and perform analysis on specific subsets of the test data."}, {"id": 97, "string": "Specifically the research questions we seek to answer are as follows: • For the translation of which words does the model rely on contextual history most?"}, {"id": 98, "string": "• Are there any non-lexical patterns affecting attention to context, such as sentence length and word position?"}, {"id": 99, "string": "• Can the context-aware NMT system implicitly learn coreference phenomena without any feature engineering?"}, {"id": 100, "string": "Since all the attentions in our model are multihead, by attention weights we refer to an average over heads of per-head attention weights."}, {"id": 101, "string": "First, we would like to identify a useful attention mass coming to context."}, {"id": 102, "string": "We analyze the attention maps between source and context, and find that the model mostly attends to <bos> and <eos> context tokens, and much less often attends to words."}, {"id": 103, "string": "Our hypothesis is that the model has found a way to take no information from context by looking at uninformative tokens, and it attends to words only when it wants to pass some contextual information to the source sentence encoder."}, {"id": 104, "string": "Thus we define useful contextual attention mass as sum of attention weights to context words, excluding <bos> and <eos> tokens and punctuation."}, {"id": 105, "string": "Top words depending on context We analyze the distribution of attention to context for individual source words to see for which words the model depends most on contextual history."}, {"id": 106, "string": "We compute the overall average attention to context words for each source word in our test set."}, {"id": 107, "string": "We do the same for source words at positions higher than first."}, {"id": 108, "string": "We filter out words that occurred less than 10 times in a test set."}, {"id": 109, "string": "The top 10 words with the highest average attention to context words are provided in Table 2 ."}, {"id": 110, "string": "An interesting finding is that contextual attention is high for the translation of \"it\", \"yours\", \"ones\", \"you\" and \"I\", which are indeed very ambiguous out-of-context when translating into Russian."}, {"id": 111, "string": "For example, \"it\" will be translated as third person singular masculine, feminine or neuter, or third person plural depending on its antecedent."}, {"id": 112, "string": "Table 2 : Top-10 words with the highest average attention to context words."}, {"id": 113, "string": "attn gives an average attention to context words, pos gives an average position of the source word."}, {"id": 114, "string": "Left part is for words on all positions, right -for words on positions higher than first."}, {"id": 115, "string": "\"You\" can be second person singular impolite or polite, or plural."}, {"id": 116, "string": "Also, verbs must agree in gender and number with the translation of \"you\"."}, {"id": 117, "string": "It might be not obvious why \"I\" has high contextual attention, as it is not ambiguous itself."}, {"id": 118, "string": "However, in past tense, verbs must agree with \"I\" in gender, so to translate past tense sentences properly, the source encoder must predict speaker gender, and the context may provide useful indicators."}, {"id": 119, "string": "Most surprising is the appearance of \"yes\", \"yeah\", and \"well\" in the list of context-dependent words, similar to the finding by Tiedemann and Scherrer (2017) ."}, {"id": 120, "string": "We note that these words mostly appear in sentence-initial position, and in relatively short sentences."}, {"id": 121, "string": "If only words after the first are considered, they disappear from the top-10 list."}, {"id": 122, "string": "We hypothesize that the amount of attention to context not only depends on the words themselves, but also on factors such as sentence length and position, and we test this hypothesis in the next section."}, {"id": 123, "string": "Dependence on sentence length and position We compute useful attention mass coming to context by averaging over source words."}, {"id": 124, "string": "Figure 2 illustrates the dependence of this average attention mass on sentence length."}, {"id": 125, "string": "We observe a disproportionally high attention on context for short sentences, and a positive correlation between the average contextual attention and context length."}, {"id": 126, "string": "It is also interesting to see the importance given to the context at different positions in the source sentence."}, {"id": 127, "string": "We compute an average attention mass to context for a set of 1500 sentences of the same length."}, {"id": 128, "string": "As can be seen in Figure 3 , words at the beginning of a source sentence tend to attend to context more than words at the end of a sentence."}, {"id": 129, "string": "This correlates with standard view that English sentences present hearer-old material before hearer-new."}, {"id": 130, "string": "There is a clear (negative) correlation between sentence length and the amount of attention placed on contextual history, and between token position and the amount of attention to context, which suggests that context is especially helpful at the beginning of a sentence, and for shorter sentences."}, {"id": 131, "string": "However, Figure 4 shows that there is no straightforward dependence of BLEU improvement on source length."}, {"id": 132, "string": "This means that while attention on context is disproportionally high for short sentences, context does not seem disproportionally more useful for these sentences."}, {"id": 133, "string": "Analysis of pronoun translation The analysis of the attention model indicates that the model attends heavily to the contextual history for the translation of some pronouns."}, {"id": 134, "string": "Here, we investigate whether this context-aware modelling results in empirical improvements in translation Ambiguous pronouns and translation quality Ambiguous pronouns are relatively sparse in a general-purpose test set, and previous work has designed targeted evaluation of pronoun translation (Hardmeier et al., 2015; Miculicich Werlen and Popescu-Belis, 2017; Bawden et al., 2018) ."}, {"id": 135, "string": "However, we note that in Russian, grammatical gender is not only marked on pronouns, but also on adjectives and verbs."}, {"id": 136, "string": "Rather than using a pronoun-specific evaluation, we present results with BLEU on test sets where we hypothesize context to be relevant, specifically sentences containing co-referential pronouns."}, {"id": 137, "string": "We feed Stanford CoreNLP open-source coreference resolution system (Manning et al., 2014a) with pairs of sentences to find examples where there is a link between one of the pronouns under consideration and the context."}, {"id": 138, "string": "We focus on anaphoric instances of \"it\" (this excludes, among others, pleonastic uses of \"it\"), and instances of the pronouns \"I\", \"you\", and \"yours\" that are coreferent with an expression in the previous sentence."}, {"id": 139, "string": "All these pronouns express ambiguity in the translation into Russian, and the model has learned to attend to context for their translation (Table 2) ."}, {"id": 140, "string": "To combat data sparsity, the test sets are extracted from large amounts of held-out data of OpenSubtitles2018."}, {"id": 141, "string": "Table 3 shows BLEU scores for the resulting subsets."}, {"id": 142, "string": "First of all, we see that most of the antecedents in these test sets are also pronouns."}, {"id": 143, "string": "Antecedent pronouns should not be particularly informative for translating the source pronoun."}, {"id": 144, "string": "Nevertheless, even with such contexts, improvements are generally larger than on the overall test set."}, {"id": 145, "string": "When we focus on sentences where the antecedent for pronoun under consideration contains    a noun, we observe even larger improvements ( Table 4 )."}, {"id": 146, "string": "Improvement is smaller for \"I\", but we note that verbs with first person singular subjects mark gender only in the past tense, which limits the impact of correctly predicting gender."}, {"id": 147, "string": "In contrast, different types of \"you\" (polite/impolite, singular/plural) lead to different translations of the pronoun itself plus related verbs and adjectives, leading to a larger jump in performance."}, {"id": 148, "string": "Examples of nouns co-referent with \"I\" and \"you\" include names, titles (\"Mr.\", \"Mrs.\", \"officer\"), terms denoting family relationships (\"Mom\", \"Dad\"), and terms of endearment (\"honey\", \"sweetie\")."}, {"id": 149, "string": "Such nouns can serve to disambiguate number and gender of the speaker or addressee, and mark the level of familiarity between them."}, {"id": 150, "string": "The most interesting case is translation of \"it\", as \"it\" can have many different translations into Russian, depending on the grammatical gender of the antecedent."}, {"id": 151, "string": "In order to disentangle these cases, we train the Berkeley aligner on 10m sentences and use the trained model to divide the test set with \"it\" referring to a noun into test sets specific to each gender and number."}, {"id": 152, "string": "Results are in Table 5 ."}, {"id": 153, "string": "We see an improvement of 4-5 BLEU for sentences where \"it\" is translated into a feminine or plural pronoun by the reference."}, {"id": 154, "string": "For cases where \"it\" is translated into a masculine pronoun, the improvement is smaller because the masculine gender is more frequent, and the context-agnostic baseline tends to translate the pronoun \"it\" as masculine."}, {"id": 155, "string": "Latent anaphora resolution The results in Tables 4 and 5 suggest that the context-aware model exploits information about the antecedent of an ambiguous pronoun."}, {"id": 156, "string": "We hypothesize that we can interpret the model's attention mechanism as a latent anaphora resolution, and perform experiments to test this hypothesis."}, {"id": 157, "string": "For test sets from Table 4 , we find an antecedent noun phrase (usually a determiner or a possessive pronoun followed by a noun) using Stanford CoreNLP (Manning et al., 2014b) ."}, {"id": 158, "string": "We select only examples where a noun phrase contains a single noun to simplify our analysis."}, {"id": 159, "string": "Then we identify which token receives the highest attention weight (excluding <bos> and <eos> tokens and punctuation)."}, {"id": 160, "string": "If this token falls within the antecedent span, then we treat it as agreement (see Table 6 )."}, {"id": 161, "string": "One natural question might be: does the attention component in our model genuinely learn to perform anaphora resolution, or does it capture some simple heuristic (e.g., pointing to the last noun)?"}, {"id": 162, "string": "To answer this question, we consider several baselines: choosing a random, last or first pronoun agreement (in %) random first last attention  it  40  36  52  58  you  42  63  29  67  I  39  56 35 62 noun from the context sentence as an antecedent."}, {"id": 163, "string": "Note that an agreement of the last noun for \"it\" or the first noun for \"you\" and \"I\" is very high."}, {"id": 164, "string": "This is partially due to the fact that most context sentences have only one noun."}, {"id": 165, "string": "For these examples a random and last predictions are always correct, meanwhile attention does not always pick a noun as the most relevant word in the context."}, {"id": 166, "string": "To get a more clear picture let us now concentrate only on examples where there is more than one noun in the context (Table 7) ."}, {"id": 167, "string": "We can now see that the attention weights are in much better agreement with the coreference system than any of the heuristics."}, {"id": 168, "string": "This indicates that the model is indeed performing anaphora resolution."}, {"id": 169, "string": "While agreement with CoreNLP is encouraging, we are aware that coreference resolution by CoreNLP is imperfect and partial agreement with it may not necessarily indicate that the attention is particularly accurate."}, {"id": 170, "string": "In order to control for this, we asked human annotators to manually evaluate 500 examples from the test sets where CoreNLP predicted that \"it\" refers to a noun in the context sentence."}, {"id": 171, "string": "More precisely, we picked random 500 examples from the test set with \"it\" from Table 7."}, {"id": 172, "string": "We marked the pronoun in a source which CoreNLP found anaphoric."}, {"id": 173, "string": "Assessors were given the source and context sentences and were asked to mark an antecedent noun phrase for a marked pronoun in a source sentence or say that there is no antecedent at all."}, {"id": 174, "string": "We then picked those examples where assessors found a link from \"it\" to some noun in context (79% of all examples)."}, {"id": 175, "string": "Then we evaluated agreement of CoreNLP and our model with the ground truth links."}, {"id": 176, "string": "We also report the performance of the best heuristic for \"it\" from our previous analysis (i.e."}, {"id": 177, "string": "last noun in context)."}, {"id": 178, "string": "The results are provided in Table 8 ."}, {"id": 179, "string": "The agreement between our model and the ground truth is 72%."}, {"id": 180, "string": "Though 5% below the coreference system, this is a lot higher than the best agreement (in %) CoreNLP 77 attention 72 last noun 54 Table 8 : Performance of CoreNLP and our model's attention mechanism compared to human assessment."}, {"id": 181, "string": "Examples with ≥1 noun in context sentence."}, {"id": 182, "string": "Figure 5 : An example of an attention map between source and context."}, {"id": 183, "string": "On the y-axis are the source tokens, on the x-axis the context tokens."}, {"id": 184, "string": "Note the high attention between \"it\" and its antecedent \"heart\"."}, {"id": 185, "string": "CoreNLP right wrong attn right 53 19 attn wrong 24 4 Table 9 : Performance of CoreNLP and our model's attention mechanism compared to human assessment (%)."}, {"id": 186, "string": "Examples with ≥1 noun in context sentence."}, {"id": 187, "string": "heuristic (+18%)."}, {"id": 188, "string": "This confirms our conclusion that our model performs latent anaphora resolution."}, {"id": 189, "string": "Interestingly, the patterns of mistakes are quite different for CoreNLP and our model (Table 9)."}, {"id": 190, "string": "We also present one example ( Figure 5) where the attention correctly predicts anaphora while CoreNLP fails."}, {"id": 191, "string": "Nevertheless, there is room for improvement, and improving the attention component is likely to boost translation performance."}, {"id": 192, "string": "Related work Our analysis focuses on how our context-aware neural model implicitly captures anaphora."}, {"id": 193, "string": "Early work on anaphora phenomena in statistical machine translation has relied on external systems for coreference resolution (Le Nagard and Koehn, 2010; Hardmeier and Federico, 2010) ."}, {"id": 194, "string": "Results were mixed, and the low performance of coreference resolution systems was identified as a problem for this type of system."}, {"id": 195, "string": "Later work by Hardmeier et al."}, {"id": 196, "string": "(2013) has shown that cross-lingual pronoun prediction systems can implicitly learn to resolve coreference, but this work still relied on external feature extraction to identify anaphora candidates."}, {"id": 197, "string": "Our experiments show that a contextaware neural machine translation system can implicitly learn coreference phenomena without any feature engineering."}, {"id": 198, "string": "Tiedemann and Scherrer (2017) and Bawden et al."}, {"id": 199, "string": "(2018) analyze the attention weights of context-aware NMT models."}, {"id": 200, "string": "Tiedemann and Scherrer (2017) find some evidence for aboveaverage attention on contextual history for the translation of pronouns, and our analysis goes further in that we are the first to demonstrate that our context-aware model learns latent anaphora resolution through the attention mechanism."}, {"id": 201, "string": "This is contrary to Bawden et al."}, {"id": 202, "string": "(2018) , who do not observe increased attention between a pronoun and its antecedent in their recurrent model."}, {"id": 203, "string": "We deem our model more suitable for analysis, since it has no recurrent connections and fully relies on the attention mechanism within a single attention layer."}, {"id": 204, "string": "Conclusions We introduced a context-aware NMT system which is based on the Transformer architecture."}, {"id": 205, "string": "When evaluated on an En-Ru parallel corpus, it outperforms both the context-agnostic baselines and a simple context-aware baseline."}, {"id": 206, "string": "We observe that improvements are especially prominent for sentences containing ambiguous pronouns."}, {"id": 207, "string": "We also show that the model induces anaphora relations."}, {"id": 208, "string": "We believe that further improvements in handling anaphora, and by proxy translation, can be achieved by incorporating specialized features in the attention model."}, {"id": 209, "string": "Our analysis has focused on the effect of context information on pronoun translation."}, {"id": 210, "string": "Future work could also investigate whether context-aware NMT systems learn other discourse phenomena, for example whether they improve the translation of elliptical constructions, and markers of discourse relations and information structure."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 25}, {"section": "Neural Machine Translation", "n": "2", "start": 26, "end": 68}, {"section": "Data and setting", "n": "4.1", "start": 69, "end": 74}, {"section": "Results and analysis", "n": "5", "start": 75, "end": 77}, {"section": "Overall performance", "n": "5.1", "start": 78, "end": 94}, {"section": "Analysis", "n": "5.2", "start": 95, "end": 104}, {"section": "Top words depending on context", "n": "5.2.1", "start": 105, "end": 122}, {"section": "Dependence on sentence length and position", "n": "5.2.2", "start": 123, "end": 132}, {"section": "Analysis of pronoun translation", "n": "5.3", "start": 133, "end": 133}, {"section": "Ambiguous pronouns and translation quality", "n": "5.3.1", "start": 134, "end": 154}, {"section": "Latent anaphora resolution", "n": "5.3.2", "start": 155, "end": 191}, {"section": "Related work", "n": "6", "start": 192, "end": 203}, {"section": "Conclusions", "n": "7", "start": 204, "end": 210}], "figures": [{"filename": "../figure/image/969-Figure4-1.png", "caption": "Figure 4: BLEU score vs. source sentence length", "page": 5, "bbox": {"x1": 338.88, "x2": 491.03999999999996, "y1": 61.44, "y2": 177.12}}, {"filename": "../figure/image/969-Figure3-1.png", "caption": "Figure 3: Average attention to context vs. source token position", "page": 5, "bbox": {"x1": 104.64, "x2": 255.35999999999999, "y1": 232.79999999999998, "y2": 346.08}}, {"filename": "../figure/image/969-Figure2-1.png", "caption": "Figure 2: Average attention to context words vs. both source and context length", "page": 5, "bbox": {"x1": 100.8, "x2": 259.2, "y1": 61.44, "y2": 191.04}}, {"filename": "../figure/image/969-Table6-1.png", "caption": "Table 6: Agreement with CoreNLP for test sets of pronouns having a nominal antecedent in context sentence (%).", "page": 6, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 193.44, "y2": 264.0}}, {"filename": "../figure/image/969-Table4-1.png", "caption": "Table 4: BLEU for test sets of pronouns having a nominal antecedent in context sentence. N: number of examples in the test set.", "page": 6, "bbox": {"x1": 74.88, "x2": 287.03999999999996, "y1": 193.44, "y2": 250.07999999999998}}, {"filename": "../figure/image/969-Table3-1.png", "caption": "Table 3: BLEU for test sets with coreference between pronoun and a word in context sentence. We show both N, the total number of instances in a particular test set, and number of instances with pronominal antecedent. Significant BLEU differences are in bold.", "page": 6, "bbox": {"x1": 104.64, "x2": 490.08, "y1": 62.879999999999995, "y2": 132.0}}, {"filename": "../figure/image/969-Table5-1.png", "caption": "Table 5: BLEU for test sets of pronoun “it” having a nominal antecedent in context sentence. N: number of examples in the test set.", "page": 6, "bbox": {"x1": 73.92, "x2": 289.44, "y1": 305.76, "y2": 376.32}}, {"filename": "../figure/image/969-Figure1-1.png", "caption": "Figure 1: Encoder of the discourse-aware model", "page": 2, "bbox": {"x1": 309.59999999999997, "x2": 523.1999999999999, "y1": 61.44, "y2": 324.96}}, {"filename": "../figure/image/969-Table7-1.png", "caption": "Table 7: Agreement with CoreNLP for test sets of pronouns having a nominal antecedent in context sentence (%). Examples with ≥1 noun in context sentence.", "page": 7, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 62.879999999999995, "y2": 132.0}}, {"filename": "../figure/image/969-Figure5-1.png", "caption": "Figure 5: An example of an attention map between source and context. On the y-axis are the source tokens, on the x-axis the context tokens. Note the high attention between “it” and its antecedent “heart”.", "page": 7, "bbox": {"x1": 319.68, "x2": 510.24, "y1": 183.84, "y2": 312.0}}, {"filename": "../figure/image/969-Table8-1.png", "caption": "Table 8: Performance of CoreNLP and our model’s attention mechanism compared to human assessment. Examples with ≥1 noun in context sentence.", "page": 7, "bbox": {"x1": 341.76, "x2": 491.03999999999996, "y1": 62.879999999999995, "y2": 119.03999999999999}}, {"filename": "../figure/image/969-Table9-1.png", "caption": "Table 9: Performance of CoreNLP and our model’s attention mechanism compared to human assessment (%). Examples with ≥1 noun in context sentence.", "page": 7, "bbox": {"x1": 349.91999999999996, "x2": 483.35999999999996, "y1": 390.71999999999997, "y2": 447.35999999999996}}, {"filename": "../figure/image/969-Table1-1.png", "caption": "Table 1: Automatic evaluation: BLEU. Significant differences at p < 0.01 are in bold.", "page": 3, "bbox": {"x1": 310.56, "x2": 522.24, "y1": 62.879999999999995, "y2": 145.92}}, {"filename": "../figure/image/969-Table2-1.png", "caption": "Table 2: Top-10 words with the highest average attention to context words. attn gives an average attention to context words, pos gives an average position of the source word. Left part is for words on all positions, right — for words on positions higher than first.", "page": 4, "bbox": {"x1": 314.88, "x2": 517.4399999999999, "y1": 62.879999999999995, "y2": 213.12}}]}