{"title": "Exploring the leading authors and journals in major topics by citation sentences and topic modeling", "abstract": "Citation plays an important role in understanding the knowledge sharing among scholars. Citation sentences embed useful contents that signify the influence of cited authors on shared ideas, and express own opinion of citing authors to others' articles. The purpose of the study is to provide a new lens to analyze the topical relationship embedded in the citation sentences in an integrated manner. To this end, we extract citation sentences from full-text articles in the field of Oncology. In addition, we adopt Author-Journal-Topic (AJT) model to take both authors and journals into consideration of topic analysis. For the study, we collect the 6,360 full-text articles from PubMed Central and select the top 15 journals on Oncology. By applying AJT model, we identify what the major topics are shared among researchers in Oncology and which authors and journal lead the idea exchange in sub-disciplines of Oncology.", "text": [{"id": 0, "string": "Introduction As the size of data on the web continues to increase in an exponential manner, finding valuable meaning between data becomes of paramount importance in many research areas."}, {"id": 1, "string": "In the information science field, citations are challenging, pivotal materials to discover the relationship between academic documents because citations present the description of authors' ideas and the hidden relationship between authors and documents."}, {"id": 2, "string": "The earliest works focused mainly on classifying the citation behaviors and discovering the citation reasons with limited data such as the location of citation sentences and the number of references [1, 2] ."}, {"id": 3, "string": "Since the mid-1990s, with the development of computer technology, citation content analysis was elaborated by applying data analysis techniques like text-mining or natural language processing."}, {"id": 4, "string": "Zhang et al."}, {"id": 5, "string": "[3] present citation analysis based on sematic and syntactic approaches."}, {"id": 6, "string": "Semantic-based citation analysis is performed by qualitative analysis to discover the citation motivation and citation classification."}, {"id": 7, "string": "On the other hand, syntactic-based citation analysis can be conducted by citation location and citation frequency, which reveals the hidden relation of authors by using meta-data of documents such as journal, venue of publication, affiliation of authors, etc."}, {"id": 8, "string": "Following their study, Ding et al."}, {"id": 9, "string": "[4] propose a theoretical methodology through content citation analysis."}, {"id": 10, "string": "However, these analyses are somewhat limited to the explicit context that primarily represents their own ideas and arguments."}, {"id": 11, "string": "The main goal of the paper is to discover the implicit topical relationships buried in citation sentences by utilizing the citation information from the author's perspective of sharing other authors' point of view."}, {"id": 12, "string": "Implicitness of the topical relationship is realized by using citation sentences as the input for the topic modeling technique."}, {"id": 13, "string": "In this study, a citation sentence indicates the sentence including citation expression consisting of year and author of the cited work."}, {"id": 14, "string": "In general, the citation sentence contains brief content of cited work and opinion that the author of citing work on the cited work."}, {"id": 15, "string": "We claim that citation sentences reveal interesting characteristics of scholarly communication such as influence, idea exchange, justification for citer's arguments, etc."}, {"id": 16, "string": "We assume that using citation sentences for topic analysis reveals aforementioned characteristics."}, {"id": 17, "string": "To explore such intellectual space created by citation sentences, we take both authors and journals into consideration of topic analysis."}, {"id": 18, "string": "To this end, we applied Author-Conference-Topic (ACT) model proposed by Tang et al."}, {"id": 19, "string": "[5] for our topic analysis in relation with both authors and journals, which is called Author-Journal-Topic (AJT) topic model."}, {"id": 20, "string": "ACT model is a probabilistic topic model for simultaneously extracting topics of papers, authors, and conferences."}, {"id": 21, "string": "There are a few studies to analyze content of citation sentences."}, {"id": 22, "string": "Most of previous studies focus on how the topic of document influences citation and vice versa [6, 7, 8] using Topic Modeling."}, {"id": 23, "string": "Kataria, Mitra, and Bhatia [8] adapt citation to Author-Topic model [9] with the assumption that the context surrounding the citation anchor could be used to get topical information about the cited authors."}, {"id": 24, "string": "These studies including Tang et al."}, {"id": 25, "string": "[10] 's ACT model are the examples of combining topic modelling methods and citation content analysis."}, {"id": 26, "string": "However, most previous studies used metadata of documents."}, {"id": 27, "string": "In this work, we focus on identifying the landscape of the oncology field from a perspective of citation."}, {"id": 28, "string": "By using citation sentences, our results can indicate which authors are actively cited and which journals lead a certain topic."}, {"id": 29, "string": "The rest of the paper is organized as follows: Section 2 describes the proposed approach."}, {"id": 30, "string": "Section 3 analyzes the topic modeling results."}, {"id": 31, "string": "Section 4 concludes the paper with the future work."}, {"id": 32, "string": "Methodology Main idea The basic assumption of the proposed approach is that citation sentences embed useful contents signifying the influence of cited authors on shared ideas of citing authors."}, {"id": 33, "string": "Citation sentences are also considered as an invisible intellectual place for idea exchanging since citations are effective means of supporting and expressing their own arguments by using other works."}, {"id": 34, "string": "In the similar vein, Di Marco and Mercer [11] claim that citation sentences play a major role in creating the relationship among relevant authors within the similar research fields."}, {"id": 35, "string": "With these assumptions, we are to explore the implicitness of topic relationships resided in citation sentences from the integrated perspective by incorporating the citing authors and journal titles into interpreting the topical relationships."}, {"id": 36, "string": "As shown in Figure 1 , we utilized various features including citing authors, citing sentences and journal titles for topic analysis."}, {"id": 37, "string": "Authors in Figure 1 mean the citing authors who write a paper and who cite other's work."}, {"id": 38, "string": "Citation sentences are the sentences written by the authors when they cite other's work in the paper, and journal titles are the journal names publishing the citing authors' paper."}, {"id": 39, "string": "By employing AJT model with these three parameters , we can discover which topics are the most salient ones referred to frequently by researchers and who are the leading authors sharing other authors' ideas in the research field and which journal leads such endeavor."}, {"id": 40, "string": "Fig."}, {"id": 41, "string": "1."}, {"id": 42, "string": "Three parameters for AJT model Data collection For this study, we compile the dataset on the field of Oncology from PubMed Central that provides the full-text in the biomedical field."}, {"id": 43, "string": "We select top 15 journals of Oncology by Thomson Reuter's JCR and journal's impact factor, and from these 15 journals, we are able to collect 6,360 full-text articles."}, {"id": 44, "string": "Figure 2 describes the workflow of our study."}, {"id": 45, "string": "As mentioned earlier, with the fulltext articles collected from PubMed Central, we extract the citation sentences."}, {"id": 46, "string": "Most citation sentences are kept in the following format: (author, year), (reference number) [reference number]."}, {"id": 47, "string": "An example of such format is \"(<xref rid=\"bib00\" ref-type=\"bibr\">Author name, 2000</xref>)\"."}, {"id": 48, "string": "We use the regular expression technique to parse and extract the citation sentences, when the tag <xref rid=>, </xref> appears on the sentences after parsing XML records with the Java-based SAX parser."}, {"id": 49, "string": "Method Fig."}, {"id": 50, "string": "2."}, {"id": 51, "string": "Workflow We also parse other metadata for AJT model such as the name of authors and journal titles."}, {"id": 52, "string": "The author tags, <surname> </surname> and <given-names></given-names> inside the <contrib-gourp></contrib-group>, denote the list of authors who wrote the paper."}, {"id": 53, "string": "For journal, we extract the titles when the journal tags, <journal-title> and </journal-title>, are included in the tag of <journal-meta> and </journal-meta>."}, {"id": 54, "string": "We also preprocess extracted sentences by removing both functional and general words and applying the Porter's stemming algorithm to improve the input for AJT Model."}, {"id": 55, "string": "AJT Model For our study, we apply ACT [10] model with several metadata such as citation sentences, journal titles and citing authors to develop AJT model."}, {"id": 56, "string": "Our AJT model utilizes journal titles and citation sentences instead of conference and abstract on documents."}, {"id": 57, "string": "The change of model is needed to analyze most influential topics in Oncology and to find leading authors who frequently mention the active topics and to detect the journals involved in such topics."}, {"id": 58, "string": "Figure 1 , Table 1) Like ACT model, AJT model assumes that each citing author is related to distribution over topics and each word in citation sentences is derived from a topic."}, {"id": 59, "string": "In the AJT model, the journal titles are related to each word."}, {"id": 60, "string": "To determine a word (ω_Si) in citation sentences (S), citing authors (x_Si) are consider for a word."}, {"id": 61, "string": "Each citing author is associated with a distributed topic."}, {"id": 62, "string": "A topic is generated from the citing author-topic distribution."}, {"id": 63, "string": "The words and journal titles are generated from a specific topic."}, {"id": 64, "string": "AJT model presents (1) 3 Results and Analyses For AJT model, we set the number of topics to 15 and finally select 8 topics as major topics."}, {"id": 65, "string": "Since we discovered that there are similar topics on our results, we calculated the similarity between 15 topics to select the most representative topics."}, {"id": 66, "string": "The topical similarities are measured by each word on topics and we calculated the similarities of two topics where each topic are represented in an array of a term vector."}, {"id": 67, "string": "Through this process, we chose 8 topics which have high topical similarities (over 0.5)."}, {"id": 68, "string": "Each topic presents top 5 words from topic-word distribution, and 5 most related authors and journal titles are displayed along with each topic."}, {"id": 69, "string": "By performing several times on the pilot studies, we decided to choose top 5 words which are quite appropriate to describe each topics."}, {"id": 70, "string": "The results of AJT-based topic modeling is shown in Table 1 ."}, {"id": 71, "string": "We label topic 1 \"breast cancer\" whose top words include breast, expression women, and growth."}, {"id": 72, "string": "Since the dataset is compiled with citation sentences, it implies that the topic \"breast cancer\" is a popular topic where researchers share and exchange ideas and facts related to breast cancer."}, {"id": 73, "string": "In relation to the topic \"breast cancer\", the active authors of breast cancer are Johnston Stephen RD, Colditz Graham A, and Sternlicht Mark D, and they share ideas with others on breast cancer from our results."}, {"id": 74, "string": "In terms of journals that provide a common place for idea sharing and communication, the journal \"Breast Cancer Research\" is the top journal of topic 1, and its impact factor is 5.49."}, {"id": 75, "string": "Authors such as Kurzrock Razelle, and Axelrod Haley in group 4 are the leading researchers sharing ideas on the topic \"targeted therapy.\""}, {"id": 76, "string": "The topic 4 is associated with the targeted therapy represented by words like mutations, treatments, therapy and disease."}, {"id": 77, "string": "The two most influential journals in topic 4 are \"Oncotarget\" and \"Journal of Thoracic Oncology\" whose impact factors are 6.36 and 5.28 respectively, which indicates that these two journals are the major journals encouraging authors to share ideas and collaborate with each other on cancer targeted therapy subject area."}, {"id": 78, "string": "Authors like Zitgel Laurence, Galluzzi Lorenzo, and Kroemer Guido in the author group 7 are the ones that actively share ideas about the topic \"Cancer Immunology.\""}, {"id": 79, "string": "Top concepts that are related to this topic are cell, immune, clinical and antitumor."}, {"id": 80, "string": "The top journal of the topic \"Cancer Immunology\" is Oncoinmmunology whose impact factor is 6.266."}, {"id": 81, "string": "Romagnani Paola and Salem Husein K in topic 8 \"Stem Cell\" are the authors that communicate and share ideas actively with each other in the given field, and the journal \"Stem Cells\" (impact factor: 6.523) is the leading journal."}, {"id": 82, "string": "We visualize topic keywords obtained from results of AJT-based topic model."}, {"id": 83, "string": "We construct the co-occurrence network and analyze which topic words play an important role in this domain."}, {"id": 84, "string": "Each node in the network represents a topic word, and an edge represents a co-occurrence frequency between keywords."}, {"id": 85, "string": "The size of nodes represents degree centrality and the color means network clusters obtained by using modularity algorithm."}, {"id": 86, "string": "This network consists of 100 nodes and 1,436 edges."}, {"id": 87, "string": "As shown in Figure 4 , each topic belongs to a specific community, but shares some important topic keywords."}, {"id": 88, "string": "Especially, the topic words positioned at the center is represented core-keywords in Oncology."}, {"id": 89, "string": "Figure 4 indicates that these words are the essential concepts of the Oncology domain."}, {"id": 90, "string": "Along with the results of AJT-based topic models, we can infer the major journals and authors develop their own research area based on these core-concepts."}, {"id": 91, "string": "Fig."}, {"id": 92, "string": "4."}, {"id": 93, "string": "Network of topic keywords The above results imply that the proposed approach identifies which topics are frequently shared, who facilitates to exchange ideas, and which journals provide a placeholder for it."}, {"id": 94, "string": "Identification of the triple relationship among authors, journals, and topics sheds new insight on understanding the well-discussed topics driven by the leading journals and authors that play a mediator role in the development of Oncology."}, {"id": 95, "string": "Conclusion One of the major research problems in bibliometrics is how to map out the intellectual structure of a research field."}, {"id": 96, "string": "The proposed approach tackles such research problem by utilizing citation sentences and AJT model."}, {"id": 97, "string": "By using citation sentences as the input for AJT model to find latent meaning, AJT model suggests a new way to detect leading authors and journals in sub-disciplines represented by discovered topics in a certain field."}, {"id": 98, "string": "Achieving this is not feasible by traditional frequency-based citation analysis."}, {"id": 99, "string": "One of the interesting observations is that the top-ranked journals in the discovered topics derived from AJT model are not ranked top in terms of JCR."}, {"id": 100, "string": "For example, the \"Oncotarget\" journal is the top-ranked journal in three topics in our analysis, but the ranking of the journal is 20 according to JCR."}, {"id": 101, "string": "Since we only report on preliminary results of our approach, we undertake in-depth analysis to investigate why this difference exists."}, {"id": 102, "string": "We also conduct various statistical tests on the results."}, {"id": 103, "string": "Based on the reported results in this paper, though, we claim that AJT can be used for discovering latent meaning associated citation sentences and the major players leading the field."}, {"id": 104, "string": "As a follow-up study, we will conduct a comparative study that compares the proposed approach with the general topic modeling technique such as LDA."}, {"id": 105, "string": "We also plan to investigate whether there is a different impact of using citation sentences and general meta-data such as abstract and title for topic analysis on facilitating idea sharing and scholarly communication."}, {"id": 106, "string": "In addition, we would like to consider the window size of citation sentences enriching citation context and to discover the authors' relationships among the neighboring citation sentences."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 31}, {"section": "Main idea", "n": "2.1", "start": 32, "end": 41}, {"section": "Data collection", "n": "2.2", "start": 42, "end": 54}, {"section": "AJT Model", "n": "2.4", "start": 55, "end": 94}, {"section": "Conclusion", "n": "4", "start": 95, "end": 106}], "figures": [{"filename": "../figure/image/971-Figure1-1.png", "caption": "Fig. 1. Three parameters for AJT model", "page": 2, "bbox": {"x1": 124.8, "x2": 471.35999999999996, "y1": 278.88, "y2": 376.32}}, {"filename": "../figure/image/971-Figure2-1.png", "caption": "Fig. 2. Workflow", "page": 2, "bbox": {"x1": 124.32, "x2": 468.47999999999996, "y1": 499.68, "y2": 610.0799999999999}}, {"filename": "../figure/image/971-Table1-1.png", "caption": "Table 1. The Results of AJT-based Topic Modeling in Oncology", "page": 4, "bbox": {"x1": 122.88, "x2": 471.35999999999996, "y1": 610.56, "y2": 685.92}}, {"filename": "../figure/image/971-Figure3-1.png", "caption": "Fig. 3. Graphical representation and Notions of AJT model, which applies ACT model (Applied Tang, J., Jin, R., & Zhang, J., 2008, p.1056, Figure 1, Table 1)", "page": 3, "bbox": {"x1": 123.83999999999999, "x2": 471.35999999999996, "y1": 388.8, "y2": 510.24}}, {"filename": "../figure/image/971-Figure4-1.png", "caption": "Fig. 4. Network of topic keywords", "page": 6, "bbox": {"x1": 126.72, "x2": 468.47999999999996, "y1": 236.64, "y2": 512.16}}]}