{"title": "Deep Dyna-Q: Integrating Planning for Task-Completion Dialogue Policy Learning", "abstract": "Training a task-completion dialogue agent via reinforcement learning (RL) is costly because it requires many interactions with real users. One common alternative is to use a user simulator. However, a user simulator usually lacks the language complexity of human interlocutors and the biases in its design may tend to degrade the agent. To address these issues, we present Deep Dyna-Q, which to our knowledge is the first deep RL framework that integrates planning for task-completion dialogue policy learning. We incorporate into the dialogue agent a model of the environment, referred to as the world model, to mimic real user response and generate simulated experience. During dialogue policy learning, the world model is constantly updated with real user experience to approach real user behavior, and in turn, the dialogue agent is optimized using both real experience and simulated experience. The effectiveness of our approach is demonstrated on a movie-ticket booking task in both simulated and human-in-theloop settings 1 .", "text": [{"id": 0, "string": "Introduction Learning policies for task-completion dialogue is often formulated as a reinforcement learning (RL) problem (Young et al., 2013; Levin et al., 1997) ."}, {"id": 1, "string": "However, applying RL to real-world dialogue systems can be challenging, due to the constraint that an RL learner needs an environment to operate in."}, {"id": 2, "string": "In the dialogue setting, this requires a dialogue agent to interact with real users and adjust its policy in an online fashion, as illustrated in Figure 1(a) ."}, {"id": 3, "string": "Unlike simulation-based games such as Atari games (Mnih et al., 2015) and AlphaGo (Silver et al., 2016a (Silver et al., , 2017 where RL has made its greatest strides, task-completion dialogue systems may incur significant real-world cost in case of failure."}, {"id": 4, "string": "Thus, except for very simple tasks (Singh et al., 2002; Gašić et al., 2010 Gašić et al., , 2011 Pietquin et al., 2011; Li et al., 2016a; Su et al., 2016b) , RL is too expensive to be applied to real users to train dialogue agents from scratch."}, {"id": 5, "string": "One strategy is to convert human-interacting dialogue to a simulation problem (similar to Atari games), by building a user simulator using human conversational data (Schatzmann et al., 2007; Li et al., 2016b) ."}, {"id": 6, "string": "In this way, the dialogue agent can learn its policy by interacting with the simulator instead of real users (Figure 1(b) )."}, {"id": 7, "string": "The simulator, in theory, does not incur any real-world cost and can provide unlimited simulated experience for reinforcement learning."}, {"id": 8, "string": "The dialogue agent trained with such a user simulator can then be deployed to real users and further enhanced by only a small number of human interactions."}, {"id": 9, "string": "Most of recent studies in this area have adopted this strategy (Su et al., 2016a; Lipton et al., 2016; Zhao and Eskenazi, 2016; Williams et al., 2017; Dhingra et al., 2017; Liu and Lane, 2017; Peng et al., 2017b; Budzianowski et al., 2017; Peng et al., 2017a) ."}, {"id": 10, "string": "However, user simulators usually lack the conversational complexity of human interlocutors, and the trained agent is inevitably affected by biases in the design of the simulator."}, {"id": 11, "string": "Dhingra et al."}, {"id": 12, "string": "(2017) demonstrated a significant discrepancy in a simulator-trained dialogue agent when evaluated with simulators and with real users."}, {"id": 13, "string": "Even more challenging is the fact that there is no universally accepted metric to evaluate a user simulator (Pietquin and Hastie, 2013 Figure 1 : Three strategies of learning task-completion dialogue policies via RL."}, {"id": 14, "string": "controversial whether training task-completion dialogue agent via simulated users is a valid approach."}, {"id": 15, "string": "We propose a new strategy of learning dialogue policy by interacting with real users."}, {"id": 16, "string": "Compared to previous works (Singh et al., 2002; Li et al., 2016a; Su et al., 2016b; Papangelis, 2012) , our dialogue agent learns in a much more efficient way, using only a small number of real user interactions, which amounts to an affordable cost in many nontrivial dialogue tasks."}, {"id": 17, "string": "Our approach is based on the Dyna-Q framework (Sutton, 1990) where planning is integrated into policy learning for task-completion dialogue."}, {"id": 18, "string": "Specifically, we incorporate a model of the environment, referred to as the world model, into the dialogue agent, which simulates the environment and generates simulated user experience."}, {"id": 19, "string": "During the dialogue policy learning, real user experience plays two pivotal roles: first, it can be used to improve the world model and make it behave more like real users, via supervised learning; second, it can also be used to directly improve the dialogue policy via RL."}, {"id": 20, "string": "The former is referred to as world model learning, and the latter direct reinforcement learning."}, {"id": 21, "string": "Dialogue policy can be improved either using real experience directly (i.e., direct reinforcement learning) or via the world model indirectly (referred to as planning or indirect reinforcement learning)."}, {"id": 22, "string": "The interaction between world model learning, direct reinforcement learning and planning is illustrated in Figure 1 (c), following the Dyna-Q framework (Sutton, 1990) ."}, {"id": 23, "string": "The original papers on Dyna-Q and most its early extensions used tabular methods for both planning and learning (Singh, 1992; Peng and Williams, 1993; Moore and Atkeson, 1993; Kuvayev and Sutton, 1996) ."}, {"id": 24, "string": "This table-lookup representation limits its application to small problems only."}, {"id": 25, "string": "Sutton et al."}, {"id": 26, "string": "(2012) extends the Dyna architecture to linear function approximation, making it applicable to larger problems."}, {"id": 27, "string": "In the dialogue setting, we are dealing with a much larger action-state space."}, {"id": 28, "string": "Inspired by Mnih et al."}, {"id": 29, "string": "(2015) , we propose Deep Dyna-Q (DDQ) by combining Dyna-Q with deep learning approaches to representing the state-action space by neural networks (NN)."}, {"id": 30, "string": "By employing the world model for planning, the DDQ method can be viewed as a model-based RL approach, which has drawn growing interest in the research community."}, {"id": 31, "string": "However, most model-based RL methods (Tamar et al., 2016; Silver et al., 2016b; Gu et al., 2016; Racanière et al., 2017) are developed for simulation-based, synthetic problems (e.g., games), but not for human-in-the-loop, real-world problems."}, {"id": 32, "string": "To these ends, our main contributions in this work are two-fold: • We present Deep Dyna-Q, which to the best of our knowledge is the first deep RL framework that incorporates planning for taskcompletion dialogue policy learning."}, {"id": 33, "string": "• We demonstrate that a task-completion dialogue agent can efficiently adapt its policy on the fly, by interacting with real users via RL."}, {"id": 34, "string": "This results in a significant improvement in success rate on a nontrivial task."}, {"id": 35, "string": "the next action 2 based on the current state; (4) a model-based natural language generation (NLG) module for converting dialogue actions to natural language response (Wen et al."}, {"id": 36, "string": "); and (5) a world model for generating simulated user actions and simulated rewards."}, {"id": 37, "string": "As illustrated in Figure 1 (c), starting with an initial dialogue policy and an initial world model (both trained with pre-collected human conversational data), the training of the DDQ agent consists of three processes: (1) direct reinforcement learning, where the agent interacts with a real user, collects real experience and improves the dialogue policy; (2) world model learning, where the world model is learned and refined using real experience; and (3) planning, where the agent improves the dialogue policy using simulated experience."}, {"id": 38, "string": "Although these three processes conceptually can occur simultaneously in the DDQ agent, we implement an iterative training procedure, as shown in Algorithm 1, where we specify the order in which they occur within each iteration."}, {"id": 39, "string": "In what follows, we will describe these processes in details."}, {"id": 40, "string": "Direct Reinforcement Learning In this process (lines 5-18 in Algorithm 1) we use the DQN method (Mnih et al., 2015) to improve the dialogue policy based on real experience."}, {"id": 41, "string": "We consider task-completion dialogue as a Markov Decision Process (MDP), where the agent inter-acts with a user in a sequence of actions to accomplish a user goal."}, {"id": 42, "string": "In each step, the agent observes the dialogue state s, and chooses the action a to execute, using an -greedy policy that selects a random action with probability or otherwise follows the greedy policy a = argmax a Q(s, a ; θ Q )."}, {"id": 43, "string": "Q(s, a; θ Q ) which is the approximated value function, implemented as a Multi-Layer Perceptron (MLP) parameterized by θ Q ."}, {"id": 44, "string": "The agent then receives reward 3 r, observes next user response a u , and updates the state to s ."}, {"id": 45, "string": "Finally, we store the experience (s, a, r, a u , s ) in the replay buffer D u ."}, {"id": 46, "string": "The cycle continues until the dialogue terminates."}, {"id": 47, "string": "We improve the value function Q(s, a; θ Q ) by adjusting θ Q to minimize the mean-squared loss function, defined as follows: L(θ Q ) = E (s,a,r,s )∼D u [(y i − Q(s, a; θ Q )) 2 ] y i = r + γ max a Q (s , a ; θ Q ) (1) where γ ∈ [0, 1] is a discount factor, and Q (.)"}, {"id": 48, "string": "is the target value function that is only periodically updated (line 42 in Algorithm 1)."}, {"id": 49, "string": "By differentiating the loss function with respect to θ Q , we arrive at the following gradient: ∇ θ Q L(θ Q ) = E (s,a,r,s )∼D u [(r+ γ max a Q (s , a ; θ Q ) − Q(s, a; θ Q )) ∇ θ Q Q(s, a; θ Q )] (2) As shown in lines 16-17 in Algorithm 1, in each iteration, we improve Q(.)"}, {"id": 50, "string": "using minibatch Deep Q-learning."}, {"id": 51, "string": "Planning In the planning process (lines 23-41 in Algorithm 1), the world model is employed to generate simulated experience that can be used to improve dialogue policy."}, {"id": 52, "string": "K in line 24 is the number of planning steps that the agent performs per step of direct reinforcement learning."}, {"id": 53, "string": "If the world model is able to accurately simulate the environment, a big K can be used to speed up the policy learning."}, {"id": 54, "string": "In DDQ, we use two replay buffers, D u for storing real experience and D s for simulated experience."}, {"id": 55, "string": "Learning and planning are accomplished Algorithm 1 Deep Dyna-Q for Dialogue Policy Learning Require: N , , K, L, C, Z Ensure: Q(s, a; θQ), M (s, a; θM ) 1: initialize Q(s, a; θQ) and M (s, a; θM ) via pre-training on human conversational data 2: initialize Q (s, a; θ Q ) with θ Q = θQ 3: initialize real experience replay buffer D u using Reply Buffer Spiking (RBS), and simulated experience replay buffer D s as empty 4: for n=1:N do 5: # Direct Reinforcement Learning starts 6: user starts a dialogue with user action a u 7: generate an initial dialogue state s 8: while s is not a terminal state do 9: with probability select a random action a 10: otherwise select a = argmax a Q(s, a ; θQ) 11: execute a, and observe user response a u and reward r 12: update dialogue state to s 13: store (s, a, r, a u , s ) to D u 14: s = s 15: end while 16: sample random minibatches of (s, a, r, s ) from D u 17: update θQ via Z-step minibatch Q-learning according to Equation (2)  18: # Direct Reinforcement Learning ends 19: # World Model Learning starts 20: sample random minibatches of training samples (s, a, r, a u , s ) from D u 21: update θM via Z-step minibatch SGD of multi-task learning 22: # World Model Learning ends 23: # Planning starts 24: for k=1:K do 25: t = FALSE, l = 0 26: sample a user goal G 27: sample user action a u from G 28: generate an initial dialogue state s 29: while t is FALSE ∧ l ≤ L do 30: with probability select a random action a 31: otherwise select a = argmax a Q(s, a ; θQ) 32: execute a 33: world model responds with a u , r and t 34: update dialogue state to s 35: store (s, a, r, s ) to D s 36: l = l + 1, s = s 37: end while 38: sample random minibatches of (s, a, r, s ) from D s 39: update θQ via Z-step minibatch Q-learning according to Equation (2)  40 : end for 41: # Planning ends 42: every C steps reset θ Q = θQ 43: end for by the same DQN algorithm, operating on real experience in D u for learning and on simulated experience in D s for planning."}, {"id": 56, "string": "Thus, here we only describe the way the simulated experience is generated."}, {"id": 57, "string": "Similar to Schatzmann et al."}, {"id": 58, "string": "(2007) , at the beginning of each dialogue, we uniformly draw a user goal G = (C, R), where C is a set of con-straints and R is a set of requests (line 26 in Algorithm 1)."}, {"id": 59, "string": "For movie-ticket booking dialogues, constraints are typically the name and the date of the movie, the number of tickets to buy, etc."}, {"id": 60, "string": "Requests can contain these slots as well as the location of the theater, its start time, etc."}, {"id": 61, "string": "Table 3 presents some sampled user goals and dialogues generated by simulated and real users, respectively."}, {"id": 62, "string": "The first user action a u (line 27) can be either a request or an inform dialogueact."}, {"id": 63, "string": "A request, such as request(theater; moviename=batman), consists of a request slot and multiple ( 1) constraint slots, uniformly sampled from R and C, respectively."}, {"id": 64, "string": "An inform contains constraint slots only."}, {"id": 65, "string": "The user action can also be converted to natural language via NLG, e.g., \"which theater will show batman?\""}, {"id": 66, "string": "In each dialogue turn, the world model takes as input the current dialogue state s and the last agent action a (represented as an one-hot vector), and generates user response a u , reward r, and a binary variable t, which indicates whether the dialogue terminates (line 33)."}, {"id": 67, "string": "The generation is accomplished using the world model M (s, a; θ M ), a MLP shown in Figure 3 , as follows: h = tanh(W h (s, a) + b h ) r = W r h + b r a u = softmax(W a h + b a ) t = sigmoid(W t h + b t ) where (s, a) is the concatenation of s and a, and W and b are parameter matrices and vectors, respectively."}, {"id": 68, "string": "Task-Specific Representation s: state a: agent action a u r t Shared layers Figure 3: The world model architecture."}, {"id": 69, "string": "World Model Learning In this process (lines 19-22 in Algorithm 1), M (s, a; θ M ) is refined via minibatch SGD using real experience in the replay buffer D u ."}, {"id": 70, "string": "As shown in Figure 3 , M (s, a; θ M ) is a multi-task neural network (Liu et al., 2015) that combines two classification tasks of simulating a u and t, respectively, and one regression task of simulating r. The lower layers are shared across all tasks, while the top layers are task-specific."}, {"id": 71, "string": "Experiments and Results We evaluate the DDQ method on a movie-ticket booking task in both simulation and human-in-theloop settings."}, {"id": 72, "string": "Dataset Raw conversational data in the movie-ticket booking scenario was collected via Amazon Mechanical Turk."}, {"id": 73, "string": "The dataset has been manually labeled based on a schema defined by domain experts, as shown in Table 4 , which consists of 11 dialogue acts and 16 slots."}, {"id": 74, "string": "In total, the dataset contains 280 annotated dialogues, the average length of which is approximately 11 turns."}, {"id": 75, "string": "Dialogue Agents for Comparison To benchmark the performance of DDQ, we have developed different versions of task-completion dialogue agents, using variations of Algorithm • The DQN(K) agents are learned by DQN, but with K times more real experiences than the DQN agent."}, {"id": 76, "string": "DQN(K) is evaluated in the simulation setting only."}, {"id": 77, "string": "Its performance can be viewed as the upper bound of its DDQ(K) counterpart, assuming that the world model in DDQ(K) perfectly matches real users."}, {"id": 78, "string": "Implementation Details All the models in these agents (Q(s, a; θ Q ), M (s, a; θ M )) are MLPs with tanh activations."}, {"id": 79, "string": "Each policy network Q(.)"}, {"id": 80, "string": "has one hidden layer with 80 hidden nodes."}, {"id": 81, "string": "As shown in Figure 3 , the world model M (.)"}, {"id": 82, "string": "contains two shared hidden layers and three task-specific hidden layers, with 80 nodes in each."}, {"id": 83, "string": "All the agents are trained by Algorithm 1 with the same set of hyper-parameters."}, {"id": 84, "string": "-greedy is always applied for exploration."}, {"id": 85, "string": "We set the discount factor γ = 0.95."}, {"id": 86, "string": "The buffer sizes of both D u and D s are set to 5000."}, {"id": 87, "string": "The target value function is updated at the end of each epoch."}, {"id": 88, "string": "In each epoch, Q(.)"}, {"id": 89, "string": "and M (.)"}, {"id": 90, "string": "are refined using one-step (Z = 1) 16-tupleminibatch update."}, {"id": 91, "string": "4 In planning, the maximum length of a simulated dialogue is 40 (L = 40)."}, {"id": 92, "string": "In addition, to make the dialogue training efficient, we also applied a variant of imitation learning, called Reply Buffer Spiking (RBS) (Lipton et al., 2016) ."}, {"id": 93, "string": "We built a naive but occasionally successful rule-based agent based on human conversational dataset (line 1 in Algorithm 1), and prefilled the real experience replay buffer D u with 100 dialogues of experience (line 2) before training for all the variants of agents."}, {"id": 94, "string": "Simulated User Evaluation In this setting the dialogue agents are optimized by interacting with user simulators, instead of real users."}, {"id": 95, "string": "Thus, the world model is learned to mimic user simulators."}, {"id": 96, "string": "Although the simulator-trained agents are sub-optimal when applied to real users due to the discrepancy between simulators and real users, the simulation setting allows us to perform a detailed analysis of DDQ without much cost and to reproduce the experimental results easily."}, {"id": 97, "string": "4 We found in our experiments that setting Z > 1 improves the performance of all agents, but does not change the conclusion of this study: DDQ consistently outperforms DQN by a statistically significant margin."}, {"id": 98, "string": "Conceptually, the optimal value of Z used in planning is different from that in direct reinforcement learning, and should vary according to the quality of the world model."}, {"id": 99, "string": "The better the world model is, the more aggressive update (thus bigger Z) is being used in planning."}, {"id": 100, "string": "We leave it to future work to investigate how to optimize Z for planning in DDQ."}, {"id": 101, "string": "User Simulator We adapted a publicly available user simulator (Li et al., 2016b) to the taskcompletion dialogue setting."}, {"id": 102, "string": "During training, the simulator provides the agent with a simulated user response in each dialogue turn and a reward signal at the end of the dialogue."}, {"id": 103, "string": "A dialogue is considered successful only when a movie ticket is booked successfully and when the information provided by the agent satisfies all the user's constraints."}, {"id": 104, "string": "At the end of each dialogue, the agent receives a positive reward of 2 * L for success, or a negative reward of −L for failure, where L is the maximum number of turns in each dialogue, and is set to 40 in our experiments."}, {"id": 105, "string": "Furthermore, in each turn, the agent receives a reward of −1, so that shorter dialogues are encouraged."}, {"id": 106, "string": "Readers can refer to Appendix B for details on the user simulator."}, {"id": 107, "string": "Results The main simulation results are reported in Table 1 and Figures 4 and 5."}, {"id": 108, "string": "For each agent, we report its results in terms of success rate, average reward, and average number of turns (averaged over 5 repetitions of the experiments)."}, {"id": 109, "string": "Results show that the DDQ agents consistently outperform DQN with a statistically significant margin."}, {"id": 110, "string": "Figure 4 shows the learning curves of different DDQ agents trained using different planning steps."}, {"id": 111, "string": "Since the training of all RL agents started with RBS using the same rule-based agent, their performance in the first few epochs is very close."}, {"id": 112, "string": "After that, performance improved for all values of K, but much more rapidly for larger values."}, {"id": 113, "string": "and DDQ(10) took only 50 epochs."}, {"id": 114, "string": "Intuitively, the optimal value of K needs to be determined by seeking the best trade-off between the quality of the world model and the amount of simulated experience that is useful for improving the dialogue agent."}, {"id": 115, "string": "This is a non-trivial optimization problem because both the dialogue agent and the world model are updated constantly during training and the optimal K needs to be adjusted accordingly."}, {"id": 116, "string": "For example, we find in our experiments that at the early stages of training, it is fine to perform planning aggressively by using large amounts of simulated experience even though they are of low quality, but in the late stages of training where the dialogue agent has been significantly improved, low-quality simulated experience is likely to hurt the performance."}, {"id": 117, "string": "Thus, in our implementation of Algorithm 1, we use a heuristic 5 to reduce the value of K in the late stages of training (e.g., after 150 epochs in Figure 4 ) to mitigate the negative impact of low-qualify simulated experience."}, {"id": 118, "string": "We leave it to future work how to optimize the planning step size during DDQ training in a principled way."}, {"id": 119, "string": "Figure 5 shows that the quality of the world model has a significant impact on the agent's performance."}, {"id": 120, "string": "The learning curve of DQN(10) indicates the best performance we can expect with a perfect world model."}, {"id": 121, "string": "With a pre-trained world model, the performance of the DDQ agent improves more rapidly, although eventually, the DDQ and DDQ(rand-init θ M ) agents reach the same success rate after many epochs."}, {"id": 122, "string": "The world model learning process is crucial to both the efficiency of dialogue policy learning and the final performance of the agent."}, {"id": 123, "string": "For example, in the early stages (before 60 epochs), the performances of DDQ and DDQ(fixed θ M ) remain very close to each other, but DDQ reaches a success rate almost 5 The heuristic is not presented in Algorithm 1."}, {"id": 124, "string": "Readers can refer to the released source code for details."}, {"id": 125, "string": "10% better than DDQ(fixed θ M ) after 400 epochs."}, {"id": 126, "string": "Human-in-the-Loop Evaluation In this setting, five dialogue agents (i.e., DQN, DDQ(10), DDQ(10, rand-init θ M ), DDQ(5), and DDQ(5, rand-init θ M )) are trained via RL by interacting with real human users."}, {"id": 127, "string": "In each dialogue session, one of the agents was randomly picked to converse with a user."}, {"id": 128, "string": "The user was presented with a user goal sampled from the corpus, and was instructed to converse with the agent to complete the task."}, {"id": 129, "string": "The user had the choice of abandoning the task and ending the dialogue at any time, if she or he believed that the dialogue was unlikely to succeed or simply because the dialogue dragged on for too many turns."}, {"id": 130, "string": "In such cases, the dialogue session is considered failed."}, {"id": 131, "string": "At the end of each session, the user was asked to give explicit feedback whether the dialogue succeeded (i.e., whether the movie tickets were booked with all the user constraints satisfied)."}, {"id": 132, "string": "Each learning curve is trained with two runs, with each run generating 150 dialogues (and K * 150 additional simulated dialogues when planning is applied)."}, {"id": 133, "string": "In total, we collected 1500 dialogue sessions for training all five agents."}, {"id": 134, "string": "The main results are presented in Table 2 and Simulation Sample Real User Sample movie-ticket booking user goal: { \"request slots\": { \"constraint slots\": { \"ticket\": \"?\""}, {"id": 135, "string": "\"numberofpeople\":\"2\" \"theater\": \"?\""}, {"id": 136, "string": "\"moviename\": \"deadpool\" \"starttime\": \"?\""}, {"id": 137, "string": "\"city\": \"seattle\" \"date\": \"?\""}, {"id": 138, "string": "} } } movie-ticket booking user goal: { \"request slots\": { \"constraint slots\": { \"ticket\": \"?\""}, {"id": 139, "string": "\"date\":\"this weekend\" \"theater\": \"?\""}, {"id": 140, "string": "\"numberofpeople\": \"1\" \"starttime\": \"?\""}, {"id": 141, "string": "\"moviename\": \"batman\" } } } Table 3 presents four example dialogues produced by two dialogue agents interacting with simulated and human users, respectively."}, {"id": 142, "string": "The DQN agent, after being trained with 100 dialogues, still behaved like a naive rule-based agent that re-quested information bit by bit in a fixed order."}, {"id": 143, "string": "When the user did not answer the request explicitly (e.g., usr: which theater is available?"}, {"id": 144, "string": "), the agent failed to respond properly."}, {"id": 145, "string": "On the other hand, with planning, the DDQ agent trained with 100 real dialogues is much more robust and can complete 50% of user tasks successfully."}, {"id": 146, "string": "• A larger K leads to more aggressive planning and better results, as shown by DDQ(10) vs. DDQ(5)."}, {"id": 147, "string": "• Pre-training world model with human con-versational data improves the learning efficiency and the agent's performance, as shown by DDQ(5) vs. DDQ(5, rand-init θ M ), and DDQ(10) vs. DDQ(10, rand-init θ M )."}, {"id": 148, "string": "Conclusion We propose a new strategy for a task-completion dialogue agent to learn its policy by interacting with real users."}, {"id": 149, "string": "Compared to previous work, our agent learns in a much more efficient way, using only a small number of real user interactions, which amounts to an affordable cost in many nontrivial domains."}, {"id": 150, "string": "Our strategy is based on the Deep Dyna-Q (DDQ) framework where planning is integrated into dialogue policy learning."}, {"id": 151, "string": "The effectiveness of DDQ is validated by human-in-theloop experiments, demonstrating that a dialogue agent can efficiently adapt its policy on the fly by interacting with real users via deep RL."}, {"id": 152, "string": "One interesting topic for future research is exploration in planning."}, {"id": 153, "string": "We need to deal with the challenge of adapting the world model in a changing environment, as exemplified by the domain extension problem (Lipton et al., 2016) ."}, {"id": 154, "string": "As pointed out by Sutton and Barto (1998) , the general problem here is a particular manifestation of the conflict between exploration and exploitation."}, {"id": 155, "string": "In a planning context, exploration means trying actions that may improve the world model, whereas exploitation means trying to behave in the optimal way given the current model."}, {"id": 156, "string": "To this end, we want the agent to explore in the environment, but not so much that the performance would be greatly degraded."}, {"id": 157, "string": "Additional Authors A Dataset Annotation Schema B User Simulator In the task-completion dialogue setting, the entire conversation is around a user goal implicitly, but the agent knows nothing about the user goal explicitly and its objective is to help the user to accomplish this goal."}, {"id": 158, "string": "Generally, the definition of user goal contains two parts: • inform slots contain a number of slot-value pairs which serve as constraints from the user."}, {"id": 159, "string": "• request slots contain a set of slots that user has no information about the values, but wants to get the values from the agent during the conversation."}, {"id": 160, "string": "ticket is a default slot which always appears in the request slots part of user goal."}, {"id": 161, "string": "To make the user goal more realistic, we add some constraints in the user goal: slots are split into two groups."}, {"id": 162, "string": "Some of slots must appear in the user goal, we called these elements as Required slots."}, {"id": 163, "string": "In the movie-booking scenario, it includes moviename, theater, starttime, date, numberofpeople; the rest slots are Optional slots, for example, theater chain, video format etc."}, {"id": 164, "string": "We generated the user goals from the labeled dataset mentioned in Section 3.1, using two mechanisms."}, {"id": 165, "string": "One mechanism is to extract all the slots (known and unknown) from the first user turns (excluding the greeting user turn) in the data, since usually the first turn contains some or all the required information from user."}, {"id": 166, "string": "The other mechanism is to extract all the slots (known and unknown) that first appear in all the user turns, and then aggregate them into one user goal."}, {"id": 167, "string": "We dump these user goals into a file as the user-goal database."}, {"id": 168, "string": "Every time when running a dialogue, we randomly sample one user goal from this user goal database."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 39}, {"section": "Direct Reinforcement Learning", "n": "2.1", "start": 40, "end": 50}, {"section": "Planning", "n": "2.2", "start": 51, "end": 67}, {"section": "World Model Learning", "n": "2.3", "start": 68, "end": 70}, {"section": "Experiments and Results", "n": "3", "start": 71, "end": 71}, {"section": "Dataset", "n": "3.1", "start": 72, "end": 74}, {"section": "Dialogue Agents for Comparison", "n": "3.2", "start": 75, "end": 93}, {"section": "Simulated User Evaluation", "n": "3.3", "start": 94, "end": 125}, {"section": "Human-in-the-Loop Evaluation", "n": "3.4", "start": 126, "end": 147}, {"section": "Conclusion", "n": "4", "start": 148, "end": 168}], "figures": [{"filename": "../figure/image/980-Table1-1.png", "caption": "Table 1: Results of different agents at training epoch = {100, 200, 300}. Each number is averaged over 5 runs, each run tested on 2000 dialogues. Excluding DQN(5) and DQN(10) which serve as the upper bounds, any two groups of success rate (except three groups: at epoch 100, DDQ(5, rand-init θM ) and DDQ(10, fixed θM ), at epoch 200, DDQ(5, rand-init θM ) and DDQ(10, rand-init θM ), at epoch 300, DQN and DDQ(10, fixed θM )) evaluated at the same epoch is statistically significant in mean with p < 0.01. (Success: success rate)", "page": 5, "bbox": {"x1": 81.6, "x2": 516.0, "y1": 72.48, "y2": 184.32}}, {"filename": "../figure/image/980-Figure4-1.png", "caption": "Figure 4: Learning curves of the DDQ(K) agents withK = 2, 5, 10, 20. The DQN agent is identical to a DDQ(K) agent with K = 0.", "page": 5, "bbox": {"x1": 79.67999999999999, "x2": 273.59999999999997, "y1": 293.28, "y2": 438.71999999999997}}, {"filename": "../figure/image/980-Figure5-1.png", "caption": "Figure 5: Learning curves of DQN, DDQ(10), DDQ(10, rand-init θM ), DDQ(10, fixed θM ), and DQN(10).", "page": 5, "bbox": {"x1": 314.88, "x2": 508.79999999999995, "y1": 293.28, "y2": 438.71999999999997}}, {"filename": "../figure/image/980-Table4-1.png", "caption": "Table 4: The data annotation schema", "page": 10, "bbox": {"x1": 306.71999999999997, "x2": 528.0, "y1": 119.52, "y2": 204.0}}, {"filename": "../figure/image/980-Figure1-1.png", "caption": "Figure 1: Three strategies of learning task-completion dialogue policies via RL.", "page": 1, "bbox": {"x1": 80.16, "x2": 520.3199999999999, "y1": 70.56, "y2": 193.44}}, {"filename": "../figure/image/980-Table2-1.png", "caption": "Table 2: The performance of different agents at training epoch = {100, 150, 200} in the human-in-theloop experiments. The difference between the results of all agent pairs evaluated at the same epoch is statistically significant (p < 0.01). (Success: success rate)", "page": 6, "bbox": {"x1": 81.6, "x2": 516.0, "y1": 72.48, "y2": 144.0}}, {"filename": "../figure/image/980-Figure6-1.png", "caption": "Figure 6: Human-in-the-loop dialogue policy learning curves in four different agents.", "page": 6, "bbox": {"x1": 314.88, "x2": 508.79999999999995, "y1": 215.51999999999998, "y2": 360.96}}, {"filename": "../figure/image/980-Figure2-1.png", "caption": "Figure 2: Illustration of the task-completion DDQ dialogue agent.", "page": 2, "bbox": {"x1": 72.0, "x2": 289.44, "y1": 62.879999999999995, "y2": 243.84}}, {"filename": "../figure/image/980-Table3-1.png", "caption": "Table 3: Two sample dialogue sessions by DQN and DDQ(10) agents trained at epoch 100: Left: simulated user experiments; Right: human-in-the-loop experiments. (agt: agent, usr: user)", "page": 7, "bbox": {"x1": 72.0, "x2": 524.16, "y1": 62.879999999999995, "y2": 544.3199999999999}}, {"filename": "../figure/image/980-Figure3-1.png", "caption": "Figure 3: The world model architecture.", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 505.44, "y1": 573.6, "y2": 729.12}}]}