{"title": "Self-Disclosure and Relationship Strength in Twitter Conversations", "abstract": "In social psychology, it is generally accepted that one discloses more of his/her personal information to someone in a strong relationship. We present a computational framework for automatically analyzing such self-disclosure behavior in Twitter conversations. Our framework uses text mining techniques to discover topics, emotions, sentiments, lexical patterns, as well as personally identifiable information (PII) and personally embarrassing information (PEI). Our preliminary results illustrate that in relationships with high relationship strength, Twitter users show significantly more frequent behaviors of self-disclosure.", "text": [{"id": 0, "string": "Introduction We often self-disclose, that is, share our emotions, personal information, and secrets, with our friends, family, coworkers, and even strangers."}, {"id": 1, "string": "Social psychologists say that the degree of self-disclosure in a relationship depends on the strength of the relationship, and strategic self-disclosure can strengthen the relationship (Duck, 2007) ."}, {"id": 2, "string": "In this paper, we study whether relationship strength has the same effect on self-disclosure of Twitter users."}, {"id": 3, "string": "To do this, we first present a method for computational analysis of self-disclosure in online conversations and show promising results."}, {"id": 4, "string": "To accommodate the largely unannotated nature of online conversation data, we take a topic-model based approach (Blei et al., 2003) for discovering latent patterns that reveal self-disclosure."}, {"id": 5, "string": "A similar approach was able to discover sentiments (Jo and Oh, 2011) and emotions (Kim et al., 2012) from user contents."}, {"id": 6, "string": "Prior work on self-disclosure for online social networks has been from communications research (Jiang et al., 2011; Humphreys et al., 2010) which relies on human judgements for analyzing self-disclosure."}, {"id": 7, "string": "The limitation of such research is that the data is small, so our approach of automatic analysis of selfdisclosure will be able to show robust results over a much larger data set."}, {"id": 8, "string": "Analyzing relationship strength in online social networks has been done for Facebook and Twitter in (Gilbert and Karahalios, 2009; Gilbert, 2012) and for enterprise SNS (Wu et al., 2010) ."}, {"id": 9, "string": "In this paper, we estimate relationship strength simply based on the duration and frequency of interaction."}, {"id": 10, "string": "We then look at the correlation between self-disclosure and relationship strength and present the preliminary results that show a positive and significant correlation."}, {"id": 11, "string": "Data and Methodology Twitter is widely used for conversations (Ritter et al., 2010) , and prior work has looked at Twitter for different aspects of conversations (Boyd et al., 2010; Danescu-Niculescu-Mizil et al., 2011; Ritter et al., 2011) ."}, {"id": 12, "string": "Ours is the first paper to analyze the degree of self-disclosure in conversational tweets."}, {"id": 13, "string": "In this section, we describe the details of our Twitter conversation data and our methodology for analyzing relationship strength and self-disclosure."}, {"id": 14, "string": "Twitter Conversation Data A Twitter conversation is a chain of tweets where two users are consecutively replying to each other's tweets using the Twitter reply button."}, {"id": 15, "string": "We identified dyads of English-tweeting users who had at least three conversations from October, 2011 to December, 2011 and collected their tweets for that duration."}, {"id": 16, "string": "To protect users' privacy, we anonymized the data to remove all identifying information."}, {"id": 17, "string": "This dataset consists of 131,633 users, 2,283,821 chains and 11,196,397 tweets."}, {"id": 18, "string": "Relationship Strength Research in social psychology shows that relationship strength is characterized by interaction frequency and closeness of a relationship between two people (Granovetter, 1973; Levin and Cross, 2004) ."}, {"id": 19, "string": "Hence, we suggest measuring the relationship strength of the conversational dyads via the following two metrics."}, {"id": 20, "string": "Chain frequency (CF) measures the number of conversational chains between the dyad averaged per month."}, {"id": 21, "string": "Chain length (CL) measures the length of conversational chains between the dyad averaged per month."}, {"id": 22, "string": "Intuitively, high CF or CL for a dyad means the relationship is strong."}, {"id": 23, "string": "Self-Disclosure Social psychology literature asserts that selfdisclosure consists of personal information and open communication composed of the following five elements (Montgomery, 1982) ."}, {"id": 24, "string": "Negative openness is how much disagreement or negative feeling one expresses about a situation or the communicative partner."}, {"id": 25, "string": "In Twitter conversations, we analyze sentiment using the aspect and sentiment unification model (ASUM) (Jo and Oh, 2011) , based on LDA (Blei et al., 2003) ."}, {"id": 26, "string": "ASUM uses a set of seed words for an unsupervised discovery of sentiments."}, {"id": 27, "string": "We use positive and negative emoticons from Wikipedia.org 1 ."}, {"id": 28, "string": "Nonverbal openness includes facial expressions, vocal tone, bodily postures or movements."}, {"id": 29, "string": "Since tweets do not show these, we look at emoticons, 'lol' (laughing out loud) and 'xxx' (kisses) for these nonverbal elements."}, {"id": 30, "string": "According to Derks et al."}, {"id": 31, "string": "(2007) , emoticons are used as substitutes for facial expressions or vocal tones in socio-emotional contexts."}, {"id": 32, "string": "We also consider profanity as nonverbal openness."}, {"id": 33, "string": "The methodology used for identifying profanity is described in the next section."}, {"id": 34, "string": "Emotional openness is how much one discloses his/her feelings and moods."}, {"id": 35, "string": "To measure this, 1 http://en.wikipedia.org/wiki/List of emoticons we look for tweets that contain words that are identified as the most common expressions of feelings in blogs as found in Harris and Kamvar (2009) ."}, {"id": 36, "string": "Receptive openness and General-style openness are difficult to get from tweets, and they are not defined precisely in the literature, so we do not consider these here."}, {"id": 37, "string": "PII, PEI, and Profanity PII and PEI are also important elements of selfdisclosure."}, {"id": 38, "string": "Automatically identifying these is quite difficult, but there are certain topics that are indicative of PII and PEI, such as family, money, sickness and location, so we can use a widely-used topic model, LDA (Blei et al., 2003) to discover topics and annotate them using MTurk 2 for PII and PEI, and profanity."}, {"id": 39, "string": "We asked the Turkers to read the conversation chains representing the topics discovered by LDA and have them mark the conversations that contain PII and PEI."}, {"id": 40, "string": "From this annotation, we identified five topics for profanity, ten topics for PII, and eight topics for PEI."}, {"id": 41, "string": "Fleiss kappa of MTurk result is 0.07 for PEI, and 0.10 for PII, and those numbers signify slight agreement (Landis and Koch, 1977 To verify the topic-model based approach to discovering PII and PEI, we tried supervised classification using SVM on document-topic proportions."}, {"id": 42, "string": "Precision and recall are 0.23 and 0.21 for PII, and 0.30 and 0.23 for PEI."}, {"id": 43, "string": "These results are not quite good, but this is a difficult task even for humans, and we had a low agreement among the Turkers."}, {"id": 44, "string": "So our current work is in improving this."}, {"id": 45, "string": "Results and Discussions Chain frequency (CF) and chain length (CL) reflect the dyad's tweeting behaviors."}, {"id": 46, "string": "In figure 1 , we can see that the two metrics show similar patterns of self-disclosure."}, {"id": 47, "string": "When two users have stronger relationships, they show more negative openness, nonverbal openness, profanity, and PEI."}, {"id": 48, "string": "These patterns are expected."}, {"id": 49, "string": "However, weaker relationships tend to show more PII and emotions."}, {"id": 50, "string": "A closer look at the data reveals that PII topics are related to cities where they live, time of day, and birthday."}, {"id": 51, "string": "This shows that the weaker relationships, usually new acquaintances, use PII to introduce themselves or send trivial greetings for birthdays."}, {"id": 52, "string": "Higher emotional openness in weaker relationships looks strange at first, but similar to PII, emotion in weak relationships is usually expressed as greetings, reactions to baby or pet photos, or other shallow expressions."}, {"id": 53, "string": "It is interesting to look at outliers, dyads with very strong and very weak relationship groups."}, {"id": 54, "string": "Table 3 summarizes the self-disclosure behaviors of these outliers."}, {"id": 55, "string": "There is a clear pattern that stronger relationships show more nonverbal openness, nega-str1 str2 weak1 weak2 weak3 lmao sleep following ill love lmfao bed thanks sure thanks shit night followers soon cute ass tired welcome better aww smh awake follow want pretty tive openness, profanity use, and PEI."}, {"id": 56, "string": "In figure 1 , emotional openness does not differ for the strong and weak relationship groups."}, {"id": 57, "string": "We can see why this is when we look at the topics for the strong and weak groups."}, {"id": 58, "string": "Table 2 shows the topics that are most prominent in the strong relationships, and they include daily greetings, plans, nonverbal emotions such as 'lol', 'omg', and profanity."}, {"id": 59, "string": "In weak relationships, the prominent topics illustrate the prevalence of initial getting-to-know conversations in Twitter."}, {"id": 60, "string": "They welcome and greet each other about kids and pets, and offer sympathies about feeling bad."}, {"id": 61, "string": "One interesting way to use our analysis is in iden-  tifying a rare situation that deviates from the general pattern, such as a dyad linked weakly but shows high self-disclosure."}, {"id": 62, "string": "We find several such examples, most of which are benign, but some do show signs of risk for one of the parties."}, {"id": 63, "string": "In figure 2, we show an example of a conversation with a high degree of self-disclosure by a dyad who shares only one conversation in our dataset spanning two months."}, {"id": 64, "string": "Conclusion and Future Work We looked at the relationship strength in Twitter conversational partners and how much they selfdisclose to each other."}, {"id": 65, "string": "We found that people disclose more to closer friends, confirming the social psychology studies, but people show more positive sentiment to weak relationships rather than strong relationships."}, {"id": 66, "string": "This reflects the social norm toward first-time acquaintances on Twitter."}, {"id": 67, "string": "Also, emotional openness does not change significantly with relationship strength."}, {"id": 68, "string": "We think this may be due to the inherent difficulty in truly identifying the emotions on Twitter."}, {"id": 69, "string": "Identifying emotion merely based on keywords captures mostly shallow emotions, and deeper emotional openness either does not occur much on Twitter or cannot be captures very well."}, {"id": 70, "string": "With our automatic analysis, we showed that when Twitter users have conversations, they control self-disclosure depending on the relationship strength."}, {"id": 71, "string": "We showed the results of measuring the relationship strength of a Twitter conversational dyad with chain frequency and length."}, {"id": 72, "string": "We also showed the results of automatically analyzing self-disclosure behaviors using topic modeling."}, {"id": 73, "string": "This is ongoing work, and we are looking to improve methods for analyzing relationship strength and self-disclosure, especially emotions, PII and PEI."}, {"id": 74, "string": "For relationship strength, we will consider not only interaction frequency, but also network distance and relationship duration."}, {"id": 75, "string": "For finding emotions, first we will adapt existing models (Vaassen and Daelemans, 2011; Tokuhisa et al., 2008) and suggest a new semi-supervised model."}, {"id": 76, "string": "For finding PII and PEI, we will not only consider the topics, but also time, place and the structure of questions and answers."}, {"id": 77, "string": "This paper is a starting point that has shown some promising research directions for an important problem."}, {"id": 78, "string": "Acknowledgment We thank the anonymous reviewers for helpful comments."}, {"id": 79, "string": "This research is supported by Korean Ministry of Knowledge Economy and Microsoft Research Asia (N02110403)."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 10}, {"section": "Data and Methodology", "n": "2", "start": 11, "end": 13}, {"section": "Twitter Conversation Data", "n": "2.1", "start": 14, "end": 17}, {"section": "Relationship Strength", "n": "2.2", "start": 18, "end": 22}, {"section": "Self-Disclosure", "n": "2.3", "start": 23, "end": 36}, {"section": "PII, PEI, and Profanity", "n": "2.4", "start": 37, "end": 44}, {"section": "Results and Discussions", "n": "3", "start": 45, "end": 63}, {"section": "Conclusion and Future Work", "n": "4", "start": 64, "end": 75}, {"section": "Acknowledgment", "n": "5", "start": 76, "end": 79}], "figures": [{"filename": "../figure/image/981-Figure1-1.png", "caption": "Figure 1: Degree of self-disclosure depending on various relationship strength metrics. The x axis shows relationship strength according to tweeting behavior (chain frequency and chain length), and the y axis shows proportion of selfdisclosure in terms of negative openness, emotional openness, profanity, and PII and PEI.", "page": 2, "bbox": {"x1": 100.32, "x2": 515.04, "y1": 62.879999999999995, "y2": 320.64}}, {"filename": "../figure/image/981-Table2-1.png", "caption": "Table 2: Topics that are most prominent in strong (‘str’) and weak relationships.", "page": 2, "bbox": {"x1": 319.68, "x2": 531.36, "y1": 388.8, "y2": 470.4}}, {"filename": "../figure/image/981-Table1-1.png", "caption": "Table 1: PII and PEI topics represented by the highranked words in each topic.", "page": 1, "bbox": {"x1": 314.88, "x2": 536.16, "y1": 444.96, "y2": 527.04}}, {"filename": "../figure/image/981-Table3-1.png", "caption": "Table 3: Comparing the top 1% and the bottom 1% relationships as measured by the combination of CF and CL. From ‘Emotion’ to PEI, all values are average proportions of tweets containing each self-disclosure behavior. Strong relationships show more negative sentiment, profanity, and PEI, and weak relationships show more positive sentiment and PII. ‘Emotion’ is the sum of all emotion categories and shows little difference.", "page": 3, "bbox": {"x1": 114.72, "x2": 259.2, "y1": 60.96, "y2": 252.0}}, {"filename": "../figure/image/981-Figure2-1.png", "caption": "Figure 2: Example of Twitter conversation in a weak relationship that shows a high degree of self-disclosure.", "page": 3, "bbox": {"x1": 313.92, "x2": 537.12, "y1": 60.96, "y2": 217.44}}]}