{"title": "Integrating Case Frame into Japanese to Chinese Hierarchical Phrase-based Translation Model", "abstract": "This paper presents a novel approach to enhance hierarchical phrase-based (HP-B) machine translation systems with case frame (CF).we integrate the Japanese shallow CF into both rule extraction and decoding. All of these rules are then employed to decode new sentences in Japanese with source language case frame. The results of experiments carried out on Japanese-Chinese test sets. It shows that our approach maintains the advantages of HPB translation systems while at the same time naturally incorporates CF constraints. The case frame rules can complement Hiero-style rules. Our approach is especially effective for language pairs with large word order differences, such as Japanese-to-Chinese.", "text": [{"id": 0, "string": "Introduction In the Japanese-Chinese machine translation task, reordering is the main problem due to substantial differences in sentence structures between these two languages."}, {"id": 1, "string": "For example, Japanese has a subject-object-verb (SOV) structure, while, Chinese has a subject-verb-object (SVO) structure."}, {"id": 2, "string": "The pre-ordering technology is one way to handle this problem (Wu, et al., 2011) , but it needs to train a pre-ordering model."}, {"id": 3, "string": "An hierarchical phrase-based (HPB) model (Chiang, 2005; Chiang, 2007 ) is a powerful method to cover any format of translation pairs by using synchronous context free grammar."}, {"id": 4, "string": "Hiero grammars can capture complex nested translation relationships to handle reordering."}, {"id": 5, "string": "However, due to its compromise on the efficiency of rule extraction and decoding, (a) a source language span limit is applied with 10, (b) the number of non-terminals in one rule is set to 2, (c) there is a prohibition of consecutive nonterminals on the source language side of a rule and With a traditional approach, the typical H-PB model fails to capture complex reordering information as shown in Figure 1 ."}, {"id": 6, "string": "By contrast, Fillmore (1968) has proposed case grammar, which is effectively proved and originally used in rule-based machine translation (RBMT) system (Yamabana,1997) ."}, {"id": 7, "string": "Furthermore, Kawahara (1994 Kawahara ( , 2002 defines the Japanese shallow CF that is widely and successfully used in Japanese dependency tasks provided by CoNLL-09 (Hajič, 2011) ."}, {"id": 8, "string": "Figure 2 shows the CF's ability to capture reordering information."}, {"id": 9, "string": "In this paper, we describe effective approaches to introducing source language Japanese CF in the Japanese-Chinese translation task."}, {"id": 10, "string": "Unlike previous work, we are the first to use Japanese CF information on the HPB model, and to transform CF information into SCFG style rules, which is suitable and useful in the original HPB decoder."}, {"id": 11, "string": "By importing CF into the HPB model, we expand search space and introduce fine-grained rules."}, {"id": 12, "string": "The remainder of this paper is organized as follows."}, {"id": 13, "string": "After introducing Japanese CF,the proposed approach is introduced in Section 3; the experimental results and associate analysis are given Case Frame Unlike HPB model's format grammar, case grammar is linguistically sensible and is applied to semantically analyze sentence."}, {"id": 14, "string": "Based on case grammar, a sentence will be analyzed using different deep case components (agent, instrument, experiencer, object, location, benefactive, factitive, goal, source and time)."}, {"id": 15, "string": "This way, Fillmore has defined the deep verb CF, where one example is shown in Figure 2 (a)."}, {"id": 16, "string": "Deep case is language independent."}, {"id": 17, "string": "If two sentences from different languages have the exactly same meaning and description, they will have the same deep case grammar analysis."}, {"id": 18, "string": "Figure 2 (a) shows the sentence \"today we will get him to the airport by car\" described respectively in Japanese and Chinese."}, {"id": 19, "string": "Meanwhile, Figure 2 (a) shows deep case alignment between these two different languages."}, {"id": 20, "string": "Deep case alignment in two different languages is one to one mapping."}, {"id": 21, "string": "For example, in Figure 2 (a), \"私 達 は\" (we) is the agent in Japanese, mapping \" 我们 \" (we) (agent) in Chinese."}, {"id": 22, "string": "The deep CF is well known, but it is rarely used in statistical machine translation due to the difficulty of the auto-analysis for all languages including Japanese."}, {"id": 23, "string": "However, due to the explicit case in Japanese, Kawahara (2002) redefines the shallow verbal CF in Japanese shown in Figure 2 analysis."}, {"id": 24, "string": "As a result, recent research has achieved high accuracy (more than 90%) on Japanese shallow CF analysis (Kawahara and Kurohashi, 2006) ."}, {"id": 25, "string": "Between the deep case and the Japanese shallow case, there is a many-to-many relation shown in Table 1 ."}, {"id": 26, "string": "In this paper, we will only use \"case frame\" to represent Japanese verbal shallow CF for short."}, {"id": 27, "string": "The proposed approach A case frame is the linguistic concept, which provides linguistic guidance for derivation."}, {"id": 28, "string": "Here, we present a method to alleviate complex reordering problems in the Japanese-Chinese machine translation task with case frame."}, {"id": 29, "string": "Generally, we obtain both the case frame and the hiero-style SCFG from the training data, and then transfer the case frame rule (CFR) to SCFG style and use both of them in decoding with the SCFG."}, {"id": 30, "string": "The method benefits from both hiero-style translation and linguistic information."}, {"id": 31, "string": "In the rule extraction of our approach, we acquire case frame rules using fuzzy strategy and hiero-style rules using traditional HPB rule extraction method."}, {"id": 32, "string": "In decoding, we use the traditional HPB decoder with CYK and cube pruning."}, {"id": 33, "string": "Figure 3 shows an example of CFRs extraction processing from a pair of word-aligned Japanese-Chinese sentences with a source language CF, and their SCFG style."}, {"id": 34, "string": "Case Frame Rules Extraction As described in section 2, the Japanese shallow case frame can be obtained through surface analysis."}, {"id": 35, "string": "This way, we can extract case frame reordering rules from sentence pairs with alignment information as shown in Figure 4 , where original case  frame rules are from o1 to o6."}, {"id": 36, "string": "Given a source language case frame and related word alignment, one case frame is mapped to the case frame reordering rule set,where there are two kinds of rules: reordering rule and phrase rule."}, {"id": 37, "string": "• Phrase rule: Each component in a case frame generates one phrase rule."}, {"id": 38, "string": "We extract the phrase rule by following the traditional phrase-based model 's strategy (Och and Ney, 2004) ."}, {"id": 39, "string": "Each phrase rule has a case distinction associated with a shallow case in a case frame like r1 to r5 in Figure  3 ."}, {"id": 40, "string": "• Reordering rule: One case frame generates one reordering rule."}, {"id": 41, "string": "For reordering rule extraction, we need to compute the relatively order of target language span associated with each case slot."}, {"id": 42, "string": "The order is relatively soft to the word alignment."}, {"id": 43, "string": "For example, if a source language phrase A covers target span [2, 4] and the other source language phrase B covers target span [1, 3] , then the phrase A is relatively right to the phrase B in target side; if a span is covered by the other one, the rule is forbidden during extraction."}, {"id": 44, "string": "All of the Transforming Case Frame Rule into SCFG style To make case frame rules directly accessible to the Hiero-style decoder with performs decoding with SCFG rules, we convert original case frame rules into SCFG style."}, {"id": 45, "string": "And then, case frame rule is defined as SCFG-style, which is a little different from hiero rules."}, {"id": 46, "string": "• Phrase rule transformation: We take o1 as an example transforming into r1 shown in Figure  5 (a)."}, {"id": 47, "string": "We use o1 's case distinction as case distinction of r1 's left."}, {"id": 48, "string": "The source side of the r1 's right is source phrase in o1 and the target side is target phrase in o1."}, {"id": 49, "string": "• Reordering rules transformation: We take o6 as an example transforming into r6 shown in Figure 5(b) ."}, {"id": 50, "string": "We also use o6 's verb case distinction as case distinction of r6 's left."}, {"id": 51, "string": "(default X if there is no case distinction in this example)."}, {"id": 52, "string": "Each slot of o6 is transformed into related X with respective case distinction in r6."}, {"id": 53, "string": "The target side of the rule 's right is target language 's reordering."}, {"id": 54, "string": "It is clearly seen that if there is no non-terminals in the right of reordering rule, reordering rule is the same with phrase rule."}, {"id": 55, "string": "In this way, each case frame rule is associated with exactly one SCFG rule."}, {"id": 56, "string": "Therefore, we can obtain a fine-grained SCFG from case frames due to case distinction."}, {"id": 57, "string": "On one hand, non-terminals associated with case are linguistically sensible."}, {"id": 58, "string": "For example of r4, \"空港 まで\" with \"マデ\" case is translated to \"去 机场\" that means \"to airport\"."}, {"id": 59, "string": "On the other hand, it can capture complex reordering information."}, {"id": 60, "string": "For example of r6, the source side of the rule's right means that \"ガ\" (who) \"時間\" (when) \"ヲ\" (whom) \"マデ\" (where) \"デ\" (how) \"送って 行き ます\" (send)in Japanese order, and the target side of the rule 's right means that \"時 間\" (when) \"ガ\" (who) \"デ\" (how) \"送\" (send) \"デ\" (whom) \"マデ\" (where) in Chinese order."}, {"id": 61, "string": "For reordering the rule extraction, we need to compute the relatively order of target language span associated with each case slot."}, {"id": 62, "string": "The order is relatively soft to the word alignment."}, {"id": 63, "string": "For example, if a source language phrase A covers target span [2, 4] and the other source language phrase B covers target span [1, 3] , then the phrase A is relatively right to the phrase B on the target side; if a span is covered by the other one, the rule is forbidden during extraction."}, {"id": 64, "string": "All the possible CFs with word alignment can be seen in Figure 4 , where only (c) rule is forbidden."}, {"id": 65, "string": "Generally, we define the transformed case frame rules as SCFG style: X → ⟨γ, α, ∼⟩ (1) Where X is non-terminal, γ and α are both strings of terminals and non-terminals as the same with SCFG in the HPB model."}, {"id": 66, "string": "Compared with SCFG in the HPB model, the only difference is that non-terminals are distinguished by case as shown in Figure 3 from r1 to r6."}, {"id": 67, "string": "Decoding Both transformed case frame rules and HPB rules can be applied using traditional Hiero decoders with a slight modification."}, {"id": 68, "string": "Here we follow the description of Hiero decoding by Chiang (2007) ."}, {"id": 69, "string": "The source sentence is parsed under the Hiero grammar using the CYK algorithm."}, {"id": 70, "string": "Each cell in the CYK grid is associated with a list of rules that applies to its span from the bottom up."}, {"id": 71, "string": "For each derivation, we apply cube pruning (Chiang,2007) and beam search technology."}, {"id": 72, "string": "This procedure accommodates traditional HPB rules directly."}, {"id": 73, "string": "We use traditional HPB rules for translation as shown in Figure 6(a) ."}, {"id": 74, "string": "For example, the traditional rule can be applied in the span (14, 16) ."}, {"id": 75, "string": "Since the span (4, 18) is longer than 10 words, the traditional rule cannot be applied in the span."}, {"id": 76, "string": "We move our focus towards case frame reordering rules, and analyze sentences and obtain all the case frames, and then for each CF, we match rules to the span related to the CF."}, {"id": 77, "string": "If a match is found, the CYK cell for the span is selected, and that rule is added to the list of rules in the selected CYK cell as shown in Figure 6 (b)."}, {"id": 78, "string": "For example, the span (1,18) can be matched with r6."}, {"id": 79, "string": "The complex reordering can be captured by r6."}, {"id": 80, "string": "It is clear that the HPB rules have non-terminals without any distinction and the case frame rules have non-terminals with case distinction."}, {"id": 81, "string": "Generally, there are two kinds of non-terminals: X and X with case."}, {"id": 82, "string": "During decoding, we respectively use three kinds of constraints on case frame rule matching: Without constraints ignore all the case distinction in case frame rules, so case frame rule format is the same with HPB rules."}, {"id": 83, "string": "In this way, we just expand SCFG."}, {"id": 84, "string": "Soft constraints admit the match between different case distinctions by adding extra dynamic feature -soft count."}, {"id": 85, "string": "For example, X with \"ヲ\" is allowed to match X with \"マデ\" by adding 1 to soft count."}, {"id": 86, "string": "Hard constraints only admit the completed and exact match."}, {"id": 87, "string": "On one hand, we admit X to match all of the X with or without distinction, on the other hand, we only allow X with distinction to match X with the same distinction."}, {"id": 88, "string": "Features The baseline feature set used in this work consists of 7 features, including a strong 5-gram language model, bidirectional translation probabilities, bidirectional lexical probabilities, and a word count, a glue rule count."}, {"id": 89, "string": "In the CF reordering rule, bidirectional translation probabilities and bidirection-al lexical probabilities are also used during decoding."}, {"id": 90, "string": "In addition, we introduce several features for applying case frame rules, and we adopt these features to log-linear model during decoding."}, {"id": 91, "string": "• Rule type indicators."}, {"id": 92, "string": "For soft or hard constraint, we consider two indicator features, indicating case frame rules, case frame reordering rules."}, {"id": 93, "string": "Case frame rules indicator feature is used to distinguish case frame rules and original HPB rules."}, {"id": 94, "string": "Case frame reordering rules indicator feature is used to distinguish phrase rules and reordering rules in case frame rule set."}, {"id": 95, "string": "• Dynamic soft constraints."}, {"id": 96, "string": "For soft constraints, we consider the soft constraints."}, {"id": 97, "string": "Note that when X with case mismatches X with other different case, we add dynamic soft constraints count for this mismatching instead of prohibition."}, {"id": 98, "string": "Evaluation Experimental Setup We report results for this Japanese-Chinese task."}, {"id": 99, "string": "We use two data sets, where one uses news from the 7th China Workshop on Machine Translation (CWMT) including 280 thousand sentence pairs for training, 500 sentence pairs for parameter optimization and 900 sentence pairs for testing, the other, from Asian Scientific Paper Excerpt Corpus-Japanese to Chinese (ASPEC-JC) includes 680 thousand pairs for training, 2090 sentence pairs for parameter optimization and 1800 sentence pairs for testing."}, {"id": 100, "string": "The source side sentences are parsed by KNP (Kurohashi and Nagao, 1994) into chunk dependency structures whose nodes are at chunk-level."}, {"id": 101, "string": "Also we achieve corresponding case frame analysis from byproduct of KNP."}, {"id": 102, "string": "The word alignment is obtained by running GIZA++ (Och and Ney, 2003) on the corpus in both direction and applying \"grow-diag-and\"refinement (Koehn et al., 2003) ."}, {"id": 103, "string": "We apply SRI Language Modeling Toolkit (Stolcke, 2002) to train a 5-gram language model for target side sentences."}, {"id": 104, "string": "Results For comparison, we also manually modify the extracted case frame rules of development and test data with case frame information according to the Japanese and Chinese grammar."}, {"id": 105, "string": "We report machine translation performance in Table 2 using case insensitive BLEU-4 metric (Papineni et al., 2002) , considering the balance of the performance   of lexical and phrase."}, {"id": 106, "string": "The experiments are organized as follows: • exp1: we use the NiuTrans (Xiao, 2012) hierarchical phrase-based model as strong baseline system."}, {"id": 107, "string": "• exp2: we transform CFRs into SCFG-style rules without any case distinction, and add these rule into exp1 system."}, {"id": 108, "string": "Analysis Finally, we discuss an example of real translation from our test set."}, {"id": 109, "string": "See Figure 7 for translations generated from different systems."}, {"id": 110, "string": "The Japanese input sentence contains \"…下さ れた\" which is usually translated into \"下达… \" (i.e."}, {"id": 111, "string": "a transformed CF reordering rule \"X → X (下さ れた, 下达\" X)) ."}, {"id": 112, "string": "However, because the \"…下さ れた\" pattern spans 12 words and that is beyond the span limit, our baseline is unable to apply this desired rule and so it chooses the wrong reordering translation."}, {"id": 113, "string": "When importing CF reordering rule which captures the CF \"(を)下さ れた\" , we can transform the CF reordering rule into one that is SCFG-style and achieve right reordering information."}, {"id": 114, "string": "• Better reordering Main structure in Japanese structure is SOV-style, which is different from Chinese SVO-style."}, {"id": 115, "string": "Reordering problem is significant in Japanese-Chinese translation, especially with long phrase for S and/or V. Compared with hierarchical phrase-based rules, case frame rules have better phrase reordering."}, {"id": 116, "string": "In the example as shown in Figure 8 , the source sentence main centered verbs contain the word \"確認(confirm)\" and the word \"集合(gather)\"."}, {"id": 117, "string": "The Hiero result mistakenly treats that objective phrase as subjective (SOV), thus results in translation with different structure from source sentence."}, {"id": 118, "string": "Conversely, our system captures this component relations in case frame and translates it into the SVO structure."}, {"id": 119, "string": "• Better exical translation results Moreover, we also find that our system can get better lexical translation results, for instance, the result of the word \"時間厳守(punctuality)\",as indicated in Figure 8 ."}, {"id": 120, "string": "Related Work Recently linguistically-motivated models have been intensively investigated in MT."}, {"id": 121, "string": "In particular, source tree-based models (Liu et al., 2006; Huang et al., 2006; Eisner, 2003; Zhang et al., 2008; Liu et al., 2009a; Xie et al., 2011) have received growing interest due to their excellent ability to model source language syntax for better lexical selection and reordering."}, {"id": 122, "string": "Alternatively, the hierarchical phrase-based approach (Chiang, 2005) considers the underlying hierarchical structures of sentences but does not require linguistically syntactic trees on either language ′ s side."}, {"id": 123, "string": "There are several lines of work for augmenting hierarchical phrase-based systems with the use of source language linguistic information."}, {"id": 124, "string": "Xiao (2014) incorporates source syntax into the hierarchical phrase-based model."}, {"id": 125, "string": "They develop procedures for joint decoding and optimization within a single system by transforming tree-to-string rules into SCFG rules."}, {"id": 126, "string": "By enlarging SCFG grammar, they perform well on Chinese-English tasks."}, {"id": 127, "string": "Our approach is motivated by high-precision Japanese case analysis, and aims to augment the search space of Hiero with linguistically-motivated hypotheses."}, {"id": 128, "string": "Moreover, we consider hiero as the backbone model and only introduce and transform Japanese CF into SCFG rules where they can contribute."}, {"id": 129, "string": "Another related line of work is to introduce pre-ordering approach for Japanese main structure."}, {"id": 130, "string": "Wu (2011) and Sudoh (2013) propose several methods to train pre-ordering model for pre-ordering."}, {"id": 131, "string": "We note that, we have no need to train extra pre-ordering models for the Japanese main structure, and we only use the highprecision Japanese explicit case analysis to improve Japanese-Chinese translation performance described in this paper."}, {"id": 132, "string": "Conclusion and Future Work We have presented an approach to improving Hiero-style systems by augmenting the SCFG with Japanese case frame rules."}, {"id": 133, "string": "The input case frame are used to introduce new linguisticallysensible hypotheses into the translation search space while maintaining the Hiero robustness qualities and avoiding computational explosions."}, {"id": 134, "string": "We obtain significant improvements over a strong Hiero baseline in the Japanese-to-Chinese task."}, {"id": 135, "string": "This paper presented an approach to improve H-PB model systems by augmenting the SCFG with Japanese CFRs."}, {"id": 136, "string": "The CF are used to introduce new linguistically-sensible hypotheses into the translation search space while maintaining the Hiero robustness qualities and avoiding computational explosions."}, {"id": 137, "string": "We obtain significant improvements over a strong HPB baseline in the Japanese-to-Chinese task."}, {"id": 138, "string": "We will try to improve the performance of our system with soft constraint or hard constraint using case frame rules, and we will challenge to resolve the problem of tense, aspect and some special grammatical sentences of Japanese to Chinese translation."}, {"id": 139, "string": "Training Program of Innovation and Entrepreneurship for Undergraduates."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 12}, {"section": "Case Frame", "n": "2", "start": 13, "end": 26}, {"section": "The proposed approach", "n": "3", "start": 27, "end": 33}, {"section": "Case Frame Rules Extraction", "n": "3.1", "start": 34, "end": 43}, {"section": "Transforming Case Frame Rule into SCFG style", "n": "3.2", "start": 44, "end": 66}, {"section": "Decoding", "n": "3.3", "start": 67, "end": 87}, {"section": "Features", "n": "3.4", "start": 88, "end": 97}, {"section": "Experimental Setup", "n": "4.1", "start": 98, "end": 103}, {"section": "Results", "n": "4.2", "start": 104, "end": 107}, {"section": "Analysis", "n": "4.3", "start": 108, "end": 119}, {"section": "Related Work", "n": "5", "start": 120, "end": 131}, {"section": "Conclusion and Future Work", "n": "6", "start": 132, "end": 139}], "figures": [{"filename": "../figure/image/982-Figure1-1.png", "caption": "Figure 1: The reordering problem in JapaneseChinese translation", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 534.24, "y1": 204.48, "y2": 285.12}}, {"filename": "../figure/image/982-Figure8-1.png", "caption": "Figure 8: Actual translations produced by the baselines and our system.", "page": 5, "bbox": {"x1": 75.84, "x2": 286.08, "y1": 61.44, "y2": 159.35999999999999}}, {"filename": "../figure/image/982-Table1-1.png", "caption": "Table 1: The mapping between a deep case and a Japanese shallow case.", "page": 1, "bbox": {"x1": 313.92, "x2": 519.36, "y1": 62.879999999999995, "y2": 193.92}}, {"filename": "../figure/image/982-Figure2-1.png", "caption": "Figure 2: Deep verbal CF and shallow verbal case between Japanese and Chinese", "page": 1, "bbox": {"x1": 70.56, "x2": 299.03999999999996, "y1": 62.879999999999995, "y2": 240.95999999999998}}, {"filename": "../figure/image/982-Figure4-1.png", "caption": "Figure 4: The fuzzy extraction strategy for CF reordering rule.", "page": 2, "bbox": {"x1": 70.56, "x2": 299.03999999999996, "y1": 321.59999999999997, "y2": 389.28}}, {"filename": "../figure/image/982-Figure5-1.png", "caption": "Figure 5: The example of transformation for phrase rule and reordering rule.", "page": 2, "bbox": {"x1": 306.71999999999997, "x2": 580.3199999999999, "y1": 63.839999999999996, "y2": 237.12}}, {"filename": "../figure/image/982-Figure3-1.png", "caption": "Figure 3: Example of CFRs extraction processing.", "page": 2, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 61.44, "y2": 279.36}}, {"filename": "../figure/image/982-Figure6-1.png", "caption": "Figure 6: Decoding with both traditional hiero grammar and case frame.", "page": 3, "bbox": {"x1": 306.71999999999997, "x2": 535.1999999999999, "y1": 62.879999999999995, "y2": 183.35999999999999}}, {"filename": "../figure/image/982-Table2-1.png", "caption": "Table 2: BLEU[%] scores of various systems. ∗ means that a system is significantly different from the baseline at p < 0.01. M means million and + means hierarchical rules with CFRs.", "page": 4, "bbox": {"x1": 312.96, "x2": 520.3199999999999, "y1": 62.879999999999995, "y2": 166.07999999999998}}, {"filename": "../figure/image/982-Figure7-1.png", "caption": "Figure 7: Comparison of translations generated by the baseline and improved systems.", "page": 4, "bbox": {"x1": 306.71999999999997, "x2": 544.3199999999999, "y1": 244.79999999999998, "y2": 327.36}}]}