{"title": "Incorporating Satellite Documents into Co-citation Networks for Scientific Paper Searches", "abstract": "To improve the search performance of retrieval methods using cocitation linkages, this study proposes a technique to enlarge a co-citation network by incorporating satellite documents. This technique specifies satellite documents via full-text searches for terms obtained from documents having cocitation linkages with a seed document; the appropriateness of each co-citation linkage is checked by using the strength of the co-citation context based on the results of parsing documents that cite the seed document. This study evaluates search performance using the proposed technique with IR experiments. Specifically, the random walk with restart algorithm, which can compute similarities between the seed document and each document in the network, is applied to the enlarged and initial networks. Scores of the normalized discounted cumulative gain (nDCG@K) were then compared. The results indicate that the search performance of the retrieval methods using the enlarged network outperforms those of a baseline method using the initial network.", "text": [{"id": 0, "string": "INTRODUCTION In the field of scientific paper searches, citations are often used to measure implicit relationships between documents."}, {"id": 1, "string": "One approach to improve the search performance of retrieval methods using citation linkages is to enlarge the citation networks by incorporating additional information."}, {"id": 2, "string": "In the case of a network created using direct citation linkages, i.e., the linkages between the citing and cited documents, techniques to enlarge the network of citations on the basis of additional information, such as citing text [1] or user profiles [2] , have been reported."}, {"id": 3, "string": "This study enlarges the networks connected by co-citations."}, {"id": 4, "string": "A co-citation is defined as a linkage between a pair of documents concurrently cited by a third document."}, {"id": 5, "string": "In the simplest retrieval method using co-citation, documents having a cocitation relationship with a given seed document that are known to be relevant are presented to the user under the assumption that documents co-cited with such a seed document tend to be topically similar to the seed document."}, {"id": 6, "string": "Co-citation networks have been used in bibliometrics and can also be applied to scientific paper searches (e.g., [3] )."}, {"id": 7, "string": "This study proposes a technique to enlarge the co-citation network by adding word-based linkages."}, {"id": 8, "string": "When documents are detected by the co-citation linkage, it is possible to obtain more appropriate search terms from the document; such terms may not have been included in the original seed document."}, {"id": 9, "string": "A set of new search terms may yield additional relevant documents that were not identified simply by the co-citation linkages or the user's original representation of his or her information needs."}, {"id": 10, "string": "This study defines satellite documents as documents that are specified via full-text searches for new search terms."}, {"id": 11, "string": "The purpose of the proposed technique is to incorporate these satellite documents into the initial network of documents, which is already connected by co-citation linkages."}, {"id": 12, "string": "In addition, the proposed technique attempts to reduce noise satellite documents incorporated into the initial co-citation network using the co-citation context."}, {"id": 13, "string": "Some studies (e.g., [3] and [4] ) have reported that using the contexts of co-citations has positive effects for reducing noise documents when co-citation networks are enlarged by additional co-citation linkages; therefore, it is feasible to use co-citation contexts when enlarging co-citation networks by adding word-based linkages."}, {"id": 14, "string": "This study empirically evaluates the search performance of retrieval methods using the proposed technique with IR experiments."}, {"id": 15, "string": "Specifically, the random walk with restart (RWR) algorithm [5] , which can compute similarities between the seed document and each document in the network, is applied to enlarged networks and initial networks, and the results are compared by computing scores of the cutoff version of the normalized discounted cumulative gain (nDCG@K)."}, {"id": 16, "string": "PROPOSED TECHNIQUE 2.1 Specifying satellite documents Figure 1 shows an initial network comprising document nodes connected by undirected co-citation linkages."}, {"id": 17, "string": "In this network, a search query is a seed document that is known to be relevant to the information needs of a user."}, {"id": 18, "string": "The weight of the edge, w, i.e., the strength of the co-citation linkage, is computed as w ( 1 , 2 ) = cociting ( 1 , 2 )."}, {"id": 19, "string": "(1) Here, d1 and d2 are co-cited documents and cociting(d1, d2) denotes the total number of documents co-citing d1 and d2 in the target document set."}, {"id": 20, "string": "Note that this study denotes a weighted edge between d1 and d2 as Edge (d1, d2, w)."}, {"id": 21, "string": "C 1 1 1 A E 1 E 2 E 3 T 1 Satellite documents of C 1 Satellite documents of C 3 C 3 new existing Seed T 2 T 3 C 3 E 1 E 2 T 3 new existing T 4 T 5 T 6 C 1 E 3 2 2 3 5 2 3 The proposed technique specifies satellite documents by investigating documents one hop from the seed."}, {"id": 22, "string": "This study defines host documents as source documents that are used to specify satellite documents."}, {"id": 23, "string": "Using the title words of the host document as a query, the satellite documents are specified on the basis of a standard fulltext search method; the seed document is excluded from the search target."}, {"id": 24, "string": "For example, in Figure 1 , Document C1, a host document that is one hop from the seed, specifies six satellite documents."}, {"id": 25, "string": "In the experiments in this study, the tf-idf retrieval function of the Indri search engine, which has been developed as part of the Lemur Project, was used."}, {"id": 26, "string": "The top N documents ranked by this full-text search were adopted as satellite documents (e.g., N = 10)."}, {"id": 27, "string": "In addition, as an optional process, the proposed technique attempts to check the appropriateness of each host document as a source because inappropriate host documents may yield noise."}, {"id": 28, "string": "To check appropriateness, this technique uses the strength of co-citation context (see e.g., [6] and [7] ) identified by parsing the full-text of documents that cite the seed and each host."}, {"id": 29, "string": "More specifically, this technique examines reference positions within the text and if references to both the document and the seed appear within a paragraph in one or more citing documents, the document is selected as a host document because a seed and host co-cited in a strong context are expected to be closely related."}, {"id": 30, "string": "For example, in Figure 1 , if one or more documents cite Documents A and C3 in the same paragraph, Document C3 would be selected as a host document."}, {"id": 31, "string": "Conversely, if no documents cite them in the same paragraph, Document C3 would not be selected as a host document."}, {"id": 32, "string": "Incorporating satellite documents If a satellite document is new, a new node is created with an undirected edge of weight 1 connecting the new node to its host."}, {"id": 33, "string": "When two host documents share a new satellite document, one new node and two edges between the new node and each host node are created."}, {"id": 34, "string": "In Figure 1 , Document T3 is specified by host Documents C1 and C3; therefore, a new node T3, Edge (T3, C1, 1), and Edge (T3, C3, 1) are created."}, {"id": 35, "string": "In addition, if a new document has co-citation linkages with documents already existing in the initial network or with other new documents, new edges are created and weights are assigned using Eq."}, {"id": 36, "string": "(1)."}, {"id": 37, "string": "When a satellite document already exists in a given network, the linkage between the satellite document and its host is used to create a new edge or recalculate the weight of a given edge."}, {"id": 38, "string": "If the linkage is new for the network, an undirected edge of weight 1 is created between the satellite and its host."}, {"id": 39, "string": "If the linkage already exists in the initial network, the weight of the existing edge is recalculated as w ( 1 , 2 ) = cociting ( 1 , 2 ) + 1."}, {"id": 40, "string": "(2) Some new linkages may be duplicated in the specified results."}, {"id": 41, "string": "In such cases, the proposed technique treats them as one combined link and creates one new edge."}, {"id": 42, "string": "For example, in Figure 1 , Document C1 has satellite document C3 and vice versa; therefore, only Edge (C1, C3, 1) is incorporated into the network."}, {"id": 43, "string": "2.3 Ranking the documents in the network To calculate document scores, the RWR algorithm is applied to the enlarged network."}, {"id": 44, "string": "This algorithm iteratively investigates the entire network, and the similarity between a seed node and each node in the network is calculated (see, e.g., [3] and [8] )."}, {"id": 45, "string": "Specifically, the walker starts at a seed node and then either proceeds to the connected nodes on the basis of a probability calculated by weights or returns back to the seed node; these steps are repeated iteratively until convergence."}, {"id": 46, "string": "The long-term visit rate of each node is used as a document score; these rates are given by the steady state of ⃗ = (1 − )̃⃗ + ⃗."}, {"id": 47, "string": "(3) Here, ⃗ is an n-dimensional vector (with n being the number of nodes in the network), ⃗ is an n-dimensional vector with 1 for the seed node and 0 for the others, and r is a return probability."}, {"id": 48, "string": "This study uses the following 11 values of r in the experiments: 0.01, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, and 0.99."}, {"id": 49, "string": "Also, ̃ is a transition probability matrix, and each transition probability between two nodes is the weight of an edge, which is normalized by the summation of the weights of the edges connected to the current node."}, {"id": 50, "string": "In the case shown in Figure 1 , the probability \"A to C1\" is 0.286 given as 2/(2+3+2)."}, {"id": 51, "string": "Therefore, ̃ is an asymmetric matrix, i.e., one direction can be different from another direction, e.g., the probability \"C1 to A\" is not equal to 0.286."}, {"id": 52, "string": "EXPERIMENTAL SETUP As described in Section 2.1, the proposed technique has an optional process."}, {"id": 53, "string": "Therefore, this study evaluates the search performance of two retrieval methods."}, {"id": 54, "string": "First, Proposed (all) omits the optional process and simply identifies all documents one hop from the seed as host documents."}, {"id": 55, "string": "Second, Proposed (context) selects host documents using the strength of the co-citation context."}, {"id": 56, "string": "For both retrieval methods, the parameter N (i.e., the number of retrieved documents per host document) was set to 10 and 100."}, {"id": 57, "string": "In addition, the study evaluates the search performance of a baseline method that applies the RWR algorithm only to the initial co-citation network."}, {"id": 58, "string": "In this experiment, the three retrieval methods take up to two hops from the seed to create each initial cocitation network; three or more hops are out of scope."}, {"id": 59, "string": "To create a special test collection, the Open Access Subset of PubMed Central was used."}, {"id": 60, "string": "The test collection was constructed by selecting approximately 152,000 documents from the subset with the condition that the document had at least one citation linkage with a document in the subset."}, {"id": 61, "string": "The test collection contained 100 seed documents that were randomly selected from all the documents under the condition that each seed document had co-citation linkages with 10 or more documents."}, {"id": 62, "string": "In addition, this experiment adopted nDCG@K as a metric to evaluate the search performance (with K = 5, 10, 50, and 100)."}, {"id": 63, "string": "A document was considered relevant depending on the degree to which it shared MeSH Descriptors with the target seed document."}, {"id": 64, "string": "More specifically, the Jaccard coefficient (JC) was used, i.e., when nDCG was calculated, the experiment used a relevance score of 3 for documents whose JC was 0.3 or more, 2 for documents whose JC was 0.2-0.3, and 1 for documents whose JC was 0.1-0.2."}, {"id": 65, "string": "4 RESULTS Search runs for 100 seed documents were executed using each method."}, {"id": 66, "string": "Evaluation of incorporated documents First, the experiment examined whether the newly incorporated documents were relevant (see Figure 1 )."}, {"id": 67, "string": "Table 1 shows the average number of relevant incorporated documents; a document is relevant if the JC is 0.1 or more."}, {"id": 68, "string": "Further, Table 1 lists the average ratio of the relevant documents, which is the total number of relevant documents over 100 search runs divided by the total number of new documents over the 100 search runs."}, {"id": 69, "string": "As shown in the table, the numbers of relevant documents were relatively large."}, {"id": 70, "string": "For example, Proposed (all) incorporated more than 50 new relevant documents per seed."}, {"id": 71, "string": "Therefore, the proposed technique has the potential to improve the search performance."}, {"id": 72, "string": "Further, the ratio of relevant documents for Proposed (context) was higher than that of Proposed (all)."}, {"id": 73, "string": "This result indicates that the checking process using the co-citation context tends to exclude inappropriate host documents."}, {"id": 74, "string": "4.2 Evaluation of the ranked retrieval results Table 2 shows the average scores of nDCG@K and the results of the paired t-test between the baseline method and each retrieval method using the proposed technique."}, {"id": 75, "string": "Note that this table shows only the scores of the best results ranked by Eq."}, {"id": 76, "string": "(3) using the aforementioned 11 different r-values."}, {"id": 77, "string": "In Table 2 , the maximum scores of the five retrieval results at each K are shown in bold."}, {"id": 78, "string": "These are the results of Proposed (context) and Proposed (all) with N = 100, with the paired t-tests showing statistically significant differences."}, {"id": 79, "string": "Therefore, the retrieval methods using the proposed technique tended to outperform the baseline method."}, {"id": 80, "string": "Furthermore, the scores of Proposed (context) were higher than those of the baseline method in all cases, with the paired t-tests indicating a statistically significant difference in most cases."}, {"id": 81, "string": "Conversely, some scores of Proposed (all), i.e., with N = 10 at K = 10 and with N = 100 at K = 5, were lower than those of the baseline method."}, {"id": 82, "string": "This suggests that the checking process had a stable and positive impact on improving the search performance."}], "headers": [{"section": "INTRODUCTION", "n": "1", "start": 0, "end": 31}, {"section": "Incorporating satellite documents", "n": "2.2", "start": 32, "end": 51}, {"section": "EXPERIMENTAL SETUP", "n": "3", "start": 52, "end": 65}, {"section": "Evaluation of incorporated documents", "n": "4.1", "start": 66, "end": 82}], "figures": [{"filename": "../figure/image/987-Table2-1.png", "caption": "Table 2. Average scores of nDCG@K.", "page": 4, "bbox": {"x1": 123.83999999999999, "x2": 471.35999999999996, "y1": 584.64, "y2": 671.04}}, {"filename": "../figure/image/987-Table1-1.png", "caption": "Table 1. Statistics of the incorporated documents.", "page": 4, "bbox": {"x1": 123.83999999999999, "x2": 471.35999999999996, "y1": 408.47999999999996, "y2": 471.35999999999996}}, {"filename": "../figure/image/987-Figure1-1.png", "caption": "Fig. 1. Initial co-citation network and satellite documents.", "page": 1, "bbox": {"x1": 183.84, "x2": 410.4, "y1": 584.64, "y2": 677.28}}]}