{"title": "A Crowdsourced Frame Disambiguation Corpus with Ambiguity", "abstract": "We present a resource for the task of FrameNet semantic frame disambiguation of over 5,000 word-sentence pairs from the Wikipedia corpus. The annotations were collected using a novel crowdsourcing approach with multiple workers per sentence to capture interannotator disagreement. In contrast to the typical approach of attributing the best single frame to each word, we provide a list of frames with disagreement-based scores that express the confidence with which each frame applies to the word. This is based on the idea that inter-annotator disagreement is at least partly caused by ambiguity that is inherent to the text and frames. We have found many examples where the semantics of individual frames overlap sufficiently to make them acceptable alternatives for interpreting a sentence. We have argued that ignoring this ambiguity creates an overly arbitrary target for training and evaluating natural language processing systemsif humans cannot agree, why would we expect the correct answer from a machine to be any different? To process this data we also utilized an expanded lemma-set provided by the Framester system, which merges FN with WordNet to enhance coverage. Our dataset includes annotations of 1,000 sentence-word pairs whose lemmas are not part of FN. Finally we present metrics for evaluating frame disambiguation systems that account for ambiguity.", "text": [{"id": 0, "string": "Introduction Crowdsourcing has been a popular method to collect corpora for a variety of natural language processing tasks (Snow et al., 2008) , although one of its downsides is the crowd's lack of domain knowledge that is helpful in solving some tasks."}, {"id": 1, "string": "Semantic frame disambiguation is an example of a complex natural language processing task that is usually performed by linguistic experts, subjected to strict annotation guidelines and quality control (Baker, 2012) ."}, {"id": 2, "string": "The theory of frame semantics (J Fillmore, 1982) defines a frame as an abstract representation of a word sense, describing a type of entity, relation, or event, together with the associated roles implied by the frame."}, {"id": 3, "string": "The FrameNet (FN) corpus (Baker et al., 1998 ) is a collection of semantic frames, together with a corpus of documents annotated with these frames."}, {"id": 4, "string": "Similarly to word-sense disambiguation, frame disambiguation is the task of obtaining the correct frame for each word, since many words have multiple possible meanings."}, {"id": 5, "string": "Using domain experts for frame disambiguation is expensive and time consuming, resulting in small corpora for this task that do not scale well for modern machine learning methods -FN version 1.7, the latest one at the time of writing, contains only about 10,000 sentences annotated with frames."}, {"id": 6, "string": "Furthermore, only using one expert to perform the annotation makes it difficult to capture any diversity of perspectives."}, {"id": 7, "string": "There have been a number of small-scale attempts at using crowdsourcing for frame disambiguation in sentences, showing that the crowd has comparable performance to the FN domain experts (Hong and Baker, 2011) , and that the crowd can be used to correct wrong examples that have been collected automatically (Pavlick et al., 2015) ."}, {"id": 8, "string": "Crowd performance can be improved by combining frame role identification with disambiguation (Fossati et al., 2013) , or by asking crowd workers to give each other feedback and then letting them change their answer (Chang et al., 2015) ."}, {"id": 9, "string": "Crowdsourcing has also been useful to identify the ambiguity in frame disambiguation (Jurgens, 2013) ."}, {"id": 10, "string": "Previously, we have shown (Dumitrache et al., 2018a ) that while the crowd and FN expert mostly agree over frame disambiguation, disagreement cases are often caused by ambiguity, such as vague or overlapping frame definitions, or incomplete information in the sentence."}, {"id": 11, "string": "Because of these issues with the input data, the approach of selecting one single correct frame for every word, and ignoring alternative interpretations, often results in arbitrary, incomplete ground truth corpora."}, {"id": 12, "string": "In order to aggregate annotated data while preserving disagreement, we use the CrowdTruth method 1 (Aroyo and Welty, 2014) , which encourages using multiple crowd annotators to perform the same work, and processes the disagreement between them to signal low quality workers, sentences, and frames."}, {"id": 13, "string": "This paper presents a crowdsourced FN frame disambiguation corpus of 5,042 sentence-word pairs (which has since grown to over 9,000 since the submission of this paper)."}, {"id": 14, "string": "More than 1,000 of these are lexical units (LUs) not part of FN."}, {"id": 15, "string": "To our knowledge, it is the largest corpus of this type outside of FN."}, {"id": 16, "string": "In addition, we applied the CrowdTruth method, in which each sentence and lexical item is accompanied by a list of multiple frames with scores that express the confidence with which each frame applies to the word."}, {"id": 17, "string": "This allows us to demonstrate that ambiguity is a prominent feature of frame disambiguation, with many cases where more than one possible frame can apply to the same word."}, {"id": 18, "string": "Finally, we present an evaluation of several frame disambiguation models using evaluation metrics that leverage the multiple answers and their confidence scores, and show that even a model that always predicts the top crowd answer will not always have the best performance."}, {"id": 19, "string": "Corpus Collection & Analysis Data Preprocessing Our corpus consists of 5,042 candidate wordsentence pairs from Wikipedia (which has since grown to over 9,000 since the submission of this paper) and a candidate list of frames for the word, with 742 unique frames and 1,705 unique lexical units (LUs)."}, {"id": 20, "string": "The sentences have been randomly selected, based on these criteria: • The candidate word has no more than 25 candidate frames, to not overwhelm the annotators."}, {"id": 21, "string": "• The part of speech of the word is a verb."}, {"id": 22, "string": "1 http://crowdtruth.org • The distribution of candidate frames was optimized for maximum diversity using a greedy approach."}, {"id": 23, "string": "To gather the candidate frames for each word, we gathered the candidate frames associated with the LU from FN1.7."}, {"id": 24, "string": "Next we completed the candidate list using Framester (Gangemi et al., 2016) , which maps FN semantic frames to synonym sets from WordNet (Miller, 1995) ."}, {"id": 25, "string": "The sentences were processed with tokenization, sentence splitting, lemmatization and part-of-speech tagging."}, {"id": 26, "string": "Then each word with a frame attached to it was matched with all of its possible synonym sets from WordNet, while making sure that the part-ofspeech constraint of the synonym set is fulfilled."}, {"id": 27, "string": "Using the WordNet mapping, we constructed the list of additional candidate frames for each word."}, {"id": 28, "string": "Framester disambiguation used release 1.5 of FN, and some frames changed names in version 1.7, so we manually mapped these frames from FS to their latest version."}, {"id": 29, "string": "Framester disambiguation was also used to collect a subset of our corpus consisting of 1,000 sentence-word pairs with LUs that are not part of the FN corpus."}, {"id": 30, "string": "For simplicity, we refer to the sentence-word pairs as sentences in the rest of the paper."}, {"id": 31, "string": "Crowdsourcing Setup We ran the task on Amazon Mechanical Turk, where the workers were asked to select all frames that fit the sense of the highlighted word in a sentence from the multiple choice candidate list, or that none of the frames is correct."}, {"id": 32, "string": "We used 15 workers/sentence that were paid $0.05 for each judgment, and a total cost of $1.35 per sentence (after factoring in the additional AMT costs)."}, {"id": 33, "string": "2 To aggregate the results of the crowd while also capturing inter-annotator disagreement, we use the CrowdTruth metrics 3 (Dumitrache et al., 2018b) , replicating the setup from our previous work (Dumitrache et al., 2018a) ."}, {"id": 34, "string": "The choice of frames of one worker over one sentence are aggregated into a worker vector -a binary vector with n + 1 components, where n is the number of frames shown together with the sentence, where the decision to pick each of the frames (or none) corresponds to a component in the vector."}, {"id": 35, "string": "The vectors are used to calculate quality scores for workers, sentences and frames."}, {"id": 36, "string": "Although we make all quality scores available as part of the corpus, in this paper we focus on: • frame-sentence score (F SS): the degree with which a frame matches the sense of the word in the sentence."}, {"id": 37, "string": "It is the ratio of workers that picked the frame to all the workers that read the sentence, weighted by the worker quality."}, {"id": 38, "string": "A high F SS means the frame is clearly expressed in a sentence."}, {"id": 39, "string": "• sentence quality (SQS): the overall worker agreement over one sentence."}, {"id": 40, "string": "It is the average cosine similarity over all worker vectors for one sentence, weighted by the worker quality and frame quality."}, {"id": 41, "string": "A high SQS indicates a clear sentence."}, {"id": 42, "string": "The aggregated crowdsourcing results and the FN 1.5 to 1.7 mapping table are available online."}, {"id": 43, "string": "4 Ambiguity in the Corpus An analysis of the corpus found many examples of inter-annotator disagreement, of which a few examples are shown in Table 1 ."}, {"id": 44, "string": "For 720 sentences, a majority of the workers picked at least 2 frames (examples 1-3 in Table 1 )."}, {"id": 45, "string": "And for 1,514 sentences, no one frame has been picked by a majority of the workers (examples 4-7 in Table 1 )."}, {"id": 46, "string": "Disagreement is also more prominent in the sentences where the LU is not a part of FN ( Figure 1) ."}, {"id": 47, "string": "The disagreement comes from a variety of causes: a parent-child relation between the frames (statement and communication in #3), an overlap in the definition of the frames (accomplishment and successful action in #2), the meaning of the word is expressed by a composition of frames (in #7, \"straightening of the knee\" is a combination of reshaping the form of the knee, arranging the knee in the right position, and body movement), and combinations of all of these reasons (in #4, \"slices\" is a combination of part piece and cause harm, and the other frames are their children)."}, {"id": 48, "string": "More example sentences for each type of disagreement are available in the appendix."}, {"id": 49, "string": "The sentences themselves are not difficult to understand, and it can be argued that all of them have one frame that applies the best for the word."}, {"id": 50, "string": "The goal of this corpus is to show that next to this best frame for the word, there are other frames that apply to a lesser degree, or capture a different part of the meaning."}, {"id": 51, "string": "When evaluating a model for frame disambiguation, it seems unfair to penalize misclassifications of frames that still apply to the word, but with less clarity, in the same way we would penalize a frame that captures a wrong meaning."}, {"id": 52, "string": "Also, we argue that models should take into account that annotators do not agree over some examples, and treat them differently than clear expressions of frames."}, {"id": 53, "string": "Disagreement can also be caused by worker mistakes (in #6, dimension refers to the size of the object, not the act of measuring the size)."}, {"id": 54, "string": "While we try to mitigate for this by weighing confidence scores with the worker quality, the mistakes still appear in the corpus."}, {"id": 55, "string": "This type of disagreement could be useful in future work to identify examples that workers need to be trained on."}, {"id": 56, "string": "Evaluating Frame Disambiguation Systems Tested As an example usage of our corpus, we used it to evaluate these frame disambiguation models: If the LU is not in FN, it cannot make a prediction."}, {"id": 57, "string": "OS+: We modified the OS classifier to perform multi-label classification."}, {"id": 58, "string": "To calculate the confidence score for candidate frame f , we removed the softmax layer and passed the output of the BiLSTM model ν(f ) through the following transformation: c(f ) = [1 + tanh ν(f )]/2."}, {"id": 59, "string": "This gave a score c(f ) ∈ [0, 1] expressing the confidence that frame f is expressed in the sentence."}, {"id": 60, "string": "FS: Framester includes a tool for rule-based multi-class multi-label frame disambiguation (Gangemi et al., 2016) ."}, {"id": 61, "string": "While for the dataset pre-processing (Sec."}, {"id": 62, "string": "2) we considered the frames for all synsets a word is part of, FS performs an additional word-sense disambiguation step to return a more precise list of frames."}, {"id": 63, "string": "We used the tool with profile T as it was shown to have the overall better performance."}, {"id": 64, "string": "FS can only predict FN frames from the 1.5 release, which is missing 202 frames from version 1.7."}, {"id": 65, "string": "While OS+ produces confidence scores, the other methods produce binary labels for each frame-sentence pair."}, {"id": 66, "string": "These models do not have state-of-the-art performance (Hermann et al., 2014; FitzGerald et al., 2015) , we picked them because they were accessible and allowed testing on a novel corpus."}, {"id": 67, "string": "Finally, we evaluate the quality of the TC corpus, containing only the top frame picked by the crowd for every sentence."}, {"id": 68, "string": "This test shows what is the best possible performance over our corpus that can be expected from a system such as OS that selects a single frame per sentence."}, {"id": 69, "string": "Evaluation Metrics & Results Instead of traditional evaluation metrics that require binary labels, we propose an evaluation methodology that is able to consider multiple candidate frames for each sentence and their quality scores."}, {"id": 70, "string": "We use Kendall's τ list ranking coefficient (Kendall, 1938) and cosine similarity to calculate the distance between the list of frames produced by the crowd labeled with the F SS, and the frames predicted by the baselines in each sentence."}, {"id": 71, "string": "Whereas Kendall's τ only accounts for the ranking of the F SS for each frame, cosine similarity uses the actual F SS values in the calculation of the similarity."}, {"id": 72, "string": "Both metrics compute a score per sentence (Kendall's τ ∈ [−1, 1], and cosine similarity ∈ [0, 1])."}, {"id": 73, "string": "Using these metrics, we produce two aggregate statistics over our test corpus: (1) the area-under-curve (AU C) for each metric, normalized by the corpus size, and (2) the SQSweighted average of each metric (w − avg), which also accounts for the ambiguity of the sentence as expressed by the SQS."}, {"id": 74, "string": "We evaluate on two versions of the corpus: (1) the restricted set (R-SET) of 4,000 sentences with LUs from the FN corpus, and (2) the full set (F-SET) of 5,042 sentences."}, {"id": 75, "string": "The results (Figure 2 & Table 2 ) show that OS+ performs best out of all the models, even taking into account sentences with LUs not in FN for which OS+ cannot disambiguate."}, {"id": 76, "string": "FS performs the worst out of all models on R-SET, because it cannot find newly added frames from the latest FN release, but improves on the F-SET (FS can find candidate frames for LUs not in FN)."}, {"id": 77, "string": "The scores on the F-SET were lower for all baselines, suggesting that sentences with LUs not in FN are more difficult to classify -this could be because FN is missing frames that can express the full meaning of these LUs."}, {"id": 78, "string": "TC has a good performance, but is far from being unbeatable -when measuring Kendall's τ over the R-SET, OS+ performs better than TC."}, {"id": 79, "string": "Conclusions We described a FrameNet frame disambiguation resource of 5,042 sentence-word pairs, and 1,000 LUs that are new to FN -the largest corpus of this type outside of FN."}, {"id": 80, "string": "Since the submission of this paper, the corpus has grown to over 9,000 sentence-word pairs."}, {"id": 81, "string": "We also provide confidence scores for each candidate frame that are based on inter-worker disagreement."}, {"id": 82, "string": "We made a case for this kind of disagreement reflecting genuine cases of ambiguity in FrameNet frames, caused by: child-parent relations between frames, frames with overlapping definitions, or compositions of frames making up the meaning of a word."}, {"id": 83, "string": "The evaluation method we proposed uses the scores for multiple frames, and is thus able to differentiate between frames that still apply to the word, but with less clarity, and frames that capture the wrong meaning."}, {"id": 84, "string": "Our goal was to build a resource that recognizes different levels of ambiguity in the expression of the frames in the text, and allows a more fair evaluation of performance of frame disambiguation systems."}, {"id": 85, "string": "George A Miller."}, {"id": 86, "string": "1995 # SENTENCE SQS FRAMES (F SS) 1 These writings lack the mystical, philosophical elements of alchemy, but do contain the works of Bolus of Mendes (or Pseudo-Democritus), which aligned these recipes with theoretical knowledge of astrology and the classical elements."}, {"id": 87, "string": "0.284 arranging (0.474) adjusting (0.4) assessing (0.298) compatibility (0.254) undergo change (0.169) 2 However, commercial application of this fact has challenges in circumventing the passivating oxide layer, which inhibits the reaction, and in storing the energy required to regenerate the aluminium metal."}, {"id": 88, "string": "Table 5 : Ambiguity because the meaning of the word is expressed by a composition of frames."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 18}, {"section": "Data Preprocessing", "n": "2.1", "start": 19, "end": 30}, {"section": "Crowdsourcing Setup", "n": "2.2", "start": 31, "end": 42}, {"section": "Ambiguity in the Corpus", "n": "2.3", "start": 43, "end": 54}, {"section": "Systems Tested", "n": "3.1", "start": 55, "end": 56}, {"section": "OS+:", "n": "2.", "start": 57, "end": 59}, {"section": "FS:", "n": "3.", "start": 60, "end": 68}, {"section": "Evaluation Metrics & Results", "n": "3.2", "start": 69, "end": 78}, {"section": "Conclusions", "n": "4", "start": 79, "end": 88}], "figures": [{"filename": "../figure/image/988-Table1-1.png", "caption": "Table 1: Example sentences with disagreement over the frame annotations (candidate word in bold).", "page": 2, "bbox": {"x1": 77.75999999999999, "x2": 520.3199999999999, "y1": 64.32, "y2": 216.95999999999998}}, {"filename": "../figure/image/988-Table4-1.png", "caption": "Table 4: Ambiguity because of overlapping frame definitions.", "page": 5, "bbox": {"x1": 87.84, "x2": 509.28, "y1": 576.48, "y2": 742.0799999999999}}, {"filename": "../figure/image/988-Table3-1.png", "caption": "Table 3: Ambiguity because of parent-child relation between frames.", "page": 5, "bbox": {"x1": 87.84, "x2": 509.28, "y1": 389.76, "y2": 544.3199999999999}}, {"filename": "../figure/image/988-Figure1-1.png", "caption": "Figure 1: Histogram of SQS values - the quality scores in sentences where the LU is not in FN skew lower.", "page": 3, "bbox": {"x1": 73.92, "x2": 286.08, "y1": 63.36, "y2": 133.92}}, {"filename": "../figure/image/988-Table2-1.png", "caption": "Table 2: Aggregated evaluation results.", "page": 3, "bbox": {"x1": 314.88, "x2": 517.4399999999999, "y1": 233.76, "y2": 327.36}}, {"filename": "../figure/image/988-Figure2-1.png", "caption": "Figure 2: Baselines evaluation results.", "page": 3, "bbox": {"x1": 309.12, "x2": 524.64, "y1": 66.24, "y2": 206.88}}, {"filename": "../figure/image/988-Table5-1.png", "caption": "Table 5: Ambiguity because the meaning of the word is expressed by a composition of frames.", "page": 6, "bbox": {"x1": 87.84, "x2": 509.28, "y1": 64.32, "y2": 288.0}}]}