{"title": "Two Methods for Domain Adaptation of Bilingual Tasks: Delightfully Simple and Broadly Applicable", "abstract": "Bilingual tasks, such as bilingual lexicon induction and cross-lingual classification, are crucial for overcoming data sparsity in the target language. Resources required for such tasks are often out-of-domain, thus domain adaptation is an important problem here. We make two contributions. First, we test a delightfully simple method for domain adaptation of bilingual word embeddings. We evaluate these embeddings on two bilingual tasks involving different domains: cross-lingual twitter sentiment classification and medical bilingual lexicon induction. Second, we tailor a broadly applicable semi-supervised classification method from computer vision to these tasks. We show that this method also helps in low-resource setups. Using both methods together we achieve large improvements over our baselines, by using only additional unlabeled data.", "text": [{"id": 0, "string": "Introduction In this paper we study two bilingual tasks that strongly depend on bilingual word embeddings (BWEs)."}, {"id": 1, "string": "Previously, specialized domain adaptation approaches to such tasks were proposed."}, {"id": 2, "string": "We instead show experimentally that a simple adaptation process involving only unlabeled text is highly effective."}, {"id": 3, "string": "We then show that a semisupervised classification method from computer vision can be applied successfully for further gains in cross-lingual classification."}, {"id": 4, "string": "Our BWE adaptation method is delightfully simple."}, {"id": 5, "string": "We begin by adapting monolingual word embeddings to the target domain for source and target languages by simply building them using both general and target-domain unlabeled data."}, {"id": 6, "string": "As a second step we use post-hoc mapping (Mikolov et al., 2013b) , i.e., we use a seed lexicon to transform the word embeddings of the two languages into the same vector space."}, {"id": 7, "string": "We show experimentally for the first time that the domain-adapted bilingual word embeddings we produce using this extremely simple technique are highly effective."}, {"id": 8, "string": "We study two quite different tasks and domains, where resources are lacking, showing that our simple technique performs well for both of them: cross-lingual twitter sentiment classification and medical bilingual lexicon induction."}, {"id": 9, "string": "In previous work, task-dependent approaches were used for this type of domain adaptation."}, {"id": 10, "string": "Our approach is simple and task independent."}, {"id": 11, "string": "Second, we adapt the semi-supervised image classification system of Häusser et al."}, {"id": 12, "string": "(2017) for NLP problems for the first time."}, {"id": 13, "string": "This approach is broadly applicable to many NLP classification tasks where unlabeled data is available."}, {"id": 14, "string": "We tailor it to both of our cross-lingual tasks."}, {"id": 15, "string": "The system exploits unlabeled data during the training of classifiers by learning similar features for similar labeled and unlabeled training examples, thereby extracting information from unlabeled examples as well."}, {"id": 16, "string": "As we show experimentally, the system further improves cross-lingual knowledge transfer for both of our tasks."}, {"id": 17, "string": "After combining both techniques, the results of sentiment analysis are competitive with systems that use annotated data in the target language, an impressive result considering that we require no target-language annotated data."}, {"id": 18, "string": "The method also yields impressive improvements for bilingual lexicon induction compared with baselines trained on in-domain data."}, {"id": 19, "string": "We show that this system requires the high-quality domain-adapted bilingual word embeddings we previously created to use unlabeled data well."}, {"id": 20, "string": "Previous Work 2.1 Bilingual Word Embeddings Many approaches have been proposed for creating high quality BWEs using different bilingual signals."}, {"id": 21, "string": "Following Mikolov et al."}, {"id": 22, "string": "(2013b) , many authors (Faruqui and Dyer, 2014; Xing et al., 2015; Lazaridou et al., 2015; Vulić and Korhonen, 2016) map monolingual word embeddings (MWEs) into the same bilingual space."}, {"id": 23, "string": "Others leverage parallel texts (Hermann and Blunsom, 2014; or create artificial cross-lingual corpora using seed lexicons or document alignments (Vulić and Moens, 2015; Duong et al., 2016) to train BWEs."}, {"id": 24, "string": "In contrast, our aim is not to improve the intrinsic quality of BWEs, but to adapt BWEs to specific domains to enhance their performance on bilingual tasks in these domains."}, {"id": 25, "string": "Faruqui et al."}, {"id": 26, "string": "(2015) , Gouws and Søgaard (2015) , Rothe et al."}, {"id": 27, "string": "(2016) have previously studied domain adaptation of bilingual word embeddings, showing it to be highly effective for improving downstream tasks."}, {"id": 28, "string": "However, importantly, their proposed methods are based on specialized domain lexicons (such as, e.g., sentiment lexicons) which contain task specific word relations."}, {"id": 29, "string": "Our delightfully simple approach is, in contrast, effectively task independent (in that it only requires unlabeled in-domain text), which is an important strength."}, {"id": 30, "string": "Cross-Lingual Sentiment Analysis Sentiment analysis is widely applied, and thus ideally we would have access to high quality supervised models in all human languages."}, {"id": 31, "string": "Unfortunately, good quality labeled datasets are missing for many languages."}, {"id": 32, "string": "Training models on resource rich languages and applying them to resource poor languages is therefore highly desirable."}, {"id": 33, "string": "Crosslingual sentiment classification (CLSC) tackles this problem (Mihalcea et al., 2007; Banea et al., 2010; Wan, 2009; Lu et al., 2011; Balamurali and Joshi, 2012; Gui et al., 2013) ."}, {"id": 34, "string": "Recent CLSC approaches use BWEs as features of deep learning architectures which allows us to use a model for target-language sentiment classification, even when the model was trained only using sourcelanguage supervised training data."}, {"id": 35, "string": "Following this approach we perform CLSC on Spanish tweets using English training data."}, {"id": 36, "string": "Even though Spanish is not resource-poor we simulate this by using only English annotated data."}, {"id": 37, "string": "Xiao and Guo (2013) proposed a cross-lingual log-bilinear document model to learn distributed representations of words, which can capture both the semantic similarities of words across languages and the predictive information with respect to the classification task."}, {"id": 38, "string": "Similarly, Tang and Wan (2014) jointly embedded texts in different languages into a joint semantic space representing sentiment."}, {"id": 39, "string": "Zhou et al."}, {"id": 40, "string": "(2014) employed aligned sentences in the BWE learning process, but in the sentiment classification process only representations in the source language are used for training, and representations in the target language are used for predicting labels."}, {"id": 41, "string": "An important weakness of these three works was that aligned sentences were required."}, {"id": 42, "string": "Some work has trained sentiment-specific BWEs using annotated sentiment information in both languages (Zhou et al., 2015 (Zhou et al., , 2016 , which is desirable, but this is not applicable to our scenario."}, {"id": 43, "string": "Our goal is to adapt BWEs to a specific domain without requiring additional task-specific engineering or knowledge sources beyond having access to plentiful target-language in-domain unlabeled text."}, {"id": 44, "string": "Both of the approaches we study in this work fit this criterion, the delightfully simple method for adapting BWEs can improve the performance of any off-the-shelf classifier that is based on BWEs, while the broadly applicable semi-supervised approach of Häusser et al."}, {"id": 45, "string": "(2017) can improve the performance of any off-the-shelf classifier."}, {"id": 46, "string": "Bilingual Lexicon Induction (BLI) BLI is an important task that has been addressed by a large amount of previous work."}, {"id": 47, "string": "The goal of BLI is to automatically extract word translation pairs using BWEs."}, {"id": 48, "string": "While BLI is often used to provide an intrinsic evaluation of BWEs (Lazaridou et al., 2015; Vulić and Moens, 2015; Vulić and Korhonen, 2016) it is also useful for tasks such as machine translation (Madhyastha and España Bohnet, 2017) ."}, {"id": 49, "string": "Most work on BLI using BWEs focuses on frequent words in high-resource domains such as parliament proceedings or news texts."}, {"id": 50, "string": "Recently Heyman et al."}, {"id": 51, "string": "(2017) tackled BLI of words in the medical domain."}, {"id": 52, "string": "This task is useful for many applications such as terminology extraction or OOV mining for machine translation of medical texts."}, {"id": 53, "string": "Heyman et al."}, {"id": 54, "string": "(2017) show that when only a small amount of medical data is available, BLI using BWEs tends to perform poorly."}, {"id": 55, "string": "Especially BWEs obtained using post-hoc mapping (Mikolov et al., 2013b; Lazaridou et al., 2015) fail on this task."}, {"id": 56, "string": "Consequently, Heyman et al."}, {"id": 57, "string": "(2017) build BWEs using aligned documents and then engineer a specialized classification-based approach to BLI."}, {"id": 58, "string": "In contrast, our delightfully simple approach to create high-quality BWEs for the medical domain requires only monolingual data."}, {"id": 59, "string": "We show that our adapted BWEs yield impressive improvements over non-adapted BWEs in this task with both cosine similarity and with the classifier of Heyman et al."}, {"id": 60, "string": "(2017) ."}, {"id": 61, "string": "In addition, we show that the broadly applicable method can push performance further using easily accessible unlabeled data."}, {"id": 62, "string": "Adaptation of BWEs BWEs trained on general domain texts usually result in lower performance when used in a system for a specific domain."}, {"id": 63, "string": "There are two reasons for this."}, {"id": 64, "string": "(i) Vocabularies of specific domains contain words that are not used in the general case, e.g., names of medicines or diseases."}, {"id": 65, "string": "(ii) The meaning of a word varies across domains; e.g., \"apple\" mostly refers to a fruit in general domains, but is an electronic device in many product reviews."}, {"id": 66, "string": "The delightfully simple method adapts general domain BWEs in a way that preserves the semantic knowledge from general domain data and leverages monolingual domain specific data to create domain-specific BWEs."}, {"id": 67, "string": "Our domain-adaptation approach is applicable to any language-pair in which monolingual data is available."}, {"id": 68, "string": "Unlike other methods, our approach is task independent: it only requires unlabeled in-domain target language text."}, {"id": 69, "string": "Approach To create domain adapted BWEs, we first train MWEs (monolingual word embeddings) in both languages and then map those into the same space using post-hoc mapping (Mikolov et al., 2013b) ."}, {"id": 70, "string": "We train MWEs for both languages by concatenating monolingual out-of-domain and in-domain data."}, {"id": 71, "string": "The out-of-domain data allows us to create accurate distributed representations of common vocabulary while the in-domain data embeds domain specific words."}, {"id": 72, "string": "We then map the two MWEs using a small seed lexicon to create the adapted BWEs."}, {"id": 73, "string": "Because post-hoc mapping only requires a seed lexicon as bilingual signal it can easily be used with (cheap) monolingual data."}, {"id": 74, "string": "For post-hoc mapping, we use Mikolov et al."}, {"id": 75, "string": "(2013b)'s approach."}, {"id": 76, "string": "This model assumes a W ∈ R d 1 ×d 2 matrix which maps vectors from the source to the target MWEs where d 1 and d 2 are the embedding space dimensions."}, {"id": 77, "string": "A seed lexicon of (x i , y i ) ∈ L ⊆ R d 1 ×R d 2 pairs is needed where x i and y i are source and target MWEs."}, {"id": 78, "string": "W can be learned using ridge regression by minimizing the L 2 -regularized mapping error between the source x i and the target y i vectors: min W i ||W x i − y i || 2 2 + λ||W || 2 2 (1) where λ is the regularization weight."}, {"id": 79, "string": "Based on the source embedding x, we then compute a target embedding as W x."}, {"id": 80, "string": "We create MWEs with word2vec skipgram (Mikolov et al., 2013a) 1 and estimate W with scikit-learn (Pedregosa et al., 2011) ."}, {"id": 81, "string": "We use default parameters."}, {"id": 82, "string": "Cross-Lingual Sentiment Classification In CLSC, an important application of BWEs, we train a supervised sentiment model on training data available in the source (a resource rich language) and apply it to the target (a resource poor language, for which there is typically no training data available)."}, {"id": 83, "string": "Because BWEs embed source and target words in the same space, annotations in the source (represented as BWEs) enable transfer learning."}, {"id": 84, "string": "For CLSC of tweets, a drawback of BWEs trained on non-twitter data is that they do not produce embeddings for twitter-specific vocabulary, e.g., slang words like English coool and (Mexican) Spanish chido, resulting in lost information when a sentiment classifier uses them."}, {"id": 85, "string": "Training Data for Twitter Specific BWEs As comparable non-twitter data we use OpenSubtitles (Lison and Tiedemann, 2016) which contains 49.2M English and Spanish subtitle sentences respectively (Subtitle)."}, {"id": 86, "string": "The reason behind choosing Subtitles is that although it is out-of-domain it contains slang words similar to tweets thus serving as a strong baseline in our setup."}, {"id": 87, "string": "We experiment with two monolingual twitter data sets: (i) 22M tweets: Downloaded 2 English (17.2M) and Spanish (4.8M) tweets using the public Twitter Streaming API 3 with language filters en and es (ii) a BACKGROUND corpus of 296K English and 150K Spanish (non-annotated) tweets released with the test data of the RepLab task (Amigó et al., 2013) described below All twitter data was tokenized using Bird et al."}, {"id": 88, "string": "(2009) and lowercased."}, {"id": 89, "string": "User names, URLs, numbers, emoticons and punctuation were removed."}, {"id": 90, "string": "As lexicon for the mapping, we use the BNC word frequency list (Kilgarriff, 1997) , a list of 6,318 frequent English lemmas and their Spanish translations, obtained from Google Translate."}, {"id": 91, "string": "Note that we do not need a domain-specific lexicon in order to get good quality adapted BWEs."}, {"id": 92, "string": "Training Data for Sentiment Classifiers For sentiment classification, we use data from the RepLab 2013 shared task (Amigó et al., 2013) ."}, {"id": 93, "string": "The data is annotated with positive, neutral and negative labels and contains English and Spanish tweets."}, {"id": 94, "string": "We used the official English training set (26.6K tweets) and the Spanish test set (14.9K) in the resource-poor setup."}, {"id": 95, "string": "We only use the 7.2K Spanish labeled training data for comparison reasons in §6.2, which we will discuss later."}, {"id": 96, "string": "The shared task was on target-level sentiment analysis, i.e., given a pair (document, target entity), the gold annotation is based on whether the sentiment expressed by the document is about the target."}, {"id": 97, "string": "For example: I cried on the back seat of my BMW!"}, {"id": 98, "string": "where BMW is the target would be negative in the sentence-level scenario."}, {"id": 99, "string": "However, it is neutral in the target-level case because the negative sentiment is not related to BMW."}, {"id": 100, "string": "The reason for using this dataset is that it contains comparable English and Spanish tweets annotated for sentiment."}, {"id": 101, "string": "There are other twitter datasets for English (Nakov et al., 2016) and Spanish (Garcıa-Cumbreras et al., 2016), but they were downloaded at different times and were annotated using different annotation methodologies, thus impeding a clean and consistent evaluation."}, {"id": 102, "string": "Sentiment Systems For evaluating our adapted BWEs on the RepLab dataset we used a target-aware sentiment classifier introduced by Zhang et al."}, {"id": 103, "string": "(2016) ."}, {"id": 104, "string": "The network first embeds input words using pre-trained 3 dev.twitter.com/streaming/overview BWEs and feeds them to a bi-directional gated neural network."}, {"id": 105, "string": "Pooling is applied on the hidden representations of the left and right context of the target mention respectively."}, {"id": 106, "string": "Finally, gated neurons are used to model the interaction between the target mention and its surrounding context."}, {"id": 107, "string": "During training we hold our pre-trained BWEs fixed and keep the default parameters of the model."}, {"id": 108, "string": "We also implement Kim (2014)'s CNN-nonstatic system, which does not use the target information in a given document (target-ignorant)."}, {"id": 109, "string": "The network first embeds input words using pretrained BWEs and feeds them to a convolutional layer with multiple window sizes."}, {"id": 110, "string": "Max pooling is applied on top of convolution followed by a fully connected network with one hidden layer."}, {"id": 111, "string": "We used this system as well because it performed comparably to the target-aware system."}, {"id": 112, "string": "The reason for this is that only 1% of the used data contains more than one target and out of these rare cases only 14% have differing sentiment labels in the same sentence, which are the difficult cases of target-level sentiment analysis."}, {"id": 113, "string": "We used the default parameters as described in (Kim, 2014) with the exception of using 1000 feature maps and 30 epochs, based on our initial experiments."}, {"id": 114, "string": "Word embeddings are fixed during the training just as for the target-aware classifier."}, {"id": 115, "string": "Results As we previously explained we evaluate our adaptation method on the task of target-level sentiment classification using both target-aware and target-ignorant classifiers."}, {"id": 116, "string": "For all experiments, our two baselines are off-the-shelf classifiers using non-adapted BWEs, i.e., BWEs trained only using Subtitles."}, {"id": 117, "string": "Our goal is to show that our BWE adaptation method can improve the performance of such classifiers."}, {"id": 118, "string": "We train our adapted BWEs on the concatenation of Subtitle and 22M tweets or BACKGROUND respectively."}, {"id": 119, "string": "In addition, we also report results with BWEs trained only on tweets."}, {"id": 120, "string": "To train the sentiment classifiers we use the English Replab training set and we evaluate on the Spanish test set."}, {"id": 121, "string": "To show the performance that can be reached in a monolingual setup, we report results obtained by using annotated Spanish sentiment data instead of English (oracle)."}, {"id": 122, "string": "We train two oracle sentiment classifiers using (i) MWEs trained on only the Spanish part of Subtitle and (ii) BWEs trained on Subtitle using posthoc mapping."}, {"id": 123, "string": "The difference between the two is that the embeddings of (ii) are enriched with English words which can be beneficial for the classification of Spanish tweets because they often contain a few English words."}, {"id": 124, "string": "We do not compare with word embedding adaptation methods relying on specialized resources."}, {"id": 125, "string": "The point of our work is to study task-independent methods and to the best of our knowledge ours is the first such attempt."}, {"id": 126, "string": "Similarly, we do not compare against machine translation based sentiment classifiers (e.g., (Zhou et al., 2016) ) because for their adaptation in-domain parallel data would be needed."}, {"id": 127, "string": "Table 1 gives results for both classifiers."}, {"id": 128, "string": "It shows that the adaptation of Subtitle based BWEs with data from Twitter (22M tweets and BACK-GROUND) clearly outperforms the Baseline in all cases."}, {"id": 129, "string": "The target-aware system performed poorly with the baseline BWEs and could benefit significantly from the adaptation approach."}, {"id": 130, "string": "The target-ignorant performed better with the baseline BWEs but could also benefit from the adaptation."}, {"id": 131, "string": "Comparing results with the Twitter-dataset-only based BWEs, the 22M tweets performed better even though the BACKGROUND dataset is from the same topic as the RepLab train and test sets."}, {"id": 132, "string": "Our conjecture is that the latter is too small to create good BWEs."}, {"id": 133, "string": "In combination with Subtitles, 22M tweets also yields better results than when combined with BACKGROUND."}, {"id": 134, "string": "Although the best accuracy was reached using the 22M tweetsonly based BWEs, it is only slightly better then the adapted Subtitles+22M tweets based BWEs."}, {"id": 135, "string": "In §6 we show that both the semantic knowledge from Subtitles and the domain-specific information from tweets are needed to further improve results."}, {"id": 136, "string": "Comparing the two classifiers we can say that they performed similarly in terms of their best results."}, {"id": 137, "string": "On the other hand, the target-ignorant system had better results on average."}, {"id": 138, "string": "This might seem surprising at first because the system does not use the target as information."}, {"id": 139, "string": "But considering the characteristics of RepLab, i.e., that the number of tweets that contains multiple targets is negligible, using the target offers no real advantage."}, {"id": 140, "string": "Although we did not focus on the impact of the seed lexicon size, we ran post-hoc mapping with different sizes during our preliminary experiments."}, {"id": 141, "string": "With 1,000 and 100 word pairs in the lexicon the target-ignorant system suffered 0.5% and 4.0% drop in average of our setups respectively."}, {"id": 142, "string": "To summarize the result: using adapted BWEs for the Twitter CLSC task improves the performance of off-the-shelf classifiers."}, {"id": 143, "string": "Medical Bilingual Lexicon Induction Another interesting downstream task for BWEs is bilingual lexicon induction."}, {"id": 144, "string": "Given a list of words in a source language, the goal of BLI is to mine translations for each word in a chosen target language."}, {"id": 145, "string": "The medical bilingual lexicon induction task proposed in (Heyman et al., 2017) aims to mine medical words using BWEs trained on a very small amount of English and Dutch monolingual medical data."}, {"id": 146, "string": "Due to the lack of resources in this domain, good quality BWEs are hard to build using in-domain data only."}, {"id": 147, "string": "We show that by enriching BWEs with general domain knowledge (in the form of general domain monolingual corpora) better results can be achieved on this medical domain task."}, {"id": 148, "string": "Experimental Setup We evaluate our improved BWEs on the dataset provided by Heyman et al."}, {"id": 149, "string": "(2017) ."}, {"id": 150, "string": "The monolingual medical data consists of English and Dutch medical articles from Wikipedia."}, {"id": 151, "string": "The English (resp."}, {"id": 152, "string": "Dutch) articles contain 52,336 (resp."}, {"id": 153, "string": "21,374) sentences."}, {"id": 154, "string": "A total of 7,368 manually annotated word translation pairs occurring in the English (source) and Dutch (target) monolingual corpora are provided as gold data."}, {"id": 155, "string": "This set is split 64%/16%/20% into trn/dev/test."}, {"id": 156, "string": "20% of the English words have multiple translations."}, {"id": 157, "string": "Given an English word, the task is to find the correct Dutch translation."}, {"id": 158, "string": "As monolingual general-domain data we use Table 2 : We report F 1 results for medical BLI with the cosine similarity and the classifier based systems."}, {"id": 159, "string": "We present baseline and our proposed domain adaptation method using both general and medical lexicons."}, {"id": 160, "string": "the English and Dutch data from Europarl (v7) (Koehn, 2005) , a corpus of 2 million sentence pairs."}, {"id": 161, "string": "Although Europarl is a parallel corpus, we use it in a monolingual way and shuffle each side of the corpus before training."}, {"id": 162, "string": "By using massive cheap data we create high-quality MWEs in each language which are still domain-specific (due to inclusion of medical data)."}, {"id": 163, "string": "To obtain an out-ofdomain seed lexicon, we translated the English words in BNC to Dutch using Google Translate (just as we did before for the Twitter CLSC task)."}, {"id": 164, "string": "We then use the out-of-domain BNC and the indomain medical seed lexicons in separate experiments to create BWEs with post-hoc mapping."}, {"id": 165, "string": "Note, we did not concatenate the two lexicons because (i) they have a small common subset of source words which have different target words, thus having a negative effect on the mapping and (ii) we did not want to modify the medical seed lexicon because it was taken from previous work."}, {"id": 166, "string": "BLI Systems To perform BLI we use two methods."}, {"id": 167, "string": "Because BWEs represent words from different languages in a shared space, BLI can be performed via cosine similarity in this space."}, {"id": 168, "string": "In other words, given a BWE representing two languages V s and V t , the translation of each word s ∈ V s can be induced by taking the word t ∈ V t whose representation x t in the BWE is closest to the representation x s ."}, {"id": 169, "string": "As the second approach we use a classifier based system proposed by Heyman et al."}, {"id": 170, "string": "(2017) ."}, {"id": 171, "string": "This neural network based system is comprised of two main modules."}, {"id": 172, "string": "The first is a character-level LSTM which aims to learn orthographic similarity of word pairs."}, {"id": 173, "string": "The other is the concatenation of the embeddings of the two words using embedding layers with the aim of learning the similarity among semantic representations of the words."}, {"id": 174, "string": "Dense layers are applied on top of the two modules before the output soft-max layer."}, {"id": 175, "string": "The classifier is trained using positive and negative word pair examples and a pre-trained word embedding model."}, {"id": 176, "string": "Negative examples are randomly generated for each positive one in the training lexicon."}, {"id": 177, "string": "We used default parameters as reported by Heyman et al."}, {"id": 178, "string": "(2017) except for the t classification thresholds (used at prediction time)."}, {"id": 179, "string": "We finetuned these on dev."}, {"id": 180, "string": "We note that the system works with pre-trained MWEs as well (and report these as official baseline results) but it requires BWEs for candidate generation at prediction time, thus we use BWEs for the system's input for all experiments."}, {"id": 181, "string": "In preliminary work, we had found that MWE and BWE results are similar."}, {"id": 182, "string": "Results Heyman et al."}, {"id": 183, "string": "(2017)'s results are our baseline."}, {"id": 184, "string": "Table 2 compares its performance with our adapted BWEs, with both cosine similarity and classification based systems."}, {"id": 185, "string": "\"top\" F 1 scores are based on the most probable word as prediction only; \"all\" F 1 scores use all words as prediction whose probability is above the threshold."}, {"id": 186, "string": "It can be seen that the cosine similarity based system using adapted BWEs clearly outperforms the nonadapted BWEs which were trained in a resource poor setup."}, {"id": 187, "string": "4 Moreover, the best performance was reached using the general seed lexicon for the mapping which is due to the fact that general domain words have better quality embeddings in the MWE models, which in turn gives a better quality mapping."}, {"id": 188, "string": "The classification based system performs significantly better comparing to cosine similarity by exploiting the seed lexicon better."}, {"id": 189, "string": "Using adapted BWEs as input word embeddings for the system further improvements were achieved which shows the better quality of our BWEs."}, {"id": 190, "string": "Simulating an even poorer setup by using a general lexicon, the performance gain of the classifier is lower."}, {"id": 191, "string": "This shows the significance of the medical seed lexicon for this system."}, {"id": 192, "string": "On the other hand, adapted BWEs have better performance compared to non-adapted ones using the best translation while they have just slightly lower F 1 using multiple translations."}, {"id": 193, "string": "This result shows that while with adapted BWEs the system predicts better \"top\" translations, it has a harder time when predicting \"all\" due to the increased vocabulary size."}, {"id": 194, "string": "To summarize: we have shown that adapted BWEs increase performance for this task and domain; and they do so independently of the taskspecific system that is used."}, {"id": 195, "string": "Semi-Supervised Learning In addition to the experiments that show our BWEadaptation method's task and language independence, we investigate ways to further incorporate unlabeled data to overcome data sparsity."}, {"id": 196, "string": "Häusser et al."}, {"id": 197, "string": "(2017) introduce a semisupervised method for neural networks that makes associations from the vector representation of labeled samples to those of unlabeled ones and back."}, {"id": 198, "string": "This lets the learning exploit unlabeled samples as well."}, {"id": 199, "string": "While Häusser et al."}, {"id": 200, "string": "(2017) use their model for image classification, we adapt it to CLSC of tweets and medical BLI."}, {"id": 201, "string": "We show that our semisupervised model requires adapted BWEs to be effective and yields significant improvements."}, {"id": 202, "string": "This innovative method is general and can be applied to any classification when unlabeled text is available."}, {"id": 203, "string": "Model Häusser et al."}, {"id": 204, "string": "(2017)'s basic assumption is that the embeddings of labeled and unlabeled samplesi.e., the representations in the neural network on which the classification layer is applied -are similar within the same class."}, {"id": 205, "string": "To achieve this, walking cycles are introduced: a cycle starts from a labeled sample, goes to an unlabeled one and ends at a labeled one."}, {"id": 206, "string": "A cycle is correct if the start and end samples are in the same class."}, {"id": 207, "string": "The probability of going from sample A to B is proportional to the cosine similarity of their embeddings."}, {"id": 208, "string": "To maximize the number of correct cycles, two loss functions are employed: Walker loss and Visit loss."}, {"id": 209, "string": "Walker loss penalizes incorrect walks and encourages a uniform probability distribution of walks to the correct class."}, {"id": 210, "string": "It is defined as: L walker := H(T, P aba ) (2) where H is the cross-entropy function, P aba ij is the probability that a cycle starts from sample i and ends at j and T is the uniform target distribution: T ij := 1/(#c(i)) if c(i) = c(j) 0 otherwise (3) where c(i) is the class of sample i and #c(i) is the number of occurrences of c(i) in the labeled set."}, {"id": 211, "string": "Visit loss encourages cycles to visit all unlabeled samples, rather than just those which are the most similar to labeled samples."}, {"id": 212, "string": "It is defined as: L visit := H(V, P visit ) P visit j := P ab ij i (4) V j := 1 U where H is cross-entropy, P ab ij is the probability that a cycle starts from sample i and goes to j and U is the number of unlabeled samples."}, {"id": 213, "string": "The total loss during training is the sum of the walker, visit and classification (cross-entropy between predicted and gold labels) losses which is minimized using Adam (Kingma and Ba, 2015) ."}, {"id": 214, "string": "We adapt this model (including the two losses) to sentiment classification, focusing on the targetignorant classifier, and the classifier based approach for BLI."}, {"id": 215, "string": "We will call these systems semisup 5 ."}, {"id": 216, "string": "Due to the fact that we initialize the embedding layers for both classifiers with BWEs the models are able to make some correct cycles at the beginning of the training and improve them later on."}, {"id": 217, "string": "We will describe the labeled and unlabeled datasets used in the subsequent sections below."}, {"id": 218, "string": "We use Häusser et al."}, {"id": 219, "string": "(2017) 's implementation of the losses, with 1.0, 0.5 and 1.0 weights for the walker, visit and classification losses, respectively, for CLSC based on preliminary experiments."}, {"id": 220, "string": "We fine-tuned the weights for BLI on dev for each experiment."}, {"id": 221, "string": "Table 3 : Accuracy on CLSC of the adapted BWE approach with the semisup (target-ignorant with additional loss functions) system comparing to the target-ignorant in brackets."}, {"id": 222, "string": "Semi-Supervised CLSC As in §4.4, we use pre-trained BWEs to initialize the classifier and use English sentiment training data as the labeled set."}, {"id": 223, "string": "Furthermore, we use the Spanish sentiment training data as the unlabeled set, ignoring its annotation."}, {"id": 224, "string": "This setup is very similar to real-word low-resource scenarios: unlabeled target-language tweets are easy to download while labeled English ones are available."}, {"id": 225, "string": "Table 3 gives results for adapted BWEs and shows that semisup helps only when word embeddings are adapted to the Twitter domain."}, {"id": 226, "string": "As mentioned earlier, semisup compares labeled and unlabeled samples based on their vector representations."}, {"id": 227, "string": "By using BWEs based on only Subtitles, we lose too many embeddings of similar English and Spanish tweets."}, {"id": 228, "string": "On the other hand, if we use only tweet-based BWEs we lose good quality semantic knowledge which can be learned from more standard text domains."}, {"id": 229, "string": "By combining the two domains we were able to capture both sides."}, {"id": 230, "string": "For Sub-title+22M tweets, we even get very close to the best oracle (BWE Subtitle) in Table 1 getting only 0.27% less accuracy -an impressive result keeping in mind that we did not use labeled Spanish data."}, {"id": 231, "string": "The RepLab dataset contains tweets from 4 topics: automotive, banking, university, music."}, {"id": 232, "string": "We manually analyzed similar tweets from the labeled and unlabeled sets."}, {"id": 233, "string": "We found that when using semisup, English and Spanish tweets from the same topics are more similar in the embedding space than occurs without the additional losses."}, {"id": 234, "string": "Topics differ in how they express sentiment -this may explain why semisup increases performance for RepLab."}, {"id": 235, "string": "Adding supervision."}, {"id": 236, "string": "To show how well semisup can exploit the unlabeled data we used both English and Spanish sentiment training data together to train the sentiment classifiers."}, {"id": 237, "string": "Table 4 shows that by using annotated data in both languages we get clearly better results than when using only one language."}, {"id": 238, "string": "Tables  3 and 4 show that for Subtitle+22M tweets based BWEs, the semisup approach achieved high improvement (2.17%) comparing to targetignorant with English training data only, while it achieved lower improvement (0.97%) with the Subtitle+BACKGROUND based BWEs."}, {"id": 239, "string": "On the other hand, adding labeled Spanish data caused just a slight increase comparing to semisup with Subtitle+22M tweets based BWEs (0.59%), while in case of Subtitle+BACKGROUND we got significant additional improvement (2.61%)."}, {"id": 240, "string": "This means that with higher quality BWEs, unlabeled target-language data can be exploited better."}, {"id": 241, "string": "It can also be seen that the target-aware system outperformed the target-ignorant system using additional labeled target-language data."}, {"id": 242, "string": "The reason could be that it is a more complex network and therefore needs more data to reach high performance."}, {"id": 243, "string": "The results in table 4 are impressive: our targetlevel system is strongly competitive with the official shared task results."}, {"id": 244, "string": "We achieved high accuracy on the Spanish test set by using only English training data."}, {"id": 245, "string": "Comparing our best system which used all training data to the official results (Amigó et al., 2013) we would rank 2 nd even though our system is not fine-tuned for the Re-pLab dataset."}, {"id": 246, "string": "Furthermore, we also outperformed the oracles when using annotated data from both languages which shows the additional advantage of using BWEs."}, {"id": 247, "string": "Semi-Supervised BLI For BLI experiments with semisup we used word pairs from the medical seed lexicon as the labeled set (with negative word pairs generated as described in §5.2)."}, {"id": 248, "string": "As opposed to CLSC and the work of (Häusser et al., 2017) , for this task we do not have an unlabeled set, and therefore we need to generate it."}, {"id": 249, "string": "We developed two scenarios."}, {"id": 250, "string": "For the first, BNC, we generate a general unlabeled set using English words from the BNC lexicon and generate 10 pairs out of each word by using the 5 most similar Dutch words based on the corresponding BWEs and 5 random Dutch words."}, {"id": 251, "string": "For the second scenario, medical, we generate an in-domain unlabeled set by generating for each English word in the medical lexicon the 3 most similar Dutch   words based on BWEs and for each of these we use the 5 most similar English words (ignoring the words which are in the original medical lexicon) and 5 negative words."}, {"id": 252, "string": "The idea behind these methods is to automatically generate an unlabeled set that hopefully has a similar positive and negative word pair distribution to the distribution in the labeled set."}, {"id": 253, "string": "Table 5 show that adding semisup to the classifier further increases performance for BLI as well."}, {"id": 254, "string": "For the baseline system, when using only in-domain text for creating BWEs, only the medical unlabeled set was effective, general domain word pairs could not be exploited due to the lack of general semantic knowledge in the BWE model."}, {"id": 255, "string": "On the other hand, by using our domain adapted BWEs, which contain both general domain and in-domain semantical knowledge, we can exploit word pairs from both domains."}, {"id": 256, "string": "Results for adapted BWEs increased in 3 out of 4 cases, where the only exception is when using multiple translations for a given source word (which may have been caused by the bigger vocabulary size)."}, {"id": 257, "string": "Results in These results show that adapted BWEs are needed to exploit unlabeled data well which leads to an impressive overall 3.71 increase compared with the best result in previous work (Heyman et al., 2017) , by using only unlabeled data."}, {"id": 258, "string": "Conclusion Bilingual word embeddings trained on general domain data yield poor results in out-of-domain tasks."}, {"id": 259, "string": "We presented experiments on two different low-resource task/domain combinations."}, {"id": 260, "string": "Our delightfully simple task independent method to adapt BWEs to a specific domain uses unlabeled monolingual data only."}, {"id": 261, "string": "We showed that with the support of adapted BWEs the performance of offthe-shelf methods can be increased for both crosslingual Twitter sentiment classification and medical bilingual lexicon induction."}, {"id": 262, "string": "Furthermore, by adapting the broadly applicable semi-supervised approach of Häusser et al."}, {"id": 263, "string": "(2017) (which until now has only been applied in computer vision) we were able to effectively exploit unlabeled data to further improve performance."}, {"id": 264, "string": "We showed that, when also using high-quality adapted BWEs, the performance of the semi-supervised systems can be significantly increased by using unlabeled data at classifier training time."}, {"id": 265, "string": "In addition, CLSC results are competitive with a system that uses targetlanguage labeled data, even when we use no such target-language labeled data."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 19}, {"section": "Previous Work 2.1 Bilingual Word Embeddings", "n": "2", "start": 20, "end": 29}, {"section": "Cross-Lingual Sentiment Analysis", "n": "2.2", "start": 30, "end": 45}, {"section": "Bilingual Lexicon Induction (BLI)", "n": "2.3", "start": 46, "end": 61}, {"section": "Adaptation of BWEs", "n": "3", "start": 62, "end": 68}, {"section": "Approach", "n": "3.1", "start": 69, "end": 81}, {"section": "Cross-Lingual Sentiment Classification", "n": "4", "start": 82, "end": 84}, {"section": "Training Data for Twitter Specific BWEs", "n": "4.1", "start": 85, "end": 91}, {"section": "Training Data for Sentiment Classifiers", "n": "4.2", "start": 92, "end": 101}, {"section": "Sentiment Systems", "n": "4.3", "start": 102, "end": 114}, {"section": "Results", "n": "4.4", "start": 115, "end": 142}, {"section": "Medical Bilingual Lexicon Induction", "n": "5", "start": 143, "end": 147}, {"section": "Experimental Setup", "n": "5.1", "start": 148, "end": 165}, {"section": "BLI Systems", "n": "5.2", "start": 166, "end": 181}, {"section": "Results", "n": "5.3", "start": 182, "end": 194}, {"section": "Semi-Supervised Learning", "n": "6", "start": 195, "end": 202}, {"section": "Model", "n": "6.1", "start": 203, "end": 221}, {"section": "Semi-Supervised CLSC", "n": "6.2", "start": 222, "end": 246}, {"section": "Semi-Supervised BLI", "n": "6.3", "start": 247, "end": 257}, {"section": "Conclusion", "n": "7", "start": 258, "end": 265}], "figures": [{"filename": "../figure/image/991-Table4-1.png", "caption": "Table 4: Accuracy on CLSC of both target-aware and target-ignorant systems using English or/and Spanish sentiment training data. Column lang shows the language of the used training data. Differences comparing to semisup are indicated in brackets.", "page": 8, "bbox": {"x1": 154.56, "x2": 442.08, "y1": 61.44, "y2": 132.48}}, {"filename": "../figure/image/991-Table5-1.png", "caption": "Table 5: Results with the semi-supervised system for BLI. Differences comparing to previous results are indicated in brackets. Baseline results are compared to rerun experiments of Heyman et al. (2017) using BWEs instead of MWEs.", "page": 8, "bbox": {"x1": 81.6, "x2": 280.32, "y1": 196.79999999999998, "y2": 248.16}}, {"filename": "../figure/image/991-Table2-1.png", "caption": "Table 2: We report F1 results for medical BLI with the cosine similarity and the classifier based systems. We present baseline and our proposed domain adaptation method using both general and medical lexicons.", "page": 5, "bbox": {"x1": 159.84, "x2": 438.24, "y1": 61.44, "y2": 127.19999999999999}}, {"filename": "../figure/image/991-Table1-1.png", "caption": "Table 1: Accuracy of the BWE adaptation approach on the target-level sentiment classification task. The oracle systems used Spanish sentiment training data instead of English.", "page": 4, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 61.44, "y2": 144.96}}, {"filename": "../figure/image/991-Table3-1.png", "caption": "Table 3: Accuracy on CLSC of the adapted BWE approach with the semisup (target-ignorant with additional loss functions) system comparing to the target-ignorant in brackets.", "page": 7, "bbox": {"x1": 75.84, "x2": 286.08, "y1": 61.44, "y2": 120.96}}]}