{"title": "Structural Neural Encoders for AMR-to-text Generation", "abstract": "AMR-to-text generation is a problem recently introduced to the NLP community, in which the goal is to generate sentences from Abstract Meaning Representation (AMR) graphs. Sequence-to-sequence models can be used to this end by converting the AMR graphs to strings. Approaching the problem while working directly with graphs requires the use of graph-to-sequence models that encode the AMR graph into a vector representation. Such encoding has been shown to be beneficial in the past, and unlike sequential encoding, it allows us to explicitly capture reentrant structures in the AMR graphs. We investigate the extent to which reentrancies (nodes with multiple parents) have an impact on AMR-to-text generation by comparing graph encoders to tree encoders, where reentrancies are not preserved. We show that improvements in the treatment of reentrancies and long-range dependencies contribute to higher overall scores for graph encoders. Our best model achieves 24.40 BLEU on LDC2015E86, outperforming the state of the art by 1.1 points and 24.54 BLEU on LDC2017T10, outperforming the state of the art by 1.24 points.", "text": [{"id": 0, "string": "Introduction Abstract Meaning Representation (AMR; Banarescu et al."}, {"id": 1, "string": "2013 ) is a semantic graph representation that abstracts away from the syntactic realization of a sentence, where nodes in the graph represent concepts and edges represent semantic relations between them."}, {"id": 2, "string": "AMRs are graphs, rather than trees, because co-references and control structures result in nodes with multiple parents, called reentrancies."}, {"id": 3, "string": "For instance, the AMR of Figure 1 (a) contains a reentrancy between finger and he, caused by the possessive pronoun his."}, {"id": 4, "string": "AMR-to-text generation is the task of automatically generating natural language from AMR graphs."}, {"id": 5, "string": "Attentive encoder/decoder architectures, commonly used for Neural Machine Translation (NMT), have been explored for this task (Konstas et al., 2017; Song et al., 2018; Beck et al., 2018) ."}, {"id": 6, "string": "In order to use sequence-to-sequence models, Konstas et al."}, {"id": 7, "string": "(2017) reduce the AMR graphs to sequences, while Song et al."}, {"id": 8, "string": "(2018) and Beck et al."}, {"id": 9, "string": "(2018) directly encode them as graphs."}, {"id": 10, "string": "Graph encoding allows the model to explicitly encode reentrant structures present in the AMR graphs."}, {"id": 11, "string": "While central to AMR, reentrancies are often hard to treat both in parsing and in generation."}, {"id": 12, "string": "Previous work either removed them from the graphs, hence obtaining sequential (Konstas et al., 2017) or tree-structured (Liu et al., 2015; Takase et al., 2016) data, while other work maintained them but did not analyze their impact on performance (e.g., Song et al., 2018; Beck et al., 2018) ."}, {"id": 13, "string": "Damonte et al."}, {"id": 14, "string": "(2017) showed that state-of-the-art parsers do not perform well in predicting reentrant structures, while van Noord and Bos (2017) compared different pre-and post-processing techniques to improve the performance of sequenceto-sequence parsers with respect to reentrancies."}, {"id": 15, "string": "It is not yet clear whether explicit encoding of reentrancies is beneficial for generation."}, {"id": 16, "string": "In this paper, we compare three types of encoders for AMR: 1) sequential encoders, which reduce AMR graphs to sequences; 2) tree encoders, which ignore reentrancies; and 3) graph encoders."}, {"id": 17, "string": "We pay particular attention to two phenomena: reentrancies, which mark co-reference and control structures, and long-range dependencies in the AMR graphs, which are expected to benefit from structural encoding."}, {"id": 18, "string": "The contributions of the paper are two-fold: • We present structural encoders for the encoder/decoder framework and show the benefits of graph encoders not only compared to sequential encoders but also compared to tree encoders, which have not been studied so far for AMR-to-text generation."}, {"id": 19, "string": "• We show that better treatment of reentrancies and long-range dependencies contributes to improvements in the graph encoders."}, {"id": 20, "string": "Our best model, based on a graph encoder, achieves state-of-the-art results for both the LDC2015E86 dataset (24.40 on BLEU and 23.79 on Meteor) and the LDC2017T10 dataset (24.54 on BLEU and 24.07 on Meteor)."}, {"id": 21, "string": "Input Representations Graph-structured AMRs AMRs are normally represented as rooted and directed graphs: G 0 = (V 0 , E 0 , L), V 0 = {v 1 , v 2 , ."}, {"id": 22, "string": "."}, {"id": 23, "string": "."}, {"id": 24, "string": ", v n }, root ∈ V 0 , where V 0 are the graph vertices (or nodes) and root is a designated root node in V 0 ."}, {"id": 25, "string": "The edges in the AMR are labeled: E 0 ⊆ V 0 × L × V 0 , L = { 1 , 2 , ."}, {"id": 26, "string": "."}, {"id": 27, "string": "."}, {"id": 28, "string": ", n }."}, {"id": 29, "string": "Each edge e ∈ E 0 is a triple: e = (i, label, j), where i ∈ V 0 is the parent node, label ∈ L is the edge label and j ∈ V 0 is the child node."}, {"id": 30, "string": "In order to obtain unlabeled edges, thus decreasing the total number of parameters required by the models, we replace each labeled edge e = (i, label, j) with two unlabeled edges: e 1 = (i, label), e 2 = (label, j): G = (V, E), V = V 0 ∪ L = {v 1 , ."}, {"id": 31, "string": "."}, {"id": 32, "string": "."}, {"id": 33, "string": ", v n , 1 , ."}, {"id": 34, "string": "."}, {"id": 35, "string": "."}, {"id": 36, "string": ", n }, E ⊆ (V 0 × L) ∪ (L × V 0 )."}, {"id": 37, "string": "Each unlabeled edge e ∈ E is a pair: e = (i, j), where one of the following holds: 1. i ∈ V 0 and j ∈ L; 2. i ∈ L and j ∈ V 0 ."}, {"id": 38, "string": "For instance, the edge between eat-01 and he with label :arg0 of Figure 1 (a) is replaced by two edges in Figure 1(d) : an edge between eat-01 and :arg0 and another one between :arg0 and he."}, {"id": 39, "string": "The process, also used in Beck et al."}, {"id": 40, "string": "(2018) , tranforms the input graph into its equivalent Levi graph (Levi, 1942) ."}, {"id": 41, "string": "Tree-structured AMRs In order to obtain tree structures, it is necessary to discard the reentrancies from the AMR graphs."}, {"id": 42, "string": "Similarly to Takase et al."}, {"id": 43, "string": "(2016) , we replace nodes with n > 1 incoming edges with n identically labeled nodes, each with a single incoming edge."}, {"id": 44, "string": "Sequential AMRs Following Konstas et al."}, {"id": 45, "string": "(2017) , the input sequence is a linearized and anonymized AMR graph."}, {"id": 46, "string": "Linearization is used to convert the graph into a sequence: x = x 1 , ."}, {"id": 47, "string": "."}, {"id": 48, "string": "."}, {"id": 49, "string": ", x N , x i ∈ V. The depth-first traversal of the graph defines the indexing between nodes and tokens in the sequence."}, {"id": 50, "string": "For instance, the root node is x 1 , its leftmost child is x 2 and so on."}, {"id": 51, "string": "Nodes with multiple parents are visited more than once."}, {"id": 52, "string": "At each visit, their labels are repeated in the sequence, effectively losing reentrancy information, as shown in Figure 1 (b)."}, {"id": 53, "string": "Anonymization removes names and rare words with coarse categories to reduce data sparsity."}, {"id": 54, "string": "An alternative to anonymization is to employ a copy mechanism (Gulcehre et al., 2016) , where the models learn to copy rare words from the input itself."}, {"id": 55, "string": "In this paper, we follow the anonymization approach."}, {"id": 56, "string": "Encoders In this section, we review the encoders adopted as building blocks for our tree and graph encoders."}, {"id": 57, "string": "Recurrent Neural Network Encoders We reimplement the encoder of Konstas et al."}, {"id": 58, "string": "(2017) , where the sequential linearization is the input to a bidirectional LSTM (BiLSTM; Graves et al."}, {"id": 59, "string": "2013) network."}, {"id": 60, "string": "The hidden state of the BiL-STM at step i is used as a context-aware word representation of the i-th token in the sequence: e 1:N = BiLSTM(x 1:N ), where e i ∈ R d , d is the size of the output embeddings."}, {"id": 61, "string": "TreeLSTM Encoders Tree-Structured Long Short-Term Memory Networks (TreeLSTM; Tai et al."}, {"id": 62, "string": "2015) have been introduced primarily as a way to encode the hierarchical structure of syntactic trees (Tai et al., 2015) , but they have also been applied to AMR for the task of headline generation (Takase et al., 2016) ."}, {"id": 63, "string": "TreeLSTMs assume tree-structured input, so AMR graphs must be preprocessed to respect this constraint: reentrancies, which play an essential role in AMR, must be removed, thereby transforming the graphs into trees."}, {"id": 64, "string": "We use the Child-Sum variant introduced by Tai et al."}, {"id": 65, "string": "(2015) , which processes the tree in a bottomup pass."}, {"id": 66, "string": "When visiting a node, the hidden states of its children are summed up in a single vector which is then passed into recurrent gates."}, {"id": 67, "string": "In order to use information from both incoming and outgoing edges (parents and children), we employ bidirectional TreeLSTMs (Eriguchi et al., 2016) , where the bottom-up pass is followed by a top-down pass."}, {"id": 68, "string": "The top-down state of the root node is obtained by feeding the bottom-up state of the root node through a feed-forward layer: h ↓ root = tanh(W r h ↑ root + b), where h ↑ i is the hidden state of node x i ∈ V for the bottom-up pass and h ↓ i is the hidden state of node x i for the top-down pass."}, {"id": 69, "string": "The bottom up states for all other nodes are computed with an LSTM, with the cell state given by their parent nodes: h ↓ i = LSTM(h ↑ p(i) , h ↑ i ), where p(i) is the parent of node x i in the tree."}, {"id": 70, "string": "The final hidden states are obtained by concatenating the states from the bottom-up pass and the topdown pass: h i = h ↓ i ; h ↑ i ."}, {"id": 71, "string": "The hidden state of the root node is usually used as a representation for the entire tree."}, {"id": 72, "string": "In order to use attention over all nodes, as in traditional NMT (Bahdanau et al., 2015) , we can however build node embeddings by extracting the hidden states of each node in the tree: e 1:N = h 1:N , where e i ∈ R d , d is the size of the output embed- dings."}, {"id": 73, "string": "The encoder is related to the TreeLSTM encoder of Takase et al."}, {"id": 74, "string": "(2016) , which however encodes labeled trees and does not use a top-down pass."}, {"id": 75, "string": "Graph Convolutional Network Encoders Graph Convolutional Network (GCN; Duvenaud et al."}, {"id": 76, "string": "2015; Kipf and Welling 2016) is a neural network architecture that learns embeddings of nodes in a graph by looking at its nearby nodes."}, {"id": 77, "string": "In Natural Language Processing, GCNs have been used for Semantic Role Labeling , NMT (Bastings et al., 2017) , Named Entity Recognition (Cetoli et al., 2017) and text generation (Marcheggiani and Perez-Beltrachini, 2018) ."}, {"id": 78, "string": "A graph-to-sequence neural network was first introduced by Xu et al."}, {"id": 79, "string": "(2018) ."}, {"id": 80, "string": "The authors review the similarities between their approach, GCN and another approach, based on GRUs (Li et al., 2015) ."}, {"id": 81, "string": "The latter recently inspired a graphto-sequence architecture for AMR-to-text generation (Beck et al., 2018) ."}, {"id": 82, "string": "Simultaneously, Song et al."}, {"id": 83, "string": "(2018) proposed a graph encoder based on LSTMs."}, {"id": 84, "string": "The architectures of Song et al."}, {"id": 85, "string": "(2018) and Beck et al."}, {"id": 86, "string": "(2018) are both based on the same core computation of a GCN, which sums over the embeddings of the immediate neighborhood of each node: h (k+1) i = σ j∈N (i) W (k) (j,i) h (k) j + b (k) , where h (k) i is the embeddings of node x i ∈ V at layer k, σ is a non-linear activation function, N (i) is the set of the immediate neighbors of x i , W (k) (j,i) ∈ R m×m and b (k) ∈ R m , with m being the size of the embeddings."}, {"id": 87, "string": "It is possible to use recurrent networks to model the update of the node embeddings."}, {"id": 88, "string": "Specifically, Beck et al."}, {"id": 89, "string": "(2018) uses a GRU layer where the gates are modeled as GCN layers."}, {"id": 90, "string": "Song et al."}, {"id": 91, "string": "(2018) did not use the activation function σ and perform an LSTM update instead."}, {"id": 92, "string": "The systems of Song et al."}, {"id": 93, "string": "(2018) and Beck et al."}, {"id": 94, "string": "(2018) further differ in design and implementation decisions such as in the use of edge label and edge directionality."}, {"id": 95, "string": "Throughout the rest of the paper, we follow the traditional, non-recurrent, implementation of GCN also adopted in other NLP tasks Bastings et al., 2017; Cetoli et al., 2017) ."}, {"id": 96, "string": "In our experiments, the node embeddings are computed as follows: h (k+1) i = σ j∈N (i) W (k) dir(j,i) h (k) j + b (k) , (1) where dir(j, i) indicates the direction of the edge between x j and x i (i.e., outgoing or incoming edge)."}, {"id": 97, "string": "The hidden vectors from the last layer of the GCN network are finally used to represent each node in the graph: e 1:N = h (K) 1 , ."}, {"id": 98, "string": "."}, {"id": 99, "string": "."}, {"id": 100, "string": ", h (K) N , where K is the number of GCN layers used, e i ∈ R d , d is the size of the output embeddings."}, {"id": 101, "string": "To regularize the models we apply dropout (Srivastava et al., 2014) as well as edge dropout ."}, {"id": 102, "string": "We also include highway connections (Srivastava et al., 2015) between GCN layers."}, {"id": 103, "string": "While GCN can naturally be used to encode graphs, they can also be applied to trees by removing reentrancies from the input graphs."}, {"id": 104, "string": "In the experiments of Section 5, we explore GCN-based models both as graph encoders (reentrancies are maintained) as well as tree encoders (reentrancies are ignored)."}, {"id": 105, "string": "x 1 x 2 ."}, {"id": 106, "string": "."}, {"id": 107, "string": "."}, {"id": 108, "string": "x N GCN/TreeLSTM h 1 h 2 ."}, {"id": 109, "string": "."}, {"id": 110, "string": "."}, {"id": 111, "string": "h N h 1 h 2 ."}, {"id": 112, "string": "."}, {"id": 113, "string": "."}, {"id": 114, "string": "hn BiLSTM e 1 e 2 ."}, {"id": 115, "string": "."}, {"id": 116, "string": "."}, {"id": 117, "string": "en x 1 x 2 ."}, {"id": 118, "string": "."}, {"id": 119, "string": "."}, {"id": 120, "string": "x N x 1 x 2 ."}, {"id": 121, "string": "."}, {"id": 122, "string": "."}, {"id": 123, "string": "xn BiLSTM h 1 h 2 ."}, {"id": 124, "string": "."}, {"id": 125, "string": "."}, {"id": 126, "string": "hn h 1 h 2 ."}, {"id": 127, "string": "."}, {"id": 128, "string": "."}, {"id": 129, "string": "h N GCN/TreeLSTM e 1 e 2 ."}, {"id": 130, "string": "."}, {"id": 131, "string": "."}, {"id": 132, "string": "e N Figure 2 : Two ways of stacking recurrent and structural models."}, {"id": 133, "string": "Left side: structure on top of sequence, where the structural encoders are applied to the hidden vectors computed by the BiLSTM."}, {"id": 134, "string": "Right side: sequence on top of structure, where the structural encoder is used to create better embeddings which are then fed to the BiLSTM."}, {"id": 135, "string": "The dotted lines refer to the process of converting the graph into a sequence or vice-versa."}, {"id": 136, "string": "Stacking Encoders We aimed at stacking the explicit source of structural information provided by TreeLSTMs and GCNs with the sequential information which BiL-STMs extract well."}, {"id": 137, "string": "This was shown to be effective for other tasks with both TreeLSTMs (Eriguchi et al., 2016; Chen et al., 2017) and GCNs Cetoli et al., 2017; Bastings et al., 2017) ."}, {"id": 138, "string": "In previous work, the structural encoders (tree or graph) were used on top of the BiLSTM network: first, the input is passed through the sequential encoder, the output of which is then fed into the structural encoder."}, {"id": 139, "string": "While we experiment with this approach, we also propose an alternative solution where the BiLSTM network is used on top of the structural encoder: the input embeddings are refined by exploiting the explicit structural information given by the graph."}, {"id": 140, "string": "The refined embeddings are then fed into the BiLSTM networks."}, {"id": 141, "string": "See Figure 2 for a graphical representation of the two approaches."}, {"id": 142, "string": "In our experiments, we found this approach to be more effective."}, {"id": 143, "string": "Compared to models that interleave structural and recurrent components such as the systems of Song et al."}, {"id": 144, "string": "(2018) and Beck et al."}, {"id": 145, "string": "(2018) , stacking the components allows us to test for their contributions more easily."}, {"id": 146, "string": "Structure on Top of Sequence In this setup, BiLSTMs are used as in Section 3.1 to encode the linearized and anonymized AMR."}, {"id": 147, "string": "The context provided by the BiLSTM is a sequential one."}, {"id": 148, "string": "We then apply either GCN or TreeLSTM on the output of the BiLSTM, by initializing the GCN or TreeLSTM embeddings with the BiLSTM hidden states."}, {"id": 149, "string": "We call these models SEQGCN and SEQTREELSTM."}, {"id": 150, "string": "Sequence on Top of Structure We also propose a different approach for integrating graph information into the encoder, by swapping the order of the BiLSTM and the structural encoder: we aim at using the structured information provided by the AMR graph as a way to refine the original word representations."}, {"id": 151, "string": "We first apply the structural encoder to the input graphs."}, {"id": 152, "string": "The GCN or TreeLSTM representations are then fed into the BiLSTM."}, {"id": 153, "string": "We call these models GCNSEQ and TREELSTMSEQ."}, {"id": 154, "string": "The motivation behind this approach is that we know that BiLSTMs, given appropriate input embeddings, are very effective at encoding the input sequences."}, {"id": 155, "string": "In order to exploit their strength, we do not amend their output but rather provide them with better input embeddings to start with, by explicitly taking the graph relations into account."}, {"id": 156, "string": "Experiments We use both BLEU (Papineni et al., 2002) and Meteor (Banerjee and Lavie, 2005) as evaluation metrics."}, {"id": 157, "string": "1 We report results on the AMR dataset LDC2015E86 and LDC2017T10."}, {"id": 158, "string": "All systems are implemented in PyTorch (Paszke et al., 2017) using the framework OpenNMT-py (Klein et al., 2017) ."}, {"id": 159, "string": "Hyperparameters of each model were tuned on the development set of LDC2015E86."}, {"id": 160, "string": "For the GCN components, we use two layers, ReLU activations, and tanh highway layers."}, {"id": 161, "string": "We use single layer LSTMs."}, {"id": 162, "string": "We train with SGD with the initial learning rate set to 1 and decay to 0.8."}, {"id": 163, "string": "Batch size is set to 100."}, {"id": 164, "string": "2 We first evaluate the overall performance of the models, after which we focus on two phenomena that we expect to benefit most from structural encoders: reentrancies and long-range dependencies."}, {"id": 165, "string": "Table 1 shows the comparison on the development split of the LDC2015E86 dataset between sequential, tree and graph encoders."}, {"id": 166, "string": "The sequential encoder (SEQ) is a re-implementation of Konstas et al."}, {"id": 167, "string": "(2017) ."}, {"id": 168, "string": "We test both approaches of stacking structural and sequential components: structure on top of sequence (SEQTREELSTM and SEQGCN), and sequence on top of structure (TREELSTMSEQ and GCNSEQ)."}, {"id": 169, "string": "To inspect the effect of the sequential component, we run ablation tests by removing the RNNs altogether (TREELSTM and GCN)."}, {"id": 170, "string": "GCN-based models are used both as tree encoders (reentrancies are removed) and graph encoders (reentrancies are maintained)."}, {"id": 171, "string": "For both TreeLSTM-based and GCN-based models, our proposed approach of applying the structural encoder before the RNN achieves better scores."}, {"id": 172, "string": "This is especially true for GCN-based models, for which we also note a drastic drop in performance when the RNN is removed, highlighting the importance of a sequential component."}, {"id": 173, "string": "On the other hand, RNN layers seem to have less impact on TreeLSTM-based models."}, {"id": 174, "string": "This outcome is not unexpected, as TreeLSTMs already use LSTM gates in their computation."}, {"id": 175, "string": "The results show a clear advantage of tree and graph encoders over the sequential encoder."}, {"id": 176, "string": "The best performing model is GCNSEQ, both as a tree and as a graph encoder, with the latter obtaining the highest results."}, {"id": 177, "string": "Table 2 shows the comparison between our best sequential (SEQ), tree (GCNSEQ without reentrancies, henceforth called TREE) and graph en-   coders (GCNSEQ with reentrancies, henceforth called GRAPH) on the test set of LDC2015E86 and LDC2017T10."}, {"id": 178, "string": "We also include state-of-the-art results reported on these datasets for sequential encoding (Konstas et al., 2017) and graph encoding (Song et al., 2018; Beck et al., 2018) ."}, {"id": 179, "string": "3 In order to mitigate the effects of random seeds, we train five models with different random seeds and report the results of the median model, according to their BLEU score on the development set (Beck et al., 2018) ."}, {"id": 180, "string": "We achieve state-of-the-art results with both tree and graph encoders, demonstrating the efficacy of our GCNSeq approach."}, {"id": 181, "string": "The graph encoder outperforms the other systems and previous work on both datasets."}, {"id": 182, "string": "These results demonstrate the benefit of structural encoders over purely sequential ones as well as the advantage of explicitly including reentrancies."}, {"id": 183, "string": "The differences between our graph encoder and that of Song et al."}, {"id": 184, "string": "(2018) and Beck et al."}, {"id": 185, "string": "(2018) were discussed in Section 3.3."}, {"id": 186, "string": "3 We run comparisons on systems without ensembling nor additional data."}, {"id": 187, "string": "Reentrancies Overall scores show an advantage of graph encoder over tree and sequential encoders, but they do not shed light into how this is achieved."}, {"id": 188, "string": "Because graph encoders are the only ones to model reentrancies explicitly, we expect them to deal better with these structures."}, {"id": 189, "string": "It is, however, possible that the other models are capable of handling these structures implicitly."}, {"id": 190, "string": "Moreover, the dataset contains a large number of examples that do not involve any reentrancies, as shown in Table 3 , so that the overall scores may not be representative of the ability of models to capture reentrancies."}, {"id": 191, "string": "It is expected that the benefit of the graph models will be more evident for those examples containing more reentrancies."}, {"id": 192, "string": "To test this hypothesis, we evaluate the various scenarios as a function of the number of reentrancies in each example, using the Meteor score as a metric."}, {"id": 193, "string": "4 Table 4 shows that the gap between the graph encoder and the other encoders is widest for examples with more than six reentrancies."}, {"id": 194, "string": "The Meteor score of the graph encoder for these cases is 3.1% higher than the one for the sequential encoder and 2.3% higher than the score achieved by the tree encoder, demonstrating that explicitly encoding reentrancies is more beneficial than the overall scores suggest."}, {"id": 195, "string": "Interestingly, it can also be observed that the graph model outperforms the tree model also for examples with no reentrancies, where tree and graph structures are identical."}, {"id": 196, "string": "This suggests that preserving reentrancies in the training data has other beneficial effects."}, {"id": 197, "string": "In Section 5.2 we explore one: better handling of long-range dependencies."}, {"id": 198, "string": "Manual Inspection In order to further explore how the graph model handles reentrancies differently from the other models, we performed a manual inspection of the models' output."}, {"id": 199, "string": "We selected examples containing reentrancies, where the graph model performs better than the other models."}, {"id": 200, "string": "These are shown in Table 5 ."}, {"id": 201, "string": "In Example (1), we note that the graph model is the only one that correctly predicts the phrase he finds out."}, {"id": 202, "string": "The wrong verb tense is due to the lack of tense information in AMR graphs."}, {"id": 203, "string": "In the sequential model, the pronoun is chosen correctly, but the wrong verb is predicted, while in the tree model the pronoun is missing."}, {"id": 204, "string": "In Example (2) , only the graph model correctly generates the phrase you tell them, while none of the models use people as the subject of the predicate can."}, {"id": 205, "string": "In Example (3), both the graph and the sequential models deal well with the control structure caused by the recommend predicate."}, {"id": 206, "string": "The sequential model, however, overgenerates a wh-clause."}, {"id": 207, "string": "Finally, in Example (4) the tree and graph models deal correctly with the possessive pronoun to generate the phrase tell your ex, while the sequential model does not."}, {"id": 208, "string": "Overall, we note that the graph model produces a more accurate output than sequential and tree models by generating the correct pronouns and mentions when control verbs and co-references are involved."}, {"id": 209, "string": "Contrastive Pairs For a quantitative analysis of how the different models handle pronouns, we use a method to inspect NMT output for specific linguistic analysis based on contrastive pairs (Sennrich, 2017) ."}, {"id": 210, "string": "Given a reference output sentence, a contrastive sentence is generated by introducing a mistake related to the phenomenon we are interested in evaluating."}, {"id": 211, "string": "The probability that the model assigns to the reference sentence is then compared to that of the contrastive sentence."}, {"id": 212, "string": "The accuracy of a model is determined by the percentage of examples in which the reference sentence has a higher probability than the contrastive sentence."}, {"id": 213, "string": "We produce contrastive examples by running CoreNLP (Manning et al., 2014) to identify coreferences, which are the primary cause of reentrancies, and introducing a mistake."}, {"id": 214, "string": "When an expression has multiple mentions, the antecedent is repeated in the linearized AMR."}, {"id": 215, "string": "For instance, the linearization of Figure 1(b) contains the token he twice, which instead appears only once in the sen-tence."}, {"id": 216, "string": "This repetition may result in generating the token he twice, rather than using a pronoun to refer back to it."}, {"id": 217, "string": "To investigate this possible mistake, we replace one of the mentions with the antecedent (e.g., John ate the pizza with his fingers is replaced with John ate the pizza with John fingers, which is ungrammatical and as such should be less likely)."}, {"id": 218, "string": "An alternative hypothesis is that even when the generation system correctly decides to predict a pronoun, it selects the wrong one."}, {"id": 219, "string": "To test for this, we produce contrastive examples where a pronoun is replaced by either a different type of pronoun (e.g., John ate the pizza with his fingers is replaced with John ate the pizza with him fingers) or by the same type of pronoun but for a different number (John ate the pizza with their fingers) or different gender (John ate the pizza with her fingers)."}, {"id": 220, "string": "Note from Figure 1 that the graph-structured AMR is the one that more directly captures the relation between finger and he, and as such it is expected to deal better with this type of mistakes."}, {"id": 221, "string": "From the test split of LDC2017T10, we generated 251 contrastive examples due to antecedent replacements, 912 due to pronoun type replacements, 1840 due to number replacements and 95 due to gender replacements."}, {"id": 222, "string": "5 The results are shown in Table 6 ."}, {"id": 223, "string": "The sequential encoder performs surprisingly well at this task, with better or on par performance with respect to the tree encoder."}, {"id": 224, "string": "The graph encoder outperforms the sequential encoder only for pronoun number and gender replacements."}, {"id": 225, "string": "Future work is required to more precisely analyze if the different models cope with pronomial mentions in significantly different ways."}, {"id": 226, "string": "Other approaches to inspect phenomena of co-reference and control verbs can also be explored, for instance by devising specific training objectives (Linzen et al., 2016) ."}, {"id": 227, "string": "Long-range Dependencies When we encode a long sequence, interactions between items that appear distant from each other in the sequence are difficult to capture."}, {"id": 228, "string": "The problem of long-range dependencies in natural language is well known for RNN architectures (Bengio et al., 1994) ."}, {"id": 229, "string": "Indeed, the need to solve this problem motivated the introduction of LSTM models, which are known to model long-range dependencies better than traditional RNNs."}, {"id": 230, "string": "(1) REF i dont tell him but he finds out , SEQ i did n't tell him but he was out ."}, {"id": 231, "string": "TREE i do n't tell him but found out ."}, {"id": 232, "string": "GRAPH i do n't tell him but he found out ."}, {"id": 233, "string": "( 2) Because the nodes in the graphs are not aligned with words in the sentence, AMR has no notion of distance between the nodes taking part in an edge."}, {"id": 234, "string": "In order to define the length of an AMR edge, we resort to the AMR linearization discussed in Section 2."}, {"id": 235, "string": "Given the linearization of the AMR x 1 , ."}, {"id": 236, "string": "."}, {"id": 237, "string": "."}, {"id": 238, "string": ", x N , as discussed in Section 2, and an edge between two nodes x i and x j , the length of the edge is defined as |j − i|."}, {"id": 239, "string": "For instance, in the AMR of Figure 1 , the edge between eat-01 and :instrument is a dependency of length five, because of the distance between the two words in the linearization eat-01 :arg0 he :arg1 pizza :instrument."}, {"id": 240, "string": "We then compute the maximum dependency length for each AMR graph."}, {"id": 241, "string": "To verify the hypothesis that long-range dependencies contribute to the improvements of graph models, we compare the models as a function of the maximum dependency length in each example."}, {"id": 242, "string": "Longer dependencies are sometimes caused by reentrancies, as in the dependency between :part-of and he in Figure 1 ."}, {"id": 243, "string": "To verify that the contribution in terms of longer dependencies is complementary to that of reentrancies, we exclude sentences with reentrancies from this analysis."}, {"id": 244, "string": "Table 7 shows the statistics for this measure."}, {"id": 245, "string": "Results are shown in Table 8 ."}, {"id": 246, "string": "The graph encoder always outperforms both the sequential and the tree encoder."}, {"id": 247, "string": "The gap with the sequential encoder increases for longer dependencies."}, {"id": 248, "string": "This indicates that longer dependencies are an important factor in improving results for both tree and graph encoders, especially for the latter."}, {"id": 249, "string": "Conclusions We introduced models for AMR-to-text generation with the purpose of investigating the difference between sequential, tree and graph encoders."}, {"id": 250, "string": "We showed that encoding reentrancies improves overall performance."}, {"id": 251, "string": "We observed bigger benefits when the input AMR graphs have a larger number of reentrant structures and longer dependencies."}, {"id": 252, "string": "Our best graph encoder, which consists of a GCN wired to a BiLSTM network, improves over the state of the art on all tested datasets."}, {"id": 253, "string": "We inspected the differences between the models, especially in terms of co-references and control structures."}, {"id": 254, "string": "Further exploration of graph encoders is left to future work, which may result crucial to improve performance further."}], "headers": [{"section": "Introduction", "n": "1", "start": 0, "end": 20}, {"section": "Input Representations", "n": "2", "start": 21, "end": 54}, {"section": "Encoders", "n": "3", "start": 55, "end": 56}, {"section": "Recurrent Neural Network Encoders", "n": "3.1", "start": 57, "end": 60}, {"section": "TreeLSTM Encoders", "n": "3.2", "start": 61, "end": 74}, {"section": "Graph Convolutional Network Encoders", "n": "3.3", "start": 75, "end": 135}, {"section": "Stacking Encoders", "n": "4", "start": 136, "end": 145}, {"section": "Structure on Top of Sequence", "n": "4.1", "start": 146, "end": 149}, {"section": "Sequence on Top of Structure", "n": "4.2", "start": 150, "end": 155}, {"section": "Experiments", "n": "5", "start": 156, "end": 186}, {"section": "Reentrancies", "n": "5.1", "start": 187, "end": 197}, {"section": "Manual Inspection", "n": "5.1.1", "start": 198, "end": 208}, {"section": "Contrastive Pairs", "n": "5.1.2", "start": 209, "end": 226}, {"section": "Long-range Dependencies", "n": "5.2", "start": 227, "end": 248}, {"section": "Conclusions", "n": "6", "start": 249, "end": 254}], "figures": [{"filename": "../figure/image/992-Table4-1.png", "caption": "Table 4: Differences, with respect to the sequential baseline, in the Meteor score of the test split of LDC2017T10 as a function of the number of reentrancies.", "page": 5, "bbox": {"x1": 331.68, "x2": 501.12, "y1": 62.4, "y2": 143.04}}, {"filename": "../figure/image/992-Table2-1.png", "caption": "Table 2: Scores on the test split of LDC2015E86 and LDC2017T10. TREE is the tree-based GCNSEQ and GRAPH is the graph-based GCNSEQ.", "page": 5, "bbox": {"x1": 73.92, "x2": 288.0, "y1": 192.48, "y2": 253.92}}, {"filename": "../figure/image/992-Table3-1.png", "caption": "Table 3: Counts of reentrancies for the development and test split of LDC2017T10", "page": 5, "bbox": {"x1": 76.8, "x2": 285.12, "y1": 316.8, "y2": 384.0}}, {"filename": "../figure/image/992-Table6-1.png", "caption": "Table 6: Accuracy (%) of models, on the test split of LDC201T10, for different categories of contrastive errors: antecedent (Antec.), pronoun type (Type), number (Num.), and gender (Gender).", "page": 7, "bbox": {"x1": 75.84, "x2": 286.08, "y1": 350.88, "y2": 418.08}}, {"filename": "../figure/image/992-Table7-1.png", "caption": "Table 7: Counts of longest dependencies for the development and test split of LDC2017T10", "page": 7, "bbox": {"x1": 79.67999999999999, "x2": 283.2, "y1": 496.79999999999995, "y2": 563.04}}, {"filename": "../figure/image/992-Table8-1.png", "caption": "Table 8: Differences, with respect to the sequential baseline, in the Meteor score of the test split of LDC2017T10 as a function of the maximum dependency length.", "page": 7, "bbox": {"x1": 96.0, "x2": 266.4, "y1": 618.24, "y2": 699.36}}, {"filename": "../figure/image/992-Table5-1.png", "caption": "Table 5: Examples of generation from AMR graphs containing reentrancies. REF is the reference sentence.", "page": 7, "bbox": {"x1": 94.56, "x2": 503.03999999999996, "y1": 62.4, "y2": 303.36}}, {"filename": "../figure/image/992-Figure2-1.png", "caption": "Figure 2: Two ways of stacking recurrent and structural models. Left side: structure on top of sequence, where the structural encoders are applied to the hidden vectors computed by the BiLSTM. Right side: sequence on top of structure, where the structural encoder is used to create better embeddings which are then fed to the BiLSTM. The dotted lines refer to the process of converting the graph into a sequence or vice-versa.", "page": 3, "bbox": {"x1": 333.59999999999997, "x2": 499.2, "y1": 62.879999999999995, "y2": 276.0}}, {"filename": "../figure/image/992-Table1-1.png", "caption": "Table 1: BLEU and Meteor (%) scores on the development split of LDC2015E86.", "page": 4, "bbox": {"x1": 308.64, "x2": 524.16, "y1": 62.4, "y2": 235.2}}]}