{"title": "Submodular Optimization-based Diverse Paraphrasing and its Effectiveness in Data Augmentation", "abstract": "Introduction Paraphrasing is the task of rephrasing a given text in multiple ways such that the semantics of the generated sentences remain unaltered. Paraphrasing Quality can be attributed to two key characteristics -fidelity which measures the semantic similarity between the input text and generated text, and diversity, which measures the lexical dissimilarity between generated sentences. Many previous works (Prakash et al., 2016; Gupta et al., 2018; Li et al., 2018) address the task of obtaining semantically similar paraphrases.", "text": [{"id": 0, "string": "Inducing diversity in the task of paraphrasing is an important problem in NLP with applications in data augmentation and conversational agents."}, {"id": 1, "string": "Previous paraphrasing approaches have mainly focused on the issue of generating semantically similar paraphrases, while paying little attention towards diversity."}, {"id": 2, "string": "In fact, most of the methods rely solely on top-k beam search sequences to obtain a set of paraphrases."}, {"id": 3, "string": "The resulting set, however, contains many structurally similar sentences."}, {"id": 4, "string": "In this work, we focus on the task of obtaining highly diverse paraphrases while not compromising on paraphrasing quality."}, {"id": 5, "string": "We provide a novel formulation of the problem in terms of monotone submodular function maximization, specifically targeted towards the task of paraphrasing."}, {"id": 6, "string": "Additionally, we demonstrate the effectiveness of our method for data augmentation on multiple tasks such as intent classification and paraphrase recognition."}, {"id": 7, "string": "In order to drive further research, we have made the source code available."}, {"id": 8, "string": "cases desirable, to produce lexically diverse ones."}, {"id": 9, "string": "Diversity in paraphrase generation finds applications in text simplification (Nisioi et al., 2017; Xu et al., 2015) , document summarization (Li et al., 2009; Nema et al., 2017) , QA systems (Fader et al., 2013; Bernhard and Gurevych, 2008) , data augmentation (Zhang et al., 2015; Wang and Yang, 2015) , conversational agents (Li et al., 2016) and information retrieval (Anick and Tipirneni, 1999) ."}, {"id": 10, "string": "To obtain a set of multiple paraphrases, most of the current paraphrasing models rely solely on topk beam search sequences."}, {"id": 11, "string": "The resulting set, however, contains many structurally similar sentences with only minor, word level changes."}, {"id": 12, "string": "There have been some prior works (Li and Jurafsky, 2016; Elhamifar et al., 2012) which address the notion of diversity in NLP, including in sequence learning frameworks (Song et al., 2018; Vijayakumar et al., 2018) ."}, {"id": 13, "string": "Although Song et al."}, {"id": 14, "string": "(2018) address the issue of diversity in the scenario of neural conversation models using determinantal point processes (DPP), it could be naturally used for paraphrasing."}, {"id": 15, "string": "On similar lines, subset selection based on Simultaneous Sparse Recovery (SSR) (Elhamifar et al., 2012) can also be easily adapted for the same task."}, {"id": 16, "string": "Though these methods are helpful in maximizing diversity, they are restrictive in terms of re-taining fidelity with respect to the source sentence."}, {"id": 17, "string": "Addressing the task of diverse paraphrasing through the lens of monotone submodular function maximization (Fujishige, 2005; Krause and Golovin; Bach et al., 2013) alleviates this problem and also provides a few additional benefits."}, {"id": 18, "string": "Firstly, the submodular objective offers better flexibility in terms of controlling diversity as well as fidelity."}, {"id": 19, "string": "Secondly, there exists a simple greedy algorithm for solving monotone submodular function maximization (Nemhauser et al., 1978) , which guarantees the diverse solution to be almost as good as the optimal solution."}, {"id": 20, "string": "Finally, many submodular programs are fast and scalable to large datasets."}, {"id": 21, "string": "Below, we list the main contributions of our paper."}, {"id": 22, "string": "We introduce Diverse Paraphraser using Submodularity (DiPS)."}, {"id": 23, "string": "DiPS maximizes a novel submodular objective function specifically targeted towards paraphrasing."}, {"id": 24, "string": "2."}, {"id": 25, "string": "We perform extensive experiments to show the effectiveness of our method in generating structurally diverse paraphrases without compromising on fidelity."}, {"id": 26, "string": "We also compare against several possible diversity inducing schemes."}, {"id": 27, "string": "3."}, {"id": 28, "string": "We demonstrate the utility of diverse paraphrases generated via DiPS as data augmentation schemes on multiple tasks such as intent and question classification."}, {"id": 29, "string": "(See et al., 2017) for generating paraphrases and an evaluator based on (Parikh et al., 2016) to penalize non-paraphrastic generations."}, {"id": 30, "string": "Several other works (Cao et al., 2017; Iyyer et al., 2018) exist for paraphrasing, though they have either been superseded by newer models or are not-directly applicable to our settings."}, {"id": 31, "string": "However, most of these methods focus on the issue of generating semantically similar paraphrases, while paying little attention towards diversity."}, {"id": 32, "string": "Diversity in paraphrasing models was first explored by (Gupta et al., 2018) where they propose to generate variations based on different samples from the latent space in a deep generative framework."}, {"id": 33, "string": "Although diversity in paraphrasing models has not been explored extensively, methods have been proposed to address diversity in other NLP tasks (Li et al., 2016 (Li et al., , 2015 Gimpel et al., 2013) ."}, {"id": 34, "string": "Diverse beam search proposed by (Vijayakumar et al., 2018) generates k-diverse sequences by dividing the candidate subsequences at each time step into several groups and penalizing subsequences which are similar to prior groups."}, {"id": 35, "string": "The most relevant to our approach is the method proposed by (Song et al., 2018) for neural conversation models where they incorporate diversity by using DPP to select diverse subsequences at each time step."}, {"id": 36, "string": "Although their work is addressed in the scenario of neural conversation models, it could be naturally adapted to paraphrasing models and thus we use it as a baseline."}, {"id": 37, "string": "Submodular functions have been applied to a wide variety of problems in machine learning (Iyer and Bilmes, 2013; Jegelka and Bilmes, 2011; Krause and Guestrin, 2011; Kolmogorov and Zabih, 2002) and have recently attracted much attention in several NLP tasks including document summarization (Lin and Bilmes, 2011) , data selection in machine translation (Kirchhoff and Bilmes, 2014) and goal-oriented chatbot training (Dimovski et al., 2018) ."}, {"id": 38, "string": "However, their application to sequence generation is largely unexplored."}, {"id": 39, "string": "Data augmentation is a technique for increasing the size of labeled training sets by leveraging task specific transformations which preserve class labels."}, {"id": 40, "string": "While the technique is ubiquitous in the vision community (Krizhevsky et al., 2012; Ratner et al., 2017) , data-augmentation in NLP is largely under-explored."}, {"id": 41, "string": "Most current augmentation schemes involve thesaurus based synonym replacement (Zhang et al., 2015; Wang and Yang, 2015) , and replacement by words with paradigmatic relations (Kobayashi, 2018) ."}, {"id": 42, "string": "Both of these F 1 S ← ∅ 2 N ← V 3 while |S| < k do 4 x * ← argmax x∈N F(S ∪ {x}) 5 S ← S ∪ {x * } 6 N ← N \\ {x * } 7 end 8 return S approaches try to boost the generalization abilities of downstream classification models through word-level substitutions."}, {"id": 43, "string": "However, they are inherently restrictive in terms of the diversity they can offer."}, {"id": 44, "string": "Our work offers a data-augmentation scheme via high quality paraphrases."}, {"id": 45, "string": "Background: Submodularity Let V = {v 1 , ."}, {"id": 46, "string": "."}, {"id": 47, "string": "."}, {"id": 48, "string": ", v n } be a set of objects, which we refer to as the ground set, and F : 2 V → R be a set function which works on subsets S of V to return a real value."}, {"id": 49, "string": "The task is to find a subset S of bounded cardinality say |S| ≤ k that maximizes the function F, i.e., argmax S⊆V F(S)."}, {"id": 50, "string": "In general, solving this problem is intractable."}, {"id": 51, "string": "However, if the function F is monotone non-decreasing submodular, then although the problem is still NPcomplete, there exists a greedy algorithm ( Algorithm 1) (Nemhauser et al., 1978) that finds an approximate solution which is guaranteed to be within 0.632 of the optimal solution."}, {"id": 52, "string": "Submodular functions are set functions F : 2 V → R, where 2 V denotes the power set of ground set V. Submodular functions satisfy the following equivalent properties of diminishing returns: ∀X, Y ⊆ V with X ⊆ Y , and ∀s ∈ V \\ Y , we have the following."}, {"id": 53, "string": "F(X ∪ {s}) − F(X) ≥ F(Y ∪ {s}) − F(Y ) (1) In other words, the value addition due to incorporation of s decreases as the subset grows from X to Y ."}, {"id": 54, "string": "Equivalently, ∀X, Y ⊆ V , we have, F(X) + F(Y ) ≥ F(X ∪ Y ) + F(X ∩ Y ) In case the above inequalities are equalities, the function F is said to be modular."}, {"id": 55, "string": "Let F(s|X) F(X ∪ {s}) − F(X)."}, {"id": 56, "string": "Therefore, F is submodular if F(s|X) ≥ F(s|Y ) for X ⊆ Y ."}, {"id": 57, "string": "t ← 0; P ← ∅ 4 while t < T do 5 Generate top 3k most probable subsequences 6 P ← Select k based on argmax X⊆V (t) F(X) using Algorithm 1 7 t = t + 1 8 end 9 return P The second criteria which the function needs to satisfy for Algorithm 1 to be applicable is of monotonicity."}, {"id": 58, "string": "A set function F is said to be mono- tone non-decreasing if ∀X ⊆ Y, F(X) ≤ F(Y )."}, {"id": 59, "string": "Submodular functions are relevant in a large class of real-world applications, therefore making them extremely useful in practice."}, {"id": 60, "string": "Additionally, submodular functions share many commonalities with convex functions, in the sense that they are closed under a number of standard operations like mixtures (non-negative weighted sum of submodular functions), truncation and some restricted compositions."}, {"id": 61, "string": "The above properties will be useful when defining the submodular objective for obtaining high quality paraphrases."}, {"id": 62, "string": "Methodology Similar to Prakash et al."}, {"id": 63, "string": "(2016) ; Gupta et al."}, {"id": 64, "string": "(2018); Li et al."}, {"id": 65, "string": "(2018) , we formulate the task of paraphrase generation as a sequence-to-sequence learning problem."}, {"id": 66, "string": "Previous SEQ2SEQ based approaches depend entirely on the standard crossentropy loss to produce semantically similar sentences and greedy decoding during generation."}, {"id": 67, "string": "However, this does not guarantee lexical variety in the generated paraphrases."}, {"id": 68, "string": "To incorporate some form of diversity, most prior approaches rely solely on top-k beam search sequences."}, {"id": 69, "string": "The kbest list generated by standard beam search are a poor surrogate for the entire search space (Finkel et al., 2006) ."}, {"id": 70, "string": "In fact, most of the sentences in the resulting set are structurally similar, differing only by punctuations or minor morphological variations."}, {"id": 71, "string": "While being similar in the encoding scheme, our work adopts a different approach for the final decoding."}, {"id": 72, "string": "We propose a framework which organi-  cally combines a sentence encoder with a diversity inducing decoder."}, {"id": 73, "string": "Overview Our approach is built upon SEQ2SEQ framework."}, {"id": 74, "string": "We first feed the tokenized source sentence to the encoder."}, {"id": 75, "string": "The task of the decoder is to take as input the encoded representation and produce the respective paraphrase."}, {"id": 76, "string": "To achieve this, we train the model using standard cross entropy loss between the generated sequence and the target paraphrase."}, {"id": 77, "string": "Upon completion of training, instead of using greedy decoding or standard beam search, we use a modified decoder where we incorporate a submodular objective to obtain high quality paraphrases."}, {"id": 78, "string": "Please refer to Figure 1 for an overview of the proposed method."}, {"id": 79, "string": "During the generation phase, the encoder takes the source sentence as input and feeds its representation to the decoder to initiate the decoding process."}, {"id": 80, "string": "At each time-step t, we consider N most probable subsequences since they are likely to be wellformed."}, {"id": 81, "string": "Based on optimization of our submodular objective, a subset of size k < N are selected and sent as input to the next time step t + 1 for further generation."}, {"id": 82, "string": "The process is repeated until desired output length T or <eos> token, whichever comes first."}, {"id": 83, "string": "Monotone Submodular Objectives We design a parameterized class of submodular functions tailored towards the task of paraphrase generation."}, {"id": 84, "string": "Let V (t) be the ground set of possible subsequences at time step t. We aim to determine a set X ⊆ V (t) that retains certain fidelity as well as diversity."}, {"id": 85, "string": "Hence, we model our submodular objective function as follows: X * = argmax X⊆V (t) F(X) s.t."}, {"id": 86, "string": "|X| ≤ k (2) where k is our budget (desired number of paraphrases) and F is defined as: F(X) = λL(X, s) + (1 − λ)D(X) (3) Here s is the source sentence, L(X, s) and D(X) measure fidelity and diversity, respectively."}, {"id": 87, "string": "λ ∈ [0, 1] is the trade-off coefficient."}, {"id": 88, "string": "This formulation clearly brings out the trade-off between the two key characteristics."}, {"id": 89, "string": "Fidelity It is imperative to design functions that exploit the decoder search space to maximize the semantic similarity between the generated and the source sentence."}, {"id": 90, "string": "To achieve this we build upon a known class of monotone submodular functions (Stobbe and Krause, 2010) f (X) = i∈U µ i φ i (m i (X)) (4) where U is the set of features to be defined later, µ i ≥ 0 is the feature weight, m i (X) = x∈X m i (x) is non-negative modular function and φ i is a non-negative non-decreasing concave function."}, {"id": 91, "string": "Based on the analysis of concave functions in (Kirchhoff and Bilmes, 2014), we use the simple square root function as φ (φ(a) = √ a) in both of our fidelity objectives defined below."}, {"id": 92, "string": "We consider two complementary notions of sentence similarity namely syntactic and semantic."}, {"id": 93, "string": "To capture syntactic information we define the following function: L 1 (X, s) = µ 1 x∈X N n=1 β n |x n-gram ∩ s n-gram | (5) where |x n-gram ∩ s n-gram | represents the number of overlapping n-grams between the source and the candidate sequence x for different values of n ∈ {1, ."}, {"id": 94, "string": "."}, {"id": 95, "string": "."}, {"id": 96, "string": ", N }(we use N = 3 )."}, {"id": 97, "string": "Since longer n-gram overlaps are more valuable, we set β > 1."}, {"id": 98, "string": "This function inherently increases the BLEU score between the source and the generated sentences."}, {"id": 99, "string": "We address the semantic aspect of fidelity by devising a function based on the word embeddings of source and generated sentences."}, {"id": 100, "string": "We define embedding based similarity between two sentences as, S(x, s) = 1 |x| w i ∈x argmax w j ∈s ψ(v w i , v w j ) (6) where v w i is the word embedding for token w i and ψ(v w i , v w j ) is the gaussian radial basis function (rbf) 1 ."}, {"id": 101, "string": "For each word in the candidate sequence x, we find the best matching word in the source sentence using word level similarity."}, {"id": 102, "string": "Using the above mentioned measure for embedding similarity we use the following submodular function: L 2 (X, s) = µ 2 x∈X S(x, s) (7) 1 We find gaussian rbf to work better than other similarity metrics such as cosine similarity This function helps increase the semantic homogeneity between the source and generated sequences."}, {"id": 103, "string": "The above defined functions (Equation 5,7) are compositions of non-decreasing concave functions and modular functions."}, {"id": 104, "string": "Thus, staying in the realm of the class of monotone submodular functions mentioned in Equation 4, we define fidelity function L(X, s) = L 1 (X, s) + L 2 (X, s) Diversity Ensuring high fidelity often comes at the cost of producing sequences that only slightly differ from each other."}, {"id": 105, "string": "To encourage diversity in the generation process it is desirable to reward sequences with higher number of distinct n-grams as compared to others in the ground set V (t) ."}, {"id": 106, "string": "Accordingly, we propose to use the following function: D 1 (X) = µ 3 N n=1 β n x∈X x n−gram (8) For β = 1, D 1 (X) denotes the number of distinct n-grams present in the set X."}, {"id": 107, "string": "Since shorter n-grams contribute more towards diversity, we set β < 1, thereby giving more value to shorter ngrams."}, {"id": 108, "string": "It is easy to see that this function is monotone non-decreasing as the number of distinct ngrams can only increase with the addition of more sequences."}, {"id": 109, "string": "To see that D 1 (X) is submodular, consider adding a new sequence to two sets of sequences, one a subset of the other."}, {"id": 110, "string": "Intuitively, the increment in the number of distinct n-grams when adding a new sequence to the smaller set should be larger than the increment when adding it to the larger set, as the distinct n-grams in the new sequence might have already been covered by the sequences in the larger set."}, {"id": 111, "string": "Apart from distinct n-gram overlaps, we also wish to obtain sequence candidates that are not only diverse, but also cover all major structural variations."}, {"id": 112, "string": "It is reasonable to expect sentences that are structurally different to have lower degree of word/phrase alignment as compared to sentences with minor lexical variations."}, {"id": 113, "string": "Edit distance (Levenshtein) is a widely accepted measure to determine such dissimilarities between two sentences."}, {"id": 114, "string": "To incorporate this notion of diversity, a formulation in terms of edit distance seems like a natural fit for the problem."}, {"id": 115, "string": "To do so, we use the coverage function which measures the similarity of the candidate sequences X with the ground set V (t) ."}, {"id": 116, "string": "The coverage function is naturally monotone submodular and is defined as: D 2 (X) = µ 4 x i ∈V (t) x j ∈X R(x i , x j ) (9) where R(x i , x j ) is an alignment based similarity measure between two sequences x i and x j given by: R(x i , x j ) = 1 − EditDistance(x i , x j ) |x i | + |x j | (10) Note that R(x i , x j ) will always lie in the range [0, 1]."}, {"id": 117, "string": "Evidently, this method allows flexibility in terms of controlling diversity and fidelity."}, {"id": 118, "string": "Our goal is to strike a balance between these two to obtain highquality generations."}, {"id": 119, "string": "Experiments Datasets In this section we outline the datasets used for evaluating our proposed method."}, {"id": 120, "string": "We specify the actual splits in Table 2 ."}, {"id": 121, "string": "Based on the task, we categorize them into the following: Baseline Several models have sought to increase diversity, albeit with different goals and techniques."}, {"id": 122, "string": "However, majority of the prior works in this area have focused on the task of producing diverse responses in dialog systems (Li et al., 2016; Ritter et al., 2011) and not paraphrasing."}, {"id": 123, "string": "Given the lack of relevant baselines, we compare our model against the following methods: (Li et al., 2018) Note that the first four baselines are trained using the same SEQ2SEQ network and differ only in the decoding phase."}, {"id": 124, "string": "Intrinsic Evaluation 1."}, {"id": 125, "string": "Fidelity: To evaluate our method for fidelity of generated paraphrases, we use three machine translation metrics which have been shown to be suitable for paraphrase evaluation task (Wubben et al., 2010) : BLEU (Papineni et al., 2002)(upto bigrams), ME-TEOR (Banerjee and Lavie, 2005) and TER-Plus (Snover et al., 2009 )."}, {"id": 126, "string": "Diversity: We report degree of diversity by calculating the number of distinct n-grams (n ∈ {1, 2, 3, 4}) ."}, {"id": 127, "string": "The value is scaled by the number of generated tokens to avoid favoring long sequences."}, {"id": 128, "string": "In addition to fidelity and diversity, we evaluate the efficacy of our method by using the generated paraphrases as augmented samples in the task of paraphrase recognition on the Quora-PR dataset."}, {"id": 129, "string": "We perform experiments with multiple augmentation settings for the following classifiers: 1."}, {"id": 130, "string": "LogReg: Simple Logistic Regression model."}, {"id": 131, "string": "We use a set of hand-crafted features, the de-tails of which can be found in the supplementary."}, {"id": 132, "string": "2."}, {"id": 133, "string": "SiameseLSTM: Siamese adaptation of LSTM to measure quality between two sentences (Mueller and Thyagarajan, 2016) We also perform ablation testing to highlight the importance of each submodular component."}, {"id": 134, "string": "Details can be found in the supplementary section."}, {"id": 135, "string": "Data-Augmentation We evaluate the importance of using high quality paraphrases in two downstream classification tasks namely intent-classification and questionclassification."}, {"id": 136, "string": "Our original generation model is trained on Quora-Div question pairs."}, {"id": 137, "string": "Since intentclassification and question-classification contain questions, this setting seems like a good fit to perform transfer learning."}, {"id": 138, "string": "We perform experiments on the following standard classifier models: 1."}, {"id": 139, "string": "LogRegDA: Simple logistic regression model trained using hand-crafted features."}, {"id": 140, "string": "For details, please refer to the supplementary section."}, {"id": 141, "string": "LSTM: Single layered LSTM classification model."}, {"id": 142, "string": "In addition to SBS and DBS, we use the following data-augmentation baselines for comparison: Setup We train our SEQ2SEQ model with attention (Bahdanau et al., 2014) for up to 50 epochs using the adam optimizer (Kingma and Ba, 2014) with initial learning rate set to 2e-4."}, {"id": 143, "string": "During the generation phase, we follow standard beam search till   the number of generated tokens is nearly half the source sequence length (token level) to avoid possibly erroneous sentences."}, {"id": 144, "string": "We then apply submodular maximization stochastically with probability p at each time step."}, {"id": 145, "string": "Since each candidate subsequence is extended by a single token at every time-step, information added might not necessarily be useful as our submodular components work on sentence level."}, {"id": 146, "string": "This approach is time efficient and avoids redundant computations."}, {"id": 147, "string": "For each augmentation setting, we randomly select sentences from the training data and generate its paraphrases."}, {"id": 148, "string": "We then add them in the training data with the same label as that of the source sentence."}, {"id": 149, "string": "We evaluate the performance on different classification models in terms of accuracy."}, {"id": 150, "string": "Based on the formulation of the objective function, it should be clear that diversity would attain maximum value at (or around) λ = 0 albeit at the cost of fidelity."}, {"id": 151, "string": "This is certainly not a desirable property for paraphrasing systems."}, {"id": 152, "string": "To address this, we perform hyperparameter tuning for λ value by analyzing the trade-off between diversity and fidelity based on varying λ values."}, {"id": 153, "string": "In practice, diversity metric attains saturation at certain λ range (usually 0.2 -0.5)."}, {"id": 154, "string": "This behaviour can be seen in Figure 2 ."}, {"id": 155, "string": "Corresponding plot for Twitter, the effect of λ on fidelity and additional details about the hyperparameters can be found in the supplementary."}, {"id": 156, "string": "Results Our experiments were geared towards answering the following primary questions: Q1."}, {"id": 157, "string": "Is DiPS able to generate diverse paraphrases without compromising on fidelity?"}, {"id": 158, "string": "(Section 6.1) Q2."}, {"id": 159, "string": "Are paraphrase generated by DiPS useful in data-augmentation?"}, {"id": 160, "string": "(Section 6.2) Intrinsic Evaluation We compare our method against recent paraphrasing models as well as multiple diversity inducing schemes."}, {"id": 161, "string": "DiPS outperforms these baseline models in terms of fidelity metrics namely BLEU, ME-TEOR and TERp."}, {"id": 162, "string": "A high METEOR score and a low TERp score indicate the presence of not only exact words but also synonyms and semantically similar phrases."}, {"id": 163, "string": "Notably, our model is not only able to achieve substantial gains over other diversity inducing schemes but is also able to do so without compromising on fidelity."}, {"id": 164, "string": "Diversity and fidelity scores are reported in Table 4 and Table 3 , respectively."}, {"id": 165, "string": "As described in Section 5.3, we evaluate the accuracy of paraphrase recognition models when provided with training data augmented using different schemes."}, {"id": 166, "string": "It is reasonable to expect that high quality paraphrases would tend to yield better results on in-domain paraphrase recognition task."}, {"id": 167, "string": "We observe that using the paraphrases generated by DiPS helps in achieving substantial gains in accuracy over other baseline schemes."}, {"id": 168, "string": "Figure 3 showcases the effect of using paraphrases generated by our method as compared to other competitive paraphrasing methods."}, {"id": 169, "string": "Data-augmentation Data Augmentation results for intent and question classification are shown in Table 5 ."}, {"id": 170, "string": "While, SBS does not offer much lexical variability, DBS offers high diversity at the cost of fidelity."}, {"id": 171, "string": "SynRep and ContAug are augmentation schemes which are limited by the amount of structural variations they can offer."}, {"id": 172, "string": "DiPS on the other hand provides generation having high structural variations without compromising on fidelity."}, {"id": 173, "string": "The boost in accuracy scores on both the types of classification models is indicative of the importance of using high quality paraphrases for data-augmentation."}, {"id": 174, "string": "Conclusion In this paper, we have proposed DiPS, a model which generates high quality paraphrases by maximizing a novel submodular objective function designed specifically for paraphrasing."}, {"id": 175, "string": "In contrast to prior works which focus exclusively either on fidelity or diversity, a submodular function based approach offers a large degree of freedom to control fidelity and diversity."}, {"id": 176, "string": "Through extensive experiments on multiple standard datasets, we have demonstrated the effectiveness of our approach over numerous baselines."}, {"id": 177, "string": "We observe that the diverse paraphrases generated are not only interesting and meaning preserving, but are also helpful in data augmentation."}, {"id": 178, "string": "We showcase that using multiple settings on the task of intent and question classification."}, {"id": 179, "string": "We hope that our approach will be useful not only for paraphrase generation and data augmentation, but also for other NLG problems in conversational agents and text summarization."}], "headers": [{"section": "Introduction", "n": "1", "start": 10, "end": 21}, {"section": "We introduce Diverse Paraphraser using", "n": "1.", "start": 22, "end": 44}, {"section": "Background: Submodularity", "n": "3", "start": 45, "end": 61}, {"section": "Methodology", "n": "4", "start": 62, "end": 72}, {"section": "Overview", "n": "4.1", "start": 73, "end": 82}, {"section": "Monotone Submodular Objectives", "n": "4.2", "start": 83, "end": 118}, {"section": "Datasets", "n": "5.1", "start": 119, "end": 120}, {"section": "Baseline", "n": "5.2", "start": 121, "end": 123}, {"section": "Intrinsic Evaluation", "n": "5.3", "start": 124, "end": 125}, {"section": "Diversity:", "n": "2.", "start": 126, "end": 134}, {"section": "Data-Augmentation", "n": "5.4", "start": 135, "end": 139}, {"section": "LSTM:", "n": "2.", "start": 140, "end": 141}, {"section": "Setup", "n": "5.5", "start": 142, "end": 155}, {"section": "Results", "n": "6", "start": 156, "end": 159}, {"section": "Intrinsic Evaluation", "n": "6.1", "start": 160, "end": 168}, {"section": "Data-augmentation", "n": "6.2", "start": 169, "end": 173}, {"section": "Conclusion", "n": "7", "start": 174, "end": 179}], "figures": [{"filename": "../figure/image/995-Table1-1.png", "caption": "Table 1: Sample paraphrases generated by beam search and DiPS (our method). DiPS offers lexically diverse paraphrases without compromising on fidelity.", "page": 0, "bbox": {"x1": 306.71999999999997, "x2": 527.04, "y1": 222.23999999999998, "y2": 322.08}}, {"filename": "../figure/image/995-Table2-1.png", "caption": "Table 2: Dataset Statistics", "page": 5, "bbox": {"x1": 309.59999999999997, "x2": 525.6, "y1": 64.32, "y2": 240.95999999999998}}, {"filename": "../figure/image/995-Table3-1.png", "caption": "Table 3: Results on Quora-Div and Twitter dataset. Higher↑ BLEU and METEOR score is better whereas lower↓ TERp score is better. Please see Section 6 for details.", "page": 6, "bbox": {"x1": 72.0, "x2": 526.0799999999999, "y1": 67.2, "y2": 163.2}}, {"filename": "../figure/image/995-Figure2-1.png", "caption": "Figure 2: Effect of varying the trade-off coefficient λ in DiPS on various diversity metrics on the Quora dataset.", "page": 6, "bbox": {"x1": 98.88, "x2": 262.08, "y1": 216.48, "y2": 380.15999999999997}}, {"filename": "../figure/image/995-Table4-1.png", "caption": "Table 4: Results on Quora-Div and Twitter dataset. Higher distinct scores imply better lexical diversity. Please see Section 6 for details.", "page": 7, "bbox": {"x1": 72.96, "x2": 525.12, "y1": 67.2, "y2": 155.04}}, {"filename": "../figure/image/995-Figure3-1.png", "caption": "Figure 3: Comparison of accuracy scores of two paraphrase recognition models using different augmentation schemes (Quora-PR). Both LogReg and SiameseLSTM achieve the highest boost in performance when augmented with samples generated using DiPS", "page": 7, "bbox": {"x1": 316.8, "x2": 516.0, "y1": 207.84, "y2": 383.03999999999996}}, {"filename": "../figure/image/995-Table5-1.png", "caption": "Table 5: Accuracy scores of two classification models on various data-augmentation schemes. Please see Section 6 for details", "page": 7, "bbox": {"x1": 72.0, "x2": 290.4, "y1": 208.32, "y2": 296.15999999999997}}, {"filename": "../figure/image/995-Figure1-1.png", "caption": "Figure 1: Overview of DiPS during decoding to generate k paraphrases. At each time step, a set of N sequences (V (t)) is used to determine k < N sequences (X∗) via submodular maximization . The above figure illustrates the motivation behind each submodular component. Please see Section 4 for details.", "page": 3, "bbox": {"x1": 121.92, "x2": 475.68, "y1": 62.879999999999995, "y2": 306.24}}]}